{
  "ProjectName": "3DTools",
  "Title": "3D Tools for the Windows Presentation Foundation",
  "Description": "A collection of tools to help developers using the 3D features in the Windows Presentation Foundation.  This project currently includes utility code for rotating the camera with the mouse, drawing fixed width lines in 3D, and automatically generating texture coordinates.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h3>Version 1.01 Released !!! </h3>\rClick on the releases section to download or go directly to the download page:<br /><a href=\"http://www.codeplex.com/3DTools/Release/ProjectReleases.aspx?ReleaseId=2058\">http://www.codeplex.com/3DTools/Release/ProjectReleases.aspx?ReleaseId=2058</a><br />\n<h3>Overview</h3>\rA collection of tools to help developers using the 3D features in the Windows Presentation Foundation. <br /><br />Some of things you will find inside:\n<ul><li>Code to interact with 2D content placed on 3D</li>\n<li>Trackball class to Rotate the camera using the mouse</li>\n<li>ScreenSpaceLines3D to draw fixed width lines in a 3D scene</li>\n<li>Texture coordinate generators</li></ul>\n<br />Current status:  Released - please go to the &quot;Releases&quot; tab to download the latest source and binaries.<br />Audience: Beginner, Intermediate, Advanced <br />Language: C# <br />\n<h3>Announcements</h3>\r<ul><li>3/1/2007 - Version 1.01 has been released.  This new release fixes a few bugs found in the 1.0 version, and includes the Flickr photo browser (as seeen in the Channel9 video) as an example.</li>\n<li>12/13/2006 - We have released our 1.0 version of the 3D Tools for the Windows Presentation Foundation.  This new version also adds the ability to interact with 2D content on 3D objects, and all on top of WPF v1.0 bits!  Go download the binaries or source from the Releases section, or you can get it from the Source Code section.</li>\n<li>9/19/2006 - The GotDotNet source code has been ported here to Codeplex - now running on RC1 bits!  Click the Source Code tab to download.</li>\n<li>8/28/2006 - We&#39;re currently in the process of porting the 3D Tools from the gotdotnet site to here on Codeplex.  The move should be done soon so expect a release shortly.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "3D Graphics,3D,WPF,WPF 3D,3D Tools for WPF,MyList,wpf3d,3D Tools for the Win,3D Tools per WPF,*,Useful,3D Tools,",
  "LastEdited": "2007-03-01T08:22:00.673-08:00"
}