{
  "ProjectName": "boxshot",
  "Title": "ConnectCode Software Box Shot Maker",
  "Description": "ConnectCode Software Box Shot Maker creates realistic images of 3D  boxes for your software using three image files. You can adjust the box orientation, box and camera position. Despite being opensource, the tool delivers professional results.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>ConnectCode Software Box Shot Maker</b><br /><br />\n<h1>ConnectCode Software Box Shot Maker</h1>\r\n<h2>What is a Box Shot</h2>\r\nA box shot is a 3D image of a software box. Box shots can help your software sell better. They project a professional image and give your customers an impression of a quality product. A boxshot is a great marketing tool. It encourages visitors on your website to examine your products in more details. Having one on your website gives you an advantage over your competitors, The reason is simple. The software with a better packaging will stand out from its peers. <br /><br /><br /><img src=\"/projects/boxshot/b0e537d6-c6cf-48d4-a3ca-7b609e12333b\" alt=\"boxshot.png\" title=\"boxshot.png\" /><br /><br />\n<h2>Opensource Box Shot Maker</h2>\r\nConnectCode Software Box Shot Maker is able to create realistic images of 3D software boxes from your existing logos and promotional materials. It is very easy to use. You simply provide two to three images, adjust the box orientation and save the result as an image file. ConnectCode Software Box Shot Maker is Free and Opensource. Despite so, it is packed with features and produces professional results. In fact, the (quality of) box shots created with ConnectCode are so good, they are almost comparable with those produced by commercial products. <br /><br />\n<h2>Supported Features</h2>\r\nThis project is written in .Net 3 and utilizes the strengths of WPF 3D.<br />Slider-Based UI For Ease Of Use<br />Rotation of Software Box<br />Adjustments for Camera Distance, Camera Height, Camera Shift from the Software Box<br />Textures for the Front, Top and Side<br />Supports Shadows<br />Box Size <br /><br />\n<h2>ConnectCode Software Box Shot Maker</h2>\r\n<a href=\"http://www.boxshot.org\">http://www.boxshot.org</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "boxshot,box shot,software boxes,3d software box,software box maker,software box,WPF,.NET 3.5,WPF 3D,RETURN 2010,",
  "LastEdited": "2009-03-24T21:00:23.533-07:00"
}