{
  "ProjectName": "codeframework",
  "Title": "CODE Framework",
  "Description": "CODE Framework is a business application development framework from the makers of CODE Magazine, Markus Egger, and EPS Software Corp.\r\n\r\nCODE Framework consists of various components and tools that help developers with common aspects of business application development, such as simplified SOA development with various clients, or WPF development, data access, and much more. The main focus of this framework is to enable productive, flexible, and highly maintainable business application development. \r\n\r\nMake sure you also install the Visual Studio Extensions and Templates from the Extension Manager right within Visual Studio!\r\n\r\nNote: Most of the CODE Framework originates in our much larger (and not free or open source) Milos Solution Platform product. This means that while the latest build is currently flagged as \"beta\", it actually contains mostly very mature and time-tested code that has been migrated from the Milos product. We are still in this migration process. Expect new builds with more and more components on an ongoing basis.\r\n\r\nDocumentation and articles will also be forthcoming over the next months and weeks and will be published in CODE Magazine (in print and online) and be linked to from here. We are also working on some videos and some tools and project/item templates which will make it much easier to use this framework. Please check back in a few days. We are hoping to release some of these very shortly.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>This Site Has Moved!</h1>\r\nDue to CodePlex shutting down, this site has moved. For the latest and greatest about CODE Framework, beyond the information and versions provided here, check out <a href=\"http://www.codemag.com/framework\">http://www.codemag.com/framework</a>. After October 1st, 2017, no updates will be added to CodePlex. Instead, this project will be maintained on the aforementioned site.<br /><br /><br /><br />\n<h1>Training - NEW!</h1>\rWe have just had another <b>free</b> CODE Framework training class with more events to be announced shortly. We also offer personalized and individual training as well as mentoring. More info can be found at: <a href=\"http://www.codemag.com/Training/\">http://www.codemag.com/Training/</a><br /><br />For more information on our training offerings in general, visit <a href=\"http://codemag.com/Training\">http://codemag.com/Training</a>. Individual training and mentoring is available as well. You can also contact us by sending email to <a href=\"mailto:info@codemag.com\">info@codemag.com</a> or by calling us at 832-717-4445 (ext 013). Ask for Iain.<br /><br /><img src=\"http://www.codemag.com/Images/Logos/CODETraining_Small.png\" /><br /><br /><br />\n<h1>Project Description</h1>\rCODE Framework is a business application development framework from the makers of CODE Magazine, Markus Egger, and EPS Software Corp.<br /><br />CODE Framework consists of various components and tools that help developers with common aspects of business application development, such as simplified SOA development with various clients, or WPF development, data access, and much more. The main focus of this framework is to enable productive, flexible, and highly maintainable business application development. <br /><br />Make sure you also install the Visual Studio Extensions and Templates from the Extension Manager right within Visual Studio&#33;<br /><br />Note&#58; Most of the CODE Framework originates in our much larger &#40;and not free or open source&#41; Milos Solution Platform product. This means that while the latest build is currently flagged as &#34;beta&#34;, it actually contains mostly very mature and time-tested code that has been migrated from the Milos product. We are still in this migration process. Expect new builds with more and more components on an ongoing basis.<br /><br />Documentation and articles will also be forthcoming over the next months and weeks and will be published in CODE Magazine &#40;in print and online&#41; and be linked to from here. We are also working on some videos and some tools and project&#47;item templates which will make it much easier to use this framework. Please check back in a few days. We are hoping to release some of these very shortly.<br />\n<h1>Getting Started</h1>\rCheck out the <a href=\"https://codeframework.codeplex.com/documentation?referringTitle=Home\">Documentation</a> page right here on CodePlex. A great way to get started is by following one of our <a href=\"https://codeframework.codeplex.com/wikipage?title=Articles&referringTitle=Home\">Articles</a>. In addition, a wealth of information can be found in the collection of <a href=\"https://codeframework.codeplex.com/wikipage?title=Quick%20Tips&referringTitle=Home\">Quick Tips</a>. Also please visit our web page at <a href=\"http://codemag.com/framework\">http://codemag.com/framework</a><br /><br /><br />\n<h1>Support</h1>\rCODE Framework is free and open source. However, that does not mean &quot;unsupported&quot;! We <i>do</i> offer premium support, training, consulting, and custom software development for CODE Framework. If you are interested, contact us at <a href=\"mailto:info@codemag.com\">info@codemag.com</a> or call us at 832-717-4445 (ext 013 - ask for Iain)!<br /><br />\n<h1>Contributing</h1>\rCODE Framework is part of a bigger effort, and as such, the source code provided here is for download purposes only. However, we do see this as a community effort and we <i>will</i> consider contributions. If you are interested in contributing, send an email to <a href=\"mailto:info@codemag.com\">info@codemag.com</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "code,WPF,wcf,xaml,soa,data,Silverlight,windows phone,Windows Phone 7,Metro,Windows 8,CODE Magazine,CODE Framework,Jerusalem2032J2IL,Published Project,CenecaJet82,",
  "LastEdited": "2017-09-30T09:41:27.303-07:00"
}