{
  "ProjectName": "colorful",
  "Title": "Colorful Expression",
  "Description": "The Colorful Expression project is an add-in for Expression Blend and Expression Design that brings you the Adobe Kuler community directly into your toolbox. It adds a new palette to your design environment, making it easy to leverage the community to find the perfect color theme for your application or design. The add-in also runs as a standalone application, making it useful for web developers working in Visual Studio or Expression Web, as you can select individual colors for your CSS style sheets.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Overview</h2>\r<i>Colorful Expression is an add-in for Expression Blend and Expression Design that brings you the Adobe Kuler community directly into your toolbox. It adds a new palette to your design environment, making it easy to leverage the community to find the perfect color theme for your application or design. The add-in also available as a standalone application, making it useful for web developers working in Visual Studio or Expression Web to select colors for your CSS style sheets.</i><br /><br /><img src=\"/projects/colorful/fbb46b35-b07f-49a5-9cd6-73c93487ba1d\" alt=\"ColorfulExpressionDesign.jpg\" title=\"ColorfulExpressionDesign.jpg\" />\n<h2>About Adobe Kuler</h2>\rAdobe Kuler (<a href=\"http://kuler.adobe.com/\">http://kuler.adobe.com/</a>) is a great example of a rich internet application that provides great value directly in the browser. Kuler is a tool that helps you create color themes by applying different rules to find matching colors. You start by selecting a base color, and Kuler will help you find four matching colors. You can even use Flickr photos as a basis for your color theme. Adobe Kuler has a social aspect to it as well. You can create an account and save your colors online and share them with the community. People can rate and commend on your themes, or create new color themes based on an excising one. Colorful Expression leverages the REST APIs exposed by Kuler to bring the power for the color community directly into the tools you use.\n<h2>Expression Design</h2>\rThe key feature of the add-in is to select colors. The eyedropper tool in Design lets you click anywhere on the screen to select a color. Simply click the eyedropper in your color panel, and click on one of the colors in the Colorful Expression panel.<br /><br />You can also copy colors to the clipboard by clicking the copy-button. When you paste the color theme onto the design surface you’ll get five rectangles and the name of the color. This lets you collect interesting themes directly in your design file by copying them onto the document.<br /><br />Expression Blend supports exporting and importing color swatch libraries through a simple XML file format. Colorful Expression allows you to save a theme as a swatch library you can import into Design. The screenshot shows the “Buddah in Rain” theme imported to the swatch library.<br /><br /><img src=\"/projects/colorful/db3bde2b-092d-4510-80c9-bbc7c92d869c\" alt=\"ColorfulExpressionDesignSwatchLibrary.gif\" title=\"ColorfulExpressionDesignSwatchLibrary.gif\" />\n<h2>Expression Blend</h2>\rThe add-in works almost the same way in Blend as in Design but with some minor differences. In Blend you can use the Ctrl+C key combination to invoke the copy command, making it a lot easier to copy/paste themes onto the design surface. When you paste a theme onto the surface you will get a grid containing five rectangles and a text block. The rectangles are painted with a solid color brush resource, and each of the colors gets added to the resource collection of the page. If you go into XAML-view and paste the theme you will get five solid color brush resource elements you can add to any resource collection. The Blend add-in also supports drag and drop, letting you drag color themes onto the design surface.<br /><br /><img src=\"/projects/colorful/9cabf5c9-6bf2-4f87-ad27-28c1a52556d7\" alt=\"ColorfulExpressionBlend.jpg\" title=\"ColorfulExpressionBlend.jpg\" />\n<h2>Standalone application</h2>\rThe standalone application gives you most of the same features as the Blend and Design add-in. You can copy or drag themes into Blend, and you can save Design swatch libraries. The stand alone application is useful if you don’t want to run the add-in all the time or if you don’t use Expression Studio. You can also hold down control and click a single color to copy it to the clipboard as a RGB HEX color. That way you can use the standalone application as a color picker for any application using HEX colors, such as CSS style sheets.<br /><br /><img src=\"/projects/colorful/77b95145-6743-4821-a014-af2c72cc68d0\" alt=\"ColorfulStandalone.jpg\" title=\"ColorfulStandalone.jpg\" />\n<h2>Ideas for next version</h2>\rI want to keep the add-in simple and focused, but I do have some ideas for new features. The first thing I’m planning to implement is a color provider for the COLORLovers site. I also want deeper integration with Blend and Design, especially around managing resources in Blend. <br /><br />It would also be nice to support Expression Web and Visual Studio 2008 so that web developers can use it to get CSS colors for their web projects. <br /><br />Another feature missing is support for the light Expression Studio color theme. The current look and feel is based on Hadi Eskandari’s Expression Clone theme and only supports the dark theme. It should be fairly simple to create a new theme matching the light colors. <br /><br />You can suggest new features in the discussion board or report bugs in the issue tracker.\n<h2>Download and installation</h2>\rThe release contains the compiled version of the add-in for Design 2.0, Blend 2.0, Blend 2.5 June CTP, Blend 2.0 SP1 Preview and as a standalone WPF application. To install the add-in simply copy the files into your Blend or Design director, and launch the EXE file with an extra parameter. <br />\n<ul><li><b><i>“Blend.exe –addin:Colorful.Blend.AddIn.dll”</i></b></li>\n<li><b><i>“Design.exe –addin:Colorful.Design.AddIn.dll”</i></b>.</li></ul>\n<br /><b>This release require .NET 3.5 SP1 to be installed</b><br /><br />You can also right click your application shortcut and select properties to change the target of the shortcut. Add the above parameters to the target to launch Blend or Design with the add-in every time you click the shortcut.<br /><br /><img src=\"/projects/colorful/d7025be8-cb24-40f6-a465-66ae099cd828\" alt=\"ShortcutProperties.jpg\" title=\"ShortcutProperties.jpg\" />\n<h2>Getting involved</h2>\rIf you would like to get involved in the project drop me an e-mail at jonas@follesoe.no. You can also suggest features or report bugs in the discussion forum and the issue tracker. <br /><br />To build the project you need to have Expression Blend or/and Expression Design installed. The add-in has a dependency on <i>Microsoft.Expression.Framework</i>, which in turn has a dependency on <i>Microsoft.Expression.Diagnostics</i>, <i>Microsoft.Expression.Interop</i> and <i>Microsoft.Expression.Licensing</i>. For licensing reasons these assemblies are not checked into the source control tree.<br /><br />If you want to run the add-in from Visual Studio I recommend running Visual Studio 2008 as administrator and then change the output directory of your debug build to the installation folder of Blend/Design. Then change the startup application to the Blend.exe/Design.exe with the correct startup arguments. That way you can hit F5 inside Visual Studio to launch Blend/Design in debug mode. You can set breakpoints in your code and test/debug the add-in this way.<br /><br />Happy coloring!</div><div class=\"ClearBoth\"></div>",
  "TagList": "Blend,Tool,",
  "LastEdited": "2008-09-29T19:00:35.21-07:00"
}