{
  "ProjectName": "dnnAdvancedLogin",
  "Title": "dnnWerk.Login",
  "Description": "dnnWerk Login is simple to use multilingual & templateabele login module for DotNetNuke sites. Besides templates and themes it also supports developers who want to hook into the sign in process of the module by providing an interface class.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">dnnWerk.Login is a login module that caters a very simple use case where you want to use DNN authentication only but also want to have full control over the outputted HTML of the login control. With the dnnWerk.Login module you get six templated views in one single module:<br />\n<ul><li>Authenticated view (shown to authenticated users)</li>\n<li>Error view (shown when log errors occur, like wrong password etc...)</li>\n<li>Loginform (shown to unauthenticated users)</li>\n<li>Password request (shown after clicking the password forgotten link)</li>\n<li>Password request result view (shown after password has been requested)</li>\n<li>Verification form (shown to registered userss who have to verify their account)</li></ul>\n<br />Each of these templates belong to a so called theme that you can reuse on different pages throughout one installation.<br /><br />As an additonal feature the module provides an interface class that developers may implement to process a users&#39;s login after authentication. You may use this feature to cater for SSO scenarios or any other custom process that you need to fire on each login. Read more about this here: <a href=\"http://dnnadvancedlogin.codeplex.com/wikipage?title=iLoginAction%20interface\">http://dnnadvancedlogin.codeplex.com/wikipage?title=iLoginAction%20interface</a><br /><br />For a live demo visit <a href=\"http://demo.dnnwerk.de/Login/tabid/68/language/en-US/Default.aspx\">http://demo.dnnwerk.de/Login/tabid/68/language/en-US/Default.aspx</a><br /><br /><b>New in 01.00.04</b><br /><br />Skin object mode. You can now run the module as a skinobject. Together with jQuery you can now do things like this:<br /><br /><a href=\"http://demo.dnnwerk.de/AdvancedLogin/tabid/77/Default.aspx\">http://demo.dnnwerk.de/AdvancedLogin/tabid/77/Default.aspx</a><br /><br />When running as a skinobject you will have to set the theme by setting something like theme=&quot;demo&quot; where you would have to create that theme yourself manually. Even the interfaceclass can be set in skinobject mode by setting &quot;InterfaceClass&quot; to your class.<br /><br /><b>New in 01.00.04</b><br /><br />Set &quot;LoginWithEmailAddress&quot; to true in the skin or the module settings to allow users to log on by using their e-mail address and their password.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-09-27T09:04:51.627-07:00"
}