{
  "ProjectName": "dnnblueprint",
  "Title": "DotNetNuke Blueprint",
  "Description": "DotNetNuke BluePrint is a project that provides a WYSIWYG reference implementation of a DotNetNuke skin to help designers get started with skin design. Original creator and designer Beatriz Oliveira, Bind (http://www.bind.pt)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">This project is currently being updated, and a new version will be published soon.<br />\n<h2>About the DNNBlueprint</h2>\rDotNetNuke BluePrint is a project that provides a reference implementation of a DotNetNuke skin to help designers get started with the skin design. In addition to conforming to standards, the skin is light-weight and aesthetically pleasing. It features WYSIWYG preview to enable designers to complete design with tools of their choice without needing to import into DotNetNuke for preview. The original creator and designer of DotNetNuke BluePrint is Beatriz Oliveira of Bind (http://www.bind.pt).<br />\n<h4>Included features</h4>\rThis blueprint framework includes a set of features/techniques that represent the latest best-practices in CSS design, and consolidates a foundation for you to develop on top. Inside you will find:<br />\n<ul><li><b>CSS Reset</b> &gt; to eliminate browser default inconsistencies</li>\n<li><b>Tableless design</b> &gt; A basic DIV based HTML structure, to serve as a base for your own structure, ready for an always-on-bottom footer, should you need it</li>\n<li><b>Grids</b> &gt; A 24 column grid set, based on the 960 grid project</li>\n<li><b>Universal container</b> &gt; A &quot;universal&quot; HTML structure for your containers</li>\n<li><b>Typography definitions</b> &gt; A base definition of all typographic elements to help you get started</li>\n<li><b>An HTML version</b> &gt; Ready for your local testing, with no need of a server (based on the same CSS)</li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "DNN Skins,dotnetnuke,DotNetNuke Skins,blueprint,DNN,theme,Template,",
  "LastEdited": "2013-04-29T09:56:53.467-07:00"
}