{
  "ProjectName": "eagle",
  "Title": "Eagle",
  "Description": "Eagle, Extensible Adaptable Generalized Logic Engine, is an implementation of the Tcl scripting language for the Common Language Runtime (CLR).",
  "MovedLink": "https://eagle.to/",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Description</h1>\r\n<blockquote><b><a href=\"https://eagle.to/\">Eagle</a></b>, Extensible Adaptable Generalized Logic Engine, is an implementation of the <b><a href=\"https://www.tcl.tk/\">Tcl</a></b> scripting language for the <b><a href=\"https://en.wikipedia.org/wiki/Common_Language_Runtime\">Common Language Runtime</a></b> (CLR).</blockquote>\n<blockquote><b><a href=\"https://eagle.to/\">Garuda</a></b> (Eagle Package for Tcl) is a <a href=\"https://wiki.tcl.tk/stubs\">stubs-enabled</a> native package for Tcl that provides any application using Tcl full access to components written for the Common Language Runtime (CLR).</blockquote>\n<h1>License</h1>\r\n<blockquote>The license is &quot;<b><a href=\"https://www.tcl.tk/software/tcltk/license.html\">Tcl-style</a></b>&quot; (i.e. more-or-less the original <b><a href=\"http://www.opensource.org/licenses/bsd-license.php\">BSD License</a></b>), the exact text of which is available <b><a href=\"https://eagle.to/standard/license.html\">here</a></b>.</blockquote>\n<h1>Release Schedule</h1>\r\n<blockquote>At this point, Eagle is considered to be &quot;release-candidate quality&quot;.  Official releases of the source code, binaries, and setup packages are normally made available at least once per month.  These releases receive an enormous amount of both manual &quot;quality checking&quot; and automated testing.  All developers and users are encouraged to report <b>any</b> issues they may find using the <a href=\"https://eagle.to/cgi-bin/fossil/tktnew\">issue tracker for this project</a>.</blockquote>\n<h1>Release Files</h1>\r\n<blockquote>For security purposes, all of the executable files available for download for this project, including the self-extracting archives, have been digitally signed by &quot;<b><a href=\"https://www.mistachkin.com/\">Mistachkin Systems</a></b>&quot; (i.e. <b><a href=\"https://eagle.to/team.html\">Joe Mistachkin</a></b>).  Please verify that the digital signatures are intact after downloading.</blockquote>\n<blockquote>In addition, all <a href=\"https://en.wikipedia.org/wiki/RAR\">RAR archive files</a> should have valid &quot;authenticity verification&quot; information.  <b>Please note that the &quot;authenticity verification&quot; information for RAR archive files is not cryptographically secure and can be forged by a determined adversary; therefore, the self-extracting archives should be downloaded and used instead, whenever possible (i.e. on Windows).</b></blockquote>\n<blockquote>The setup is designed to install Eagle, including the interactive shell, as a Windows application.  The minimum operating system supported is Windows XP with the .NET Framework 2.0.  In addition to installing the necessary files, the setup can optionally create file associations, add Start Menu shortcuts, add assemblies to the Global Assembly Cache (GAC) and/or Native Image Cache, and register the PowerShell Cmdlet.  Eagle does not need to be installed in order to run properly; however, having it installed can be useful in some deployment scenarios. </blockquote>\n<blockquote>The binary archives are intended for &quot;xcopy deployment&quot; scenarios and the contained binaries are identical to those installed by the setup.</blockquote>\n<blockquote>The source archives contain all the source code for Eagle, including the necessary tools to compile, test, and package it for deployment.</blockquote>\n<h1>Visual Studio</h1>\r\n<blockquote>Using <a href=\"https://www.microsoft.com/vstudio/\">Visual Studio 2005</a> or higher is fully supported, including the &quot;<a href=\"https://www.microsoft.com/express/\">Express</a>&quot; editions; however, Visual Studio is not required to build and use Eagle.  Support for adding Eagle to your project via <a href=\"https://www.nuget.org/\">NuGet</a> and <a href=\"https://www.symbolsource.org/\">SymbolSource</a> is present and can be used from within Visual Studio 2010 or higher.</blockquote>\n<h1>Mono</h1>\r\n<blockquote>Preliminary support for running on <a href=\"http://www.mono-project.com/\">Mono 2.0</a> or higher has been added.  When running on Mono, using version 2.10 or higher is recommended, as several critical issues have been identified and fixed.  The &quot;Mono-on-Unix&quot; builds are primarily for use with Mono on <a href=\"http://www.unix.org/\">Unix</a> systems; however, they will function with the <a href=\"https://en.wikipedia.org/wiki/.NET_Framework\">.NET Framework</a> on <a href=\"https://www.microsoft.com/windows\">Windows</a>, with the exception of features that are either .NET Framework-specific or Windows-specific.</blockquote>\n<h1>Presentations</h1>\r\n<blockquote>Garuda was presented at the <a href=\"https://www.tcl.tk/community/tcl2011/\">18th Annual Tcl/Tk Conference</a>.  Eagle was presented at the <a href=\"http://www.altnetseattle.org/\">Alt.NET 2011 Seattle Conference</a>.  Eagle was the subject of a paper at the <a href=\"https://www.tcl.tk/community/tcl2010/\">17th Annual Tcl/Tk Conference</a>.  Eagle was the subject of a paper at the <a href=\"https://www.tcl.tk/community/tcl2009/\">16th Annual Tcl/Tk Conference</a>.  Eagle was presented at the <a href=\"http://www.langnetsymposium.com/\">2009 Lang.NET Symposium</a>.  Eagle was the subject of a paper at the <a href=\"https://www.tcl.tk/community/tcl2008/\">15th Annual Tcl/Tk Conference</a>.</blockquote>\n<h1>Tutorials &amp; Walkthroughs</h1>\r\n<blockquote>Various <a href=\"https://eagle.to/tutorial.html\">tutorials and walkthroughs</a> are actively being worked on.</blockquote>\n<h1>Latest Changes</h1>\r\n<blockquote>To determine if you are running the latest available build, use the &quot;<b>#check</b>&quot; command at the interactive shell prompt.  To see detailed version information, use the &quot;<b>#version</b>&quot; command at the interactive shell prompt.  Full details of the latest changes are available in the <b><a href=\"https://eagle.to/cgi-bin/eagle\">source code repository</a></b> and the <b><a href=\"https://eagle.to/ChangeLog\">ChangeLog</a></b>.  To clone the repository, you will need the <b><a href=\"https://www.fossil-scm.org/\">Fossil</a></b> binary for your platform.</blockquote>\n<blockquote>The very latest source code is always available from <b><a href=\"https://eagle.to/cgi-bin/eagle/zip/Eagle-trunk.zip?name=trunk\">the trunk of the repository in the ZIP file format</a></b>.</blockquote></div><div class=\"ClearBoth\"></div>",
  "TagList": "powershell,Integration,MSBuild,winforms,C#,scripting,Database,sockets,Plugin,WiX,parser,.NET 2.0,com,console,language,mono,Windows,WPF,Windows Forms,BSD,Reflection,Generics,automation,C# 2.0,Web Services,64-Bits,Threading,Unit Testing,Functional,dynamic language,.NET 3.5,native,extensibility,p/invoke,Unix,Interpreter,DLL,Tcl/Tk,Eagle,threadsafe,Windows 7,closures,.NET 4.0,32-Bits,NuGet,Tcl,CLR,DSL,scripting language,",
  "LastEdited": "2016-09-18T03:49:52.983-07:00"
}