{
  "ProjectName": "EBlahTemplateEditor",
  "Title": "E-Blah Template Editor",
  "Description": "An open-source template editor for the popular PERL-based bulletin board software E-Blah! Allows the editing of templates without even the slightest bit of knowledge of CSS or HTML.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><img src=\"/projects/EBlahTemplateEditor/c33b32d5-b3a2-4404-b9cb-bc3876d45d5e\" alt=\"nocss.gif\" title=\"nocss.gif\" /><br /><i>The E-Blah Template Editor uses a wizard-based interface to help you create a template. No CSS or HTML knowledge is required to create a great looking template.</i><br /><i>Simply download and unzip and you are good to go!</i><br />\n<h1><img src=\"/projects/EBlahTemplateEditor/7a02ffcb-e478-45f7-8d9c-d2439f761eb4\" alt=\"download.gif\" title=\"download.gif\" /> <a href=\"http://www.codeplex.com/EblahTemplateEditor/Release/ProjectReleases.aspx?\">Download now!</a></h1>\r\n<h2>System Requirements:</h2>\r<ul><li>*Microsoft .NET Framework 2.0</li>\n<li><b>Supported Operating Systems:</b> Windows Server 2003; Windows Server 2008; Windows Vista; Windows XP</li>\n<li><b>Processor:</b> 400 MHz Pentium processor or equivalent (Minimum); 1GHz Pentium processor or equivalent (Recommended)</li>\n<li><b>RAM:</b> 96 MB (Minimum); 256 MB (Recommended)</li>\n<li><b>Hard Disk:</b> 1MB space</li>\n<li><b>Display:</b> 800 x 600, 256 colors (Minimum); 1024 x 768 high color, 32-bit (Recommended)</li></ul>\nMac and Linux version is planned for the future. No release date has been set currently.\n<h2>Project Description</h2>\rAn open-source template editor for the popular PERL-based bulletin board software E-Blah&#33; Allows the editing of templates without even the slightest bit of knowledge of CSS or HTML.<br />\n<h2>Project Status</h2>\r<ul><li>Version 1.1 is planned to be released soon. I&#39;m working on getting major bugs fixed as well as adding FTP client to the next release. Hopefully the update will be released within the next month.</li></ul>\n<br />\n<ul><li>1.0 Stable is now available from the Releases section. The main feature added to this release is live previewing similar to Dreamweaver&#39;s Live Preview. The main template refreshes itself as you as you edit template.css allowing real time updates. A few bugs were fixed as well, making the program run smoother.</li>\n<li>Beta Release 3 is now available from the Releases section. A few things have been added to add support for latest E-Blah version 10.3.5. There have also been a few bugs fixed.</li>\n<li>Beta Release 2 is now available from the Releases section. There has been a huge improvement on the GUI and major bugs fixed. Simply download the release and extract all contents to the same directory. If you are interested in editing the source, it is available as well. Most of the code is commented, but some hasn&#39;t been yet.</li>\n<li>Beta Release 1 is available from the Releases section. This is simply the last release published on the E-Blah forums before going open source on CodePlex. You don&#39;t need to install the release, just download and run the file. It&#39;s suitable for creating simple themes (no images, only colors) right now.</li></ul>\n<br />All mentioned names, products, and services are Copyright (c) of their respective owners.</div><div class=\"ClearBoth\"></div>",
  "TagList": "template,theme,E-Blah,HTML,css,editor,generator,",
  "LastEdited": "2009-10-07T21:00:57.54-07:00"
}