{
  "ProjectName": "eWallet",
  "Title": "Digital Wallet",
  "Description": "e-Wallet is a WPF application that allows you to store sensitive information such as online banking accounts or user names and passwords, and protect all of that information securely with a single password or a digital certificate.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Introduction</h2>\re-Wallet is a WPF application that allows you to store sensitive information such as online banking accounts and user names and passwords in a secure way, and protect all of that sensitive information with a single password or a digital certificate. If you like, you can also use a password to protect certain kind of information and a digital certificate to protect other kinds of information.<br /><br />Sensitive data that you would want to store with e-Wallet could be for instance:<br />\n<ul><li>Online banking accounts</li>\n<li>Accounts for websites</li>\n<li>Social security numbers</li>\n<li>Bank account numbers</li>\n<li>Contracts and agreements</li></ul>\n<br />e-Wallet allows you to store both plain text and files, so you don&#39;t have to write the sensitive information you want to protect, if that information is stored for instance in a PDF document or in an image.<br />\n<h2>Functional Principles</h2>\re-Wallet uses the functionality provided by the .NET Framework in the <a href=\"http://msdn.microsoft.com/en-gb/library/system.security.cryptography.aspx\">System.Security.Cryptography</a> namespace to protect your sensitive data. When the data is stored, it is encrypted using a symmetric algorithm. Currently, the algorithm used is the <a href=\"http://msdn.microsoft.com/en-gb/library/system.security.cryptography.rijndaelmanaged.aspx\">RijndaelManaged</a> symmetric algorithm with a key length of 256 bits.<br /><br />The algorithm (including the key and initialization vector) is then encrypted using either a password or a digital certificate and stored in the database as well. This represents an encryption group or a protection group. All sensitive data protected by one single group can be accessed using the same password or the same digital certificate.<br />\n<h2>Roadmap</h2>\rThis section briefly describes the current plans for the development of e-Wallet.<br />\n<ul><li>v1 - In this version, you will be able to work with e-Wallet on your computer and store secrets that you protect either with a password or a certificate.</li>\n<li>v1.1 - This version adds backup functionality to e-Wallet so that you can specify multiple folders to where e-Wallet attempts to copy the database files when closing the application.</li>\n<li>v2 - In this version, you will be able to sync your local database with a central database running on SQL Server 2008 on a remote computer.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "security,Encryption,storage,Cryptography,X509 Certificates,.NET 3.5,",
  "LastEdited": "2008-12-13T02:46:51.613-08:00"
}