{
  "ProjectName": "expresscms",
  "Title": "Express CMS - Complete CMS for asp.net based on MWPSK",
  "Description": "Express CMS is a simple but complete solution for creating a website with all required ready to use features like contact us, guest book, google map, send sms, product listing, user and role mangement, more than 80 unique themes and much more... ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Project Description<br /><br />Express CMS is a simple but complete solution for create a website with all required ready to use features. All you need to do is:<br /><br />- Download the setup<br />- Install the setup to your machine<br />- Open the website<br />- Login with user name &quot;admin&quot; and password &quot;admin&quot;<br />- Change website settings according to your needs<br />- Create / edit pages using Page and Navigation user CMS Setup menu<br />- Select the theme you like from 80+ themes given at the bottom<br /><br />Your site is ready.<br /><br />Note: Please give write permissions to aspnet user / networkservice user on app_data folder before login.<br /><br />This provides features like <br />- Manage Page (add / edit / delete pages of your site)<br />- Manage Roles (add / edit / delte user roles for your site)<br />- Manage Users (add / edit./ delete users for your site)<br />- Contact us form<br />- Blog / Blog roll and Tag Clouds<br />- Guest Book<br />- Google Map to show your address on google<br />- Send SMS (create groups, add contacts and send sms - india only), contact pareekshyam@gmail.com for free SMS credits),<br />- Create product listing alogin with product image and description<br />- Create News List<br />- Create Events<br />- Create Photo Gallery (with Slide Show and/or SilverLight)<br />- Subsonic integrated to use your database<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "CMS,CMS.NET,CMS.asp.net,ASP.NET 2.0,ASP.NET CMS,MWPSK,CMS ASP.NET,Open Source CMS,Express CMS/MWPSK,google book download,",
  "LastEdited": "2009-05-14T02:58:47.953-07:00"
}