{
  "ProjectName": "groovesharp",
  "Title": "GrooveSharp",
  "Description": "GrooveSharp is an MP3 Player built in WPF. Information is stored in an SQLite database exposed by Stormy.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br /><br />There are already 1000 MP3 players... Why to create another one?<br /><br />Just for fun. I was updating my WPF knowlegde and needed a study project. And I wanted to have Stormy supporting SQLite.<br /><br />Besides that, when I&#39;m listening music I&#39;m often sitting on a distance, reading. I want to see the titles from a distance. So I like to see the program full screen, with large titles, and no irrelevant information. Most players display the title quite small (Zune is better but it is still too small).<br /><br />This first, version of GrooveSharp was created in about 15 minutes, using WPF it is really a piece of cake. After that the program started to grow... But it is still not that large.<br /><br />It does not:\n<ul><li>it only plays MP3 from the file system. It does not play WAV, does not play from a CD, or from the Internet</li>\n<li>it never writes into MP3. It reads the tags but does not write them (also no ratings are written to the MP3)</li>\n<li>it does not retrieve track titles or albums graphics from the Internet</li>\n<li>it does not contain play lists</li>\n<li>you cannot navigate within a song. But you can go to next</li></ul>\n<br />It does:\n<ul><li>play music from your filesystem, either from the Music folder or from other folders</li>\n<li>folders can conveniently be turned on and off</li>\n<li>has a full screen mode for listening-only and a small always-on-top mode for computering-and-listening</li>\n<li>displays album graphics</li>\n<li>can store ratings, export ratings, import ratings (also from iPad via iTunes)</li>\n<li>can store other characteristics such as being a hit, live, a bonus track, a single, ...</li>\n<li>stores it information in a SQLite database</li></ul>\n<br />It will do:\n<ul><li>search (on title, album, artist, etc)</li>\n<li>learn</li>\n<li>...</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "mp3,c#,Groove,player,SQLite,Music,Rating,iTunes,WPF,xaml,LINQ,LINQ to XML,Stormy,",
  "LastEdited": "2012-01-11T11:10:52.757-08:00"
}