{
  "ProjectName": "kinectexplorersp",
  "Title": "Kinect Explorer For SharePoint 2010",
  "Description": "Kinect Explorer for SharePoint brings the freedom of Kinect to the power of SharePoint.\r\nBrought to you by the SharePoint People at Zevenseas (www.zevenseas.com)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Kinect Explorer For SharePoint 2010</b><br />Kinect Explorer for SharePoint brings the freedom of Kinect to the power of SharePoint.<br />Brought to you by the SharePoint People at Zevenseas &#40;www.zevenseas.com&#41;<br /><br />Since the movie - Minority Report released every ‘geek’ wanted to control his machine without any device. Just start gazing on any surface and start moving your body to control the elements. Welcome to Kinect – A controller free Natural User Interface (NUI), now everyone is Chief John Anderton or Harry Potter. <br /><br />Kinect for XBOX provided high-level of user control without any devices and made playing games a fun. And now, with Kinect for Windows – the same experience of one self being a controller is here. Use Kinect to move documents, read files or even give voice commands. It is just like having a ‘Jeannie’ for you. <br /><br />But in enterprise, using Kinect can be challenging. People are busy with managing documents, replying mails and processing workflows. People spend most of the time either with collaboration tool (like SharePoint) or Personal Information Management Tools (like Outlook). SharePoint is widely used as a collaboration and document management tool in enterprise. With tools like Attini, even social network (blogs, news, quick updates) has become a part of SharePoint infrastructure. <br /><br /><a href=\"https://kinectexplorersp.codeplex.com/wikipage?title=http%3a%2f%2fwww.zevenseas.com&referringTitle=Home\">http&#58;&#47;&#47;www.zevenseas.com</a><br /><a href=\"https://kinectexplorersp.codeplex.com/wikipage?title=http%3a%2f%2ftwitter.com%2fdanmc&referringTitle=Home\">http&#58;&#47;&#47;twitter.com&#47;danmc</a><br /><a href=\"https://kinectexplorersp.codeplex.com/wikipage?title=https%3a%2f%2ftwitter.com%2fmayur_tendulkar&referringTitle=Home\">https&#58;&#47;&#47;twitter.com&#47;mayur_tendulkar</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "Kinect SDK,SharePoint 2010,WPF,Speech,kinect,sp2010,sharepoint,sp-xbox,kinectintegration,",
  "LastEdited": "2012-09-06T21:32:43.143-07:00"
}