{
  "ProjectName": "Lexalytics4Excel",
  "Title": "Lexalytics plugin for Excel 2010",
  "Description": "This project builds an add-in for Excel 2010 that exposes the text analytics functionality for Lexalytics' Salience Engine. The add-in requires a local installation of Salience Five, and uses Salience to perform entity and theme extraction with sentiment analysis.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong></p>\r\n<p>This project builds an add-in for Excel 2010 that exposes the text analytics functionality for Lexalytics' Salience Engine. The add-in requires a local installation of Salience Five, and uses Salience to perform entity and theme extraction with sentiment\r\n analysis. For more information about Lexalytics and Salience Five, please visit <a title=\"Lexalytics.com\" href=\"http://www.lexalytics.com\" target=\"_blank\">\r\nhttp://www.lexalytics.com</a>.</p>\r\n<p>This project is provided for Lexalytics customers who want a vehicle for quick analysis of Excel-based data. It requires an existing local Salience Five installation. The plugin allows one or more columns of data to be selected in an Excel worksheet, where\r\n one column is text to be analyzed and any additional columns are treated as metadata. The plugin creates new worksheets for entities (people, companies, products, places) as well as themes. Sentiment analysis of entity and theme mentions are provided, which\r\n links back to each mention of the entity or theme in the original content.</p>\r\n<p><br>\r\n<strong>Background</strong></p>\r\n<p>The Excel plugin was originally developed in 2010 as a client for the Lexascope web service. When the Lexascope project was mothballed, this plugin was put on hold. Recently, we decided to resurrect it as a simple tool for use with a local Salience installation\r\n as a simple client application for analyzing Excel-based content. The original project had been developed in such a manner that the framework for the plugin was completely intact, and processing via the web service could be replaced with calls to local processing\r\n without too much rework. Most of the internal data structures used for handling result data from the web service were retained, and you'll still see some legacy unused code related to the web service. This code has been retained for any future development\r\n that includes the option to send data out to a web service for processing.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-12-10T22:44:15.71-08:00"
}