{
  "ProjectName": "mscui",
  "Title": "Microsoft Health Common User Interface",
  "Description": "The Microsoft Health Common User Interface (CUI) provides Design Guidance and controls which allow a new generation of safer, more usable and compelling health applications to be quickly and easily created. It is aimed at user interface designers, application developers and patient safety experts who want to find out more about the benefits of a standardized approach to user interface design.\n\nPatient safety is a critical issue for healthcare organizations worldwide. Microsoft has been working with the National Health Service (NHS) in England to improve patient safety by creating a common look and feel for NHS systems through the NHS Common User Interface (CUI) Programme. This partnership initiative is in conjunction with the UK government agency called NHS Connecting for Health. Microsoft is now publishing the Design Guidance produced through this collaboration and providing the Healthcare community with access to the associated controls.\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Welcome </h2>\r\nThe Microsoft Health Common User Interface (CUI) provides Design Guidance and Toolkit controls which allow a new generation of safer, more usable and compelling health applications to be quickly and easily created. It is aimed at user interface designers, application developers and patient safety experts who want to find out more about the benefits of a standardized approach to user interface design.<br /><br />Patient safety is a critical issue for healthcare organizations worldwide. Microsoft has been working with the <a href=\"http://www.nhs.uk/Pages/homepage.aspx\">National Health Service (NHS)</a> in England to improve patient safety by creating a common look and feel for NHS systems through the NHS Common User Interface (CUI) Programme. This partnership initiative is in conjunction with the UK government agency called <a href=\"http://www.connectingforhealth.nhs.uk/\">NHS Connecting for Health</a>. Microsoft is now publishing the Design Guidance produced through this collaboration and providing the healthcare community with access to the associated Toolkit controls.<br />\n<h3>Further Information on the CUI</h3>\r\n<h4>CUI Website:</h4>\r\nThe <a href=\"http://www.mscui.net/\">Microsoft Health Common User Interface website</a> provides information on the CUI project, the Design Guidance, examples of Toolkit controls, and interactive sample pages for this release. A roadmap for future developments is also included.<br />\n<h4>Design Guidance:</h4>\r\nThe Design Guidance has been produced through a rigorous user-centred design process that incorporates primary and secondary research, usability testing, consultation with software providers and integrated hazard assessments.<br /><br />The first areas to be released as part of the Design Guidance can be interactively browsed or downloaded <a href=\"http://www.mscui.net/designguide/designguide.aspx\">here</a>.\n<h4>Toolkit Controls:</h4>\r\nThe Microsoft Health CUI Toolkit is a set of .NET controls that help Independent Software Vendors (ISVs) build safe, consistent user interfaces for healthcare applications. Full source code is provided, and includes sample applications that illustrate how the controls can be used in a variety of contexts. Unit tests that can be used to verify that the controls are working correctly are also included. The controls are designed to be used in conjunction with the Design Guidance documentation, but ISVs are free to extend the controls to suit their own requirements using the source code provided as a starting point. Once installed into the Visual Studio Toolbox, full IntelliSense and context-sensitive help are available to help developers understand how to use the various control features. <br /><br />Examples of the controls that implement the Design Guidance in specific scenarios and a demonstration of how different Toolkit controls can be combined and different styling applied can be found <a href=\"http://www.mscui.net/controlsandsamples.aspx\">here</a>.<br /><br />In the releases prior to June 2008, Toolkit controls were created using ASP.NET AJAX and .NET WinForms. For future releases, all new controls will be developed in Windows Presentation Foundation (WPF) and Silverlight. The decision to change our technology focus is based on feedback we have received from healthcare ISVs, who are keen to start working with these new technologies. <br /><br />It is important to emphasise that the move to new technologies doesn&#39;t make the controls we have produced so far obsolete. Whether you are building a brand new application, or incorporating the Toolkit controls into an existing one, the new technologies are designed to integrate seamlessly with ASP.NET and WinForms, so any investment you have already made has not been wasted. WPF controls can be hosted in WinForms applications using the <a href=\"http://msdn2.microsoft.com/en-us/library/system.windows.forms.integration.elementhost.aspx\">.NET ElementHost control</a>, and Silverlight controls are designed to be used within ASP.NET web pages alongside ASP.NET AJAX controls. <br /><br />\n<h4>Pre-Requisites:</h4>\r\nBefore you can use the toolkit you will need to install a number of prerequisites. These are described in more detail in the ReadMe document on the Releases page. <br />\n<h4>Future Releases:</h4>\r\nA delivery roadmap for future areas of the Design Guidance and controls can be found <a href=\"http://www.mscui.net/roadmap/schedule.aspx\">here</a>.<br /><br />A unified body of guidance will be maintained based on feedback from the broader healthcare community and innovation and collaboration with the NHS CUI Programme.&#39;<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,winforms,ASP.NET,Controls,WPF,WinForm Controls,patterns,patterns &amp; practices,Guidance,health management,UI Controls,Microsoft,ASP.NET 2.0,AJAX Control Toolkit,UI,App,control,Applications,asp.net controls,webcontrols,health,MyList,WinForms Controls,Silverlight,Microsoft CUI,CUI,WPF controls,Silverlight Controls,example,application,Silverlight 2.0,Medical,microsoft health,Ajax Controls,demo,User Interface,Healthcare,MSCUI,eHealth,Need Revist,sl,Health  Silverlight,MEMEDICAL,medlink,",
  "LastEdited": "2008-11-11T08:34:43.21-08:00"
}