{
  "ProjectName": "organizeyourlearning",
  "Title": "Virtual Notebook",
  "Description": "Organize your learning is about managing how you read from your e-books and searches from the blogs, forums and other web contents. It provides you with adding bookmarks, tags and comments in your e-books and also provides a managed repository for offline storage of your searches",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><font size=\"4\">Virtual NoteBook</font> (originally, Organize your learning), is an application intended to be readers friendly (especially for the students). What we search in the internet, or other e-books, this application is intended to be a repository\r\n for it so that the users can add tags, comments to it and work over it like their notebook, so that their e-learning becomes more simplified. I did it as a part of my minor project for my college.&#160; For now, it has the following features:\r\n<br>\r\n</p>\r\n<h3><a name=\"_Toc284830760\">FEATURES:</a></h3>\r\n<p>1. Document management system, with all basic text editing features, with ribbon GUI</p>\r\n<p>2. Multiple tabs support to open multiple documents simultaneously</p>\r\n<p>3. Feature to mark contents as bookmarks, highlight and questions</p>\r\n<p>4. Feature to add comments in the documents as annotation</p>\r\n<p>5. Feature to search for all these annotated contents in the document</p>\r\n<p>6. Integration of Web Browser Control into our application so that they don’t have to switch back to the browsers to start searching in the web.</p>\r\n<p>7. Interoperability with Internet Explorer to extract web page contents and send it directly to our application, along with the metadata of the information source (URL and the date time information)</p>\r\n<p>8. Using Tag based search in Tag Cloud to search for the tags across the documents (ie bringing Tag Cloud to desktop app)</p>\r\n<p>&#160;</p>\r\n<p>Please find the installation file, Complete Documentation and User Guide in the link below.</p>\r\n<p><a title=\"http://organizeyourlearning.codeplex.com/releases/view/70519\" href=\"http://organizeyourlearning.codeplex.com/releases/view/70519\">http://organizeyourlearning.codeplex.com/releases/view/70519</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,annotations,Flowd,FlowDocument,Document Management,college projects,",
  "LastEdited": "2011-07-23T19:20:21.25-07:00"
}