{
  "ProjectName": "PoshPAIG",
  "Title": "PoshPAIG",
  "Description": "PoshPAIG allows you to easily audit and install patches on your servers in the network by providing a graphical interf",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1><b>All work on this has moved to Github. Please direct all issues to that site.</b></h1>\r<h1><b><a href=\"https://github.com/proxb/PoshPAIG\">https://github.com/proxb/PoshPAIG</a></b></h1>\r\n<b>Project Description</b><br />PoshPAIG allows you to easily audit and install patches on your servers in the network by providing a graphical interf<br /><br />The utility works in any environment, but the optimal environment is a where you have a local WSUS server and your systems have Windows Update settings configured to &quot;Download updates and do not install&quot; either through Group Policy or local policy.<br /><br /><b>Due to licensing issues, please download PSExec.exe from the link below and place in the root of the UI folder, otherwise the Install portion will fail</b><br /><a href=\"http://technet.microsoft.com/en-us/sysinternals/bb897553\">http://technet.microsoft.com/en-us/sysinternals/bb897553</a><br /><br /><b>Version 2.1.5 has been released!</b><br />Please see release notes in the downloads section for new features/bug fixes.<br /><a href=\"http://poshpaig.codeplex.com/releases/view/100929\">http://poshpaig.codeplex.com/releases/view/100929</a><br /><br /><br /><img src=\"/projects/PoshPAIG/87f0fcd9-e312-4673-97b0-39ef1140abba\" alt=\"poshpaig_2_1_5.PNG\" title=\"poshpaig_2_1_5.PNG\" /><br /><br />Hey, Scripting Guy articles:<br /><a href=\"http://blogs.technet.com/b/heyscriptingguy/archive/2011/08/13/use-powershell-to-audit-and-install-windows-patches.aspx\">http://blogs.technet.com/b/heyscriptingguy/archive/2011/08/13/use-powershell-to-audit-and-install-windows-patches.aspx</a><br /><a href=\"http://blogs.technet.com/b/heyscriptingguy/archive/2011/08/14/lessons-learned-while-writing-the-powershell-poshpaig-module.aspx\">http://blogs.technet.com/b/heyscriptingguy/archive/2011/08/14/lessons-learned-while-writing-the-powershell-poshpaig-module.aspx</a><br /><br /> A list of new features available are:<br />\n<ul><li>Updated ListView UI</li>\n<li>PSJobs replaced with Background runspaces for better performance</li>\n<li>New reports for installed updates</li>\n<li>Keyboard Shortcuts\n<ul><li>F1: Display Help</li>\n<li>F5: Run the selected command. Ex. Audit Patches,Install Patches</li>\n<li>F8: Run a select report to generate</li>\n<li>Ctrl+E: Exits the PoshPAIG applicaton</li>\n<li>Ctrl+A: Select all systems in the Computer List</li>\n<li>Ctrl+O: Opens up the Options menu</li>\n<li>Ctrl+S: Opens window up to add more systems to Computer List</li>\n<li>Ctrl+D: Removes a selected System or Systems</li></ul></li>\n<li>Services Reporting for non-running services set to Automatic</li>\n<li>New UI changes</li>\n<li>Better interaction with Windows Update Service</li>\n<li>New reporting options available</li>\n<li>Options menu to adjust some settings</li>\n<li>MultiThreading of operations (Supports running 20 jobs at one time) without UI freeze</li>\n<li>Add multiple computers with Add Server button using comma to separate each server</li>\n<li>Select multiple computers in server list and perform operations on only those servers</li>\n<li>Able to reboot systems with a monitored reboot</li>\n<li>Ping sweep of all systems in server list</li>\n<li>View windowsupdate.log on an individual server</li>\n<li>View installed updates on servers</li>\n<li>Remotely run wuauclt /detectnow on servers</li>\n<li>Generate host list of servers</li>\n<li>Sort columns</li>\n<li>Notes column to track running operations</li>\n<li>Error report</li></ul>\n<br /><br />The PowerShell Patch Audit/Installation GUI started out as a project for work to build an interface to perform the patching of our systems to those who were not familiar enough with PowerShell to run a set of scripts I build to perform the same auditing and installation of patches.  This product is currently in Alpha as there are some bugs that need to be squashed as well as other features I need to add to the tool as well as updating some some current features.<br /><br />A blog post about this is available at <a href=\"http://learn-powershell.net/2011/06/03/powershell-patch-auditinstall-gui-poshpaig-released/\">http://learn-powershell.net/2011/06/03/powershell-patch-auditinstall-gui-poshpaig-released/</a><br /><br />What this tool gives you is a way to first audit your systems which you can supply one of many ways. You can supply a list of systems, pull a list from Active Directory or manually add the systems yourself into the utility.<br /><br />One of the best features about this tool is that it uses background jobs to perform all of the actions while the front end GUI is not affected. This means that you can freely move the GUI around as it does not get locked up like a normal WPF gui would in PowerShell if you attempted to run a job of some kind. You will also notice that the data in the GUI updates automatically as each job finishes for a server. For instance, if you are Auditing for patches, you will start seeing the number of patches waiting to be installed start updating next to each respective server. Same for Installing patches, the total number of installed patches, along with patches that gave an error when installing will be displayed in the GUI&#39;s data window. Also, a progress bar is at the bottom of the GUI and status bar to show you how far along the process is.<br /><br />After an Audit or Installation is performed, there are options to generate a Grid-View report for viewing or a CSV report can easily be generated to the default location of the GUI in no time!<br /><br /><b>Next version </b><br />The next version will have the following items that I am working on:<br />\n<ul><li>Better displaying of services report to allow restart</li>\n<li>UI updates for grid view</li>\n<li>Updated code and reporting</li>\n<li>Various feature/bug requests</li></ul>\n<br /><br />I will update this as necessary as other requests/bugs come in.</div><div class=\"ClearBoth\"></div>",
  "TagList": "powershell,WSUS,WPF,xaml,patches,Windows Update,posh,",
  "LastEdited": "2016-02-29T16:24:29.703-08:00"
}