{
  "ProjectName": "psisecream",
  "Title": "PowerShell ISE-Cream",
  "Description": "Community extentions for Powershell ISE(Integrated Scripting Environment), to allow custom hotkeys for code execution, editing,exporting, as well as color themes and such.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Community extentions for Powershell ISE&#40;Integrated Scripting Environment&#41;, to allow custom hotkeys for code execution, editing,exporting, as well as color themes and such. <br /><br />With powershell.exe version 1, there were a few projects that really TOPPED it, sweetened powershell, and just worked. In my opinion these &quot;icings&quot; on the cake were Mow&#39;s PowerTab and PSCX. With PowerShell Version 2 Microsoft introduces a simple and lean graphical powershell editor, and console called ISE (Integrated Scripting Environment). Just as Microsoft added Tabcompletion extensibility points in V1 which enabled the amazing PowerTab, Microsoft knows that its not going to be able to ship all the coolness it would want, and not be absle to come up with the diversity of innovation that the community can, and thus has exposed much functionality through the $PSISE variable. The goal of this project is to group together many such community scripts for ISE, in a V2 module, in a way that users can choose which features of this library they want to use, which features are mapped to the hotkeys of their choice, and allow this library to grow over time, as the contributors here and bloggers write interesting extentions for ISE.<br /><br />Here is a <a href=\"https://psisecream.codeplex.com/wikipage?title=List%20of%20blogged%20about%20Extentions&referringTitle=Home\">List of blogged about Extentions</a> .  <br /><br />The first goal of this project is just collecting these cool extentions and getting a few contributors joining the project. <br />After that we&#39;ll work out a good way to enable and disable different features, and maybe build certian WPF UI&#39;s around the editing of these settings, such as editor themes.<br /><br />Here are some <a href=\"https://psisecream.codeplex.com/wikipage?title=Ideas%20to%20Implement&referringTitle=Home\">Ideas to Implement</a><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-01-03T19:48:04.897-08:00"
}