{
  "ProjectName": "reloadit",
  "Title": "ReloadIt",
  "Description": "ReloadIt is like Live Reload, for Windows.  It automatically reloads a page in IE, when a change is detected in a given file or directory.  \r\n\r\nSave your file (js css htm aspx etc) and ReloadIt tells IE to refresh the page.  You see changes instantly while developing.  It's like an *automatic F5* button for your browser.  It's implemented in C# as a WPF project, but it works with any web project - PHP, jQuery, JSP, HTML and Javascript, ASPX, anything.  You will be amazed at how much this simple tool makes your life better.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>ReloadIt ! </h1>\rReloadIt is like Live Reload, for Windows.  It automatically reloads a page in IE, when a change is detected in a given file or directory.  <br /><br />Save your file &#40;js css htm aspx etc&#41; and ReloadIt tells IE to refresh the page.  You see changes instantly while developing.  It&#39;s like an &#42;automatic F5&#42; button for your browser.  It&#39;s implemented in C&#35; as a WPF project, but it works with any web project - PHP, jQuery, JSP, HTML and Javascript, ASPX, anything.  You will be amazed at how much this simple tool makes your life better.<br />\n<h2>A Simple tool for web developers </h2>\r\n<img src=\"/projects/reloadit/e4f554bf-99fd-454e-a172-9d76385ec82d\" alt=\"ReloadIt.png\" title=\"ReloadIt.png\" /><br /><br />The other day I heard about &quot;Live Reload&quot; - a tool that apparently is available for Mac, and works with Chrome and Safari.  It automatically reloads a webpage when a source file gets changed - a nice convenience for developers of web apps.  There used to be a Firefox add-in called Xrefresh that did this; not sure of its current status.   I do most of my work on Windows, and thought it would be nice to have that kind of tool on Windows.  And that&#39;s how ReloadIt was born. <br /><br />ReloadIt is a small tool that does one thing - reload web pages.  It&#39;s easy and handy.  Free to use, and licensed under the MS-PL. <br /><br />If you&#39;re like me, your edit-test-debug cycle is pretty rapid.  I tweak a js file , and I&#39;d like to see the effect immediately.  I change a .css style, and I want immediate feedback - did it do what I expected?  I modify the HTML and change the server-side code, and I want to see what the webpage looks like. Each change affects the way the webpage looks. This tool updates the appropriate IE tab after every change, automatically.  Like pressing F5 in the appropriate IE tab, only without changing windows.   <br /><br />ReloadIt works with any editor.  Stay in your editor, save any file involved in the project, and ReloadIt automatically causes IE to reload the configured page. It saves a few seconds, but more importantly, several mental context switches. It can make a surprisingly big difference in your work.  Keep the IE window open and partly visible, and never leave your editor.  You don&#39;t need to swap back-and-forth between windows. It&#39;ll make your life better.<br /><br />I published this tool in hopes that other people would like to use it too.  If you try it and like it, let me know. If you try it and don&#39;t like it, let me know that too.  Suggestions and questions to the discussions list.  If I get reasonable enhacement requests I&#39;ll put them into the tool. <br />\n<h2>Example Usage: The Tool</h2>\r\nIn the image above, you see the ReloadIt tool.  On the left hand side, I&#39;ve selected a URL that is already displayed in an IE tab.  On the right hand side, I&#39;ve specified a directory to watch for changes. <br />\n<h2>Example Usage: An Editing Session. </h2>\r\n<img src=\"/projects/reloadit/30ea3bff-1fd6-4c0b-b635-18f9537094c9\" alt=\"ReloadIt-Usage.gif\" title=\"ReloadIt-Usage.gif\" /><br /><br />What you&#39;re seeing above: an IE Window is open in the background, displaying a bar chart created using the flot Javascript library.  This is the same URL that was selected in the previous screenshot.  A text editor is open on the right hand side, editing a Javascript module that defines the data being displayed in the chart.  I modify the file, and save the .js module. At that point ReloadIt (not pictured) detects the change, and tells IE to reload the changed page. This works with any editor, any type of source file, any server-side technology. Once you configure ReloadIt, you don&#39;t need to go back into the tool.  Set it and forget it.  Minimize it, and perform your edits as normal.  It quietly reloads pages as necessary. <br />\n<h2>FAQ</h2>\r\n<ul><li><b>How do I use ReloadIt?</b>  </li></ul>\nOpen your page in IE.  Then start ReloadIt. In the left-hand-side of the tool, select the URL you want to be automatically reloaded. In the right hand side of the tool, specify one or more &quot;paths to watch&quot; for changes. Each should be a path to a directory, a path to a file, or a path to a set of filenames specified via wildcards (eg, c:\\dir1\\*.htm).  Tick the checkbox, and press F12. When any file changes in any of those directories (or any of their subdirectories), ReloadIt will tell IE to reload the selected page.  It happens in less than a second.<br />\n<ul><li><b>Cool!</b></li></ul>\nYeah, I know.<br />\n<ul><li><b>Can ReloadIt watch for changes in a specific file?</b>  </li></ul>\nYes, as of v1.1.0.1.  It can watch directories, specific files, or a set of files described by a wildcard.  You can configure a set of those things for any webpage; when any change happens in any of them, ReloadIt reloads the webpage. <br />\n<ul><li><b>Can ReloadIt watch for changes in a remote website?</b>  </li></ul>\nNo.  ReloadIt is not a consumer-oriented tool that monitors websites.  It&#39;s a developer tool.  It monitors FILES, and then refreshes an IE tab when the file changes. <br />\n<ul><li><b>Is it fast?</b></li></ul>\nThe IE tab begins reloading the page, within less than a second after you&#39;ve saved your file. It&#39;s pretty quick, normally. For directories containing a large number of files, or a large number of subdirectories, the latency will be higher. If you configure a larger number of tabs to reload, that may also affect the latency. <br />\n<ul><li><b>Does it work with Firefox? Chrome? Safari? Linux?  Mac?</b>  </li></ul>\nNo.  It works with IE only.  And obviously only on Windows.<br />\n<ul><li><b>Does it work with IE7?</b>  </li></ul>\nI don&#39;t know.  I tried it only on my machine, IE9 on Windows 7.  It <i>should</i> work with IE8 and on prior versions of Windows. <br />\n<ul><li><b>Does it require IIS?</b>  </li></ul>\nNo.  It doesn&#39;t matter what the server-side technology is, including the web server.  In fact the only connection between the directory you select, and the URL that gets refreshed, is in ReloadIt&#39;s memory.  You could, for example, tell reloadit to re-load a browser page showing the Google news feed, every time the file c:\\temp\\foo.txt changes.  Not sure how useful that would be, but it&#39;s possible.  The main use case, is to enable a rapid edit-test-debug cycle for developers who build websites on Windows.<br />\n<ul><li><b>I noticed that the IE page does not reload repeatedly when there are multiple changes in quick succession.  But I want it to reload faster. Can I do that?</b>  </li></ul>\nYes, there&#39;s a registry setting for that.  It&#39;s in \\HKCU\\Dino Chiesa\\ReloadIt\\ReloadIntervalInMs .  It&#39;s a DWORD, set it to the minimum number of milliseconds between successive reloads. A value of 3200 would mean ReloadIt would not reload a web page until at least 3.2s elapsed since the prior reload, regardless of any ongoing changes detected in the filesystem. Lower the value to allow more frequent reloads.<br />\n<ul><li><b>How does ReloadIt work?</b></li></ul>\nIt&#39;s just a WPF form around a FileSystemWatcher, plus some IE-specific magic to get the list of currently-open IE tabs.  <br />Pretty simple. <br />\n<ul><li><b>My page is getting reloaded constantly. WTF?</b> </li></ul>\nThe directory you are watching, is probably getting more changes that you imagined it would.  You&#39;ll need to monitor a more specific directory, or specify an individual file, or reduce the number of changes being made to the file, or something along those lines. <br />\n<ul><li><b>Can ReloadIt open a page in IE?</b></li></ul>\nNo.  ReloadIt can only reload a page that is already open in an IE tab.  Open the page first in IE, then start ReloadIt. <br />\n<ul><li><b>How do I tell ReloadIt to stop monitoring for changes?</b> </li></ul>\nPress F12, and ReloadIt stops or starts monitoring. <br />\n<ul><li><b>How do I ask ReloadIt to re-scan the list of IE tabs?</b> </li></ul>\nPress F5 to refresh the list of URLs.  For any tab open in IE, ReloadIt will list the URL in the left-hand-side listbox. <br />\n<ul><li><b>What else?</b> </li></ul>\nThere&#39;s a right-click context-menu that allows you to close, refresh, or bring-to-front any tab in IE. This logic may be interesting for other apps.  <br />\n<ul><li><b>Does ReloadIt remember the reload settings for various URLs?</b> </li></ul>\nYes, it&#39;s got a Most-Recently-Used list of URLs and directories to watch.  The list is 15 elements long, so if you stop ReloadIt, and then run it tomorrow, it will remember the settings you&#39;ve used for various websites.  <br />\n<ul><li><b>Can ReloadIt work with ASPNET MVC pages?</b></li></ul>\nSure, it works with any server-side technology.  If you want to display generated JSON in IE, then you will need to futz with the registry, as per <a href=\"http://stackoverflow.com/questions/2483771/\">this tip on stackoverflow.com</a>. </div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-11-10T13:12:08.823-08:00"
}