{
  "ProjectName": "sbn",
  "Title": "Simple Blog .NET",
  "Description": "Simple Blog is what the name implies, a simple blogging software application for the ASP.Net 2.0 platform.  Unlike other blogging software like CommunityServer, Simple Blog should be as simple as running a db script, editing a connection string in the web.config and dropping the code on the server.  An unlike other software packages, instead of using a \"theme\" to setup the blog you can just modify the CSS and aspx pages however you want to achieve your own look and feel to your site.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>4/19/2007 Changes</b><br />I&#39;ve made dozens of fixes and correctted some problems I was having with TFS.  The new code has support for photo galleries, static pages, pinned articles, etc.  A new official release should be available soon.<br /><br /><b>11/05/2006 Changes</b> <br />I&#39;ve checked in more changes that address some bug fixes and missing functionality that is required to make the site operate that I ran into these issues while setting up ryanandkimberly.com.<br /><br /><b>SQL 2000 Support</b><br />If you&#39;re going to run SBN on a SQL 2000 database, you&#39;ll need to rename sys.objects to sysobjects and &quot;object<i>id = OBJECT</i>ID&quot; to &quot;id = OBJECT_ID&quot; in the change scripts and stored procedures.<br /><br /><b>10/22/2006 Changes</b> <br />I checked in a huge set of changes, including several database changes.  The code includes numerous fixes and several security enhancments to prevent people from posting spam in your blogs.  Things include: optional user registration, software autoposter prevention, maximum login attempts, ip address blocking and several GUI enhancements.  If you&#39;re updating an existing database you&#39;ll need to make sure you publish your existing blog entries before they&#39;ll reappear on your site.<br /><br /><b>Changes</b><br />I made several changes recently and you&#39;ll need to make sure to run the change scripts and the new stored procedures (not the ones in the V2 folder) regardless if you have an old database or if you just created a new one from the create scripts.<br /><br /><b>Simple Blog .Net (SBN)</b><br />SBN is simple to setup, simple to use blogging application build on top of the .Net 2.0 framework and SQL 2005 (although it&#39;ll work in 2000).<br /><br />Release 2 is available at <a href=\"http://www.infinityball.net\">http://www.infinityball.net</a>, it has some issues (nothing major) that I&#39;m working on right now and I should have a stable release on CodePlex soon.  Or you can just download Change Set 3222 or higher.<br /><br /><b>Requirements</b><br />-SQL Server 2005 (2000 works too)<br />-Web server capable of running ASP.Net 2.0 code<br />-Privledges to setup the database and web site<br /><br /><b>Installation</b><br />Installation is pretty easy. First you need to download the latest source code or grab one of the releases (shouldn&#39;t make a big difference unless you&#39;re already running an old version of SBN).    Both the release and source contain a folder called &quot;SimpleBlogData&quot;, inside that folder is a &quot;Create Scripts&quot; folder.  This contains the sql script that will build the initial database or upgrade your current DB to the latest version.  In SQL Server, create a new, empty database (i.e. SimpleBlog), then run the create script on the that database.  This will setup the tables and stored procedures you need to run SBN.  Depending on your SQL Server security setup you&#39;ll most likely have to create a SQL user that can access the DB and you may have to give that user execute permissions on the stored procedures.  Once that is done, you&#39;ll need to copy the contents of the &quot;SimpleBlogWeb&quot; folder that came with the source or release to the server where you&#39;ll be hosting SBN.  Next you&#39;ll need to modify the web.config file found in the root of the SBN web site you&#39;re creating.  Modify the ConnectionString property and SMTPServer properties to match the settings for your web site.  Once that is done you should be able to visit your SBN web site and you will be prompted to setup the admin user.  After that the site should be fully operational.<br /><br /><b>Lost Admin Password</b><br />If you lost your admin password, the only way to recover it is to modify the sbusers table in the database.  To reset the password, find your admin user account in sbusers and modify the password field to be &quot;admin&quot;.  The word &quot;admin&quot; is a reserved word that will not require or be encrypted to login, this will allow you to login with the password &#39;admin&#39; and change it to something more secure through the settings page.<br /><br /><b>Planned Features</b>\n<ul><li>AJAX enabled image gallery</li>\n<li>Enhanced settings page</li>\n<li>SimpleNav control will be database driven</li>\n<li>Toolbar navigation control</li>\n<li>Themes</li>\n<li>RSS support (available in the latest build and currently being tested at <a href=\"http://www.infinityball.net/rss.aspx\">http://www.infinityball.net/rss.aspx</a></li>\n<li>Rich text editor for article entry</li>\n<li>Article and comment ranking system</li></ul>\n<br /><br /><br /><b>Sites Using SBN</b><br /><a href=\"http://www.infinityball.net\">http://www.infinityball.net</a><br /><a href=\"http://www.ryanandkimberly.com\">http://www.ryanandkimberly.com</a><br /><a href=\"http://www.jdhsreunion.com\">http://www.jdhsreunion.com</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "blogging,blog,Portal,Simple Blog .NET ,blogs,",
  "LastEdited": "2007-04-19T17:10:33.617-07:00"
}