{
  "ProjectName": "TheBeerHouse",
  "Title": "TheBeerHouse: CMS & e-commerce StarterKit",
  "Description": "TheBeerHouse is an ASP.NET 3.5 website which features a layout with themes, membership system, a CMS for publishing and syndicating articles, polls, mailing lists, forums, an e-commerce store, calendar of events and photo gallery.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>TheBeerHouse</strong> is a website developed with <span style=\"text-decoration:underline\">\r\nMicrosoft's MVC Framework</span> which includes a number of features and modules that you expect from a typical CMS / e-commerce website, such as:</p>\r\n<ul>\r\n<li><strong>Membership system</strong> with registration, login, profile setup and complete administration.\r\n</li><li><strong>Content management system</strong> for publishing and syndicating articles and photos, with support for categories, comments, rating and profile-based personalization.\r\n</li><li><strong>Opinion polls</strong> with support for multiple active polls and archived polls.\r\n</li><li><strong>Mailing lists</strong> with support for HTML and plain-text newsletters, background transmission and asynchronous processing.\r\n</li><li><strong>Forums</strong> with support for multiple categories, custom pagination, avatars, signatures, moderation, and complete administration.\r\n</li><li><strong>E-commerce store</strong> with support for real-time credit card processing, with support for multiple categories, percentage discounts, zoomable pictures, availability display and more.\r\n</li><li><strong>Localization</strong>. </li></ul>\r\n<p><br>\r\nThis website was developed by Nick Berardi, Al Katawazi, and Marco Bellinaso as a sample project for their book\r\n<a href=\"http://www.amazon.com/ASP-NET-MVC-1-0-Website-Programming/dp/0470410957\">\r\n&quot;ASP.NET MVC 1.0 Website Programming: Problem - Design - Solution&quot; (Wrox Press)</a>. The book is aimed at describing, designing, and implementing a site much like the ones you&rsquo;re probably working on or will be soon, while taking the opportunity to introduce\r\n and explain many of the new features that the new great ASP.NET MVC framework offers. Difficult problems are addressed head-on so you'll be ready for most of the problems you&rsquo;ll typically face when writing a modern website, and have one or more solutions\r\n ready for them. <br>\r\n<br>\r\nUnlike many other MVC Framework books that show examples for individual viewsor features, the example in this book is an integrated end-to-end site (written in C#). The entire book and site has been written specifically for ASP.NET MVC Framework, to use the\r\n ASP.NET MVC Framework features wherever they make sense. <br>\r\n<br>\r\nIn building the site features listed above, you'll learn these new features available to you in the MVC Framework:</p>\r\n<ul>\r\n<li>Concept of Model View Controller </li><li>Creating RESTful URLs </li><li>Leveraging jQuery to make a lean and scalable website that incorporates AJAX </li><li>Using Membership &amp; Profile modules in the MVC Framework </li><li>Incorporating LINQ to SQL to generate your data access layer </li><li>Use of inline C# code inside of your markup </li></ul>\r\n<p><br>\r\n<strong>Links</strong></p>\r\n<ul>\r\n<li><a href=\"http://www.TheBeerHouseExample.com\">TheBeerHouse live online</a> </li><li><a href=\"http://www.amazon.com/gp/product/0764584642?tag=coderjournal-20\">The Original Book</a>\r\n</li><li><a href=\"http://www.amazon.com/dp/0470410957?tag=coderjournal-20\">The MVC Book</a>\r\n</li><li><a href=\"http://www.amazon.com/gp/product/0470187581?ie=UTF8&tag=extremewebwor-20&linkCode=as2&camp=1789&creative=390957&creativeASIN=0470187581\">WebForms 3.5 with Entity Framework</a>\r\n</li></ul>\r\n<p><br>\r\n<strong>Selling downloadable products</strong><br>\r\nTheBeerHouse does not support selling downloadable products, as that needs a number of very specific features such as tracking and limiting downloads, delivering serial codes, handling discount coupons, and more. However, I've released a separate service that\r\n does just this: <a href=\"http://www.bytecommerce.com\">byteCommerce</a><br>\r\nPlease take a look at it, it's probably the most convenient service of this type you can find around!</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,CMS,Database,Starter Kit,Portal,favorite,ASP.NET 2.0,sample,e-commerce,nkfav,HsLovesIt,beer house,langua,beerhouse,StarterKit,Viewstate,shop,wrox book,ecommerce,yorkrj,example,MVC,TheBeerHouse,Articles,Membership system,",
  "LastEdited": "2012-02-24T12:40:39.753-08:00"
}