{
  "ProjectName": "vandelay",
  "Title": "Vandelay Industries",
  "Description": "This suite of Orchard modules contains the following features:\r\nClassy, Favicon, Feedburner, Meta tags, Tag Cloud, Tag RSS, Theme Picker and Translation Manager.",
  "MovedLink": "https://github.com/bleroy/vandelay",
  "HomeWiki": "<div class=\"wikidoc\">This repository is now on GitHub: <a href=\"https://vandelay.codeplex.com/wikipage?title=https%3a%2f%2fgithub.com%2fbleroy%2fvandelay%2f&referringTitle=Home\">https&#58;&#47;&#47;github.com&#47;bleroy&#47;vandelay&#47;</a>.<br />\n<h1>Vandelay Industries module for Orchard</h1>\r\nThis suite of Orchard modules contains the following features:<br />Classy, Custom Sort Favicon, Meta tags, Splash Screen, Theme Picker and Translation Manager.<br />\n<h2>Classy</h2>\r\nAdd ids, classes and scripts to the rendering of your content items through this part that can be added to any content type. To use, go into content/content types, edit a content type and add the Custom CSS part.<br /><br />The content template for the content type may have to be changed so that it renders the additional attributes. See <a href=\"http://orchard.codeplex.com/discussions/259938\">http://orchard.codeplex.com/discussions/259938</a>.<br />\n<h2>Favicon</h2>\r\nThis feature adds a favicon configuration page to site settings. Favicons should be stored into a favicon subfolder of the media folder.<br />\n<h2>Meta Tags</h2>\r\nAdd the Meta content part to Page or to any of your content types to add keywords and description meta tags. <br /><br /><b>Warning:</b> keywords and descriptions are no SEO silver bullets and can even be counter-productive. This will not magically get your site to #1 in search engines. The best SEO techniques are to write relevant contents, format it with valid markup under friendly URLs.<br /><br />!!Remote RSS<br /><br />Include remote RSS feeds into your site using a widget or a content part.<br />\n<h2>Theme Picker</h2>\r\nThe Theme Picker provides an admin-based way of picking one of the currently active themes for different user agents. For example, you can provide a mobile theme for your visitors who are using their phone&#39;s browser. Optionally, the module can add to each page a templatable piece of UI that enables the user to force the use of the default theme, for example to enable phone users to still use the site&#39;s full desktop experience.<br /><br />The admin page for the theme picker can be found under the Picker tab of the Themes admin section.<br />\n<h2>Translation Manager</h2>\r\nA bunch of command-line tools that facilitate the creation and management of Orchard translation files.<br />\n<ul><li>install translation &lt;translationZip&gt;</li></ul>\n<blockquote>Installs the translation files contained in the zip file. Translations for modules that are not physically present in the application are skipped.</blockquote><ul><li>package translation /Culture:&lt;cultureCode&gt; /Extensions:&lt;extensionName1&gt;,&lt;extensionName2&gt;... /Input:&lt;inputDirectory&gt; /Output:&lt;outputDirectory&gt;</li></ul>\n<blockquote>Packages translation files for the specified culture into a zip file in the specified output directory. One or more module or theme names can be specified, in which case only the po files for those modules and themes are included in the package. If no extension name is specified, all modules are scanned for po files, as well as Core and App_Data.</blockquote><ul><li>extract default translation /Extensions:&lt;extensionName1&gt;,&lt;extensionName2&gt;... /Input:&lt;inputDirectory&gt; /Output:&lt;outputDirectory&gt;</li></ul>\n<blockquote>Extracts and packages a translation file for the default culture.</blockquote><ul><li>sync translation /Input:&lt;translationDirectory&gt; /Culture:&lt;cultureCode&gt;</li></ul>\n<blockquote>Synchronizes the translation for the specified culture with the default translation. If the translation for the specified culture does not exist yet, this generates a stub for it. The Output switch must point to a directory that contains both translations.</blockquote></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2016-07-08T12:16:55.95-07:00"
}