{
  "ProjectName": "voicerecorder",
  "Title": ".NET Voice Recorder",
  "Description": "WPF application for recording and visualizinaudio using NAudio in .NET. ",
  "MovedLink": "https://github.com/markheath/voicerecorder",
  "HomeWiki": "<div class=\"wikidoc\"><h2>.NET Voice Recorder</h2>\r\n.NET Voice Recorder is a sample application demonstrating how to use <a href=\"http://naudio.codeplex.com\">NAudio</a> to record audio on the .NET framework. It also shows how to visualise audio WaveForms in WPF and can save to WAV or MP3 if you have <a href=\"http://www.bing.com/search?q=lame.exe\">lame.exe</a> on your computer. It was written for a <a href=\"http://blogs.msdn.com/coding4fun/\">Coding 4 Fun</a> article, which can be accessed <a href=\"http://blogs.msdn.com/coding4fun/archive/2009/10/08/9905168.aspx\">here</a>. You can watch a short video of .NET Voice Recorder in action <a href=\"http://www.youtube.com/watch?v=j1kSxHF0S64\">here</a>.<br />\n<h2>Installing</h2>\r\nTo install .NET Voice Recorder, simply go to the Downloads tab and download the latest Binaries. Unzip the contents and run <b>VoiceRecorder.exe</b>. .NET Voice Recorder uses .NET 3.5 and should run on Windows XP or above.<br />\n<h2>Usage</h2>\r\n.NET Voice Recorder has three main screens. The first screen allows you to select which recording device you will use. The first one in the list is the default recording device and is usually the best choice.<br /><br /><img src=\"/projects/voicerecorder/28da6a16-3aab-4f8f-917a-5afec2a71df0\" alt=\"VoiceRecorderScreen1.png\" title=\"VoiceRecorderScreen1.png\" /><br /><br />On the second screen, you have the opportunity to check and adjust the recording level before you begin recording by pressing the circular red button. Recording will automatically stop after 60 seconds. You can stop earlier by pressing the square stop button.<br /><br /><img src=\"/projects/voicerecorder/aaad9d1d-48c7-4375-83f5-60dcfb389c4b\" alt=\"VoiceRecorderScreen2.png\" title=\"VoiceRecorderScreen2.png\" /><br /><br />On the third screen, the entire recorded waveform is displayed. You are able to drag the left and right edges of the selection box to select a smaller portion to save if you wish. The Select All reselects the entire waveform. Pressing Play will allow you to preview the selected portion. When you are ready to save, click Save, and you have the option of saving either as WAV or MP3. If you select MP3, Voice Recorder will need to locate LAME.exe on your computer. It will ask you where it is, and remember the location for next time.<br /><br /><img src=\"/projects/voicerecorder/3b6879bd-9fcb-4ec1-9881-e925900ad16e\" alt=\"VoiceRecorderScreen3.png\" title=\"VoiceRecorderScreen3.png\" /><br />\n<h2>Source Code</h2>\r\nThe latest source code for .NET Voice Recorder can be accessed from the Source Code tab. To download the code that accompanies the coding 4 fun article, go to the Downloads tab and select the &quot;Coding 4 Fun Sample Code&quot; download.<br />\n<h2>Roadmap</h2>\r\nI hope to make a few enhancements to the Voice Recorder application. Here&#39;s a few of the ideas I have:<br />\n<ul><li>Support for selecting sample rate</li>\n<li>Removal of the 60 second restriction (requires a more efficient entire WaveForm display)</li>\n<li>Range selection control should support auto-scroll</li>\n<li>Noise gate and compressor effects</li>\n<li>Integrate a MVVM helper library, perhaps MVVM Light</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,audio,recording,WPF,MVVM,.net voice recorder,",
  "LastEdited": "2010-05-18T01:13:28.643-07:00"
}