{
  "ProjectName": "wallpaperchanger",
  "Title": "National Geographic Photo of the Day Wallpaper Changer",
  "Description": "I used to watch National Geographic Photo of the day everyday. \r\nhttp://photography.nationalgeographic.com/photography/photo-of-the-day\r\n\r\nSo I thought it might be helpful for people like me if a software synchronise the wallpaper with national geographic photo of the day. It also archives photo of the day along with publication date and photo title.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\rNational Geographic – Photo of the day wallpaper changer can automatically set your desktop background to the Photo of the Day. You can switch between automatic and manual changing of wallpaper. Daily archive can be enabled to archive daily image automatically. You can also use the advanced archiving options to archive images between any (currently available between 1st Jan 2009 and Today) given dates. <br /><br />Link to National Geographic Photo of the Day<br /><a href=\"http://photography.nationalgeographic.com/photography/photo-of-the-day\">http://photography.nationalgeographic.com/photography/photo-of-the-day</a><br /><br />If you like to get news updates about this project, please follow us on <a href=\"https://www.facebook.com/NationalGeographicPhotoOfTheDayWallpaperChanger\">facebook</a>.<br />\n<h2>Future of this project</h2>\rThe goal of the project is to build an event triggered wallpaper management system, where desktop visualization is triggered by events like, Time of day, Weather conditions, National Holidays, Religious fastivals, your life events like your anniversary, birthday etc.<br /><br />You will be able to add/remove wallpaper packs in your inventory. Wallpaper packs will be used to change your desktop visualizations based on the event triggers.<br /><br />You will also be able to create and publish your own wallpaper packs.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Theme,Wallpaper,Wallpaper changer,Desktop,National Geographic,",
  "LastEdited": "2014-01-14T14:47:23.093-08:00"
}