{
  "ProjectName": "wcfbyexample",
  "Title": "patterns & practices: WCF by example",
  "Description": "WCF by example is a three-tier basic application designed with the purpose to provide examples for developers interested in the designed and development of rich applications using WPF, WCF and NHibernate.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>05 Feb 2013: Entity Framework support was added to the solution. A new project that implements the Transaction Manager and generic Repository using EF Code First is now available. The following article explains the new functionality, how to get it working\r\n using SQL CE and how to deploy the solution to Azure WebSites:&nbsp; <a href=\"http://www.codeproject.com/Articles/530789/WCFplusbyplusExampleplus-plusChapterplusXVIplus-pl\">\r\nChapter XVI - EF Implementation</a></p>\r\n<p>15 Dec 2012: RavenDB was added to the eDirectory solution. A new persistance implementation was added to supported the RavenDB Embeedded document store; also, the tests can be executed using the InMemory mode. The following article describe what changes\r\n were made:&nbsp;<a href=\"http://www.codeproject.com/Articles/509581/WCF-by-Example-Chapter-XV-RavenDB-Implementation\">WCF by Example - Chapter XV - RavenDB Implementation</a></p>\r\n<p>WCF by example is a three-tier basic application designed with the purpose to provide examples for developers interested in the designed and development of rich applications using WPF, WCF and NHibernate, Entity Framework or RavenDB. (Apr 2012: a MVC project\r\n is also available)<br>\r\n<br>\r\nThere are many books and articles that individually cover WPF, WCF, DDD, NHibernate, EF and other critical technical aspects required for the design and development of enterprise applications. But yet, it is not easy to find a comprehensive example that covers\r\n the mentioned technologies in a way to facilitate developers in the creation of their own applications.<br>\r\n<br>\r\nThis project is envisaged for an application with the following requirements:</p>\r\n<ul>\r\n<li>Business processes require a comprehensive business layer </li><li>A rich client or RIA (reach internet application) is required </li><li>Clients will connect to an application server which is responsible for the business processing and persistence of the domain entities.\r\n</li><li>The application architecture needs to leverage RAD and short development iterations so agile methodologies can be applied during the development.\r\n</li><li>The architecture needs to provide comprehensive flexibility to leverage rapid model development and frequent feedback to the business stakeholder.\r\n</li></ul>\r\n<p><br>\r\nThe above architecture is resolved in this project by:</p>\r\n<ul>\r\n<li>DDD is used for the design and development of the business layer </li><li>A rich client developed on WPF using the MVVM pattern and WCF for the communication to services in the application server\r\n</li><li><span style=\"color:#000000\">A MVC solution is also available (Apr 2012) that demonstrates the use of the server components in a web application project</span>\r\n</li><li>Server component deployed on IIS7 using TCP/IP </li><li>NHibernate is used for persistence purposes but an in-memory persistence implementation is provided for RAD and testing purposes.\r\n</li><li><span style=\"color:#ff0000\">Support for RavenDB was added in Dec 2012</span>.\r\n</li><li><span style=\"color:#ff0000\">Support for Entity Framework Code First was added in Feb 2013.</span>\r\n</li><li>Dependency injection articulates a flexible architecture providing comprehensive decoupling between the application layers and components.\r\n</li><li>Additional configuration was added so the NHibernate implementation supports: SQL Server, SQL Server Express and SQL CE.\r\n</li></ul>\r\n<p><br>\r\nA <a href=\"http://www.codeproject.com/KB/architecture/wcfbyexample_introduction.aspx\">\r\nseries of articles</a> can be found at Codeproject that discusses the solution architect.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2013-02-05T14:53:37.537-08:00"
}