{
  "ProjectName": "WpfSplitContainer",
  "Title": "WPF SplitContainer",
  "Description": "Fully customizable WPF SplitContainer built from scratch, resizes two child window via movable splitter.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Fully customizable WPF SplitContainer built from scratch, resizes two child window via movable splitter.<br /><br /><img src=\"/projects/WpfSplitContainer/67dd4fc9-dcf1-4364-aebf-fa924f647077\" alt=\"SplitContainer.jpg\" title=\"SplitContainer.jpg\" /><br /><br /><b>Introduction</b><br />Windows Forms has a very handy SplitContainer control that you can use to resize two child panels. In WPF world we&#39;re out of the luck - we must use Grid and GridSplitter which is not intuive, and most importantly, can only data binding to a collection of children instead of the fixed number of 2. As we all know, data binding is the bridge between Model and View in WPF, and the greatest part (at least from my point of view) is the seperation of Model and View (or named as business logic and presentation).<br /><br />So we decided to develop a custom panel (SplitContainer class) just like Windows Forms SplitContainer, which resizes two children as the value of Child1 and Child2 dependency property. It also supports auto-resize by double clicking the splitter, resizing by keyboard arrow keys, etc. The splitter, and resizing preview, can be fully customized. You can build endless layout complexity by nesting more SplitContainers.<br /><br />The SplitContainer is part of <a href=\"http://www.devzest.com/WpfDocking.aspx\">DevZest WPF Docking</a>, a undo/redo-able commercial docking library for WPF, as a Free Feature that you can use FREE OF CHARGE for both commercial and non-commercial applications. We decided to make this class open source as a contribution to the WPF development community.<br /><br />Please note the downloadable source code is under GPL license and cannot be used for proprietary software. To use SplitContainer for proprietary software, you can download and install our <a href=\"http://www.devzest.com/WpfDocking.aspx\">WPF Docking</a> product, and obtain a Free Feature License through installed License Console, FREE OF CHARGE. This additional couple of clicks brings you extra benefits of commercial product quality documentation, upgrade and <a href=\"http://www.devzest.com/FreeSupport.aspx\">free technical support</a>.<br /><br /><br /><b>Resources</b><br /><a href=\"http://www.devzest.com/blog/?tag=/splitcontainer\">The DevZest Blog - tutorials, samples and articles</a><br /><a href=\"http://www.devzest.com/Documentation/WpfDocking/Content/fc89e6cc-6746-b5e6-cfda-45b7d9412bdb.aspx\">Online documentation</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,Controls,WPF,xaml,WPF controls,Splitter,SplitContainer,Control,",
  "LastEdited": "2009-08-14T06:22:20.25-07:00"
}