{
  "ProjectName": "zadmin",
  "Title": "Z-Admin Small Business CMS for ASP.NET",
  "Description": "With z-admin Small Business CMS for ASP.NET you will get all the tools needed to create beautiful website. Manage Pages, Columns, Articles and News.Get response from Users by adding Polls and Comment Boxes anywhere on your site. Add external content from RSS feeds, XML or REST Web Service. With support from Themes, easily change your web site look. Need specific business logic functionality? No problem, z-admin CMS support modules and custom SQL bound items. Easy to use and free!\r\n\r\nZ-Admin is a very flexible framework, based on program modules and templates. That means every part of your website is editable. Editable parts are based on installed theme. Z-admin theme is a regular HTML file. On editable parts you can add modules (z-admin embedded or custom) - which are .NET controls. You can add modules to any part of website, including editable parts, pages and articles. So what does that all mean ? It means z-admin IS DESIGNED for you to explore your creativity, and to suit needs of web designer, web developer and web moderator. Also, due simplcity and absolutely none programming skills needed to create theme, it is very easy to convert existing static website to dynamic (z-admin CMS powered) website!\r\n\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\rWith z-admin Small Business CMS for ASP.NET you will get all the tools needed to create beautiful website. Manage Pages, Columns, Articles and News.Get response from Users by adding Polls and Comment Boxes anywhere on your site. Add external content from RSS feeds, XML or REST Web Service. With support from Themes, easily change your web site look. Need specific business logic functionality&#63; No problem, z-admin CMS support modules and custom SQL bound items. Easy to use and free&#33;<br /><br />Z-Admin is a very flexible framework, based on program modules and templates. That means every part of your website is editable. Editable parts are based on installed theme. Z-admin theme is a regular HTML file. On editable parts you can add modules &#40;z-admin embedded or custom&#41; - which are .NET controls. You can add modules to any part of website, including editable parts, pages and articles. So what does that all mean &#63; It means z-admin IS DESIGNED for you to explore your creativity, and to suit needs of web designer, web developer and web moderator. Also, due simplcity and absolutely none programming skills needed to create theme, it is very easy to convert existing static website to dynamic &#40;z-admin CMS powered&#41; website&#33;<br /><br />\n<h2>Features</h2>\r\n<b>Flexible.</b> Extremely flexible CMS framework, which has purpose to adapt to the needs of website and user (and NOT the other way!).<br /><b>Themes.</b> Easily change website theme (look of website), by uploading ZIP file. Themes are ZIP files with <b>HTML documents (templates).</b> Every template contains placeholders for modules (regular HTML comment). Web designer can manage them without any knowledge of programming.<br /><b>Templates.</b> Every theme can contain unlimited number of templates. Moderator defines which page will use what template.<br /><b>Module placeholders.</b> Every template has specific places for modules (web designer defines those places). In placeholder you can add any module, text or HTML. Placeholders are easy to create, without any programming knowledge.<br /><b>Modules.</b> Any from the 30+ built in modules or user modules (or HTML content) can be placed anywhere on specific placeholders or anywhere on the page/article content. You can change positions of placed modules.<br /><b>Menu Pages.</b> Z-Admin CMS supports unlimited number of menu pages, which can be on multiple levels (multi level menu items).<br /><b>User Pages.</b> You can add unlimited number of user pages, which will not be on Menu Pages.<br /><b>Module inside Content.</b> You can add module (built in or user) in every menu page, user page, or article. It is possible to have HTML text for content, after that some specific module, after module gallery or some other module, and finally another block of HTML text.<br /><b>User modules.</b> Z-Admin CMS supports user modules (which are regular ASCX files, programmed in Visual Studio). You can place modules anywhere on page.<br /><b>Per Page Authorization.</b> Every Page (User of from Menu) supports authorization. It is possible to have specific pages allowed only to particular user group.<br /><b>Drag-Drop.</b> Page order in Menu Pages is simple as drag-drop from one place to another.<br />Extendability. Z-Admin CMS supports extenders, which are user interfaces for specific user controls. They are made and designed in Visual Studio (the same way as user controls).<br /><b>User data from SQL.</b> You can display data from specific table in database, by using module “Custom Items”. This module allows you to define header, footer, item template and writing C# code for data retrieving and data manipulating. Change everything from CMS web interface.<br /><b>Dynamic Text.</b> You can add dynamic text, where programmer can write C# code (from CMS web interface) in order to display any dynamic data he needs (e.g. current day, number of online users, etc.)<br /><b>Article Lists.</b> Z-Admin CMS has advanced features for displaying article lists. For example, you can change number of articles on page, enable paging, and change number of columns for articles.<br /><b>Article Categories.</b> Every article has it&#39;s own specific category (Category → Article List → Article Detail).<br /><b>Data through XML.</b> You can manipulate data through XML along with XSL transformations. Along with static XML data, you can use web URL to retrieve XML.<br /><b>Contact Lists.</b> You can create and manage contact lists, and every contact has it&#39;s own form for sending e-mail.<br /><b>Contact Localization.</b> You can fully localize contacts, and even hide some specific properties.<br /><b>Comments.</b> You can add comments anywhere on page. You can bind comments to article. User can write BB tags which will be automatically recognized and formatted. You can filter bad words and filter spam messages.<br /><b>Polls.</b> Module for adding and manipulating polls.<br /><b>Galleries.</b> Module for adding and manipulating image galleries.<br /><b>YouTube.</b> Module for adding and manipulating video files from YouTube.<br /><b>Twitter.</b> Module for adding and manipulating Twitter widgets.<br /><b>RSS data.</b> Module for displaying RSS data from external source.<br /><b>File Manager.</b> You can administer whole website (similar to FTP program). You can upload files, delete and rename files and directories. You can download files (including restricted ones, like web.config) You can also manage ZIP files (add to ZIP and extract).<br /><b>CSS Styles.</b> Module for quick change of specific CSS styles on website.<br /><b>User Roles and Logins.</b> You can add new roles and logins, and change their permissions. For example, you can have Administrator with full permissions, and moderator that can only manage articles.<br /><br /><a href=\"https://zadmin.codeplex.com/wikipage?title=About&referringTitle=Home\">About</a><br /><br />In the folowing video you will be shown how to create and install theme, and manage modules in template<br /><a href=\"http://www.youtube.com/watch?v=12fcd4iEH84\">http://www.youtube.com/watch?v=12fcd4iEH84</a><br /><br />In the following video you wil be shown how to create and add module inside z-admin Page.<br /><a href=\"http://www.youtube.com/watch?v=JOGixSzwCRE\">http://www.youtube.com/watch?v=JOGixSzwCRE</a><br /><br />In the following video you will be shown how to manage content, create galleries and youtube playlists and enter maintenance mode<br /><a href=\"http://www.youtube.com/watch?v=-uYS7MvYLYE\">http://www.youtube.com/watch?v=-uYS7MvYLYE</a><br /><br />In the following video you will be shown how to create and edit Twitter Widget, and add it to your website<br /><a href=\"http://www.youtube.com/watch?v=x569e_-LOiU\">http://www.youtube.com/watch?v=x569e_-LOiU</a><br /><br />In the following video you will be shown how to manipulate XML data using XSLT file, how to retrieve XML from Web Service, and finally how to display XML on the page<br /><a href=\"http://www.youtube.com/watch?v=SzAl8ypWFVA\">http://www.youtube.com/watch?v=SzAl8ypWFVA</a><br /><br />In this advanced video you will be shown how to create and use Extenders, and how to display data using Custom Items<br /><a href=\"http://www.youtube.com/watch?v=V1d_dtdgnog\">http://www.youtube.com/watch?v=V1d_dtdgnog</a><br /><br /><a href=\"http://www.z-admin.com\">http://www.z-admin.com</a><br /><br />Official YouTube channel<br /><a href=\"http://www.youtube.com/user/ZAdminCMS\">http://www.youtube.com/user/ZAdminCMS</a><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "CMS,",
  "LastEdited": "2012-03-25T14:18:41.4-07:00"
}