{
  "ProjectName": "zsclassictheme",
  "Title": "Classic Themes",
  "Description": "Using the zevenseas Classic Theme solution, you can enable the 'old' functionality of SharePoint themes to your site. Using this, you have control over the .css and images you want to include.. just like the theming engine in SharePoint 2007 and 2003.. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Using the zevenseas Classic Theme solution, you can enable the &#39;old&#39; functionality of SharePoint themes to your site. Using this, you have control over the .css and images you want to include.. just like the theming engine in SharePoint 2007 and 2003.. <br /><br /><br />Who is a fan of the way how themes were being used in SharePoint 2003 and 2007? I know, I am! In my opinion the theming support in SharePoint 2010 is ok but it lacks the the level of customization which could be achieved by the previous implementation of themes in SharePoint. What you might wonder, first and foremost you had the ability of creating your own .css file. Next, while adding the theme to your SharePoint farm, you could apply the theme to every site in your farm (the question there is, do you want that in the first place, but that’s a whole other topic ;).<br />You could have the option of using the AlternateCSS, but that option is only available in publishing environments which means that it’s not available for SharePoint foundation environment. Plus, maybe you don’t want to enable the publishing features on a collaboration site. You might wonder.. ok Robin.. now what? Well, luckily the good ‘ol theme engine of 2003/2007 is still available (on the filesystem, in the API) we only need a way of exposing this in the UI. So that’s why I developed the Classic Theme solution! Great Scott!<br />So what does it do then.. <br />1.\tGives you the ability to apply a theme to your site <br />2.\tGives you the ability to administer which themes are available in which webapplication <br />3.\tGives you the ability to deploy your custom theme in a supported way (by not overriding the spthemes.xml file)<br />If you are reading my blog in the last couple of years than you probably know that  I created a solution already to support bullet no2 and 3 (http://community.zevenseas.com/Blogs/Robin/archive/2009/08/03/adding-themes-the-supported-way.aspx) so it was just a matter of blowing the dust off that solution, make it ready for SharePoint 2010 and add the functionality to apply an ‘old’ theme to your site.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-08-21T02:28:45.94-07:00"
}