{
  "ProjectName": "activitymonitor",
  "Title": "Personal Activity Monitor - increas your productivity by eliminating timewasters",
  "Description": "simple, personal activity monitor. See how much time do you spend using different applications. Localize your time wasters and minimize them and be happy with more time for your productivity",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br /><br /> simple, personal activity monitor. See how much time do you spend using different applications. Localize your time wasters and minimize them and be happy with more time for your productivity<br /><br /><br /> Do you want to increase your productivity? Do you know how much time do you waste while working on your computer? Do you know which programs and apps do you use and how much time do you spend using them? <br /><br /> If you said yes to one of those questions then this app if for you. It sits in the tray and write down each app you launch and use. It adds up the time and show as a simple graph (for now). After a day, take a look and find your timewasters that prevent you from increasing your productivity. <br /><br /><img src=\"http://download.codeplex.com/download?ProjectName=activitymonitor&amp;DownloadId=221795\" /><br />\n<ul><li>at current state app shows the currently used app (at the top) </li>\n<li>application name (usage time in minutes <b>and in percentages</b>) </li>\n<li>graphic visualization of time spend using app (comparing to the others app) </li>\n<li>can start automatically with the system so you can better monitor your time wasting apps </li>\n<li>auto idle after 30 seconds of inactivity which can be changed in the range 1 sec up to 5 minutes. The app timers are stopped until you start unsing your computer again </li>\n<li><b>export data as xml</b> for further external processing</li></ul>\n<br /><br />Future plans:<br /><br /> Even better ui. Reports showing total usage time in the span of a day, week, month etc. <br /><br /><br /><b>Quick tour</b><br />\n<ul><li>From taskbar tray choose Personal Activity Monitors icon and with right mouse button you get:</li></ul>\n<img src=\"http://download.codeplex.com/download?ProjectName=activitymonitor&amp;DownloadId=221800\" /><br />\n<ul><li>in the settings you can set auto <b>idle time</b> (from 1 second to 5 minutes) and turn autostart on/off</li></ul>\n<img src=\"http://download.codeplex.com/download?ProjectName=activitymonitor&amp;DownloadId=221798\" /><br /><br />*about window shows some data about the app (like its version)<br /><img src=\"http://download.codeplex.com/download?ProjectName=activitymonitor&amp;DownloadId=221802\" /><br /><br />*export allows you to save data to xml format for easy further processing - this file can be read by Microsoft Excel 2010 without problems<br /><img src=\"http://download.codeplex.com/download?ProjectName=activitymonitor&amp;DownloadId=221801\" /><br /><br /><br /><br /> Don&#39;t procrastinate, install it today and get rid of the most time wasting apps tomorrow and then enjoy extra free time.<br /><br /><b>Q&amp;A</b><br />*Q. what is the latest version of the application ? <br /> A. Check it here <a href=\"https://activitymonitor.codeplex.com/wikipage?title=Latest%20application%20version&referringTitle=Home\">Latest application version</a><br /><br /><br /> </div><div class=\"ClearBoth\"></div>",
  "TagList": "tool,monitoring,Tools,monitor,productivity,desktop,Agile,Applications,personal,Projects,application,GTD,Monitoring Tool,increase,increasing,.net,.NET 4.0,mvvm,c#,c# 4.0,wpf,",
  "LastEdited": "2011-03-28T04:16:18.25-07:00"
}