{
  "ProjectName": "CustomFeedAggregator",
  "Title": "Custom WPF RSS Feed Aggregator for developers",
  "Description": "A custom RSS Feed client aggregator in WPF which allows to aggregate feeds from MS development web-sites and community blogs. Sites and blogs are grouped into categories so that you can easily browse them and stored inside a customizable XML file. Developed in Visual Basic 2008",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A custom RSS Feed client aggregator in WPF which allows to aggregate feeds from MS development web-sites and community blogs. Sites and blogs are grouped into categories so that you can easily browse them and stored inside a customizable XML file. Developed in Visual Basic 2008<br /><br /><br />A Custom RSS Feed client aggregator based on <b>Windows Presentation Foundation</b> which allows to easily stay up to date with news from Microsoft websites and community blogs. Sites and blogs are grouped into categories and you can easily browse them, read the news and open the corresponding Web pages when needed. For each feed you&#39;ll have the post title (with Hyperlink), the publish date and the category. <br /><br />Sites and categories are stored inside <b>a customizable XML document</b>. You&#39;ll be able to add <b>new feed addresses via the UI</b>, without the need of manipulating the document by yourself. By default, the application includes an XML document which contains lots of <b>Microsoft websites and blogs about development and the most important community blogs from Italian developer Microsoft MVPs</b> which you can easily replace with your favorites. <br /><br />It&#39;s developed in <b>Visual Basic 2008</b> and uses <b>LINQ-to-Xml</b> and <b>XML Literals</b> to read feeds and persist XML data.<br /><br />Here&#39;s a screen-shot:<br /><br /><img src=\"/projects/CustomFeedAggregator/2cdc7f45-c4bd-4fbd-8e1b-b93cf60d89a7\" alt=\"customfeedaggregator.jpg\" title=\"customfeedaggregator.jpg\" /><br /><br />You&#39;ll learn a lot of things like:<br /><br />WPF <b>Styles</b> and <b>control templates</b>;<br />WPF <b>Data-binding</b>;<br />WPF <b>color animations</b>;<br /><b>Creating a Grid</b> to show data in WPF;<br /><b>LINQ-to-Xml</b> query expressions and embedded expressions in Visual Basic 2008;<br /><b>XML Literals</b> in Visual Basic 2008;<br />Enabling IntelliSense for LINQ-to-XML with <b>XML Schema Inference</b>.<br /><br /><b>Important notice:</b> the XML document containing feed addresses is stored inside the application folder. This means that if you decide to deploy the application to the Program Files folder you must make sure you have permissions to read and write that folder or, otherwise, change the code to place the XML document inside another folder.<br /><br />Developed by Alessandro Del Sole, Microsoft MVP<br />Please visit <a href=\"http://community.visual-basic.it/Alessandro\">my Italian language blog</a> or contact me for further informations. If you find any errors or have suggestions, please use the Issue Tracker and Discussions tabs above.</div><div class=\"ClearBoth\"></div>",
  "TagList": "VB.NET,WPF,LINQ to XML,visual basic,RSS,Family.Show,AddToProject,",
  "LastEdited": "2011-11-13T08:06:21.673-08:00"
}