{
  "ProjectName": "dnncontrolpanel",
  "Title": "DNN Platform Role-Based Control Panels",
  "Description": "This provider extends the DotNetNuke control panel by allowing a host to specify the particular control panel that is to be loaded by role (and site).  ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>DNN Platform Role-Based Control Panels</h1>\rMore details about this project may be found on <a href=\"http://brandonhaynes.org\">my blog</a>.  <br />\n<h2>Description</h2>\r\nThe <a href=\"http://www.dotnetnuke.com\">DotNetNuke content management system</a> exposes a control panel to administrators, allowing for site and (in the case of host users) installation administration.  Historically some components of these administrative tasks (the &quot;Admin&quot; menu) were displayed alongside the main site navigation, however, after version 6.0 this component was moved out of this navigation area and consolidated into a single interface.  This served to reduce the layout differences between ordinary and administrative user, and greatly enhances the user experience.<br /><br />However, while in previous versions it was possible to assign access permissions to some administrative components (e.g. access on the &quot;Admin&quot; menu or page-editing permissions) to users who were not members of the Administrators group, some delegation-related use-cases were deprecated in version 6.0.  While users who have specific permissions (e.g. the ability to edit a specific page or module) may be granted access to some subcomponents of this enhanced control panel, some functionality is restricted only to those in the &quot;Administrators&quot; role.  Stated another way, in order to view the control panel an individual must be (i) in the Administrators role, (ii) visiting a page that is editable by that user, or (iii) visiting a page with a module that is editable by that user.  It is not possible to display the &quot;Admin&quot; control panel option to users who have permission but do not meet the criteria above.<br /><br />Additionally, the ability to present a &quot;control panel-like&quot; interface on a site-wide basis is an interesting use-case.  For example, Facebook presents a toolbar to authenticated users that is visually similar to the DotNetNuke control panel.  The ability to display a control of this type to authorized users would enable this sort of functionality not presently possibly without tedious workarounds (e.g. including an additional module on each page).<br /><br />Accordingly, this project is designed to expose the ability to instantiate a control panel on a per-role basis, with the intention that functionality delegated to non-administrators may be exposed via an alternate control panel that contains only that functionality relevant to those users.<br />\n<h2>Goals</h2>\r<ul><li>Seamless integration of alternate control panels to non-administrators, with existing administrators (and hosts) remaining unaffected.</li>\n<li>Per-request, role-based identification of the most-suitable control panel for a given user</li>\n<li>The ability to specify associate various controls with roles via metadata</li>\n<li>A demonstration control that displays only the &quot;Admin&quot; menu to authorized users</li>\n<li>Require no core changes and utilize only existing DotNetNuke extension points</li></ul>\n\n<h2>Installation and Documentation</h2>\r\nSee the <a href=\"https://dnncontrolpanel.codeplex.com/documentation?referringTitle=Home\">documentation page</a> for details on installing the extension and associating an alternate control panel with a role.  <b>Note that, by default and for security reasons, no initial control panel associations are made when installing this extension.</b>  Nothing will change in an existing installation without additional metadata changes!<br />\n<h2>Feedback, Reviews, and Ratings Appreciated!</h2>\rFeedback about your experiences is needed, and <u>greatly</u> appreciated!</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-04-23T13:14:14.967-07:00"
}