{
  "ProjectName": "dropboxifier",
  "Title": "Dropboxifier",
  "Description": "Dropboxifier helps you share saved games and application data between computers by simplifying the process of adding folders to Dropbox and creating symbolic links.\r\n\r\nDropboxifier was made to work with Dropbox but will also work with any other online storage application that creates a virtual folder on your hard drive.\r\n\r\nRequires .NET 4.0 and Vista or higher.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Backup and share saved data with Dropboxifier</h2>\r\nDropboxifier helps you share saved games and application data between computers by simplifying the process of adding folders to Dropbox and creating symbolic links. If you&#39;ve ever used <b>Chrome/Firefox Sync</b>, or played a game that had <b>Steam Cloud</b> support, then you&#39;ve already experienced what Dropboxifier can do for you!<br /><br />The cool part? <b>Dropboxifier works with <i>any</i> application or game!</b><br /><br />Dropboxifier was originally made to work with Dropbox but will also work with any other online storage application that creates a virtual folder on your hard drive (SkyDrive, Google Drive, etc).<br /><br /><img src=\"/projects/dropboxifier/1c40e33f-645c-474b-8435-5aa183c39712\" alt=\"Dropboxifier.PNG\" title=\"Dropboxifier.PNG\" /><br /><br />So how does it work? Well, Dropboxifier simply fools applications into reading and writing directly from Dropbox! Saved games and profile data can be placed in Dropbox, a symbolic link put in its place (which is kind of like a shortcut at the file system level), and applications/games won&#39;t even notice - they will read and write directly to your Dropbox folder.<br /><br />Doing this on one PC is great since Dropbox itself is a fantastic online storage utility (you can restore files to previous versions or even undelete something). The best part is that Dropboxifier allows you to do this on more than one PC so that suddenly all your machines are reading and writing to the same data! This means that multiple PCs can be using the same browser data, saved games, you name it! It&#39;s all automatic. Gone are the days of dragging around USB drives and manually replacing files and trying to remember which computer has the latest version of your data.<br /><br />In Dropboxifier, each entry is referred to as a &quot;link&quot; - short for symbolic links. Dropboxifier handles linking multiple PCs easily: simply add a link on one PC, then go to your other PC and resolve the link. Just follow the onscreen instructions. Unresolved links appear as red in the list, while resolved links are green.<br /><br />Dropboxifier has no dependencies, so you can even put the single Dropoxifier executable into your Dropbox for some brain-busting Dropbox action!<br /><br />Head over to the <a href=\"http://dropboxifier.codeplex.com/documentation\">Documentation</a> section for my recommended way of using Dropboxifier.<br /><br />Requires <a href=\"http://www.microsoft.com/downloads/en/details.aspx?FamilyID=9cfb2d51-5ff4-4491-b0e5-b386f32c0992&amp;displaylang=en\">.NET 4.0</a> and Vista or higher.<br /><br />Visit <a href=\"http://linearskillz.wordpress.com/\">my blog</a> for more Dropboxifier information.<br />\n<h4>For those new to Dropbox</h4>\r\n<i>(You only need to read this if you&#39;re unfamiliar with Dropbox itself)</i><br /><br />Dropboxifier is best used with Dropbox. Don&#39;t know what Dropbox is? Well, it&#39;s only the coolest online storage solution out there! Dropbox looks just like a normal folder on your hard drive, but when you put stuff into it it gets uploaded online using some very clever cloud-based technology. What&#39;s better, is that any data you put on Dropbox will be automatically downloaded on any computers you have Dropbox installed on. With Dropbox you can share folders with friends, so they also get any new data you place in your Dropbox, and can interact with it! You also get a public folder where you can add files and get direct links to them to share with the world.<br /><br />Don&#39;t have Dropbox? What are you waiting for? <b><a href=\"http://db.tt/YQjh65g\">Get Dropbox!</a></b><br /><br />In case my explanation was unclear, the folks at <a href=\"https://www.dropbox.com/features\">Dropbox</a> itself probably do a better job explaining it. But if you want to make an account, use this &quot;<a href=\"http://db.tt/YQjh65g\">Get Dropbox</a>&quot; link - it&#39;s a referral link so you&#39;ll get an additional 250MB of free storage!<br /><br />Like Dropboxifier? Consider donating:<br /><br /><a href=\"https://www.paypal.com/cgi-bin/webscr?cmd=_donations&amp;business=SYRU2FBZ8LAP2&amp;lc=CA&amp;item_name=Dropboxifier%20Donation&amp;currency_code=CAD&amp;bn=PP%2dDonationsBF%3abtn_donateCC_LG%2egif%3aNonHosted\"><img style=\"border:none;\" src=\"https://www.paypalobjects.com/WEBSCR-640-20110401-1/en_US/i/btn/btn_donateCC_LG.gif\" alt=\"Donate\" title=\"Donate\" /></a></div><div class=\"ClearBoth\"></div>",
  "TagList": "dropbox,symbolic links,games,.NET 4.0,C#,WPF,dropbox addons,",
  "LastEdited": "2012-05-27T20:24:53.807-07:00"
}