{
  "ProjectName": "FiddlerTreeViewPanel",
  "Title": "Fiddler TreeView Panel Extension",
  "Description": "Extension for Fiddler, to display the session information in a TreeView panel instead of the default ListBox, so it groups the information logically...",
  "MovedLink": "https://github.com/gamosoft/FiddlerTreeviewPanel/",
  "HomeWiki": "<div class=\"wikidoc\"><h1><b>CodePlex is shutting down!</b></h1>\r\n<div style=\"clear:both;height:0;\">&nbsp;</div><a style=\"float:left;padding-right:.5em;\" href=\"http&#58;&#47;&#47;blog.gamosoft.com&#47;fiddler-treeview-panel-extension&#47;\"><img src=\"/projects/FiddlerTreeViewPanel/0475edb7-0c2f-4e1a-8d62-a4406762d81e\" alt=\"The&#32;project&#32;has&#32;moved&#33;\" title=\"The&#32;project&#32;has&#32;moved&#33;\" /></a><br />As you may already know, after all these amazing years CodePlex is going to stop working, so I&#39;ve decided to move the binaries over to <a href=\"http://blog.gamosoft.com/\">my blog</a> to be downloaded from now on. Please use <a href=\"http://blog.gamosoft.com/fiddler-treeview-panel-extension/\">this direct link to the project</a> to update your bookmarks.<br />I&#39;ll probably put the code elsewhere but for the moment my blog is where you can keep updated of what&#39;s going on with the project (or ask questions, etc...). The project will still remain in Codeplex until the site is closed but will no longer be updated.<br /><br />Thanks for these years CodePlex!!!<br /><br /><br /><br /><b>Project Description</b><br />Extension for Fiddler, to display the session information in a TreeView panel instead of the default ListBox, so it groups the information logically...<br /><br /><b>Introduction</b><br />If you need to capture http traffic there are several tools out there that can help you with this task, and a really good one is <a href=\"http://www.fiddler2.com\">Fiddler</a>.<br />It&#39;s really flexible and, best of all, it&#39;s free. :-)<br /><br />The only thing you might be a little bit annoyed with is that, when analyzing a site that performs lots of calls, you might end up with a screen like the following:<br /><br /><img src=\"/projects/FiddlerTreeViewPanel/0e0e3701-3657-4235-b611-c1b4aed40bf8\" alt=\"Original&#32;Fiddler&#32;view\" title=\"Original&#32;Fiddler&#32;view\" /><br /><br />which is a great amount of information but it&#39;s a bit complicated to locate exactly the session you&#39;re looking for (sure, you can sort the ListView and such, but that wasn&#39;t <i>fast enough</i> for me. :-D).<br /><br />So, to address this issue I have created an extension that displays all the sessions in a TreeView, so the hosts, folders and calls are organized in a tree structure, much faster to locate what you want and to collapse entire sections of data you don&#39;t need. The results for the same captured data can be seen in the next screenshot:<br /><br /><img src=\"/projects/FiddlerTreeViewPanel/d61e045f-5e8a-4060-89b8-4ed4a9fc5843\" alt=\"TreeView&#32;extension&#32;view\" title=\"TreeView&#32;extension&#32;view\" /><br /><br />To switch between the two views, a new menu entry has been created in the top level menu called <i>TreeViewPanel</i> where you can activate or deactivate it (shortcut <b>CTRL</b> + <b>F1</b>):<br /><br /><img src=\"/projects/FiddlerTreeViewPanel/302e1c5f-c41e-4af9-b95b-cd8a2669a4e6\" alt=\"New&#32;menu&#32;option\" title=\"New&#32;menu&#32;option\" /><br /><br />Integration with Fiddler is not 100%, since I first created this extension to be able to locate sessions in a more efficient manner. You can right-click on a session and the original Fiddler context will show up, although some options will not be usable or have any meaning. I&#39;m sure other stuff might not work as well, but again my goal was just to make it <i>usable enough</i> for my own needs. ;-)<br /><br />For instance coloring a session will in fact color it in the ListView, but nothing will happen in the tree.<br />We can however reissue sessions, save them, etc...<br /><br /><img src=\"/projects/FiddlerTreeViewPanel/89ef1bef-f9dd-47b5-a3e0-979df034d8f3\" alt=\"Context&#32;menu&#32;integration\" title=\"Context&#32;menu&#32;integration\" /><br /><br /><b>Installation</b><br />In order to install this extension you&#39;ll need to copy the compiled assembly .DLL into your <i>\\My Documents\\Fiddler2\\Scripts</i> folder (or <i>\\Program Files\\Fiddler2\\Scripts</i> to make it available to all users on the machine). After that, you&#39;ll need to restart Fiddler if was already running.<br /><br /><b>Known issues</b><br />Right now, there are issues in the way sessions are deleted, because the only way to effectively delete a session is by choosing the <b>ALL</b> option from the tools menu as shown in the selected screenshot:<br /><br /><img src=\"/projects/FiddlerTreeViewPanel/6d30834b-215c-43d1-9c67-1fab48483781\" alt=\"Delete&#32;all&#32;sessions\" title=\"Delete&#32;all&#32;sessions\" /><br /><br />All the other ways to delete sessions (even from the context menu) will wipe them out from the ListView but <u>not</u> from the TreeView, so you might get out of sync (not a huge deal since you can re-sync by using the above option as well). The biggest roadblock is that the ListView won&#39;t fire an event when items are removed from it, so I&#39;d need to implement an additional mechanism to fix it (btw, that&#39;s the reason there are some work-in-progress sections in the source code).<br /><br />But other than that the extension is fully usable and I thought some of you might find it useful too.<br />Of course, you&#39;re free to download the code and if you want to extend it further or have some ideas let me know. :-)<br /><br />Thanks to Eric Lawrence for some suggestions, I&#39;ve added double-click to expand/collapse all child nodes at once (where clicked) and to keep the selected session when losing focus off the TreeView.<br /><br />Kind regards.<br /><br /><br /><b>Other projects</b><br />Here are other projects you might be interested in as well:<br />\n<ul><li><a href=\"http://outlook2013addin.codeplex.com\">http://outlook2013addin.codeplex.com</a></li>\n<li><a href=\"http://entlibextensions.codeplex.com\">http://entlibextensions.codeplex.com</a></li>\n<li><a href=\"http://slbindabledatagrid.codeplex.com\">http://slbindabledatagrid.codeplex.com</a></li>\n<li><a href=\"http://endomondoexport.codeplex.com\">http://endomondoexport.codeplex.com</a></li>\n<li><a href=\"http://sharepointdocgen.codeplex.com\">http://sharepointdocgen.codeplex.com</a></li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "fiddler,extension,treeview,Session,HTTP,Proxy,capture,traffic,network,addin,tree,",
  "LastEdited": "2017-04-20T12:30:34.033-07:00"
}