{
  "ProjectName": "forumsbrowser",
  "Title": "MSDN Forums Browser",
  "Description": "ForumsBrowser makes it easier for MSDN Forums participants to keep up-to-date on their favorite forums, and easily access the forums as well.  This means you can close all the tabs on your browser and lose the bookmarks.  It's developed in C# as a WPF application. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />ForumsBrowser makes it easier for MSDN Forums participants to keep up-to-date on their favorite forums, and easily access the forums as well.  This means you can close all the tabs on your browser and lose the bookmarks.  It&#39;s developed in C&#35; as a WPF application. <br /><br />Updates! (as of June 25, 2009)<br /><br />In addition to some performance improvements and general bug-fixing, probably the most significant change to the Forums Browser application is the addition of the MiniView.   The MiniView allows you quick access and quick analysis of threads, including a tooltip that shows a portion of the latest post.  This can allow you to determine if you&#39;re interested in the thread or not simply by hovering your mouse over the thread&#39;s item in the list.  This new tooltip has also been added to the main view as well. <br /><br />Here&#39;s the view of the MiniView when hovered over:<br /><br /><img src=\"/projects/forumsbrowser/5ba3a51c-be41-4ad9-a63b-560b0f6d35a1\" alt=\"MiniView1.JPG\" title=\"MiniView1.JPG\" /><br /><br />And here&#39;s the image when it&#39;s simply residing on the desktop:<br /><br /><img src=\"/projects/forumsbrowser/ef44940f-8080-4212-a164-df3803bc5ba0\" alt=\"MiniView2.JPG\" title=\"MiniView2.JPG\" /><br /><br />Also, some formatting changes have been put in place to allow for a better reading experience.  Some of the fonts have been changed for appearance and readability:<br /><br /><img src=\"/projects/forumsbrowser/3c7afaf8-e296-44fb-b2c7-cc87572897b3\" alt=\"View3.JPG\" title=\"View3.JPG\" /><br /><br />Lastly, one thing that has been overlooked in the past by a few people is the ability to easily browse to the thread, simply by double clicking on the thread view.  When viewing a particular thread, simply double click on the surface of the thread, and you&#39;ll notice the viewer immediately changes to a web browser, which can allow you to respond to the thread easily and simply from within the application:<br /><br /><img src=\"/projects/forumsbrowser/c8c4dcf0-a89d-4c27-ae31-82afc086f115\" alt=\"View4.JPG\" title=\"View4.JPG\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "MSDN,wpf,",
  "LastEdited": "2009-06-25T08:46:30.95-07:00"
}