{
  "ProjectName": "Kit3D",
  "Title": "Kit3D - a 3D C# graphics engine for Microsoft Silverlight",
  "Description": "Kit3D is a 3D graphics engine written to work with Microsoft Silverlight.  The library is currently written in C# (and also there is a JavaScript version for 1.0) and supports 3D perspective projection and affine texture mapping.  This library allows anyone to easily create 3D content for their Silverlight application.  The library API matches the System.Windows.Media.Media3D namespace of WPF, so people familiar with 3D in WPF will feel right at home using Kit3D.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Kit3D is a 3D graphics engine for Microsoft Silverlight.  There is a JavaScript version that runs on the 1.0 bits of Silvelright, however moving forward the engine will only be actively developed in C#.  The library has been refactored to match the System.Windows.Media.Media3D namespace from WPF so that it closely matches development for WPF3D syntax (saves me creating documentation :-) )<br /><br />For some examples of the library in action, see <a href=\"http://www.markdawson.org/Kit3D\">http://www.markdawson.org/Kit3D</a>.<br /><br />PROJECT STATUS:<br />- This project is still very early on in its lifecycle,  the following areas are where energy will be focussed in the future:<br />  - Bug fixes &amp; Unit Testing - currently no unit tests for the SL code,  I need to look into how to use the Silverlight unit testing framework, since unit testing frameworks like xUnit, nUnit cannot be used.<br />  - View frustum culling - stops models that go outside the visible area of the viewport from causing rendering artifacts.  Right now if you move models around outside of the visible screen space you may see visual artifacts flash on the screen as objects go behind the camera.  This feature will also help improve performance for a large number of models.<br />  - Implement more WPF3D features<br /><br />DEVELOPMENT REQUIREMENTS:<br />- You will need a full version of Visual Studio to be able to compile the source code, since the Express versions of Visual Studio do not yet support the silverlight Tools install.<br />- Need to install the Silverlight 2 dev tools from www.silverlight.net<br /><br /><br />FUTURE DIRECTION:<br />Right now this project is focussed on getting the core 3D engine up to scratch, however the longer term aim is to build ontop of the library with higher level constructs so that when Silverlight does realease native 3D at some point in the future this library will still have value ontop of that.<br /><br /><br />PEOPLE USING KIT3D:<br />This is really cool - check out the video running on the cubes, also if you click on some of the cubes the layers rotate, awesome: <a href=\"http://sildev.net/3DCubes/index.html\">http://sildev.net/3DCubes/index.html</a> (The owner of the site modified Kit3D to have videobrush support, I hope to add this soon)<br /><br /><a href=\"http://sildev.net/3DDemo/\">http://sildev.net/3DDemo/</a><br /><img src=\"/projects/Kit3D/60bc7c63-0cd4-434d-8cd6-36eee2fb19a9\" alt=\"monkey.jpg\" title=\"monkey.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,3D,engine,graphics,Silverlight,Silverlight Game,Silverlight 3d,Kit3D,3D engine,",
  "LastEdited": "2008-11-17T23:14:22.23-08:00"
}