{
  "ProjectName": "LogicCircuit",
  "Title": "LogicCircuit",
  "Description": "LogicCircuit – is educational software for designing and simulating digital logic circuits.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Description</h2>\rLogicCircuit – is educational software for designing and simulating digital logic circuits.<br />Intuitive graphical user interface, allows you to create unrestricted circuit hierarchy with multi bit buses, debug circuits behavior with oscilloscope, and navigate running circuits hierarchy.\n<h2>Official Web site</h2>\rThe official web site was created. Please visit it at: <a href=\"http://www.LogicCircuit.org\">http://www.LogicCircuit.org</a><br />Source code: <a href=\"https://bitbucket.org/EugeneLepekhin/logiccircuit\">https://bitbucket.org/EugeneLepekhin/logiccircuit</a><br /><br /><img src=\"/projects/LogicCircuit/aa7ba011-adfe-44e8-8a16-effbc0911dc6\" alt=\"ScreenShot.PNG\" title=\"ScreenShot.PNG\" /><br />\n<h2>Short user guide</h2>\rThere are two modes the program can be in: edit mode and running mode. To switch use power button on the status bar, checkbox on the sliding tool panel on the bottom or use short cut: Ctrl+W.<br />In edit mode on the left side you can see all available circuits. Just drag and drop them where you want on the diagram – right part of the window. In order to wire circuits just click connector – bold dot on the side of the circuits and then click where you want your wire be extended to. Wires are connected only if their ends are in the same location. If you just cross two wires they are not connected.<br />By double clicking items on the diagram you can start editing them. So double click on pin, constant, memory, or button will open dialog where you can change properties of the item. Double click symbol of logical circuit you’ve created will switch you to this circuit. To change properties of the entire project select menu Circuit/Project, to change properties of the currently edited logical circuit either double click anywhere in empty space on the diagram or select menu Circuit/Logical Circuit.<br />In order to select an item on diagram, just click it. To add an item to selection or remove it from - hold Ctrl and click. Press and move mouse you can select everything in marked area. Hold Shift and click wire to select entire conductor. Ctrl+A will select everything on the diagram. Edit menu contains some other useful commands to select and unselect symbols on the circuit diagram.<br />When you create a new circuit it becomes available for you to use on other circuits.<br />Use input and output pins as interface with external circuits.<br />Use probes to observe state of the circuits when it is in running mode.<br />When in running mode you can interact with you circuits through buttons and double clicking constants – which increment value of constant within it bit width.<br />If you have some probes connected on your circuits you can open oscilloscope and watch history of the states of your probes.<br />To switch between your circuits you can double click them on the left panel or pressing Ctrl + Tab or Ctrl + Shift + Tab to navigate through circuits in reverse historical order. Press Tab more than once while holding Ctrl to navigate further in the history.<br />Happy designing!<br /><br /><a href=\"https://logiccircuit.codeplex.com/wikipage?title=Oscillation&referringTitle=Home\">See also Oscillation</a><br /><a href=\"https://logiccircuit.codeplex.com/wikipage?title=Memory&referringTitle=Home\">See also Memory components &#40;RAM and ROM&#41;</a><br /><a href=\"https://logiccircuit.codeplex.com/wikipage?title=Splitter&referringTitle=Home\">See also Splitter</a><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "LogicCircuit,WPF,.NET,.NET 3.5,C#,C# 3.0,Tools,utility,xml,Editor,Simulation,2d,cool,graphics,GUI,Interesting,Open Source,Simulator,Modeling,Model View Presenter,Digital,logic,Education,xaml,tool,utilities,watch,Windows,circuit,",
  "LastEdited": "2017-09-26T14:52:15.417-07:00"
}