{
  "ProjectName": "mindtouch",
  "Title": "MindTouch DekiWiki and Dream",
  "Description": "    *  MindTouch DekiWiki:\r\n      A free and open source wiki engine and web framework ideal for creating enterprise and social applications. It is freely downloadable at http://www.opengarden.org and licensed under GPL.\r\n    * MindTouch Dream:\r\n      A portable framework for RESTful web-services written in .Net/Mono. Dream is freely downloadable at http://www.opengarden.org and licensed under LGPL.\r\n\r\nMindTouch DekiWiki is a powerful, easy to use, feature rich wiki and cross-platform web framework with a unique architecture that makes extending it very approachable. It is built using a Service Oriented Distributed Architecture (SODA), which is a programming pattern promoted by MindTouch Dream. Furthermore DekiWiki's architecture is unique because the presentation layer is written in PHP and loosely coupled with the business logic of the application, which is implemented entirely in C# and is .Net 2.0 and Mono compliant. The PHP presentation layer is very appealing to a very large population of web programmers who are accustomed to implementing web applications in this popular language. In fact, many web designers are fond of PHP because it allows them to create simple applications and prototypes. With DekiWiki the same developers can create far more powerful applications without having to get there hands dirty in the complex logic of the application. Finally, this innovative architecture makes extending the application is relatively simple because new logic can be provided via web services that federate with the application simply by describing the service in DekiWiki's services manager panel. \r\n\r\nMindTouch DekiWiki is an OSI approved open source wiki. DekiWiki is a wiki engine and extensible enterprise and social application framework. Wiki community: http://www.OpenGarden.org. Commercial wiki products: http://www.MindTouch.com. Wikiwiki more..",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />    &#42;  MindTouch DekiWiki&#58;<br />      A free and open source wiki engine and web framework ideal for creating enterprise and social applications. It is freely downloadable at http&#58;&#47;&#47;www.opengarden.org and licensed under GPL.<br />    &#42; MindTouch Dream&#58;<br />      A portable framework for RESTful web-services written in .Net&#47;Mono. Dream is freely downloadable at http&#58;&#47;&#47;www.opengarden.org and licensed under LGPL.<br /><br />MindTouch DekiWiki is a powerful, easy to use, feature rich wiki and cross-platform web framework with a unique architecture that makes extending it very approachable. It is built using a Service Oriented Distributed Architecture &#40;SODA&#41;, which is a programming pattern promoted by MindTouch Dream. Furthermore DekiWiki&#39;s architecture is unique because the presentation layer is written in PHP and loosely coupled with the business logic of the application, which is implemented entirely in C&#35; and is .Net 2.0 and Mono compliant. The PHP presentation layer is very appealing to a very large population of web programmers who are accustomed to implementing web applications in this popular language. In fact, many web designers are fond of PHP because it allows them to create simple applications and prototypes. With DekiWiki the same developers can create far more powerful applications without having to get there hands dirty in the complex logic of the application. Finally, this innovative architecture makes extending the application is relatively simple because new logic can be provided via web services that federate with the application simply by describing the service in DekiWiki&#39;s services manager panel. <br /><br />MindTouch DekiWiki is an OSI approved open source wiki. DekiWiki is a wiki engine and extensible enterprise and social application framework. Wiki community&#58; http&#58;&#47;&#47;www.OpenGarden.org. Commercial wiki products&#58; http&#58;&#47;&#47;www.MindTouch.com. Wikiwiki more..<br /><br /><b>Resources</b>\n<ul><li><a href=\"http://www.MindTouch.com\">http://www.MindTouch.com</a></li>\n<li><a href=\"http://www.OpenGarden.org\">http://www.OpenGarden.org</a></li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,xml,php,mono,wiki,JSON,soa,",
  "LastEdited": "2007-06-27T10:16:23.69-07:00"
}