{
  "ProjectName": "moonydesk",
  "Title": "MoonyDesk (windows desktop widgets)",
  "Description": "Windows desktop plugin based widgets system written on WPF. \nThis application shows how to implement plugin based application and onscreen desktop widgets in WPF.\nRequirements: .Net framework 3.5",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Windows desktop plugin based widgets system written on WPF. <br />This application shows how to implement plugin based application and onscreen desktop widgets in WPF.<br />Requirements&#58; .Net framework 3.5<br />\n<h2>MoonyDesk</h2>\rThere are only two widgets in alpha release: clock and weather widgets.<br /><br /><a href=\"http://i44.tinypic.com/n2elc6.jpg\"><img style=\"border:none;\" src=\"http://i44.tinypic.com/21al4hz.png\" alt=\"Preview\" title=\"Preview\" /></a><br /><i>*click image to see full screenshot</i><br /><br />Icons for weather widget from: <a href=\"http://merlinthered.deviantart.com/art/plain-weather-icons-157162192\">http://merlinthered.deviantart.com/art/plain-weather-icons-157162192</a><br />\n<h2>Plugins for MoonyDesk</h2>\rEach plugin must implement IPlugin interface from MoonyPlugin.dll.<br />Each plugin has it&#39;s name and UIElement that will appear on desktop. <br />Also plugin can contain settings tabs that will be loaded in settings window in main application (for example: clock hours format settings 12/24). Each plugin has default settings such as size, location, topmost, rotation angle. So there&#39;s no need to implement this settings.<br /><br /><b>IPlugin properties:</b><br />name - name of the plugin<br />DesktopElement - UIElemet that will be shown on desktop. This UIElement will be loaded as a content of DesktopWindow<br /><br /><b>IPlugin methods:</b><br />Initialize() – initialization method of the plugin<br />Dispose() – dispose method of the plugin. Will be called on disabling of the plugin<br />GetNewSettingsTabs() – returns list of SettingTabs. This method will be called on opening of SettingsWindow<br /><br />Plugin class can contain fields that define default settings:<br />double DefaultTop - default Y position of the widget on the screen<br />double DefaultLeft - default X position of the widget on the screen<br />double DefaultSize - default size of the widget<br />bool DefaultTopmost - default value that indicates whether widget is topmost<br />bool DefaultMovable - default value that indicates whether widget is movable by mouse<br />double DefaultRotation - default rotation angle of the widget<br />\n<h2>MoonyDesk review:</h2>\r<a href=\"http://www.instantfundas.com/2010/05/moonydesk-is-gorgeous-new-desktop.html\">http://www.instantfundas.com/2010/05/moonydesk-is-gorgeous-new-desktop.html</a> by Kaushik</div><div class=\"ClearBoth\"></div>",
  "TagList": "wpf,widgets,desktop,Plugin Based,",
  "LastEdited": "2010-05-17T05:45:18.117-07:00"
}