{
  "ProjectName": "mubox",
  "Title": "Mubox",
  "Description": "Mubox is a multiplexer emulator written in C#/.NET utilizing WPF and WinAPI. It offers \"Keyboard Multicast\", \"Mouse Clone\" and multiple-clients locally and remotely. Mubox is an Open-Source (MS-RL) variation of pre-existing closed-source and/or proprietary multiplexer emulators such as 'Octopus', 'Multibox', and 'KeyClone'; though it makes no attempt to replicate the workflow nor features of these applications. It has been developed independently with a focus on obeying the common Terms of Service for most popular MMOs.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>PROJECT HAS MOVED</b><br />This project is retained on codeplex for reference and legal purposes, active development moved to <a href=\"http://www.github.com/wilson0x4d/Mubox/\">http://www.github.com/wilson0x4d/Mubox/</a> several years ago, please update your bookmarks.<br /><br /><b>Project Description</b><br />Mubox is a multiplexer emulator written in C&#35;&#47;.NET utilizing WPF and WinAPI. It offers &#34;Keyboard Multicast&#34;, &#34;Mouse Clone&#34; and multiple-clients locally and remotely. Mubox is an Open-Source &#40;MS-RL&#41; variation of pre-existing closed-source and&#47;or proprietary multiplexer emulators such as &#39;Octopus&#39;, &#39;Multibox&#39;, and &#39;KeyClone&#39;&#59; though it makes no attempt to replicate the workflow nor features of these applications. It has been developed independently with a focus on obeying the common Terms of Service for most popular MMOs.<br /><br /><b>Help and Assistance?</b><br />If you need end-user assistance please <a href=\"https://www.facebook.com/groups/121558081022/\">try the Mubox group on Facebook</a><br /><br />Documentation on CodePlex will be updated as time permits.<br /><br />If you are interested in becoming a contributor (docs, release management, feature development) please contact the project coordinator via CodePlex as other methods of contact will be ignored.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-03-26T14:39:59.72-07:00"
}