{
  "ProjectName": "osssearchrefinement",
  "Title": "Custom Refinement Panel on OSSSearchResults.aspx",
  "Description": "In SharePoint 2010 you can customize the refinement panel on the results page of a search center. Unfortunately the default search scope \"This Site\" uses the OSSSearchResults.aspx page. This is a layouts page so you cannot edit the refiners or add new refiners. So if you wanted cool and custom refiners added, you had to force users to use the search center. Once you force them to use the search center they lose the \"This Site\" scope if they attempt to search from the center. A big mess.\r\n\r\nThis solution allows you to have your custom refiners and the osssearchresults page.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />In SharePoint 2010 you can customize the refinement panel on the results page of a search center. Unfortunately the default search scope &#34;This Site&#34; uses the OSSSearchResults.aspx page. This is a layouts page so you cannot edit the refiners or add new refiners. So if you wanted cool and custom refiners added, you had to force users to use the search center. Once you force them to use the search center they lose the &#34;This Site&#34; scope if they attempt to search from the center. A big mess.<br /><br />This solution allows you to have your custom refiners and the osssearchresults page.<br /><br /><b>Out of the box OSSSearchResults.aspx Refinement Panel:</b><br />OOTB gives administrator&#39;s no way to reorder or add new refiners.<br /><img src=\"/projects/osssearchrefinement/11115537-9b91-4fe8-95f5-4f9fdf7aaa99\" alt=\"refiners_before.jpg\" title=\"refiners_before.jpg\" /><br /><br /><b>After OSSSearchRefinement Solution:</b><br />You have complete control of the order of refiners. You can also add refiners. In the example below I&#39;ve added 3 custom refiners to the panel.<br /><img src=\"/projects/osssearchrefinement/6d3bb451-3678-4af2-9884-51fc5e3efd5f\" alt=\"refiners_after.jpg\" title=\"refiners_after.jpg\" /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-09-29T13:49:31.55-07:00"
}