{
  "ProjectName": "raytracer",
  "Title": "Ray Tracer Starter",
  "Description": "Ray Tracer built in C# with a User Interface built in WPF. The project has been a lot for educational purposes, and gain experience in C# and WPF.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Just added Reflections and Shadows to WPF . . . with a ray tracer</h1>\r\n<br /><b>Project Description</b><br />Ray Tracer built in C&#35; with a User Interface built in WPF. The project has been a lot for educational purposes, and gain experience in C&#35; and WPF.<br /><br /><b>New Project</b><br />WPF&#39;s Viewport3D can now be translated into an Image that is RayTraced. If you want to check it out look at the Viewport3DRayTracer project. I&#39;m pretty happy about it because I&#39;m able to use the Transforms to manipulate a Viewport3D scene, and then ray trace it with my ray tracer. <br /><br />Here are some screen shots of the new project. There are 3 cubes in the scene (made from a MeshGeometry3D), all of them are transformed in some way, you can also move the scroll bars to change the position of the 2 blocks facing each other. The Image on the right is WPF&#39;s Viewport3D scene, the image on the left is the RayTraced Image. The first image has demonstrates reflection, where the other demonstrates shadows. <br /><br /><img src=\"/projects/raytracer/b5dcdd32-31bd-4bba-860e-8bdccdbb9c65\" alt=\"WPFReflection.png\" title=\"WPFReflection.png\" /><br /><img src=\"/projects/raytracer/d3b34d97-1165-45cf-a623-dde3b35322b5\" alt=\"WPFRayTraced1.png\" title=\"WPFRayTraced1.png\" /><br /><br /><b>Project Direction</b><br />I&#39;ve added the capabilities to manipulate the scene then re-render it by the click of a button. The UI isn&#39;t pretty or anything but at least it shows everything that is part of the scene. The basic design of the ray tracer source code is in place where it is easy to add new materials, new shapes, new lights, and test C# performance. There are a few things that increased my performance dramatically which were simple C# coding. When people look at the code, I wouldn&#39;t mind hearing about certain things that would speed things up.<br /><br />So far I haven&#39;t found a fast way to interactively update the buffer and watch the ray tracer fill in the pixels. I would really like this to be fast, but even updating the back buffer on the new WriteableBitmap directly is not fast per pixel. I thought maybe per row would be good enough, but it&#39;s not really worth the wait.   <br /><br />Now there are a few shapes that are ray traced correctly. I&#39;ve been messing with a lot of performance stuff in C#, and I&#39;ve actually gotten this thing faster then my C++ ray tracer <a href=\"http://www.eng.utah.edu/~kmadsen\">http://www.eng.utah.edu/~kmadsen</a>. I&#39;ve added a couple of threads to speed things up when you&#39;re on a multicore computer. The design of the multi-threading is not yet as elegant as I want it. I think I&#39;ll open a discussion, because I&#39;d like to know why it won&#39;t speed things up if I change my Float3 class into a C# struct.  <br /><br />At the bottom I show the ray tracer at work. I&#39;m still touching up materials so there is a more wide range of colors you can give objects. At least everything is drawing correctly, multiple lights is working, reflections are working, and the shape intersections are working as well. I&#39;m almost to the point to focus on converting a Viewport3D into a Ray Tracer scene.<br />\n<h2>Current Features</h2>\r<b>Primitives</b>\n<ol><li>Plane</li>\n<li>Sphere</li>\n<li>Triangle</li>\n<li>Box</li>\n<li>Disk</li>\n<li>Ring</li></ol>\n<b>Materials</b>\n<ol><li>Lambertian</li>\n<li>Blinn-Phong: Reflective</li></ol>\n<b>Lights</b>\n<ol><li>Point Light</li>\n<li>Directional Light</li></ol>\n<b>Cameras</b>\n<ol><li>Pinhole Camera</li>\n<li>Orthographic Camera</li></ol>\n<b>Performance Acceleration</b>\n<ol><li>Bounding Volume Hierarchy (needs more work, a little broken)</li>\n<li>Who needs to anti-alias with multi sampling when a WPF Image will do it for you? </li></ol>\n<b>Windows Presentation Foundation</b>\n<ol><li>WPF scene manipulation capabilities - You can basically edit the camera, and resolution.</li></ol>\n\n<h2>Features Coming Soon</h2>\r<ol><li>Refraction - Dielectric Materials</li>\n<li>Better Scene Manipulation!</li>\n<li>Convert a WPF Viewport3D into a ray traced seen</li>\n<li>Other acceleration structures</li>\n<li>Read/Write Scene files</li>\n<li>Sampling</li>\n<li>A bunch of other junk...</li></ol>\n<br /><img src=\"/projects/raytracer/345dae57-15e0-4b5e-919a-cf3f426f145b\" alt=\"allShapes.png\" title=\"allShapes.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-06-09T01:31:34.023-07:00"
}