{
  "ProjectName": "rent4nature",
  "Title": "Rent4Nature",
  "Description": "Rent4Nature is an multi-tier WPF application with LINQ to SQL database access written in C# to run an practical rental and event agency.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>About</b><br /><br />Rent4Nature is an open source application that offers rich features to build a practical and fully functional rental and event agency. You can manage items through categories and stores, customers and their orders about items or their enrollments about events. You can choose different payments and customer run states. If you set up an order, you can pick items for a selected time span. If items are not available, you will be informed. You can set up the application as a rental and event service for outdoor items and activities, also for do-it-yourself workshops or for rural communities in developing countries. <br /><br /><img src=\"/projects/rent4nature/82c9ea26-e462-4374-93dd-a0a87ca0dda6\" alt=\"Screenshot.jpg\" title=\"Screenshot.jpg\" /><br /><br /><b>General Features</b><br /><br />- Desktop application for Windows 7 up to 10<br />- SQL Server database access or database file<br />- Built on a multi-tier model<br />- Multilingual order forms<br />- Language, currency and VAT selection<br />- Reminder for defaulting customers<br />- Available under GPL v2 license<br />- Visual Studio 2013 Desktop solution<br />- SQL script to set up the database<br /><br /><b>Special Features</b><br /><br />- C# .NET Framework 4.5<br />- WPF technology for UI<br />- LINQ to SQL database access<br />- Usage of user controls<br /><br /><img src=\"/projects/rent4nature/142a8e80-d50a-4b85-8b2d-938a28445257\" alt=\"Flags.jpg\" title=\"Flags.jpg\" /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "LINQ,SQL,WPF,desktop,Print,Commerce,shop,Nature,Rent,Sports,Multilingual,2D-Graphics,Event,Order,Enrollment,Rural,DIY,Do-It-Yourself,Workshop,",
  "LastEdited": "2016-02-10T08:32:32.707-08:00"
}