{
  "ProjectName": "sevenzipwrapper",
  "Title": "Seven Zip Wrapper",
  "Description": "A small application which allows to call 7zip to create an archive, but skip compression for specific file extensions, which are usually already compressed.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>A .NET wrapper for the 7zip compression application</b><br /><br />A small application which allows to call 7zip to create an archive, but skip compression for specific file extensions, which are usually already compressed.<br /><br />I originally wrote this small application a few months ago, to be able to call 7zip in order to create an archive, but skip compression for specific file extensions, which are usually already compressed. To my knowledge, at that time, the 7zip GUI did not support this functionality. It is possible to achieve the same result by issuing a command line, specifying the extensions to skip, however, this is not very user friendly. Here are some screenshots:<br /><br />The main application window:<br /><br /><img src=\"http://s7.postimage.org/5j9j6yhfv/7zip_Wrapper_Main_Window.png\" alt=\"The main application window\" title=\"The main application window\" /><br /><br />The extensions selection window:<br /><br /><img src=\"http://s9.postimage.org/x7hnsiydr/7zip_Wrapper_Extensions.png&#39;\" alt=\"The extensions window\" title=\"The extensions window\" /><br /><br />In order to use the program, you <b>must</b> have 7zip already installed. This is not a replacement for 7zip, it is a wrapper around an existing 7zip executable. If you don&#39;t have 7zip already, you can get it at <a href=\"http://www.7-zip.org/\">http://www.7-zip.org/</a><br /><br />The way the program works is rather simple: <br /><br />- you specify the location of your 7zip executable (you only have to do this once, unless the location changes in the future).<br />- you specify the folder you want to compress (includes sub folders by default) and the compression level required (by default 5 i.e. medium). <br />- you specify the location and filename of the archive to be created.<br />- you specify the extensions you want to exclude from high compression (by clicking the &quot;Select&quot; button which opens a new window), and the level of compression you want to use for them (by default 0 = store - no compression). The extensions are populated on the fly by a text file which exists in the application directory. You can modify this file in your text editor if you don&#39;t like the default extensions that exist there.<br />- you click compress.<br /><br />What the program does, it generates a .bat file with the command to run, placed in the application directory, and runs this in a console window. It is simple as that. <br /><br />The compression takes place in 2 stages. In the first stage, the files that are to be compressed with high compression are processed, and in the second stage, the rest of the files that are to be packed as low or no compression are added to the archive.<br /><br />I have marked this release as &quot;Alpha&quot; as there are a few more features I want to add, time permitting, and it has not been extensively tested yet by anyone else other than me. However, it does work on my machine (except the &quot;other options&quot; part, which is for future work). <br /><br />Update: I have now updated the release status to Beta, as more than 6 months after release and with several downloads there have been no complaints about bugs. I am aware that normally there should be a new release for going to Beta, but unfortunately I haven&#39;t had the time to add more features, and I have been doing more ASP.NET/MVC/web services development lately.<br /><br />The software requires .NET 4.0 to be installed, and I am providing a ClickOnce installer file (which hopefully works for everybody, at least it did on my machine...) for people who are not interested in the code or don&#39;t have the time to compile it. It is written in C# using Visual Studio 2010 and uses WPF.<br /><br />Please note that you need to have permission to access the files you are trying to compress, otherwise you will get an error.<br /><br />This is the first project I am publishing on Codeplex, so hopefully everything will work fine, but if not, please let me know so that I can fix it. In any case, your feedback is much appreciated.<br /><br />Kind Regards.<br /><br />PS: The project is released under the Mozilla Public License 2.0, which basically means in a nutshell that you are free to take it and do whatever you want with it with no obligation. The only restriction is that if you do decide to re-release the source code as is or modified to the public domain, under your own name, you are obliged to acknowledge the source of the code (this page) and to contribute back here any code modifications you make. I think it&#39;s fair enough...<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "7zip,zip,archive,compression,WPF,C#,.NET,wrapper,",
  "LastEdited": "2013-07-28T15:35:07.163-07:00"
}