{
  "ProjectName": "shellfactory",
  "Title": "WPF ShellFactory",
  "Description": "WPF ShellFactory is an easy-to-use application framework for WPF, using a system derived from M-V-VM for its views. It supports multiple modules, either statically or dynamically loaded (i.e. plugins). Based on project- and item templates for speedy development.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><span style=\"color:#800000\"><strong>Due to low interest this project is practically dead.</strong></span></p>\r\n<p><strong>Project Description</strong> <br>\r\nWPF ShellFactory is an easy-to-use application framework for WPF, using a system derived from M-V-VM for its views. It supports multiple modules, either statically or dynamically loaded (i.e. plugins). It also contains mechanisms for application-wide services.</p>\r\n<p><strong>So why another application framework?</strong> <br>\r\nWell, for the last few years I have been a part of a team building a large-ish commercial WPF application. What I wanted to do here was to use the lessons learned while building that application. I wanted to improve on what we did there and create a simple\r\n framework with the hope that others can benefit from my experience.</p>\r\n<p><strong>&quot;Hey dude, this isn't proper M-V-VM!&quot;</strong> <br>\r\nHonestly, I think that depends on how you choose to interpret the definition of M-V-VM. This is how we interpreted it in the project this framework derives from, and we are very happy with how it works - especially here were the problems from that project has\r\n been rectified. If you, for instance, want a fully separate presentation assembly, well... our experience is that this is not necessary, so we haven't included any templates which does this, but it should be quite possible to do. If you need it, tell me. If\r\n enough people has a wish, I will try to implement it.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF frameworks,WPF,Framework 4.0,Framework,application,Applications,MVVM,architecture,.NET 4.0,",
  "LastEdited": "2011-08-29T01:26:08.653-07:00"
}