{
  "ProjectName": "SilverlightToolkit",
  "Title": "Silverlight Control Toolkit",
  "Description": "Welcome to Silverlight Control Toolkit !!!\n\nThe aim of the Toolkit is to provide components/controls that could be used in any Silverlight application. The Toolkit itself is built on top of Silverlight 2.0 Beta 1 and in most cases extends the existing controls provided by Microsoft.. The Toolkit is primarily useful for any Business line of applications and focusses more on providing functionality which otherwise would take several development hours to build. In the first phase we plan to provide the following controls:\n\n1) Modal Dialog Box (You can display any Silverlight UIElement modally by using the static methods of this control)\n2) Message Box (You can display modal Message Boxes (similar to WinForms) by using the static methods of this control)\n3) ValidatorControl (Provides basic validations for most of the Controls by defining few properties instead of writing code\n4) MDI Child Window (Custom Panel similar to WinForm which could optionally have a title bar, close button, minimize/maximize button and let the user move the form)\n5) MDI Parent Window (A container which will contain other UIElements/MDI Child windows within)\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Welcome to Silverlight Control Toolkit !!!<br /><br />The aim of the Toolkit is to provide components/controls that could be used in any Silverlight application.  The Toolkit itself is built on top of Silverlight 2.0 Beta 1 and in most cases extends the existing controls provided by Microsoft..  The Toolkit is primarily useful for any Business line of applications and focusses more on providing functionality which otherwise would take several development hours to build.  In the first phase we plan to provide the following controls:<br /><br />1) Modal Dialog Box  (You can display any Silverlight UIElement modally by using the static methods of this control)<br />2) Message Box (You can display modal Message Boxes (similar to WinForms) by using the static methods of this control)<br />3) ValidatorControl (Provides basic validations for most of the Controls by defining few properties instead of writing code<br />4) MDI Child Window (Custom Panel similar to WinForm which could optionally have a title bar, close button, minimize/maximize button and let the user move the form)<br />5) MDI Parent Window (A container which will contain other UIElements/MDI Child windows within)<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Silverlight NPE,Silverlight Control ,",
  "LastEdited": "2008-04-11T01:33:27.64-07:00"
}