{
  "ProjectName": "skydrivesimpleviewer",
  "Title": "SkyDrive Simple Viewer for WebDAV",
  "Description": "This is a very simple SkyDrive viewer that determines the WebDAV addresses to your SkyDrive folders. There is both a console application and a WPF application for displaying the information.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\rThis is a very simple SkyDrive viewer that determines the WebDAV addresses to your SkyDrive folders. There is both a console application and a WPF application for displaying the information.\n<h2>Background</h2>\rThis source code was written as a follow up to a blog post where I described how I used the latest Microsoft Office 2010 beta to discover the apis that Office uses in order to share documents to SkyDrive.<br /><br /><a href=\"http://www.mikeplate.com/how-to-connect-to-skydrive-with-webdav/\">http://www.mikeplate.com/how-to-connect-to-skydrive-with-webdav/</a><br /><br />Please don&#39;t take the code as any kind of example of good code writing. I wrote it very fast just to help people discover the WebDAV addresses to their SkyDrive folders. I suspect we will see more/better public support of this from Microsoft in the future.<br /><br />Note: I have not used any libraries for Windows Live ID authentication or WebDAV client access since I wanted to code as little as possible to make it work. That also means that the code assumes that everything in these protocols work as they have for me during testing.\n<h2>Usage</h2>\rThe solution has three projects. A library with the SkyDrive/WebDAV code in it, a console application and a WPF application. The console client requires Microsoft.NET 2.0 and can be downloaded as the recommended release. <a href=\"http://skydrivesimpleviewer.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=39725\">Download console client without source</a><br /><br />Run the console client from a command line like this with your Windows Live ID credentials:<br /><br />dumpurls.exe &lt;UserName&gt; &lt;Password&gt;<br /><br />And you will hopefully see a list of addresses that you can use in mapping up your WebDAV access in Windows. Those addresses can for instance be used in a &quot;net use&quot; command to map drives for them. Note that there is no concept of a &quot;root&quot; in SkyDrive. You must map/access the folders at the &quot;root&quot; individually.<br /><br />The WPF client requires the latest version of Microsoft.NET which is 3.5 SP1. It does one more thing than the console application, and that is to display the contents of the SkyDrive folder you click on. But this is just a proof-of-concept, that WebDAV access actually work. The WPF application uses WebDAV to find out the contents of the folder (not screenscraping). <a href=\"http://skydrivesimpleviewer.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=39728\">Download WPF client without source</a><br /><br /><img src=\"/projects/skydrivesimpleviewer/23001194-27bc-47cb-8c80-8fe3b3d88051\" alt=\"SkyDriveSimpleViewer.png\" title=\"SkyDriveSimpleViewer.png\" /><br /><br />Note: Passport1.4 authentication is used by the services, so WebDAV access will only work in Windows (even though the WebDAV part is standard).<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "SkyDrive,WebDAV,Mesh,",
  "LastEdited": "2010-02-01T14:06:30.85-08:00"
}