{
  "ProjectName": "soundwall",
  "Title": "Vertigo SoundWall",
  "Description": "Kinect Sound Wall",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>SoundWall</h1>\r\n<h2>Overview</h2>\r\n<p>SoundWall is a digital drum machine. This application tracks a user&rsquo;s hand motion using the Kinect skeletal tracking feature to enable sound to play from selected squares on the screen. SoundWall is made up of two distinct drum sounds where the user\r\n can enable different notes to make a unique beat.&nbsp;&nbsp; SoundWall is made up of two tracks that contain individual squares that represent notes. A continuous beat will play those activated sounds every time the light flashes over a note in the tracks.</p>\r\n<p><a href=\"http://youtu.be/2JHhZq9gFsA\"><img src=\"http://www.codeplex.com/download?ProjectName=soundwall&DownloadId=261405\" alt=\"Preview\" width=\"600\" height=\"338\" style=\"float:right; border:1px solid black; margin-left:10px\"></a></p>\r\n<p>-<span style=\"font:normal normal normal 7pt/normal 'Times New Roman'\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\r\n</span>SoundWall will load a grid of 32 blue squares with a continuous beat moving through the grid.</p>\r\n<p>-<span style=\"font:normal normal normal 7pt/normal 'Times New Roman'\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\r\n</span>By default, the cursor is the user&rsquo;s right hand. Use the yellow cursor ball to navigate through the grid. To change to the left hand bring your right hand above your head and say\r\n<em>&ldquo;SoundWall Left&rdquo;</em></p>\r\n<p>-<span style=\"font:normal normal normal 7pt/normal 'Times New Roman'\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\r\n</span>To enable or disable a note, hover over a chosen square for about a second. The square&rsquo;s sound should be activated once the light beat passes over it. Squares are disabled when they change back to blue.</p>\r\n<p>-<span style=\"font:normal normal normal 7pt/normal 'Times New Roman'\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\r\n</span>SoundWall can be customize based on certain voice commands. To enable a voice command, the user must have their cursor hand above their head while stating the command. ( This is to prevent false audio readings )</p>\r\n<h2>Voice commands to control SoundWall</h2>\r\n<p><em>SOUND WALL PAUSE</em></p>\r\n<p>Pause the Sound Wall by stopping the beat timer. In this state, no other commands but SOUND WALL PLAY can be activated.</p>\r\n<p><em>SOUND WALL PLAY</em></p>\r\n<p>Sound Wall will resume its beats from the note it was last played.</p>\r\n<p><em>SOUND WALL FASTER</em></p>\r\n<p>Increase the beat tempo. This can be repeated multiple times for faster-paced music.</p>\r\n<p><em>SOUND WALL SLOWER</em></p>\r\n<p>Slow the beat tempo. This can be repeated multiple times for slower-paced music.</p>\r\n<p><em>SOUND WALL RESET</em></p>\r\n<p>Resets the beat tempo to the default beats per minute.</p>\r\n<p><em>SOUND WALL LEFT</em></p>\r\n<p>Cursor will be controlled by your left hand.</p>\r\n<p><em>SOUND WALL RIGHT</em></p>\r\n<p>Cursor will be controlled by your right hand.</p>\r\n<p><em>SOUND WALL CLEAR</em></p>\r\n<p>The entire board will be reset to have no activated notes.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "kinect,WPF,Music,Drum Machine,",
  "LastEdited": "2011-07-22T14:06:00.713-07:00"
}