{
  "ProjectName": "vewpf",
  "Title": "Virtual Earth WPF Control",
  "Description": "Integrating Virtual Earth Interactive SDK with WPF.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b><u>Note</u></b>: Finally, Virtual Earth team released the Silverlight Map Control. Meaning most of the porting effort is useless at this moment.<br /><br /><b>Virtual Earth WPF Control</b> ports Virtual Earth&#39;s Interactive SDK to Windows Presentation Framework (WPF). If you are a developer who plays with location based data and want to take the advantage of .NET platform, this framework can take care of every tiny detail you normally have to deal with.<br /><br />This library is far from being perfect at the moment, but most of the functionality within controls and events are mapped already. Please contribute VE WPF Control by adding not-yet-implemented Virtual Earth pieces, finding bugs or writing automated unit tests. Any help is highly appreciated.<br /><br /><b>Virtual Earth WPF Control</b>  comes with a demo WPF project, you can get the main feeling. Sorry for the horrible user experience I&#39;m serving you but, at least you can have a first impression of usage of controls and basic event handling.<br /><br /><img src=\"/projects/vewpf/7b6a3135-1cfd-4bc1-b14e-6e509c97eb85\" alt=\"vewpf.png\" title=\"vewpf.png\" /><br /><br /><b>TO-DO List</b>\n<ul><li>Most of the mapping control and event handling is implemented. A few waits to be handled.</li>\n<li>Allow functionality to override existing keyboard/mouse events.</li>\n<li>Features related to custom shapes and interaction doesn&#39;t exist yet.</li>\n<li>Needed: better error handling</li>\n<li>Hidden properties of VEMap should be revisited. In theory, VEMap inherits both from User Control and Virtual Earth&#39;s VEMap. So, there occurs a few event handlers in conjunction. </li></ul>\n<br />Note: This library depends on <a href=\"http://blogs.msdn.com/publicsector/archive/2008/06/24/wpf-and-virtual-earth-revisited.aspx\">Marc&#39;s WPF effort</a> on Virtual Earth.</div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,Virtual Earth,Maps,Mapping,Virtual Earth 3D,WPF Controls,",
  "LastEdited": "2009-04-16T14:37:16.723-07:00"
}