{
  "ProjectName": "VHERP",
  "Title": "WPF MVVM with Entity Framework",
  "Description": "Its an WPF application with modern UI with Entity Framework 5.0",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">This Project is a WPF MVVM with EntityFramework 5. Demonstrations EF 5 features and its simplicity by attribute decoration than fluent API way of approach with MVVM design pattern. Also as part of WPF, Metro UI Theme been used and simplest ways to do Model Popup with MVVM pratten, Search functionality and its easy way to implement with EF.<br /><br /><b>Note: this project is under developement, Soon will be adding few features which are more of EF and WPF aspects.</b><br />\n<h2>Main Page with Login Screen</h2>\r<img src=\"/projects/VHERP/0f8df1c4-b78c-4d73-956f-e9ca3e53bd98\" alt=\"Metro&#32;Theme&#32;UI.JPG\" title=\"Metro&#32;Theme&#32;UI.JPG\" /><br />\n<h2>Search Option</h2>\r<img src=\"/projects/VHERP/580b5d7d-e5c7-4763-bf7b-bb60890b52ed\" alt=\"Metro&#32;Theme&#32;UI1.JPG\" title=\"Metro&#32;Theme&#32;UI1.JPG\" /><br />\n<h2>Model Popup - Simple one with MVVM approach</h2>\r<img src=\"/projects/VHERP/cd81991e-2b9f-4dd4-894a-4122d4905215\" alt=\"Metro&#32;Theme&#32;UI2.JPG\" title=\"Metro&#32;Theme&#32;UI2.JPG\" /><br /><br /><br /><b>About the Author</b><br /><br /><b>Amarnath Kashyap</b><br /><img src=\"/projects/VHERP/9f37d057-fb64-4950-95ec-f0164a19300a\" alt=\"Amar1_160x120_scaled_cropp.jpg\" title=\"Amar1_160x120_scaled_cropp.jpg\" />  <br /> I am a software professional always with anticipation to contribute significantly to the IT community. Has a great interest in working with latest technologies in order to get better results in business / applications. Currently having 8 years of extensive experience in developing enterprise applications with Microsoft technologies like C#, WPF, Entity Framework, SliverLight, WinRT, Windows Phone, WCF, ASP.Net, SQL Server under MVC, MVP and MVVM patterns and has interpersonal skills with exposure to all aspects of the software development life cycle.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,Learning MVVM LIGHT,",
  "LastEdited": "2013-05-21T08:55:07.533-07:00"
}