{
  "ProjectName": "WEIShare",
  "Title": "WEI Share",
  "Description": "WEI Share is an application for sharing your Windows Experience Index (WEI) scores from Windows 7 with others in the community. The data can be explored so finding the best scoring driver for your hardware is fast and easy. It was developed with Azure, WPF, and Silverlight.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />WEI Share is an application for sharing your Windows Experience Index &#40;WEI&#41; scores from Windows 7 with others in the community. The data can be explored so finding the best scoring driver for your hardware is fast and easy. It was developed with Azure, WPF, and Silverlight.<br /><br />The Windows Experience Index <a href=\"http://windows.microsoft.com/en-us/windows7/products/features/windows-experience-index\">(link)</a> measures the capability of your Windows 7 PC through a set of diagnostics tests. The higher the score, the better your hardware. In the test, 5 subscores are given for these hardware categories; Processor, Memory, Graphics, Gaming Graphics, Hard drive. Your overall WEI score is the lowest of these five: a computer is only as good as its weakest link. <br /><br /><b>WEI Share Features: </b>\n<ul><li>See the score a specific model PC or driver gets. </li>\n<li>Post your machine&#39;s score to your Facebook wall for bragging rights. </li>\n<li>Scores can change depending on driver efficiency. WEI Share can tell you the score that each driver gets in configurations closest to yours. </li>\n<li>Find out how many touch points (min/max) a particular multitouch PC can get (depending on driver). </li></ul>\n<br /><b>Run WEI Share, submit your score, search the scores here: </b><a href=\"http://www.weishare.net\">http://www.weishare.net</a>  <br /><br /><b>WEI Share is a <a href=\"http://coding4fun.com\">Coding 4 Fun</a> project.</b> Read about this project on Coding4Fun (Coming Soon)<br /><br />WEI Share can be accessed through our ODATA feed here: https://odata.sqlazurelabs.com/OData.svc/v0.1/lftq42zkkh/WEIShare<br /><br />WEI Share WPF application runs locally. <br /><img src=\"http://ptr9fg.bay.livefilestore.com/y1paC4zNkeOV5vuNOEAXZEzzjIqAnCjlt1tYYizz8zphhqlKXg9Gi6VNgsBtd4A8NIhPfHff0DhlTaBWxZG2mDEC_Wcnigu_a8a/WEIShareSS4.jpg\" /><br /><br />Data is sent to Azure where it is searchable through a Silverlight interface.  <br /><img src=\"http://ptr9fg.bay.livefilestore.com/y1puSrkH3m67a93Gk47TxQioCReTwRL_N43kO4ww5T3PFwA37R8guwN5LiozfTngVI08OS9bmUiW2HQyLUWy-ehvAHRttHDVDpR/WEIShareSS3.jpg\" /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Coding4Fun,C#,WPF,Windows 7,Windows Exp Index,Hardware,Channel9,DIY,Facebook,Community,2c,",
  "LastEdited": "2011-01-10T11:22:20.993-08:00"
}