{
  "ProjectName": "wpfstarterkit",
  "Title": "WPF Starter Kit",
  "Description": "WPF Starter Kit is:\r\nA simple, easy to use implementation of the MVVM pattern\r\n\r\nA navigation framework\r\n\r\nSupport for passing data between View Models\r\n\r\nSupport for generic exception handling\r\n\r\nSupport for long running operations on the UI thread",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>WPF Starter Kit</h1>\r<a href=\"http://blogs.msdn.com/knowledgecast/archive/2009/11/02/the-wpf-starter-kit.aspx\">http://blogs.msdn.com/knowledgecast/archive/2009/11/02/the-wpf-starter-kit.aspx</a><br /><br /><i> <b>Disclaimer:</b> It has come to my attention that there is some confusion in the community regarding the &quot;official status&quot; of the WPF Starter Kit. I must admit that I hadn&#39;t anticipated this and might have even encouraged it by using a Microsoft template for the presentation that accompanies the toolkit (I have now switched to another template). I wanted to make it clear that this toolkit has come out of my and my team&#39;s efforts on a recent project and is by no means the endorsed (by Microsoft) or only way of implementing the features outlines below.  The p&amp;p team&#39;s Composite WPF and Silverlight guidance (http://compositewpf.codeplex.com/) and the WPF codeplex site (http://wpf.codeplex.com) are the official sources of guidance. Another source of inspiration to me has been the people and articles of http://wpfdisciples.wordpress.com/. In fact, they helped highlight the confusion that prompted this disclaimer. Finally, there are a bunch of community-created MVVM toolkits out there, and most are as valid as this one. Please feel free to take your pick :) </i><br /><br />The WPF Starter Kit is a great way to get started building Model View ViewModel based WPF applications. Unlike other MVVM frameworks, the starter kit makes it easy for people new to WPF to jump right in. Here&#39;s what the WPF Starter Kit supports:<br />\n<ul><li>A simple, easy to use implementation of the Model View View Model pattern</li></ul>\n\n<ul><li>A navigation framework that allows for clean navigation between View/ViewModel units. This framework is based on built-in WPF navigation</li></ul>\n\n<ul><li>Support for passing data between View Models</li></ul>\n\n<ul><li>Support for generic exception handling</li></ul>\n\n<ul><li>Support for long running operations on the UI thread</li></ul>\n\n<ul><li>Automatic change notification on the view models. Just make your properties virtual! Props to Dmitry Shechtman over at <a href=\"http://shecht.wordpress.com/\">http://shecht.wordpress.com/</a> for pointing me in the right direction.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF MVVM,WPF,MVVM,Silverlight,Starter Kit,WPF frameworks,Framework,",
  "LastEdited": "2009-12-31T01:57:16.003-08:00"
}