{
  "ProjectName": "writespace",
  "Title": "Writespace",
  "Description": "Writespace is an open source full screen writing environment plug-in for Word inspired by Dark Room for Windows and Write Room for OS X.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Writespace is a <b>fullscreen writing environment</b> add-in for Word 2013.<br /><br />Writespace is inspired by <i>Dark Room</i> (<a href=\"http://they.misled.us/dark-room\">http://they.misled.us/dark-room</a>) for Windows and <i>Write Room</i> (<a href=\"http://www.hogbaysoftware.com/product/writeroom\">http://www.hogbaysoftware.com/product/writeroom</a>) for OS X. One advantage of Writespace is the <b>built in spellcheck support</b> (English, French, Spanish and German).<br /><br /><img src=\"/projects/writespace/47a260f8-7262-4a73-927f-112d27fbf90a\" alt=\"margin1.png\" title=\"margin1.png\" /><br /><img src=\"/projects/writespace/9975f378-3086-4f8e-ae78-c46af068d0b2\" alt=\"centered&#32;text.png\" title=\"centered&#32;text.png\" /><br />The program is quite simple, but I&#39;ve been missing a plug-in for Word like this one, that&#39;s why I made it.<br />\n<h2>News</h2>\r<b>May 2015</b> - New release and installer for Word 2013 with new features added<br />- Background color<br />- Top margin<br />- Text alignment<br />- Word count<br />- Support for fonts with Light weight typefaces<br />\n<h2>IMPORTANT NOTE</h2>\r<b>Always, always, always keep a copy of your orginal document or text before you try out or use Writespace</b> so you can revert if things go bad. Writespace is work in progress and has not yet been tested enough to be called &quot;stable&quot;.<br />\n<h2>Shortcuts</h2>\rWritespace supports the following shortcuts from within the writing environment:<br /><br />CTRL+Mousewheel - Zoom in/out<br />CTRL+F - Search<br />F3 - Find next<br />F4 - Options Dialog<br />CTRL+G - Go to line<br />CTRL+M - Toggle between monitors<br />ESC- Exit to Word<br />CTRL+S - Save<br /><br />Writespace also supports the standard Undo/Redo/Select/Cut/Paste functionality you are used to.\n<h2>Word Integration</h2>\rWritespace is started from the <b>View-tab of the Word Ribbon</b>, just click the &quot;Writespace&quot; button and the text of the current document is grabbed and put into the Writespace full screen editor. When you escape from Writespace, the text in the Word document is updated with the text from Writespace. <i><b>Note</b> that Writespace removes all formating of the text</i>, so italics, font size, bold text, is removed and converted into the font, color and size Writespace uses. Word documents containing tables, pictures and other &quot;non-text&quot; content will not be possible to move to the Writespace editor, and you will get an error dialog if you try this. This is to protect you from messing things up.<br /><br /><img src=\"/projects/writespace/e7e08cfc-b8cb-486c-a4de-a42e6cc800c8\" alt=\"ribbon.png\" title=\"ribbon.png\" />\n<h2>Text Formatting</h2>\rWritespace does not have any support for formatting the text. You can select the size, color and type of font, which will affect the whole editor, but that&#39;s it. This may change in the future though. Note that if you enter the Writespace editor from an existing document in Word, the formatting of that text will be removed and converted to plain Writespace text.\n<h2>Spell Check</h2>\rWritespace uses the built in spell checking support which comes with WPF. Language is set from the options dialog. Unfortunately WPF only supports English, French, German and Spanish at the moment. If you still want to spell check your text, just escape back to Word and let it handle that for you.<br /><br /><img src=\"/projects/writespace/c50151f1-d06c-4edc-a644-ea48d3b3b5cd\" alt=\"spelling.png\" title=\"spelling.png\" />\n<h2>Drag/drop Margin</h2>\rThe left and right side margin can be changed without leaving Writespace. Just move the mouse over the left margin until it lights up, and adjust the size of the margin until you are satisfied. <br /><br /><img src=\"/projects/writespace/47a260f8-7262-4a73-927f-112d27fbf90a\" alt=\"margin1.png\" title=\"margin1.png\" /><br />Drag the margin with left mouse button and release. The new margin size will be saved to settings automatically.<br /><br /><img src=\"/projects/writespace/d8aaeddb-133e-4cf7-956c-651171fda179\" alt=\"margin2.png\" title=\"margin2.png\" />\n<h2>Find</h2>\rPress CTRL+F to display the find dialog. Press F3 to find next, next, next... as you are probably used to.<br /><br /><img src=\"/projects/writespace/4cb175de-fa3c-46b3-aaee-55151e10fe55\" alt=\"find.png\" title=\"find.png\" /> <img src=\"/projects/writespace/3fa2e2f8-4c3f-48c7-a5c0-a1fd8bb2114f\" alt=\"find_result.png\" title=\"find_result.png\" />\n<h2>Goto Line</h2>\rPress CTRL+G to display the goto dialog which helps you go to a specific line in the text.<br /><br /><img src=\"/projects/writespace/e16923ea-5a04-4cf9-b56e-1d7ec975829e\" alt=\"goto.png\" title=\"goto.png\" />\n<h2>Multiple Monitors</h2>\rPress CTRL+M to toggle between multiple monitors.\n<h2>Status Bar</h2>\rThe editor has a descrete status bar to show information about file saved and it also displays the current row and column in an animated, fade-out way <b>if you place the mouse in the lower right corner</b>. Feedback about the status bar and the row/col informaiton is appreciated.\n<h2>Mousewheel Zoom</h2>\rThe font size can also be changed without leaving the writing environment. Just hold CTRL and use the mouse wheel to zoom in our out of the text. The current size will also be saved to the settings.\n<h2>Options</h2>\rIt&#39;s possible to set color, font, size and margin from the options dialog. It&#39;s also possible to enable/disable spellchecking by specifying the language. <br /><img src=\"/projects/writespace/40b212d6-1e48-48a7-b855-a11ee766f795\" alt=\"options.png\" title=\"options.png\" /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Word 2007,Editor,WPF,Favorite,word wpf,",
  "LastEdited": "2015-05-21T11:22:53.367-07:00"
}