{
  "ProjectName": "XamlTorrent",
  "Title": "XAML Torrent",
  "Description": "XAML Torrent is a WPF-based client which organizes multiple file transfer libraries/protocols under one user interface.\n\nThe project's design centers around a set of abstractions of \"transfer tasks\" and \"transfer managers\". The idea is to build a user-friendly, protocol independent GUI and provide various data transfer protocols (BitTorrent, FTP, HTTP, etc.) as plugins.\n\nAs of now support for these protocols is planned:\n - URI-based protocols (HTTP, FTP, and anything else handled by System.Net.WebRequest)\n - BitTorrent, via the MonoTorrent library (www.monotorrent.com)\n\nAs the initial work on the framework is completed more interesting protocols (SFTP) may be included.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />XAML Torrent is a WPF-based client which organizes multiple file transfer libraries&#47;protocols under one user interface.<br /><br />The project&#39;s design centers around a set of abstractions of &#34;transfer tasks&#34; and &#34;transfer managers&#34;. The idea is to build a user-friendly, protocol independent GUI and provide various data transfer protocols &#40;BitTorrent, FTP, HTTP, etc.&#41; as plugins.<br /><br />As of now support for these protocols is planned&#58;<br /> - URI-based protocols &#40;HTTP, FTP, and anything else handled by System.Net.WebRequest&#41;<br /> - BitTorrent, via the MonoTorrent library &#40;www.monotorrent.com&#41;<br /><br />As the initial work on the framework is completed more interesting protocols &#40;SFTP&#41; may be included.<br /><br />The application&#39;s back-end framework currently under heavy development and faces constant design changes. Once that&#39;s more or less settled other the doors will be opened to other developers wishing to contribute to the project.</div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,MonoTorrent,BitTorrent,Torrent,",
  "LastEdited": "2008-08-21T01:25:35.303-07:00"
}