{
  "ProjectName": "XamlQueryWPF",
  "Title": "XamlQuery/WPF - The Write Less, Do More, WPF Library",
  "Description": "XamlQuery/WPF is a lightweight yet powerful library that enables rapid development in WPF. It simplifies several tasks like page/window traversing; finding controls by name, type, style, property value or position in control tree; event handling; animating and much more.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>What is <i>XamlQuery/WPF</i></h2>\rXamlQuery&#47;WPF is a lightweight yet powerful library that enables rapid development in WPF. It simplifies several tasks like page&#47;window traversing&#59; finding controls by name, type, style, property value or position in control tree&#59; event handling&#59; animating and much more.<br /><br />XamlQuery/WPF provides two approaches for finding controls.\n<ul><li>Using Selector Queries, and</li>\n<li>Using Managed Helper Methods</li></ul>\n\n<h2>Using Selector Queries</h2>\r\n<i>XamlQuery/WPF</i> selectors are feature rich and similar to <b><i>CSS</i></b> (cascading style sheet) selectors and <b><i>jQuery</i></b> selectors. A selector is a string that contains a set of matching rules or conditions that determine which controls to extract from the rendered WPF output. The following table summarizes the syntax of selectors.<br /><br /><img src=\"/projects/XamlQueryWPF/89a8016a-bf86-4c57-ba19-6d1f1b249772\" alt=\"XamlQuery&#32;Selectors.jpg\" title=\"XamlQuery&#32;Selectors.jpg\" /><br /><br />For more information about Selectors syntax and examples, see <a href=\"http://www.codeding.com/XamlQuery/?topic=15\">http://www.codeding.com/XamlQuery/?topic=15</a><br /><br />Once the syntax and usage are understood, the selectors are very easy and intuitive way to find controls. The search is performed in child / descendant controls of a given reference control. The reference control limits the search scope. It is very important to search in a lesser scope because of WPF&#39;s behavior of creating additional controls in the rendered output.<br /><br />The following method is used to find controls using selectors.<br />\n<ul><li><i>Search()</i> - method accepts a reference control and a selector query-string and returns the matching controls. The reference control is the one where the search starts.</li></ul>\n\n<h4>Selector Examples</h4>\r\nThe following query finds all rectangles inside a canvas.<br /><blockquote><i>#MainCanvas Rectangle</i></blockquote>The following query finds all Shapes (Rectangle, Line, Ellipse, etc.) inside a canvas.<br /><blockquote><i>#MainCanvas Shape</i></blockquote>The following example finds all textboxes that are grand child of a scroll viewer. The ‘*’ indicates that a ScrollViewer must be the ancestor of some control and that control must be an ancestor of a TextBox.<br /><blockquote><i>ScrollViewer * TextBox</i></blockquote>The following example gets all grids that are immediate children of all stack-panels in the search scope.<br /><blockquote><i>StackPanel &gt; Grid</i></blockquote>The following example gets all children of a wrap-panel named ‘ScoresContainer’.<br /><blockquote><i>WrapPanel#ScoresContainer &gt; *</i></blockquote>The following query finds all ellipses of style named ‘HighlightedNode’.<br /><blockquote><i>#LayoutRoot Ellipse.HighlightedNode</i></blockquote>The following example finds the control named ‘EmailTextBox’ that is a descendant of ‘RegisterGrid’.<br /><blockquote><i>#RegisterGrid #EmailTextBox</i></blockquote>The following query will get all text-boxes whose Tag property is set.<br /><blockquote><i>TextBox[Tag]</i></blockquote>The following query will get all text-blocks in second column of a grid.<br /><blockquote><i>#SalesReportGrid TextBlock[Grid_Column=1]</i></blockquote>The following example will find all controls whose name starts with ‘Rect’<br /><blockquote><i>*[Name^Rect]</i></blockquote>\n<h2>Using Managed Helper Methods</h2>\r\nThe following are helper methods that are used to find children and parent controls.<br />\n<ul><li><i>All()</i> - finds all children of a given control. </li>\n<li><i>ByType()</i> - finds all children of specified type, for example <i>TextBox</i>, <i>Rectangle</i>, etc. </li>\n<li><i>ByProperty()</i> - finds children whose property value matches a specified criteria. The <i>FilterType</i> optional parameter controls the matching of property value. The possible values for <i>FilterType</i> are <i>Equal</i>, <i>NotEqual</i>, <i>StartsWith</i>, <i>EndsWith</i> and <i>Contains</i>. The string representation of the property value is used for <i>StartsWith</i>, <i>EndsWith</i> and <i>Contains</i> filter-types.</li>\n<li><i>AllParents()</i> - finds all parents (upto root) of a control.</li>\n<li><i>ParentsUpto()</i> - finds all parents, until the parent with specified type or name is found.</li>\n<li><i>ParentByType()</i> - finds the first parent of specified type.</li>\n<li><i>ParentsByType()</i> - finds all parents of specified type. </li>\n<li><i>ParentByName()</i> - finds a parent control by name. </li>\n<li><i>Root()</i> - method finds the root control in the rendered <i>WPF</i> page. If a <i>UserControl</i> or <i>Page</i> is embedded within another <i>UserControl</i> or <i>Page</i>, the later will be returned as root. </li></ul>\n\n<h2>XamlQuery/WPF API</h2>\r\nThe <b><i>ControlSet</i></b> is a set of dependency objects. All the methods of XamlQuery/WPF returns <i>ControlSet</i> object. The <i>ControlSet</i> provides several methods/functions for carrying out useful tasks related to the controls. Each method operates on all the controls in the ControlSet. Most of the methods of <i>ControlSet</i> simplifies a complex task and can be invoked in a single line.<br />\n<h5>Filter Methods</h5>\r\nThese methods reduce the set of matched controls to those that pass a criteria (defined by the method).<br />\n<ul><li><i>FilterByType()</i> - finds and returns controls of specified type. </li>\n<li><i>FilterByTypes()</i> - finds and returns controls of specified types. </li>\n<li><i>FilterByProperty()</i> - finds and returns controls whose property value matches a specified criteria. </li>\n<li><i>RemoveByType()</i> - removes controls of specified type. </li>\n<li><i>RemoveByTypes()</i> - removes controls of specified types. </li>\n<li><i>Not()</i> - removes the given list of controls. </li>\n<li><i>Even()</i> - returns controls at even indices. </li>\n<li><i>Odd()</i> - returns controls at odd indices. </li>\n<li><i>Gt()</i> - returns controls at index greater than specified index. </li>\n<li><i>Lt()</i> - returns controls at index lesser than specified index. </li>\n<li><i>Enabled()</i> - returns all enabled controls. </li>\n<li><i>Disabled()</i> - returns all disabled controls. </li>\n<li><i>Visible()</i> - returns all visible controls. </li>\n<li><i>Invisible()</i> - returns all invisible controls. </li>\n<li><i>Checked()</i> - returns all checked controls. </li>\n<li><i>Unchecked()</i> - returns all unchecked controls. </li></ul>\n\n<h5>Value-Related Methods</h5>\r\nThese methods operate on property values.<br />\n<ul><li><i>SetValue()</i> - sets the value of specified property (of all controls) to a given value. </li>\n<li><i>GetValue()</i> - returns the value of specified property (of all controls) as List object. </li>\n<li><i>SetBinding()</i> - attaches a binding to specified property (of all controls). </li>\n<li><i>ClearValue()</i> - clears the local value of a specified property (of all controls). </li>\n<li><i>Val()</i> - returns the current value of first control. </li>\n<li><i>Data()</i> - gets or sets an arbitrary object to all controls (similar to multiple Tag properties). </li></ul>\n\n<h5>Visibility-Related Methods</h5>\r\nThese methods are used to hide/show controls, with optional animation. The speed of animation and the opacity can be specified through arguments.<br />\n<ul><li><i>Hide()</i> - hides all controls. </li>\n<li><i>Show()</i> - displays all controls. </li>\n<li><i>Toggle()</i> - alternates the visibility of controls. </li>\n<li><i>FadeOut()</i> - hides the controls by fading them to transparent. </li>\n<li><i>FadeIn()</i> - displays the controls by fading them to opaque. </li>\n<li><i>FadeTo()</i> - sets the opacity of controls to a specified value. </li>\n<li><i>FadeToggle()</i> - alternates the transparency of controls. </li>\n<li><i>SlideUp()</i> - hides the controls with a sliding motion. </li>\n<li><i>SlideDown()</i> - displays the controls with a sliding motion. </li>\n<li><i>SlideTo()</i> - sets the height of controls to a specified value. </li>\n<li><i>SlideToggle()</i> - displays or hides the controls with a sliding motion. </li></ul>\n\n<h5>Animation Methods</h5>\r\nThese methods are used to carry out a custom animation on a given property.<br />\n<ul><li><i>Animate()</i> - animates the controls on a given property and settings (like duration, begin/end values, etc.) </li></ul>\n\n<h5>Event-Related Methods</h5>\r\nThese methods simplifies the tasks related to event-handling. The events can be specified by high-level event names, defined by EventType enumeration. For more information, see documentation.<br />\n<ul><li><i>AddHandler()</i> - attaches an event handler to specified event of all controls.</li>\n<li><i>RemoveHandler()</i> - removes the specified event from all controls.</li>\n<li><i>Bind()</i> - attaches an event handler to event specified by a high level name. Events attached using Bind() can be fired manually.</li>\n<li><i>Trigger()</i> - fires/invokes the event handler of specified event manually (without actual event occurs).</li></ul>\n\n<h5>Layout-Related Methods</h5>\r\nThese methods operate on layout attributes like position, size, etc.<br />\n<ul><li><i>Detach()</i> - deletes/removes all controls from the rendered output. </li>\n<li><i>DetachByType()</i> - deletes/removes controls of given type from the rendered output. </li>\n<li><i>DetachByTypes()</i> - deletes/removes controls of given types from the rendered output. </li>\n<li><i>Empty()</i> - removes all controls from a container control (like Panel, Grid, etc.) </li>\n<li><i>Width()</i> - returns the actual width of first control. </li>\n<li><i>Height()</i> - returns the actual height of first control. </li>\n<li><i>Position()</i> - returns the position of first control, with reference to its immediate parent. </li></ul>\n\n<h4>API Examples</h4>\r\nThe following code applies some styles to all rectangles inside a canvas.<br /><br /><pre>\nControlSet allRectangles = XamlQuery.Search(LayoutRoot, &quot;#MainCanvas Rectangle&quot;);\nallRectangles.SetValue(Shape.StrokeThicknessProperty, 4.0);\nallRectangles.SetValue(Shape.FillProperty, new SolidColorBrush(Colors.LightGray));\n</pre><br />The following code disables all textboxes inside the registration form.<br /><br /><pre>\nXamlQuery.Search(RegisterGrid, &quot;TextBox&quot;).SetValue(Control.IsEnabledProperty, false);\n</pre><br />The following code attaches mouse-enter event to all text-blocks in a grid.<br /><br /><pre>\nControlSet allTextBlocks = XamlQuery.Search(LayoutRoot, &quot;#RegisterGrid TextBlock&quot;);\nallTextBlocks.Bind(EventType.MouseEnter,\n    new MouseEventHandler(delegate(object sender, MouseEventArgs e)\n{\n    ((TextBlock)sender).FontWeight = FontWeights.Bold;\n}));\n</pre><br />The following code gets all textboxes that are marked as compulsory.<br /><br /><pre>\nXamlQuery.Search(LayoutRoot, &quot;TextBox[FrameworkElement_Tag=Compulsory]&quot;);\n</pre><br />\n<h2>Frequently Asked Questions (FAQ)</h2>\r\n1) Why Search() method requires a reference control as argument?<br /><blockquote>The reference control is used to limit the search scope. The search scope is very important, because of WPF&#39;s behavior of creating additional controls in the rendered output. The lesser the search scope, the higher the accuracy of matching. For example, if the user needs to find controls inside a Grid, the reference control shall be that Grid instead of root control in the Page/UserControl.</blockquote>2) Can we use any number of white-spaces inside a query string?<br /><blockquote>Yes, there is no restriction in number of white-spaces in a selector. Also, a selector can span to multiple lines. However, the location of white-space between two simple-selectors is significant because white-space is a symbol for descendant-selector if used between two simple-selectors.</blockquote>3) Is &quot;*.GreenRect&quot; and &quot;* .GreenRect&quot; are different?<br /><blockquote>Yes, white-space is a symbol used for descendant selectors. ‘*.GreenRect’ will match all controls with style ‘GreenRect’. ‘* .GreenRect’ will match all controls with style ‘GreenRect’ that are descendants of some other control in the rendered output.</blockquote>4) Should dependency property names end with &#39;Property&#39;?<br /><blockquote>No, the ‘Property’ keyword should be ignored while using a dependency property in a selector. For example, UIElement.OpacityProperty should be given as ‘UIElement_Opacity’.</blockquote>5) While using style selectors, styles should be defined in the same UserControl/Page?<br /><blockquote>No, styles can reside in same UserControl/Page or any of merged resource dictionaries or App.xaml also. XamlQuery/WPF will search for styles in all these places.</blockquote>6) While using style selectors, using a base style will match controls of its dependent styles?<br /><blockquote>Yes, using a base style in selector will match controls whose style is extended from that base-style. For example, if style ‘GreenRect’ and ‘BlueRect’ are based on style ‘BaseRect’, then the selector query ‘*.BaseRect’ will match both green and blue rectangles.</blockquote>7) Is type selectors can be used to find subclasses of a control type?<br /><blockquote>Yes, type-selectors match controls of sub classes also. For example, the selector query ‘Shape’ will match controls of type Rectangle, Line, Ellipse, etc. Similarly, the selector query ‘Selector’ will match controls of type ComboBox, ListBox, etc.</blockquote>8) Double spaces between two simple-selectors means double descendant-selectors?<br /><blockquote>No, multiple-spaces (including line-breaks) are considered as single white-space. However, if you need to apply double descendant-selectors, you can use &#39;*&#39; like this &quot;#MainCanvas * Rectangle&quot;.</blockquote>\n<h2>Documentation</h2>\r\nFor more information, examples and demonstrations,<br />see Documentation (PDF) and API reference (CHM) available in Downloads section.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "wpf,",
  "LastEdited": "2011-01-28T03:58:06.723-08:00"
}