{
  "ProjectName": "locker",
  "Title": "Locker - remember only one password",
  "Description": "Locker is a password management tool. It provides a better way to store your passwords (like websites and Cards) so that you don't need to remember any of them.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>Locker - Remember only one Password</h1>\r\n<h5><br>\r\nLots of password and information to remember?</h5>\r\n<p>Then Locker can be&nbsp;handy.<br>\r\nIt provides a great way to store your website password,URL and other info about websites.<br>\r\n<br>\r\nI have account on more than 10 website all with different password even some website has multiple account for fun also. But when time comes, I need to use that\r\n<strong>Forget Password</strong> option available on every website. <br>\r\nEvery time I reset a password I feel to remember one more new password.<br>\r\n<br>\r\nNot only this, Locker&nbsp;also store Debit/Credit card&nbsp;related information like card number, valid through, CVV detail etc.\r\n<br>\r\nyou can save it as many details as you can. <br>\r\n<br>\r\nYou just need to open this app, login and <strong>Bingo</strong> all your saved information is here.</p>\r\n<h2>Features</h2>\r\n<ul>\r\n<li>Only one account for a Application. </li></ul>\r\n<ol>\r\n<ul>\r\n<li>if Locker is installed in a system then only a single user can use it. Another user will have to reset first account in order to use it.\r\n</li></ul>\r\n</ol>\r\n<ul>\r\n<li>Once account is created next time it will directly prompt for login only. </li><li>You can save your website details such as website name, password, email, extra details, passcode(if any), extra website info and many more.\r\n</li><li>Another tab is added if you want to save Debit/Credit &nbsp;card related information such as, pin, CVV number, card number etc.\r\n</li></ul>\r\n<p><strong>* more features can be added at later stages.</strong></p>\r\n<p><strong>*All sensitive information is highly secured with encryption.&nbsp;</strong></p>\r\n<p><strong>Disclaimer</strong> :</p>\r\n<p>We don't&nbsp;need<strong>&nbsp;</strong>any ones private information(I already have too many, overburdened). we are here to provide a better and easy way of life style.</p>\r\n<p>&nbsp;</p>\r\n<h2>Targeted Operating Systems:</h2>\r\n<ul>\r\n<li>Windows XP/7/8. </li><li>windows phone 8.1 </li><li>Android. </li></ul>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><br>\r\n</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,WPF,Windows Phone 8.1,XAML,PCL,SQLite-Net,SQLite,Windows,",
  "LastEdited": "2015-11-16T20:48:55.483-08:00"
}