{
  "ProjectName": "multitouchtransformbehavior",
  "Title": "Multitouch Transform WPF Behaviour",
  "Description": "A WPF behaviour that allows any element in the visual tree to be transformed by multi-touch touchscreen events.\r\n\r\nInspired by TranslateZoomRotateBehavior.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">This WPF behaviour is a custom behaviour based on Microsoft&#39;s TranslateZoomRotateBehavior that adds new functionality, as well as giving you easy, clear source code to adapt to your own needs.<br /><br />The source code for Microsoft&#39;s TranslateZoomRotateBehavior isn&#39;t available, so it makes it difficult to adapt the behaviour to your own needs.<br /><br />I needed a behaviour to allow for the zoom, pan and rotate of photographs that replicated the conventions of the iPad and iPhone. For that reason I created this custom implementation, which includes some improvements over the original behaviour:<br />\n<ul><li>More easily configurable options when working with the behaviour in Blend.</li>\n<li>Pinch to zoom centres the translation at the point of manipulation.</li>\n<li>Double-tap to zoom in and back out (mimicking the Apple iOS style).</li>\n<li>Methods to programatically zoom in and out.</li>\n<li>Reset method to return the element to it&#39;s original location.</li>\n<li>Animated transitions for double-tap, zoom in/out and reset.</li>\n<li>Bound checking (if the element is moved out of bounds, then it is animated back to it&#39;s previous position).</li>\n<li>(Hopefully) Clean, organised and well commented code.</li>\n<li>Animation and transformation code encapsulated into separate classes, allowing you to use these features directly in code-behind if you don&#39;t wish to attach the behaviour.</li></ul>\n<br />Features that are not yet implemented, but are planned:\n<ul><li>Inertia (with configurable options)</li>\n<li>More flexible bound checking by allowing you to select ANY element to use as a bounds frame.</li>\n<li>Mouse-down support for panning and double click.</li></ul>\n<br />Known Issues (currently fixing):\n<ul><li>ZoomInStep and ZoomOutStep do not currently zoom from center.</li>\n<li>Reset() automatically firing in unexpected way when MinimumZoom is set to &lt; 1.0.</li>\n<li>Reset() automatically firing if scale == 1.0, and the element is translated (without scaling). This is by design (for my original implementation), but there&#39;s currently no option to turn this off if you don&#39;t need it.</li></ul>\n<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-12-10T10:06:04.09-08:00"
}