{
  "ProjectName": "NGoogleCalendar",
  "Title": "NGoogleCalendar",
  "Description": "Occassionaliy-connected desktop client for google calendar.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Occassionaliy-connected desktop client for google calendar.<br /><br />The application runs locally on your computer / laptop and brings your Google Calendar onto the desktop. Because the software is able to work offline, you can work with the calendar even if your are not connected to the internet. NGoogleCalendar automatically detects your network status and synchronises the calendars occassionaliy when connected.<br /><br />Project status (20.08.2008):<br /><br />Today I&#39;ve added the WPF GUI to the project. It is my first WPF Application and I was able to do some databinding and so. I&#39;m very proud that the data is load out of the SQL Server and is not faked or so.<br />But I must wait on the book I&#39;ve ordered. I still have a lot to learn about WPF!<br />Here a screenshot of my work today:<br /><br /><img src=\"/projects/NGoogleCalendar/17b38c26-449c-4408-aa64-c7f72f7cc639\" alt=\"googleCalendarScreenshot.png\" title=\"googleCalendarScreenshot.png\" /><br /><br /><br />I am working on the architecture. During the last weeks I hadn&#39;t so much time to do development for this project. But the last few days, I could do some work on the DAL layer etc. I hope I can release V 0.2 in September this year. <br /><br /><img src=\"/projects/NGoogleCalendar/a98f50d1-0647-4024-88f3-dec0ccc3d3e4\" alt=\"Architecture_Drawing.PNG\" title=\"Architecture_Drawing.PNG\" /><br /><br />But it still needs some time until this core problem is solved. In between i will post some (pre-) releases, which shown that the architecture is working. <br /><br /><br />Details about the project are hosted on my <a href=\"http://www.froorider.ch/dokuwiki/doku.php\">wiki</a>. Attention: I have just changed my wikiengine from mediawiki to dokuwiki. So please be patient if the articles are not yet available. I have to move the content first. And this is unfortunately not an out-of-the-box thing. </div><div class=\"ClearBoth\"></div>",
  "TagList": "C# 3.5,WPF,Google,calendar,C# 3.0,",
  "LastEdited": "2008-08-20T09:42:48.5-07:00"
}