{
  "ProjectName": "rcat",
  "Title": "RNA Comparative Analysis Software Tools",
  "Description": "A software infrastructure for the Comparative Analysis of RNA. The infrastructure consists of a novel database, RNA Comparative Analysis Database (rCAD) and an application for visualization/manipulation of data from rCAD, Comparative Analysis Toolkit User Interface (CATUI).",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\rA software infrastructure for the Comparative Analysis of RNA. The infrastructure consists of a novel database, RNA Comparative Analysis Database &#40;rCAD&#41; and an application for visualization&#47;manipulation of data from rCAD, Comparative Analysis Toolkit User Interface &#40;CATUI&#41;.<br />\n<h2>Releases</h2>\r<ul><li><b>New</b> - RNA Comparative Analysis Tools 3.00, <a href=\"https://rcat.codeplex.com/releases/view/50671\">Released 8/19/2010</a>\n<ul><li><a href=\"https://rcat.codeplex.com/releases/view/50671\">CATUI 3.51</a>\n<ul><li><b>Note:</b> - If you installed CATUI 3.5 via clickonce, you will have to uninstall it and reinstall via clickonce to get CATUI 3.51.</li></ul></li>\n<li><a href=\"https://rcat.codeplex.com/releases/view/50671\">rCAD Reference Implementation 1.5.1</a>\n<ul><li><b>Note:</b> - If you installed rCAD 1.5.0, you will have to uninstall it and reinstall to update to rCAD 1.5.1</li>\n<li><b>Note:</b> - The 5S rRNA rCAD dataset at the CRW Site (<a href=\"http://www.rna.ccbb.utexas.edu/DAT/3C/Alignment/#CRW\">http://www.rna.ccbb.utexas.edu/DAT/3C/Alignment/#CRW</a>) is updated to included 179 2-D structure models (requires rCAD 1.5.1).</li>\n<li><b>Note:</b> - We have found issues related to installing the x86 version of the rCAD Utilities on x64 Windows. In particular, the rCAD Creator and rCAD Taxonomy Updater utilities will complain of Registry errors. Please install the x64 version of the rCAD Utilties on x64 Windows and the x86 on version of the rCAD Utilities on x86 Windows.</li></ul></li></ul></li></ul>\n\n<ul><li>RNA Comparative Analysis Tools 2.00, <a href=\"https://rcat.codeplex.com/releases/view/40549\">Released 2/16/2010</a>\n<ul><li><a href=\"https://rcat.codeplex.com/releases/view/40549\">CATUI 3.0</a>\n<ul><li><b>Note:</b> - There appears to be an issue with the way the built in unzip tool in Windows 7 is handling the CATUI3.0.zip file. Use WinZip or 7zip to extract.</li>\n<li><b>New</b>, 2/18/2010 - The first video tutorial, an introduction to the CATUI 3.0 is available. Head on over to the <a href=\"https://rcat.codeplex.com/releases/view/40549\">download page here to get it</a> or visit the Gutell Lab&#39;s YouTube Page: <a href=\"http://www.youtube.com/GutellLab\">http://www.youtube.com/GutellLab</a> </li></ul></li>\n<li><a href=\"https://rcat.codeplex.com/releases/view/40549\">CATUI 3.0 Documentation</a></li>\n<li><a href=\"https://rcat.codeplex.com/releases/view/40549\">rCAD Reference Implementation 1.0</a></li></ul></li></ul>\n\n<ul><li>RNA Comparative Analysis Tools 1.00, <a href=\"https://rcat.codeplex.com/releases/view/39651\">Released 1/29/2010</a>\n<ul><li><a href=\"https://rcat.codeplex.com/releases/view/39651\">CATUI 2.0</a></li>\n<li><a href=\"https://rcat.codeplex.com/releases/view/39651\">rCAD Reference Implementation 1.0</a></li></ul></li></ul>\n\n<h2>Publications/Citing this work</h2>\r1. Doshi K.J., Gutell R.R., and Ozer S. (2010)<br />rCAD: The RNA Comparative Analysis Database<br />(<b>manuscript submitted for publication</b>)<br /><b>Note</b>: Some of the figures on this site are adapted from that manuscript.<br /><br />2. Doshi K.J., Gardner D.P., Cannone.J.J, Gutell.R.R. and Smith M. (2010)<br />CATUI: The Comparative Analysis Toolkit User Interface<br />(<b>manuscript in preparation</b>)<br />\n<h2>External Links</h2>\r\n<ul><li>Gutell Lab Research Site:\n<ul><li><a href=\"http://www.rna.ccbb.utexas.edu\">http://www.rna.ccbb.utexas.edu</a></li></ul></li>\n<li>Microsoft Research Spotlight: \n<ul><li><a href=\"http://www.microsoft.com/mscorp/tc/determining-fundamental-principles.mspx\">http://www.microsoft.com/mscorp/tc/determining-fundamental-principles.mspx</a></li></ul></li>\n<li>Computational Tools to Help Solve the Puzzle of RNA Structure\n<ul><li><a href=\"http://research.microsoft.com/en-us/collaboration/focus/health/rna-structure.aspx\">http://research.microsoft.com/en-us/collaboration/focus/health/rna-structure.aspx</a></li></ul></li>\n<li>rCAD - RNA Comparative Analysis using SQL Server (video presentation):\n<ul><li><a href=\"http://research.microsoft.com/apps/video/default.aspx?id=103865\">http://research.microsoft.com/apps/video/default.aspx?id=103865</a></li></ul></li>\n<li>Microsoft Biology Foundation:\n<ul><li><a href=\"http://mbf.codeplex.com\">http://mbf.codeplex.com</a></li></ul></li></ul>\n\n<h2>Introduction</h2>\r\nThe Gutell Lab at The University of Texas at Austin (<a href=\"http://www.rna.ccbb.utexas.edu\">http://www.rna.ccbb.utexas.edu</a>) has been successfully applying Comparative Analysis techniques to study Ribosomal RNA&#39;s amongst other RNA&#39;s <b><a href=\"#intro_ref_1\">&#40;1&#41;</a></b>. Comparative Analysis has been used to successfully decipher the structure of RNA molecules <b><a href=\"#intro_ref_2\">&#40;2&#41;</a></b>, and identify and characterize new RNA structural motifs. Successful application of Comparative Analysis for RNA involves the analysis of multiple, related dimensions of information: sequence and a sequence alignment, structure (secondary and 3-D structure), and evolutionary relationships (phylogeny).<br /><br /><img src=\"/projects/rcat/5ff3523e-7d6c-42c2-9ae3-170036f02923\" alt=\"Integrated.Dimensions.png\" title=\"Integrated.Dimensions.png\" /><br /><br />Comparative Analysis of an RNA is an iterative process involving two distinct phases: <b>bootstrap</b> and <b>curation</b>. In the <b>bootstrap</b> phase, an initial set of homologous sequences (closely related evolutionarily) for the RNA of interest are aligned for maximum sequence identity and a secondary structure hypothesis is made. Selection of the initial sequence set is important; generally you need sequences with enough identity to enable a sequence based alignment, but also enough variation to observe higher-order relationships between positions (e.g., covariations). In the <b>curation</b> phase, more sequences are added to the data set in an iterative process. The structure model hypothesis is continually tested and accepted or refuted and revised as more evolutionarily distant sequences are added to the sequence alignment. Both the <b>bootstrap</b> and the <b>curation</b> phases require the Biologist to be involved in the analysis; however, certain steps can be streamlined and automated.<br /><br /><img src=\"/projects/rcat/70e41319-140f-4420-8ffb-f28ee974d618\" alt=\"Comparative.Analysis.Workflow.png\" title=\"Comparative.Analysis.Workflow.png\" /><br /><br />The successes of the Gutell Lab and other research groups using Comparative Analysis techniques have contributed significantly to RNA science. The tremendous increase in available biological information has created new opportunities to further decipher the structure, function and evolution of cellular components, such as Ribosomal RNA, but presents new computational challenges to obtain adequate performance and scalability. The lack of software tools capable of allowing Biologists to <b>interactively</b> apply Comparative Analysis to ever increasing amounts of biological information has become a significant bottleneck. The Gutell Lab has continually developed and re-develop their own custom software tools to handle the ever increasing amounts of RNA sequence and structure information. While the tools developed worked within the Gutell Lab, they were not designed for dissemination within the wider scientific community. The Gutell Lab in collaboration with Microsoft Research have started this project to develop an advanced software infrastructure for applying Comparative Analysis to large RNA datasets. These tools are to be used within the Gutell Lab, but also be made available, open source, to the scientific community.<br /><br />Our Comparative Analysis software infrastructure can be broken down into two separate elements. The first element is an advanced database system, built on Microsoft SQL Server 2008, capable of organizing large amounts of biological information for efficient retrieval and multi-dimensional analysis. This database system is known as the <a href=\"https://rcat.codeplex.com/wikipage?title=rCAD_RI&referringTitle=Home\">RNA Comparative Analysis Database &#40;rCAD&#41;</a> <b><a href=\"#intro_ref_3\">&#40;3&#41;</a></b>. The rCAD database cross-indexes several dimensions of an RNA dataset: sequence, structure, and phylogenetic/evolutionary information. The rCAD database is the first biological database system capable of storing sequence alignments down to the resolution of individual nucleotides <b><a href=\"#intro_ref_3\">&#40;3&#41;</a></b>. Individual rows, columns and cells in an alignment can be directly included in SQL statements along with different RNA structure and phylogenetic/evolutionary information <b><a href=\"#intro_ref_3\">&#40;3&#41;</a></b>. By uniting multiple dimensions of information, rCAD allows new, innovative analyses of the fundamentals of RNA such as: statistics of different RNA sequence/structure motifs (Gardner, DP et al, <b>manuscript in preparation</b>), <a href=\"http://www.rna.ccbb.utexas.edu/SAE/2D\">http://www.rna.ccbb.utexas.edu/SAE/2D</a> or the evolution of RNA structural elements <b><a href=\"#intro_ref_4\">&#40;4&#41;</a></b>.<br /><br /><img src=\"/projects/rcat/5e64892c-ebaf-45b2-bb3c-d7204c61621f\" alt=\"rCAD.Database.png\" title=\"rCAD.Database.png\" /><br /><br />The second element of this project is a comprehensive, interactive visualization package for analyzing and manipulating large RNA datasets using Comparative Analysis. This software package is the <a href=\"https://rcat.codeplex.com/wikipage?title=CATUI&referringTitle=Home\">Comparative Analysis Toolkit User Interface &#40;CATUI&#41;</a> (<b>manuscript in preparation</b>). We intend for the CATUI to be the most sophisticated RNA Comparative Analysis sequence and structure visualization tool available. The CATUI will interact directly with the rCAD database platform.<br /><br />The CATUI will support the manipulation and editing of sequence alignments containing more than 100,000 sequences. The sequence alignments can be in files or in the rCAD database. The CATUI will provide an integrated RNA secondary structure editing widget, and advanced alignment navigation tools. Users will be able to navigate sequence alignments by taxonomy or common secondary structure. Below is a very screen capture of the visualization of integrated dimensions in the CATUI (CATUI 3.0, not available till Feb 2010). In the screen capture, a sequence alignment is opened, and the sequences grouped by evolutionary relationships. A taxonomy browser allows the user to navigate the alignment in the vertical direction and an &quot;birds-eye&quot; viewer allows one to move across the alignment two-dimensionally.<br /><br /><img src=\"/projects/rcat/c4bc9f8e-1db1-4eb7-ab0b-599164db4686\" alt=\"CATUI.Overview.ShrinkMore.png\" title=\"CATUI.Overview.ShrinkMore.png\" /><br />\n<h2>Sections</h2>\r<ul><li><a href=\"https://rcat.codeplex.com/wikipage?title=CATUI&referringTitle=Home\">Comparative Analysis Toolkit User Interface &#40;CATUI&#41;</a></li>\n<li><a href=\"https://rcat.codeplex.com/wikipage?title=rCAD_RI&referringTitle=Home\">RNA Comparative Analysis Database &#40;rCAD&#41; Reference Implementation</a></li>\n<li><a href=\"https://rcat.codeplex.com/documentation?referringTitle=Home\">Documentation</a></li></ul>\n\n<h2>References</h2>\r<ol><li><a name=\"intro_ref_1\"></a> Cannone JJ, Subramanian S, Schnare MN, et al. (2002) The comparative RNA web (CRW) site: an online database of comparative sequence and structure information for ribosomal, intron and other RNAs. BMC Bioinformatics 3:2.</li>\n<li><a name=\"intro_ref_2\"></a> Gutell RR, Lee JC, Cannone JJ (2002) The accuracy of ribosomal RNA comparative structure models. Curr Opin Struct Bio 12:301-310</li>\n<li><a name=\"intro_ref_3\"></a> Doshi KJ, Gutell RR, Ozer S (2010) rCAD: The RNA Comparative Analysis Database (manuscript submitted)</li>\n<li><a name=\"intro_ref_4\"></a> Xu W, Ozer S, Gutell R (2009) Covariant Evolutionary Event Analysis for Base Interaction Prediction Using a Relational Database Management System for RNA. Scientific and Statistical Database Management. Berlin/Heidlberg: Springer. 200-216.</li></ol>\n\n<h2>Additional Information and Credits</h2>\r<ul><li>This project is partially funded by grants from the National Institutes of Health, GM085337 and GM067317, and Microsoft External Research.</li>\n<li>Mark Smith of Julmar Technologies Inc. <a href=\"http://www.julmar.com\">http://www.julmar.com</a>\n<ul><li>Julmar Model-View-ViewModel Framework: <a href=\"http://mvvmhelpers.codeplex.com\">http://mvvmhelpers.codeplex.com</a></li></ul></li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "Computational,Biology,RNA,Comparative,Analysis,WPF,Bioinformatics,Database,",
  "LastEdited": "2010-08-30T08:36:27.567-07:00"
}