{
  "ProjectName": "riams",
  "Title": "RIAMS",
  "Description": "Rich Internet Application Management System.\nRIAMS is a Content Management System designed to be hosted on Windows Azure with offline administration applications for Win an Mac. \nRIAMS delivers HTML content and also loose XAML content for dynamic Silverlight and WPF applications.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project has been closed!</h2>\r\n<b>Project Description</b><br />Rich Internet Application Management System.<br />RIAMS is a Content Management System designed to be hosted on Windows Azure with offline administration applications for Win an Mac. <br />RIAMS delivers HTML content and also loose XAML content for dynamic Silverlight and WPF applications.\n<h2>Idea</h2>\rThe idea behind this project is to create a Content Management System with a rich user experience, administration- and editing tools which run on Windows and on a Mac.<br />The content is HTML for websites and loose XAML with script support for Ruby and Python for dynamic Silverlight and WPF applications. <br />You will not need Visual Studio or any compiler for your projects.<br />You are able to implement web sites and intranet applications.<br />Addons can be developed separately as standalone Silverlight applications or just HTML components.<br />There will be a plugin technologie to host admin modules for addons.<br />\n<h2>First impressions</h2>\rWe are using RIAMS to create an <a href=\"http://www.coopforge.net\">Open Source Portal</a>. Here are the first impressions.<br /><br /><img src=\"/projects/riams/146acfdd-124b-48a7-873f-d4feb09c8c40\" alt=\"CodePlex&#32;Thumbnail\" title=\"CodePlex&#32;Thumbnail\" /><br />\n<h2>Target platforms</h2>\rThe RIAMS.Manager will run on Windows (WPF) and Mac (Cocoa) as native applications.<br />The RIAMS.Server will run on Windows Azure with Windows Azure Storerage.<br />\n<h2>Content</h2>\rThe content is based on HTML and XAML and is therefore very small and easy to mantain.<br />There will also be a WYSIWYG-Tool where you can edit content without the knowledge of any programming language.<br />\n<h2>Benefits</h2>\rRich user experience! Fun for your customers.<br />The Manager-Software will run on Mac and on Windows as native application and will be very fast according to other CMS&#39;s which have a Web-GUI.<br />You are able to work offline without network traffic.<br />You can publish the content when the server is idle.<br />RIAMS does not use any SQL-Server, instead it uses Windows Azure Storage for best performance, price and compatibilty to REST.<br />\n<h2>Company behind RIAMS</h2>\rThe company RIAMS GmbH has been founded to make this project successful.<br />Please visit our homepage at  <a href=\"http://www.riams.net\">www.riams.net</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "python,C#,CMS,Windows,xaml,ruby,Silverlight,REST,RIA,User Experience,mac osx,RESTful,XAML templates,silverlight 4,loose xaml,Azure,Azure Storage,ASP.NET MVC,ASP.NET,",
  "LastEdited": "2011-03-21T08:55:44.383-07:00"
}