{
  "ProjectName": "SammyKailini",
  "Title": "SharePoint Theme Applicator",
  "Description": "SharePoint Theme Applicator will give SharePoint administrators the ability to apply a theme accross a whole web application (i.e. apply a theme to all site collections and all webs under the site collections). This was developed in C# and WPF.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />SharePoint Theme Applicator will give SharePoint administrators the ability to apply a theme accross a whole web application &#40;i.e. apply a theme to all site collections and all webs under the site collections&#41;. This was developed in C&#35; and WPF.\n<h1>Features</h1>\rThis simple application will enable SharePoint admins to apply a theme across a whole entire web application. This could make a great tool to apply a unified theme across all sites for a newly setup or existing SharePoint portal environment.\n<ul><li>Provides the total number of site collections in the giving web application.</li>\n<li>Provides the total number of webs in the giving web application.</li>\n<li>Provides a window that shows the current sites the theme is being applied to.</li>\n<li>Provides a status of the overall progress and how many site collections and webs are still to go.</li>\n<li>Provides a status of the overall progress using a progress bar.</li></ul>\n<h1>Requirements</h1>\rThe application may only be run on the SharePoint server itself, with an account that has sufficient permissions.\n<h1>Screen Shots</h1>\rStarting the application.<br /><img src=\"http://i3.codeplex.com/download?ProjectName=sammykailini&amp;DownloadId=109224\" /><br /><br />Running the application.<br /><img src=\"http://i3.codeplex.com/download?ProjectName=sammykailini&amp;DownloadId=109222\" /><br /><br />The operation completed.<br /><img src=\"http://i3.codeplex.com/download?ProjectName=sammykailini&amp;DownloadId=109225\" /><br /><br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-03-04T10:19:37.453-08:00"
}