{
  "ProjectName": "TV4Home",
  "Title": "TV4Home - The all-in-one TV solution!",
  "Description": "TV4Home installs MediaPortal TV Server on Windows Home Server for recording TV or streaming Live-TV to network clients. It includes an Add-In for WHSv1, WHS2011 (Vail) and a Web-Interface with full EPG (Electronic Program Guide) to schedule recordings.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h2>Project Description</h2>\r\n<p>TV4Home installs MediaPortal TV Server on your Windows Home Server. You can then record your favorite TV shows or stream Live-TV to network clients.<br>\r\nThe installation procedure is based on easy to use wizards, which means you can get your TV Server up and running in a couple of minutes!<br>\r\n<br>\r\nThe Add-In is available for the original Windows Home Server, as well as for the new version Windows Home Server 2011 (Vail).<br>\r\nIt integrates into the WHS Console or the WHS2011 Dashboard and provides an overview of the current TV Server status.<br>\r\n<br>\r\nWith the Web-Interface you can schedule recordings by using the EPG (Electronic Program Guide) from any Internet-connected PC.<br>\r\nSimply visit&nbsp;your WHS Remote Access Website and click on the TV4Home link.</p>\r\n<h2>Download</h2>\r\n<ul>\r\n<li><a href=\"/releases/46042/download/207758\">TV4Home Add-In for Windows Home Server 2011 (formerly Codename &quot;Vail&quot;)</a>\r\n</li><li><a href=\"/releases/46042/download/207759\">TV4Home Add-In for Windows Home Server</a>\r\n</li></ul>\r\n<h2>Installation</h2>\r\n<p>Please refer to the <a href=\"http://tv4home.codeplex.com/documentation\">Documentation</a> for detailed installation instructions.</p>\r\n<h2>Screenshots</h2>\r\n<p>Vail Add-In:<br>\r\n<img title=\"TV4Home-Vail.png\" src=\"http://i3.codeplex.com/download?ProjectName=TV4Home&DownloadId=193554\" alt=\"TV4Home-Vail.png\" width=\"600\"></p>\r\n<p>WHS Add-In:<br>\r\n<img title=\"TV4Home-WHS.png\" src=\"http://i3.codeplex.com/download?ProjectName=TV4Home&DownloadId=193555\" alt=\"TV4Home-WHS.png\" width=\"600\"></p>\r\n<p><br>\r\nWeb-Interface:<br>\r\n<img title=\"TV4Home-Vail.png\" src=\"http://i3.codeplex.com/download?ProjectName=TV4Home&DownloadId=193561\" alt=\"TV4Home-Vail.png\" width=\"600\"></p>\r\n<h2>FAQ</h2>\r\n<ul>\r\n<li>Will TV4Home work on Windows Small Business Server 2011 Essentials (formerly Codename &quot;Aurora&quot;) or Windows Storage Server 2008R2 Essentials (formerly Codename &quot;Breckenridge&quot;) ?\r\n<ul>\r\n<li>Yes and no. The TV4Home Add-In will install on these prodcuts, because they share the same extensibility platform as WHS2011 (Vail). However, they lack some important components (specifically the Broadcast Driver Architecture - BDA) necessary for digital\r\n TV cards. You may not be able to scan for channels or use the TV Server for recording TV. It is therefore not recommended to install TV4Home on platforms other than Windows Home Server, though you can try it at your own risk.\r\n</li></ul>\r\n</li><li>I'm using an existing MSSQL and the authentication isn't working?\r\n<ul>\r\n<li>When using an existing MS SQL server it has to be ensured that the SQL Server allows the SQL authentication mode. The &quot;Express&quot; versions of MS SQL are configured with NTLM authentication mode by default, so you need to&nbsp;reconfigure it to support SQL\r\n authentication too. </li></ul>\r\n</li><li>What should I do if I have already installed MediaPortal TV Server on my WHS?\r\n<ul>\r\n<li>Simply install the Add-In and the Web-Interface, it should recognize your existing TV Server installation. There may be some issues if you use another version of the TV Server as the Add-In does (1.1.2).\r\n</li></ul>\r\n</li><li>Which TV cards are supported?\r\n<ul>\r\n<li>While in theory every TV card supported by MediaPortal TV Server (see <a href=\"http://wiki.team-mediaportal.com/1_MEDIAPORTAL_1/11_Preparing_Your_System/01_Supported_TV_Cards\">\r\nhere</a>) should work, there may be some incompatibilities between the cards and Windows Home Server. Especially Windows Home Server v1 might have some problems that WHS2011 doesn't have, since it is more optimized for media scenarios. We therefore put together\r\n a list of cards&nbsp;that are known to work with WHSv1 or WHS &quot;Vail&quot;: <a href=\"/wikipage?title=List&#43;of&#43;supported&#43;TV&#43;cards\">\r\nList of supported TV cards</a> </li></ul>\r\n</li></ul>\r\n<h2>Donate</h2>\r\n<p><a href=\"https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=Z7TL5DNFCFN3C\" target=\"_blank\">Paypal</a></p>\r\n<h2>Discussions</h2>\r\n<p>If you want to discuss new features, please use the <a href=\"/discussions\">Discussions</a> forum to share your ideas with us.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Projects,WPF,App,Application,Applications,TV Home,Website,Demo,Example,",
  "LastEdited": "2011-02-14T10:46:29.35-08:00"
}