{
  "ProjectName": "uTorrentClient",
  "Title": "uTorrent Web Client API Wrapper Library",
  "Description": "This library allows .NET developers to easily access the uTorrent Web Client API. It provides a nice object-oriented wrapper over the uTorrent JSON API, and supports automatic updating and caching of results.\nIt's developed in C# using WCF and requires .NET Framework 3.5 SP1.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This library allows .NET developers to easily access the uTorrent Web Client API. It provides a nice object-oriented wrapper over the uTorrent JSON API, and supports automatic updating and caching of results.<br />It&#39;s developed in C&#35; using WCF and requires .NET Framework 3.5 SP1.<br /><br /><b>Contact Regarding This Project</b><br />Please note if you want to contact me about this project, make sure there is a way for me to contact you in return. I have had several people contact me recently without any way of me getting back to them.<br /><br /><b>Version 1.1 Released</b><br />I&#39;ve uploaded a new version with some bug fixes and various new features to support building UIs based on the client library.<br /><br /><b>Fat Controller Added</b><br />I&#39;ve also added a little WPF demo application which uses the client library to control uTorrent via the web interface. It uses the (painfully slow) WPF DataGrid preview to show torrents in a similar format to the standard uTorrent interface. It has the following features:\n<ul><li>Shows a list of torrents in a grid</li>\n<li>Displays status, progress and a little status icon just like uTorrent</li>\n<li>You can sort by any column or several columns</li>\n<li>You can move columns about</li>\n<li>Toolbar with similar buttons to the normal uTorrent interface</li>\n<li>Minimises to the system tray</li>\n<li>Single instance</li>\n<li>Accepts torrent files on the command line (you can associate torrent files with Fat Controller)</li></ul>\n<br /><b>Screenshots</b><br />The Fat Controller main interface looks something like this:<br /><img src=\"/projects/uTorrentClient/39344278-3dfb-48a5-b933-0d3bc9effd67\" alt=\"MainWindow.png\" title=\"MainWindow.png\" /><br /><br />When minimised to the system tray, it looks like this:<br /><img src=\"/projects/uTorrentClient/e7200f66-bc28-415c-8e2c-ae23298e6992\" alt=\"Taskbar.png\" title=\"Taskbar.png\" /><br /><br /><b>Future Development</b><br />Apart from bug fixes, I might get round to adding the following features to Fat Controller at some point:\n<ul><li>A right-click menu on the system tray icon</li>\n<li>A right-click context menu for the torrents like the one in uTorrent</li>\n<li>A torrent properties window to change torrent properties</li>\n<li>A right-click context menu on the column headers to show/hide different columns</li>\n<li>A bottom tabbed section like the one in uTorrent with general torrent information and a file list (including a context menu to set file priority)</li>\n<li>A left-hand filtering/selection/navigation bar like the one in uTorrent</li>\n<li>A search box in the toolbar to filter the list of torrents</li>\n<li>A settings window to change uTorrent settings</li>\n<li>Improvements in the client library work with multiple torrents where appropriate (e.g. start/pause multiple torrents at once). This looks like it could be suprisingly difficult with WCF.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "uTorrent,BitTorrent,JSON,wcf,WPF,µTorrent,WebUI,Torrent,api,",
  "LastEdited": "2009-08-17T04:03:54.12-07:00"
}