{
  "ProjectName": "wpfrcp",
  "Title": "WPF RCP",
  "Description": "WPF RCP is RCP (Rich Client Platform) for project written in WPF .Net. It enables you easily build your own application leaving tools to be platform's issues.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />WPF RCP is RCP &#40;Rich Client Platform&#41; for project written in WPF .Net. It enables you easily build your own application leaving tools to be platform&#39;s issues.<br />WPF RCP is developed by IISG Research Group AGH (<a href=\"http://www.iisg.agh.edu.pl\">www.iisg.agh.edu.pl</a>) and is Open Source product (see the <a href=\"http://wpfrcp.codeplex.com/license\">license</a>).<br /><br />When creating new WPF application you usually need to think about a lot of issues not necessary connected to its logic. Those are for example simple decisions like styles that should be used, application layout, but also more complex like way of even logging, threading or exception handling.<br />Those concepts should be platform, not developer, concerns. And those are the proposition that I made by this project – development environment that allows you to focus on the logic of your application while all the rest is taken care of.<br /><br />You may see how the example application build using the platform for the dark theme looks like:<br /><img src=\"/projects/wpfrcp/f007b36f-c486-4baa-b9ac-69ee818ef0ad\" alt=\"RCP&#32;Application.png\" title=\"RCP&#32;Application.png\" /><br />\n<h1>Features</h1>\rTools you get by using WPF RCP project include:\n<ul><li>two types of <i><b>windows docking</b></i> - standard and using AvalonDock project, that allows you to change place of the windows in the application</li>\n<li>two types of <i><b>menu</b></i> - standard menu items and ribbon based</li>\n<li><i><b>jobs</b></i> management - including preview of run jobs, stopping them and resuming</li>\n<li><i><b>logs</b></i> management - choice of the log tool and previewing them</li></ul>\n<br />!Additional information<br />See our latest release: <a href=\"https://wpfrcp.codeplex.com/releases/view/112327\">https://wpfrcp.codeplex.com/releases/view/112327</a>.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2013-10-07T13:52:23.2-07:00"
}