{
  "ProjectName": "wpfrssfeedreader",
  "Title": "WPF RSS Feed Reader",
  "Description": "Using WPF, this application allows simple management of RSS feeds, allowing you to add feeds, export and import feeds.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">WPF RSS Feed Reader<br /><br />This was built in Visual Studio 2010 with .NET 4. In order to build the source you will need to install the Async CTP library from here: <a href=\"http://www.microsoft.com/en-us/download/details.aspx?id=9983\">http://www.microsoft.com/en-us/download/details.aspx?id=9983</a><br /><br />The current release is a simple RSS Feed Reader, allowing you to easily subscribe to web feeds, import and export feeds in OPML format.<br /><br />It has the following features:<br />\n<ol><li>Can add new folders</li>\n<li>Can move feeds into folders</li>\n<li>If first time running will load default feeds from IE</li>\n<li>Can mark all post as read on a feed</li>\n<li>Can view the properties of a feed - detailing home page and feed uri</li>\n<li>Manage feeds (add, add folders, delete, change refresh period of feeds)</li>\n<li>Drag and drop functionality</li>\n<li>Can rename the title of feeds via properties menu or rename context menu</li>\n<li>Can now mark all feeds within a folder as read (doesn&#39;t apply to folders within folders - i.e. only marks feeds in folder clicked as read, not feeds within a subfolder of the folder clicked)</li>\n<li>Can import/export feeds as OPML</li>\n<li>Can detect network connectivity</li>\n<li>Load IE feeds on first use of application</li></ol>\n<br />If there are any bugs please report them, or feature requests etc.<br /><br />I created this for fun in my spare time, hope someone finds it useful<br /><br /><img src=\"/projects/wpfrssfeedreader/64cd775f-58fd-4cf2-b7a6-02d281644e41\" alt=\"Screenshot.jpg\" title=\"Screenshot.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,RSS,.net,C#,WPf RSS,FeedReader,Feed,.NET 3.5,RSS Reader,",
  "LastEdited": "2012-07-16T09:07:31.98-07:00"
}