{
  "ProjectName": "playerframework",
  "Title": "Player Framework by Microsoft",
  "Description": "An open source, robust video player framework for Windows 10, Windows 8, HTML5, Silverlight, Windows Phone and other application platforms. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Player Framework: an open source media player framework for Windows and Windows Phone</h2>\r\n<h4><a href=\"https://playerframework.codeplex.com/releases/view/619329\">Player Framework 3.0.0.4 released which fixes issues with .NET Native Toolchain Compiling enabled on WinJS Release builds and continuous buffering of HLS streams in some WinJS apps (1/26/2016)</a></h4>\r\n<b>Project Description</b><br />An open source, robust video player framework for Windows 10, Windows 8, HTML5, Silverlight, Windows Phone and other application platforms. <br /><br /><img src=\"/projects/playerframework/0242fc3f-38cb-4b87-b4e0-5ee594bd6760\" alt=\"entertainment_theme.jpg\" title=\"entertainment_theme.jpg\" /><br /><br />Video players can be incredibly difficult to build. When developers require support for adaptive streaming, closed captioning, advertising standards integration, DVR-style playback control, and other advanced features, the complexity of their video player grows exponentially. Over the last few years at Microsoft we have helped build some of the most advanced video applications on the Web including the browser-based experience for the Beijing and Vancouver Olympics with NBC Sports, the last three seasons of NBC&#39;s Sunday Night Football (including the 2012 Super Bowl), the CBS March Madness college basketball tournament, Wimbledon, and a number of other major, live events with millions of simultaneous users. As a part of those projects we have developed one of the most powerful video players on the planet. And we&#39;ve decided to share it with everyone, for free. <br /><br />The Microsoft Media Platform&#39;s Player Framework is an open source video player that we continue to develop and evolve. It is available for Silverlight, HTML5, Windows Phone, Xbox, and now, in our latest release, Windows 10 UWP applications. And it&#39;s fully open source!<br /><br />The Player Framework supports a long list of advanced features including:\n<ul><li>Adaptive streaming and advanced playback heuristics via the <a href=\"https://visualstudiogallery.msdn.microsoft.com/1e7d4700-7fa8-49b6-8a7b-8d8666685459?SRC=Home\">Microsoft Universal Smooth Streaming Client SDK</a> for Windows 10 UWP applications</li>\n<li>Closed captioning support via SMPTE-TT and TTML</li>\n<li>Advertising standards support including VAST, MAST, and VPAID</li>\n<li>Advanced DVR-style playback</li>\n<li>Robust skinning and styling</li>\n<li>A number of other powerful features</li></ul>\n<br />Follow the links below to start building for each of these platforms:\n<ul><li><a href=\"https://playerframework.codeplex.com/wikipage?title=Player%20Framework%20for%20Windows%208%20Applications&referringTitle=Home\">Windows 8 Applications</a></li>\n<li><a href=\"https://playerframework.codeplex.com/wikipage?title=Player%20Framework%20for%20HTML5&referringTitle=Home\">HTML5</a></li>\n<li><a href=\"http://smf.codeplex.com/documentation\">Silverlight</a></li>\n<li><a href=\"http://smf.codeplex.com/documentation\">Windows Phone</a></li></ul>\n\n<h3>Additional information</h3>\r<ul><li>Learn about the <a href=\"http://www.microsoft.com/en-us/mediaplatform\">Microsoft Media Platform</a></li>\n<li>Check out Microsoft&#39;s Nigel Parker&#39;s post on <a href=\"http://blogs.msdn.com/b/nigel/archive/2011/09/02/how-to-navigate-the-html5-video-maze.aspx\">navigating the HTML5 video maze</a></li></ul>\n<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,windows phone,Metro,Video Player,Media,Player Framework,video,wp media streaming,",
  "LastEdited": "2016-01-28T14:50:02.663-08:00"
}