{
  "ProjectName": "symmetryXAML",
  "Title": "Symmetry XAML Plugins (Osiris Release)",
  "Description": "Got a bug you just can't crack?  Want to automate or customize something but the team will howl at you for checking it in?  Symmetry Plugins to the rescue!!!",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\n<br>\r\nA great way to get started building and understanding Plugins for Symmetry!&nbsp;\r\n<br>\r\n<br>\r\nThis project is designed to grow community involvement in EString Software's Symmetry for Windows 8 XAML all while adding useful plugins to the user community.&nbsp; Plugins extend the power of Symmetry by orders of magnitude.&nbsp;</p>\r\n<p><strong>Why use plugins?&nbsp; </strong><br>\r\nImagine you are working on a custom app that renders data from a feed (web service, rss, REST, etc).&nbsp; At any given time you may wish to examine how various components of your UI are reacting to the data.&nbsp; It's taking you way too long to keep tweaking\r\n the code, building, deploying, logging in, testing, navigating... etc.&nbsp; Without Symmetry you have to&nbsp;write custom code (into your build branch) to test these scenarios.&nbsp; This code will later have to be factored out.&nbsp;&nbsp;You decide to\r\n build a Plugin for Symmetry that helps you quickly load data sets from your feed into a list of buttons.&nbsp; Clicking a button pushes the given feed into the model.&nbsp; You can now test multiple scenarios very quickly and changing the data is no longer\r\n even a UI layer task.&nbsp; Even better, next time you publish the code to UAT, your testers can also just use the Symmetry Plugin to quickly regression test multiple data scenarios.&nbsp; You gain a bunch of time ($)&nbsp;back for your project.&nbsp;&nbsp;Your\r\n managers throw a party and make you the guest of honor.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Windows 8,xaml,Inspector,Plugin,PlugIns,Plugin Library,symmetry,estring,symbiant,.net,WinRT,Metro,Windows Phone 8,",
  "LastEdited": "2012-10-30T10:51:59.957-07:00"
}