{
  "ProjectName": "WinRTDatabase",
  "Title": "WinRT File Based Database",
  "Description": "This database is based on a file system in Windows 8 and is using WinRT (Windows Runtime) in Windows 8 environment and thus can be used for Metro style applications.  It includes simple, yet effective API that allows you to create tables based on classes. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Current version (0.6) support WinRT Release Preview<br /><br />This database is based on a file system in Windows 8 and is using WinRT (Windows Runtime) in Windows 8 environment and thus can be used for Metro style applications.  It includes simple, yet effective API that allows you to create tables based on classes.  Each database consists of any number of tables.  All operations are asynchronous to support Metro style operations on file system.  It also supports horizontal partitioning of tables to provide for smaller files and faster operations.  The usage of this software is very simple. You create a new database by calling CreateDatabase. You can add tables to the database by calling db.CreateTable&lt;T&gt; where T is the type of entity to be stored in table rows.  You can save either all tables by calling SaveAsync on database or one table at a time by calling SaveAsync on a specific table.  It supports await and async keywords. It supports data binding to list based controls, such as ListBox.<br />IsBusy property is added and can be used to maintain the state of Save button.  Please see QuickStart project that is part of the download for sample implementation of Save button and use of Busy status.  You can now store database in local or roaming folder.<br />You can install via NuGet - <i><b>Install-Package WinRT.DB</b></i> <br /><br />You can check out quick start guide here <a href=\"http://dotnetspeak.com/index.php/2012/04/update-to-winrt-database-project-2/\">http://dotnetspeak.com/index.php/2012/04/update-to-winrt-database-project-2/</a><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-06-24T10:34:39.17-07:00"
}