{
  "ProjectName": "barbarian",
  "Title": "COBOL the Barbarian: Multi-Language .NET Snippet Compiler",
  "Description": "COBOL the Barbarian is a multi-language .NET snippet compiler based on Jon Skeet's Snippy. The Barbarian compiles C# and VB, has a WPF user interface, and is written in COBOL. In principle it could be extended to compile additional .NET languages, and unmanaged code snippets.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\n<br>\r\nCOBOL the Barbarian is a multi-language .NET snippet compiler based on Jon Skeet's\r\n<a href=\"http://csharpindepth.com/Downloads.aspx\">Snippy</a>. The Barbarian compiles C# and VB, has a WPF user interface, and is written in COBOL. In principle it could be extended to compile additional .NET languages, as well as unmanaged code snippets.<br>\r\n<br>\r\n<strong>Intended Use</strong><br>\r\n<br>\r\nThe Barbarian is a lightweight utility for anyone who wants to compile and test short blocks of C# and VB.NET code. The adventurous user is encouraged to look under the hood and see how this has all been implemented in COBOL.<br>\r\n<br>\r\n<strong>Runtime and Development Requirements</strong><br>\r\n<br>\r\nThe Barbarian itself is lightweight, but to run it will require a few additional developer toys, which (except for the operating system) are available at no charge:</p>\r\n<ol>\r\n<li><strong>Windows Vista/XP/2000 (any version), Windows 7 Pro, or Windows 7 Ultimate:</strong> Note that in Windows 7, Net Express 5.1 Personal Edition can only be installed in\r\n<a title=\"Windows XP Mode\" href=\"http://www.microsoft.com/windows/virtual-pc/download.aspx\" target=\"_blank\">\r\nWindows XP Mode</a> (which unfortunately is not available for Windows 7 Home). In order to work together in Windows 7, all software listed below must be installed in Windows XP Mode. Performance is not great in Windows XP Mode, but it does work.\r\n</li><li><strong>NET framework 3.5:</strong> Self-explanatory. </li><li><strong>Visual Studio 2008 or Visual Studio Shell:</strong> This is a prerequisite, without which Net Express will not install. Express editions of Visual Studio do not meet this requirement, but if necessary you can install the free Visual Studio Shell\r\n as follows:\r\n<ol>\r\n<li>Download the integrated mode version of the shell <a href=\"http://www.microsoft.com/downloads/details.aspx?familyid=2E9A8C35-EB3D-43EB-9122-A5EC195CD7BB&displaylang=en\">\r\nhere</a>. </li><li>Run the &quot;installer&quot;. Note that all this does is extract the redistributable package.\r\n</li><li>Navigate to the new folder, C:\\VS 2008 Shell Redist\\Integrated Mode, and run vside.enu.exe. This will install the Visual Studio Shell, along with some runtime components for applications developed with Visual C&#43;&#43;. Once you have either Visual Studio 2008\r\n or the Visual Studio Shell installed, you can go ahead and install Net Express. </li></ol>\r\n</li><li><strong>Micro Focus Net Express 5.1 Personal Edition:</strong> This <a href=\"http://download.cnet.com/Net-Express-with-NET/3000-2069_4-10866201.html\">\r\nfree software</a> is your source for the required Micro Focus COBOL runtime DLLs. It will also enable you to create your own managed COBOL projects in Visual Studio, and native COBOL programs in Net Express. Bear in mind that the Personal Edition of this compiler\r\n and COBOL runtime are for personal use only. </li></ol>\r\n<p>Having met the requirements above, you may now either download and extract the pre-built EXE, or build the Barbarian from source in Visual Studio 2008. If running Windows 7, please note that you will have to run Barbarian.exe in Windows XP Mode, or launch\r\n Visual Studio 2008 in Windows XP Mode.</p>\r\n<p><br>\r\n<strong>History</strong><br>\r\n<br>\r\nCOBOL the Barbarian is the successor to Add One Snippy, which was a straight port to COBOL of the C# code for Jon Skeet's\r\n<a href=\"http://csharpindepth.com/Downloads.aspx\">Snippy</a>. FxCop demanded a strong name for the assembly, hence COBOL the Barbarian.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,C#,.NET 2.0,VB,console,WPF,RAD,compiler,Agile,c++/cli,.NET 3.5,snippy,snippet,Express Edition,barbarian,cobol,Micro Focus,compile,OOP,",
  "LastEdited": "2011-12-31T21:22:48.193-08:00"
}