{
  "ProjectName": "bend",
  "Title": "Bend",
  "Description": "Modern text editor. C#/WPF UX and Direct 2D editor surface.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<div id=\"one\">\r\n<div>\r\n<div>\r\n<div id=\"Title\">\r\n<h1>Bend</h1>\r\n<h3>A modern text editor for Windows.</h3>\r\n<h3>&nbsp;<img src=\"/projects/bend/1aab6040-0fb8-43f5-bd2f-d4d50c92608d\" alt=\"\" width=\"600\"></h3>\r\n<h3>Bend is a modern text editor.</h3>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n<div id=\"two\">\r\n<div>Bend is an editor that aims to be elegant, clean and a pleasure to work in. It exploits XAML / WPF / Direct 2D to render beautiful hardware accelerated text, with features tuned to balance performance and style. Download the latest version and take it\r\n for a spin. Bend is work in progress, expect bugs and occasional surprise features.&nbsp;<br>\r\n<br>\r\n<h4>Lightning fast.</h4>\r\n<h3><img src=\"/projects/bend/5425280a-c7b7-455f-9323-1b43304e4d43\" alt=\"\" width=\"600\"></h3>\r\nUsing a technique called virtualized display, Bend holds in memory just the lines you see on screen. When opening large files processing the lines not on screen is offloaded to a seperate thread. Infact Bend is faster than notepad at opening large files.&nbsp;<br>\r\n<br>\r\n<h4>Tabs.</h4>\r\nLike every good editor Bend has tabs but it doesnt stop there, Bend supports tear away tabs along with drag &amp; drop tab rearrangement. Speaking of drag &amp; drop, hold down ALT while starting a tab drag to drop the file to another application like Windows\r\n Explorer or Visual Studio. <br>\r\n<br>\r\n<h4>Settings.</h4>\r\n<h3><img src=\"/projects/bend/d2c11145-8172-4938-bdb0-1a9ed84e562d\" alt=\"\" width=\"600\"></h3>\r\nKnobs and buttons you can tweak to your taste. Choose a Theme, color Bend dark or Turn off line numbering. Everything you need is neatly hidden away behind the Bend logo.&nbsp;<br>\r\n<br>\r\n<h4>Search.</h4>\r\n<h3><img src=\"/projects/bend/6d07fbd4-98d3-419f-83e5-dcd769d37fe9\" alt=\"\" width=\"600\"></h3>\r\nFind on page is easy to reach on the top right. Ctrl &#43; H brings up the Find &amp; Replace dialog where you can do advanced Regex Search and Replacement. If you already know where to go - Ctrl &#43; G brings up the goto line number dialog. Find on page is fluid,\r\n asynchronous and never makes you wait for Bend to catch up.&nbsp;<br>\r\n<br>\r\n<h4>Misc.</h4>\r\nLots of careful touches that you will appreciate. Find dims the entire page to make the search results stand out. Instant Zoom (ctrl&#43;mouse wheel). Right click integration with Windows Explorer. File change monitoring, notifies if the file you are editing changes\r\n underneath you. Syntax highlighting for over 30&#43; languages, plus heuristics that detect the language as you type. Infinite Clipboard (Ctrl &#43; Shift &#43; Insert), never loose anything you copied within Bend.&nbsp;<br>\r\n<h4>Auto Update.</h4>\r\nBend is built on Microsoft ClickOnce technology and auto updates every 7 days, this makes sure you always have the latest and greatest.</div>\r\n</div>\r\n<div id=\"three\">\r\n<div>\r\n<h3>Prerequisites</h3>\r\n<ul>\r\n<li>Microsoft .NET Framework 4 Client Profile (x86 and x64) </li><li>Windows Installer 4.5 </li><li>Windows 8.1 should work on anything above Windows XP but tested on Windows 8.1 only\r\n</li><li>Visual C&#43;&#43; 2013 Runtime Libraries (x86) </li></ul>\r\n<h3>Disclaimer</h3>\r\n<div>This program is distributed in the hope that it will be useful, but without any warranty; without even the implied warranty of merchantability of fitness for any particular purpose. In simple terms, this software is use at your own risk. There is a distinct\r\n possibility of data loss if the software is defective and encounters a software bug before you save your work. Under no event will the author of the software be liable to you for any kind of damage.</div>\r\n</div>\r\n</div>\r\n<div id=\"four\">&nbsp;</div>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2015-07-11T23:50:08.223-07:00"
}