{
  "ProjectName": "bigmailer",
  "Title": "ASP.NET Upload Utility: Big Mailer",
  "Description": "Email something huge: The big mailer project allows you to upload large files to your website and then retrieve a convenient url for email and other uses.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Email something huge&#58; The big mailer project allows you to upload large files to your website and then retrieve a convenient url for email and other uses.<br /><br />I often have to send large files around by email. For example, I had to email a colleague a 10 MB file. It seems a little rude to hit him out of the blue with a 10 MB email. I wanted something cleaner and less intrusive.<br /><br />So I created a simple utility I called &quot;Big Mailer&quot;. This program consists of both a (WPF) client and (WCF / ASP.NET) server piece that simplifies uploading content to your web site. The program then gives you a regular web link you can send via email.<br /><br />Here&#39;s a screenshot:<br /><br /><img src=\"/projects/bigmailer/d70f74b3-4fc6-4a71-8751-e7d545b9b9cd\" alt=\"BigMailer.jpg\" title=\"BigMailer.jpg\" /><br /><br />If you&#39;d like to see the original post on my blog, here&#39;s the link:<br /><a href=\"http://www.michaelckennedy.net/blog/PermaLink,guid,3c1f1434-99ea-4b94-9411-d6227c7af1f1.aspx\">http://www.michaelckennedy.net/blog/PermaLink,guid,3c1f1434-99ea-4b94-9411-d6227c7af1f1.aspx</a><br /><br />You maybe be thinking that you can also just use FTP if you have that for your web site, but I hate FTP personally. I don&#39;t like fighting the firewall issues and I don&#39;t want it running on my servers.<br /><br />So this program allows you to upload content of unlimited size, without FTP, without sending your files to a third party, in a firewall friendly manor. Also, it sends everything in 16KB blocks, rather than one giant http message. So you get the benefit of both being able to send huge files (say 1 GB) and you get progress / cancel support.<br /><br />Because the back-end is a WCF service, you can integrate that with your ASP.NET websites as well. Here&#39;s an example where I use the discoverability features along with the service to show public files available. Note, this is a separate website pulling from the service:<br /><br /><a href=\"http://www.michaelckennedy.net/sharedfiles.aspx\">http://www.michaelckennedy.net/sharedfiles.aspx</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,WPF,wcf,Services,upload,clickonce,BigMailer WCF Large,Big Mailer,pkgod,",
  "LastEdited": "2008-07-11T08:13:56.197-07:00"
}