{
  "ProjectName": "BlakeNUI",
  "Title": "Blake.NUI",
  "Description": "Blake.NUI is a collection of helpful controls, utilities, and samples useful for multi-touch and NUI development with WPF 4 and Surface. Much of this code was used in samples in my book, Natural User Interfaces in .NET. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rBlake.NUI is a collection of helpful controls, utilities, and samples useful for multi-touch and NUI development with WPF 4 and Surface. Much of this code was used in samples in my book, Natural User Interfaces in .NET. <br /><br />Blake.NUI currently is focused on WPF 4 multi-touch development, including both Win7 Touch and Microsoft Surface. This scope may expand in the future as I create useful and interesting reusable components.<br />\n<h1>Features</h1>\r\nBlake.NUI contains several different types of components.\n<ul><li><a href=\"https://blakenui.codeplex.com/wikipage?title=Controls&referringTitle=Home\">Controls</a></li>\n<li><a href=\"https://blakenui.codeplex.com/wikipage?title=Gestures&referringTitle=Home\">Gestures</a></li>\n<li><a href=\"https://blakenui.codeplex.com/wikipage?title=TouchDevices&referringTitle=Home\">TouchDevices</a></li>\n<li><a href=\"https://blakenui.codeplex.com/wikipage?title=Common%20classes%20and%20utilities&referringTitle=Home\">Common classes and utilities</a></li>\n<li><a href=\"https://blakenui.codeplex.com/wikipage?title=NaturalShow&referringTitle=Home\">NaturalShow</a></li></ul>\n\n<h1>Getting started</h1>\r\nHead over to the <a href=\"http://blakenui.codeplex.com/SourceControl/list/changesets\">Source Code tab</a>, click the latest changeset, and download the source code. I would recommend just referencing the binaries from the /bin folder, but if you want to you can add the actual projects to your solution.<br />\n<h1>License</h1>\r<div style=\"clear:both;height:0;\">&nbsp;</div><a style=\"float:left;padding-right:.5em;\" href=\"http&#58;&#47;&#47;bit.ly&#47;NUIbook\"><img src=\"/projects/BlakeNUI/db06b10e-385a-473c-8317-131ccc38fe8a\" alt=\"Natural&#32;User&#32;Interfaces&#32;in&#32;.NET&#32;cover\" title=\"Natural&#32;User&#32;Interfaces&#32;in&#32;.NET&#32;cover\" /></a>I want to get this library out there and not restrict how it can be used, so I&#39;m making it available under the MS-PL. You should read the license, but basically it means you can do whatever you want with the code, including make modifications and use it in commercial products.<br /><br />I would request to every developer that uses Blake.NUI, especially for commercial projects, please buy my book, <a href=\"http://bit.ly/NUIbook\">Natural User Interfaces in .NET</a>. Feel free to try out the library first, of course. I&#39;m not making any money from open-sourcing this library, so buying my book is the best way to show support. If you buy it after clicking the link above, I&#39;ll get a few extra dollars.<br /><br />There is no way for me to enforce this, of course, so I consider it the honor system if you find Blake.NUI useful. If you have already bought a copy, thank you! Please recommend it to a friend or colleague.<br /><br /><br /><br />\n<h1>Feedback</h1>\rProvide feedback about the library. You post on the discussion tab or email me (joshblake at gmail dotcom) to let me what you like and what you don&#39;t like and what kind of project you&#39;re using it for.<br />\n<h1>Warning</h1>\rAll of the code should be considered alpha status. I&#39;m still refactoring certain parts as I use this library in my book and in other projects. At this point in time, I will make no attempt to avoid breaking changes. If you use the library, you may need to make updates to your code if you update to a newer version. I will commit to documenting changes as I go, so that users can keep up. I&#39;ll update this status in the future as the library stabilizes.<br /><br />There is also no formal documentation aside from links from this wiki and the <a href=\"http://blakenui.codeplex.com/Thread/List.aspx\">discussion forum</a>. I will be working on documentation as the code refactoring settles down. If you want to see this library in action, then you should check out my book.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,WPF Gestrue,",
  "LastEdited": "2011-01-20T01:13:02.643-08:00"
}