{
  "ProjectName": "cmsresponsive",
  "Title": "CMS .NET",
  "Description": "CMS .net HTML5 multilingual+FORUM+GALLERY+Responsive Web Design+WIKI+COMMUNITY: Easy user-friendly, fast 10X,;multi site in different domain; multi server",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Stand-lone (portable) &amp; Responsive Web Design .NET CMS in <b>HTML5</b> style with forum <b>database-less</b> (No database = no problem!), it’s a free and open source HTML5 (with support of rich snippet microdata by schema.org) web platform <b>multilingual</b> appositely formed to overcome the single site management, allowing a whole network implant, composed by <b>countless web sites</b>, provided with <b>forum</b>, <b>gallery</b> (photos album), social utilities, all of this install application only once on a shared hosting, supported by ASP.NET. It isn’t a simple CMS, because of utilities within that go over and above editing and content format. Web application releases his power by advanced technologies multi-threading that, combined to new technology introduced by multi-core processors, maximize each function in order to give an unique and one-off surfing experience to the visitor. The latest version application combines sophisticated algorithms that nullify query’s latency period (database aren’t there at all!), permitting a fluidity navigation up to 10X speed, quickness obtained thanks to the algorithm incredible power that elaborate dynamically the contents.<br /><br />Online support: <a href=\"http://cmsaspnet.com/forum.aspx\">http://cmsaspnet.com/forum.aspx</a> (<b>NOTE:</b> The support forum is made with this application!)<br /><br /><img src=\"http://www.w3.org/html/logo/downloads/HTML5_Logo_64.png\" /><br /><br />Features:<br /><br />Free for all purpose (no license required)<br />Responsive Web Design CMS<br />High front-end Accessibility: Responsive and <b>no dependence on client side technology</b> like JavaScript (no jQuery, not Ajax, etc..), no ActiveX, no Java<br />PDF dynamic generator<br />Forum software<br />Wiki<br />Gallery<br />Multi domain &amp; multi website<br />Community<br />Multilingual<br />Very fast<br />No database configuration<br />SEO<br />Chat<br />Chat robot programmable<br />Weather<br />Translator<br />Currency excange<br />News aggregator<br />Blog aggregator<br />Template polyvalent (work on mobile devices, tablets, handhelds)<br />Adsense ready<br />PayPal IPN integration<br />HTML5 validation OK!<br />Template<br />Commentary<br />Multi role: Supervisor &gt; Webmaster &gt; Admin &gt; User senior &gt; User &gt; Visitors &gt; Banned<br />Dynamic sitemap<br />Dynamic RSS<br />Full microdata semantic of SCHEMA.ORG by Google<br />Easy to use<br />Free user support - assistance online 24/24<br />10 Specials plugins in source code format<br />Free developer support<br />YouTube video channel synchronization<br />EXIF and Geolocation<br />Dynamic photo effect: Sepia, Polaroid, RayBan, Vintage, ecc..<br />Customer care software (online ticket support service)</div><div class=\"ClearBoth\"></div>",
  "TagList": "CMS,Chat,Community,SEO,Accessibility,Exif,PlugIns,gallery,Fast,multilingual,easy to use,forum software,HTML5,Multi domain,multi website,database-less,News aggregator,Blog aggregator,Dynamic sitemap,microdata,rich snippets,YouTube channel,Dynamic photo effect,responsive design,fluid,tickes system,.NET 4.0,.NET,CMS .NET,.NET CMS,CMS ASP .NET,",
  "LastEdited": "2012-12-18T04:11:01.427-08:00"
}