{
  "ProjectName": "cnzklibrary",
  "Title": "CNZK Library",
  "Description": "Web library of reusable components and classes for ASP.NET, Silverlight and WPF Projects, containing image thumbnailers, helpers, behaviors, controls...\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Web library of reusable components and classes for ASP.NET, Silverlight and WPF Projects, containing image thumbnailers, helpers, behaviors, controls...<br /><br /><br />The <b>ASP.NET download</b>, contains only the default ThumbnailHandler, which is a HttpHandler designed to create thumbnail images in the easiest way possible. The thumbnail is generated by simply appending a &quot;suffix&quot; to the original image URI. See the following example to better understand the concept. <br /><br />Original Image URI:<br />img/original-image.jpg<br /><br />Resized Image URI:<br />img/original-image.jpg.200x150.thumb.axd<br /><br />When you use this default ThumbnailHandler, the thumbnail is always resized proportionally to its original. When the desired image proportions are diferent from the original proportions, there will be borders on the sides or top and bottom of the new image to make it of the desired size without distortion. The resized image is cached in memory, to avoid overloading the server CPU. When the original image does not exists, it will be generated an image with the desired proportions and a customizable text (for example, &quot;Image not found.&quot;), or you can provide a placeholder image. <br /><br />This handler is extensible, effectively enabling you to create your own strategy for parsing the url, finding and opening the original file. In fact, the default ThumbnailHandler is already implemented as an extension. I&#39;ll post another sample extension soon that loads imagens stored in a database table.<br /><br />The <b>Silverlight download</b> contains a behavior for filtering Deep Zoom collections and an Action to Toggle the FullScreen state of the application.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET 2.0,web development,ASP.NET,Webcontrols,silverlight,Behaviors,",
  "LastEdited": "2012-05-03T04:27:12.767-07:00"
}