{
  "ProjectName": "csharpgdiplus11",
  "Title": "GDI PlusX (C# GDI Plus 1.1 - Effects, Histogram ...)",
  "Description": "C# GDI Plus 1.1 provides access to the GDI+ 1.1 functions which are available from Vista onwards. These functions include: Effects, Histograms, Palette creation, and more. Developed in Visual Studio Express 2008.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />C&#35; GDI Plus 1.1 provides access to the GDI&#43; 1.1 functions which are available from Vista onwards. These functions include&#58; Effects, Histograms, Palette creation, and more. Developed in Visual Studio Express 2008.<br /><br /><br />I found that there was quite a bit in GDI+ 1.1 which is not implemented in the standard Graphics namespace for .NET languages. I decided to write some extension methods to allow for the new functionality.<br /><br />It provides this functionality as a fully Managed code set:<br />\n<ul><li>Fast polygon drawing using selective indexes from arrays</li>\n<li>Getting histograms from Bitmaps</li>\n<li>Apply effects to Bitmaps / creating a new Bitmap from a bitmap and an effect.</li>\n<li>Drawing images with effects</li>\n<li>Effects: Blur, Sharpen, Tint, RedEyeCorrection, ColorMatrixEffect, ColorLUT, BrightnessContrast, HueSaturationLightness, ColorBalance, Levels, ColorCurve</li></ul>\n<br />Included in the source is a library project (GDIPlusX) and a Demo project.<br /><br />Everything is implemented seamlessly with the standard System.Drawing namespace using extension methods.<br /><br />GDI Plus 1.1 functions are only  available on Vista or above client machine, however, the library now has full support for legacy mode, which allows all effects to run on the CPU if GDI Plus 1.1 is not found, you can of course detect whether GDI Plus 1.1 is available or not using the library, please see the code to the form in the demo for more information.<br /><br />Any comments / suggestions welcome.<br /><br />These things have currently been implemented:<br />\n<ul><li>All Effects classes</li>\n<li>Legacy mode for all effects</li>\n<li>Getting histograms from Bitmaps</li>\n<li>Apply effects to Bitmaps / creating a new Bitmap from a bitmap and an effect.</li>\n<li>Drawing images with effects</li></ul>\n<br />Things left to implement:\n<ul><li>More overloads to make some functions easier to call (ie Destination rect on DrawImage with Effect)</li>\n<li>Palette creation from Bitmap</li>\n<li>Convert format of bitmap</li></ul>\n<br /><img src=\"/projects/csharpgdiplus11/6e118618-bc70-49cb-a882-abb39ce46480\" alt=\"screenshot.PNG\" title=\"screenshot.PNG\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "GDI+ 1.1,GDI Plus 1.1,Effects,c#,.NET 3.5,GDIPlusX,Image Histogram,Blur,Sharpen,Red Eye,",
  "LastEdited": "2011-06-22T18:23:55.11-07:00"
}