{
  "ProjectName": "d3stockchart",
  "Title": "D3 Stock Chart",
  "Description": "A derived version of the original Dynamic Data Display by Microsoft Research solely dedicated for stock charting. Suitable for simple trading system.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nA derived version of the original Dynamic Data Display by Microsoft Research solely dedicated for stock charting. Suitable for simple trading system.</p>\r\n<p>The original Dynamic Data Display has a rich of features. However, it appears that the project has been abandoned since 2009. Thats why I created this fork. Features unrelated to stock charting (e.g pie chart, contour, etc) have been intentionally removed.\r\n &quot;Ya Aint Gonna Need It.&quot; This project has been re-purposed, refocused, refactored, solely for charting stock price only.</p>\r\n<p><strong>Ready to Use<br>\r\n</strong>It is currently stable, ready for immediate use. It is using .NET Framework 4. Although the solution is under Visual Studio 2013, it should work with Visual Studio 2010 as well. To see it in action, download the source code, set\r\n<strong>D3StockChart.Tester</strong> as a startup project, and launch it. I have personally used it in my trading software in the last 3 years.</p>\r\n<p>&nbsp;</p>\r\n<p><img src=\"/projects/d3stockchart/b3ba3c5b-56a2-446b-9628-a53388495370\" alt=\"\" width=\"522\" height=\"347\"></p>\r\n<p>&nbsp;</p>\r\n<p><strong>Limited Help<br>\r\n</strong>I have a family and full-time job. However, if you have a code snippet that has been consistently producing the bug, I might have some time to help you out. Of course, as stated in the license page, *use it at your own risk*.</p>\r\n<p><strong>To Do<br>\r\n</strong>Currently this library only supports line chart. There are definitely more to do (candlesticks, overlays, etc). If you are interested to help out, let me know.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Stock Chart,C#,WPF,",
  "LastEdited": "2014-03-04T18:35:52.46-08:00"
}