{
  "ProjectName": "dathanliblikdepo",
  "Title": "DepO WPF Dependency Object Visualizer",
  "Description": "DepO is a visualizer for Microsoft Visual Studio that enables you to view the Logical and Visual DependencyObject hierarchies and any node's properties when debugging WPF applications.  Supports both Dependency Properties, and regular properties, and for Dependency properties, tracks Base Values, Expressions, Animation, and Coercion.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />DepO is a visualizer for Microsoft Visual Studio that enables you to view Logical and Visual DependencyObject hierarchies, plus associated property values -- both normal and DependencyProperty-based -- when debugging WPF applications.  DepO has been developed to be FAST because VS only allows visualizers to use a small amount of time per operation, including initialization of the visualizer&#39;s own UI.  This means that heavier, more full-featured WPF Visualizers get repeatedly disabled by VS for taking too long (a pain when you are mid-way through debugging a complex issue).<br /><br />The visualizer displays information about who set DependencyProperty values: whether locally, from a default style template, from inheritance, from parent templates, etc., and also how they were set and overridden: by Base Value (B), Markup Expression (E), Animation (A), and Coercion (C).  To show overrides, a progressing value chain is displayed.  For example, a value set by a combination of base value, markup expression (i.e. binding), and finally coercion will show as B-&gt;E-&gt;C meaning the property has a base value, was also set with an expression, and finally was coerced.<br /><br /><img src=\"/projects/dathanliblikdepo/ff503463-88d3-47f3-a8f8-c4a258d73334\" alt=\"DepO_1.PNG\" title=\"DepO_1.PNG\" /><br /><br />To &#39;use&#39; this project, you must install the .dll (see Releases tab) in the appropriate directory for Visual Studio (restart Visual Studio if it&#39;s running):<br /><br /><i>Visual Studio 2008</i>: C:\\Program Files\\Microsoft Visual Studio 9.0\\Common7\\Packages\\Debugger\\Visualizers<br /><br />To activate the visualizer, click on the small magnifying glass that appears beside any DependencyObject (or derived object) in your Locals window, etc.  For example, Window1 in the typical WPF project derives from DependencyObject, and so you will see the small magnifying glass beside it when it is in the Locals window (it may be called &#39;this&#39; if your breakpoint is in Window1.xaml.cs):<br /><br /><img src=\"/projects/dathanliblikdepo/5ed0e3c7-e059-43db-bb62-5577288f85f6\" alt=\"DepO_2.PNG\" title=\"DepO_2.PNG\" /><br /><br />You can also activate the visualizer while debugging by hovering over any DependencyObject derived object in your code and clicking on the small magnifying glass that appears there.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "debugging,WPF,xaml,.net 3.0,debugger visualizer,visualizer,.NET 3.5,MyList,Orcas,Visual Studio 2008,Useful,vs2008,VS2008SP1,VS2010,UI Testing,",
  "LastEdited": "2008-02-25T06:26:27.897-08:00"
}