{
  "ProjectName": "desktopgooglereader",
  "Title": "Desktop Google Reader",
  "Description": ".NET / WPF client for Google Reader RSS agregator service. Shows unread items with basic functionality and various social network integrations. \r\nHas Outlook-like new item notification functionality standalone as well as using Snarl (http://www.fullphat.net(",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Desktop Google Reader</h1>\r\n<b>IMPORTANT: Read the latest news down on this page about Google Reader discontinuation</b><br /><br />Desktop Google Reader was a desktop client to Google&#39;s popular RSS agregator services. It was focused on on the most important things you do with Google Reader - read, mark as read and starr items. In addition and in combination with the notification system Snarl (see <a href=\"http://www.fullphat.net/\">http://www.fullphat.net/</a> it gave you nice popup notifications on your newly arriving news feed items.<br /><br />It needs the <b>.NET framework 3.5 SP1</b> in order to run.<br />\n<h1>Screenshots</h1>\r<img src=\"/projects/desktopgooglereader/47d5843a-c31e-4543-9434-230bc06a50a2\" alt=\"snarl_1.png\" title=\"snarl_1.png\" />      <img src=\"/projects/desktopgooglereader/c9e8eeeb-68d0-40f2-bf5b-180532db15af\" alt=\"snarl_2.png\" title=\"snarl_2.png\" />      <img src=\"/projects/desktopgooglereader/e3dd93d0-4151-4b1a-ac9b-4e26b6da18dc\" alt=\"snarl_3.png\" title=\"snarl_3.png\" />      <br /><i>Example notifications using Snarl.</i><br /><br /><img src=\"/projects/desktopgooglereader/b64ccfe5-f7ab-4773-bdce-948248324b1d\" alt=\"DesktopGoogleReader1.3.png\" title=\"DesktopGoogleReader1.3.png\" /><br /><i>Main window</i>\n<hr />\n<a href=\"http://www.softpedia.com/progClean/Desktop-Google-Reader-Clean-134357.html\"><img style=\"border:none;\" src=\"http://www.softpedia.com/base_img/softpedia_clean_award_f.gif\" alt=\"100% CLEAN Certified by Softpedia\" title=\"100% CLEAN Certified by Softpedia\" /></a>  <a href=\"http://www.softsea.com/review/Desktop-Google-Reader.html\"><img style=\"border:none;\" src=\"http://www.softsea.com/images/pro-logo-5stars.gif\" alt=\"Reviews on SoftSea\" title=\"Reviews on SoftSea\" /></a>\n<hr />-\n<h1>News</h1>\r<h1>Desktop Google Reader and Feedly 2013-06-18</h1>\rWhile finishing the code of my new Open Source library with Feedly retrieval I made a hard but I think in the end good decision: Desktop Google Reader is dead! :(<br /><br />But don&#39;t worry as it is getting a <b>better successor</b> which is called <b>Mener&#233;</b>. In fact Mener&#233; is already available for download at <a href=\"http://www.li-ghun.de/menere/\">http://www.li-ghun.de/menere/</a> featuring Fever support and will get Feedly as soon as the API gets public.<br /><br />While Mener&#233; will be paid software (5.99 EUR) I will add all features Desktop Google Reader has today (like unread items, Snarl notifications, sending to various services and so on) to the free version - I promissed you get a new client and you&#39;ll get it - and as promissed for free!<br /><br />The auto update of Desktop Google Reader will then point to Mener&#233; - please don&#39;t feel stressed to pay for Mener&#233; - just do so if you like to support me (or if you you want one of the new features).<br /><br />That said as long as Mener&#233; is lower than version 1.0 (current state: 0.6) all features are available in the free version (to be honest: there is no code for license handling available).<br /><br />Desktop Google Reader is here and will stay Open Source as well as the new library I am writing for Feedly (and other RSS services) at <a href=\"https://github.com/liGhun/RSSharp\">https://github.com/liGhun/RSSharp</a> - so if anyoine would like to pick up I would offer quite some help.<br /><br />Background: The API of Feedly is more modern (and nice) than the one of Google Reader and in fact to make it right it would have been a rewrite of 80% of the code - code being four years old from a time when I started doing Desktop development...<br />\n<h1>Desktop Google Reader and the end of Google Reader API 2013-03-29</h1>\rJust a short update: Desktop Google Reader will be migrated to another service in time for the closing of Google Reader API. There is a service (Feedly) which plans to make the transition from the Google Reader API to their API very smooth so I gonna invest that time :)<br /><br />And about my successor of Desktop Google Reader: it&#39;s still in the planning but with the current dramtic changes in RSS it might get speed again soon :)<br /><br />Stay tuned...<br />\n<h1>Desktop Google Reader 1.4 has been released (&quot;Going WebKit&quot;) 2011-04-11</h1>\r<ul><li>Removed both the originally integrated Internet Explorer (which was quite bad) and the Chromium engine (which was unstable) by WebKit .NET (which is fast, renders fine and is stable)</li>\n<li>Added an additional button to toolbar to view full article (same function as the link on bottom right of the content)</li>\n<li>Toolbar now with separate parts which can be reorderd</li>\n<li>Some minor bugfixes like possible crash dialog on closing the application fixed</li></ul>\n\n<h1>Desktop Google Reader 1.4 and the future</h1>\r\nI am quite sure you noticed we didn&#39;t hold the pace have had between the first beta releases and the 1.3 releases with new updates every few weeks. There are two main reasons - first it does everything I need for myself already and second I am focused currently on two other projects (as they are not open source I don&#39;t wanna link them here - I don&#39;t think advertisement should be done i this place).<br /><br />When the second of those projects (the first is already next to an 1.6 release) finally hits the road this spring (I hope) I plan to get back to Google Reader again with more time. Until than I plan to release an intermediate release 1.4 with some minor bugfixes (see the sourcecode checkins here on this page) and using Webkit instead of Chromium (which is to much unstable in my opinion - ever tried to do a double click in the content area? Don&#39;t do so...).<br /><br />I think there won&#39;t be a real &quot;Desktop Google Reader 2.0&quot; anymore here. Sounds bad? What I mean is that I want to do it new from scratch and create a feature complete Google Reader client (not only the unread items but also read, starred, liked, shared, ...). Those changes (and my greatly grown knowledge in using WebServices and WPF) will let it be a complete new project where I start from scratch. So I think it won&#39;t take over the project here but be an own, fresh one. Stay tuned :)<br />\n<h1>Desktop Google Reader 1.3.1 More Social has been released.</h1>\r\nWhat&#39;s new since 1.3:\n<ul><li>Hotfix: New authentication method of Google Reader</li>\n<li>Added some more social networks\n<ul><li>Facebook</li>\n<li>Posterous</li>\n<li>del.icio.us</li>\n<li>Diigo</li></ul></li>\n<li>Fetch 1000 (and not only 100) items</li>\n<li>Some performance tweaks</li>\n<li>Mark as read button now can handle multiple items</li>\n<li>The item title above the content area is now always only one line</li>\n<li>The interface has been slightly enhanced</li>\n<li>Completly new about window</li></ul>\nThis release is planned to be the last release in the 1.x series of Desktop Google Reader. The work on Desktop Google Reader 2.0 with a completely rewritten foundation in about to start very soon.<br />\n<h1>Desktop Google Reader 1.3.1b2 released to cover login issues (2010-07-03)</h1>\rGoogle just changed the way how to authenticate the user using a token. The last stable version 1.3 was unable to connect to Google Reader. Please download the newest version 1.3.1b2 at <a href=\"http://desktopgooglereader.codeplex.com/releases/view/48268\">http://desktopgooglereader.codeplex.com/releases/view/48268</a> to get back a working Google Reader client.<br />Sorry for the inconvenience<br /><br />What&#39;s new since 1.3:<br />Hotfix: New authentication method of Google Reader<br />Google changed the authentication method so this Beta 1 had to be released a little bit earlier than planned. Some interface elements will look not 100% finished but working.<br />\n<ul><li>Add some more social networks\n<ul><li>Facebook</li>\n<li>Posterous</li>\n<li>del.icio.us</li>\n<li>Diigo</li>\n<li>=&gt; they miss some finer posting settings until now (as Twitter does already where you can change the text before posting)</li></ul></li>\n<li>Rework the social networks preferences pane (not included in Beta 1)</li>\n<li>Fetch 1000 (and not only 100) items</li>\n<li>Some performance tweaks</li></ul>\n<br />Bugfixes<br />\n<h1>Version 1.3 - the social release - released (2010-03-16)</h1>\rNew Features:\n<ul><li>Sharing</li>\n<li>Liking</li>\n<li>Mail item</li>\n<li>Labels / Tags</li>\n<li>Send to Twitter</li>\n<li>Read It Later <a href=\"http://readitlaterlist.com/\">http://readitlaterlist.com/</a></li>\n<li>Instapaper <a href=\"http://www.instapaper.com/\">http://www.instapaper.com/</a></li>\n<li>Favicons of feeds shown</li>\n<li>Integrated Chromium browser now has forward / backward controls</li>\n<li>Item title are stripped (no HTML in there anymore)</li>\n<li>Fixed a bug in save/restore of settings (in some environments always old settings had been restored)</li></ul>\n\n<h1>Version 1.3 Beta 1 released (2010-02-23)</h1>\rNew features:\n<ul><li>Read it Later included (see <a href=\"http://readitlaterlist.com/\">http://readitlaterlist.com/</a>)</li>\n<li>Liking added (working: see number of liking users, see if liking yourself, add to liked items)</li>\n<li>Change tags/labels added (fully working but changes not shown in GUI until now)</li>\n<li>Sharing added (sharing works - comments for sharing not - changes not shown in GUI until now)</li>\n<li>Included Chromium browser has now back and forward buttons</li>\n<li>HTML is now stripped from item titles</li></ul>\n<br />This is a <b>real beta release</b> meaning all the new features may cause some unexpected behavior at the moment. Read It Later support should be working completely already <br />see <a href=\"http://desktopgooglereader.codeplex.com/releases/view/40920\">http://desktopgooglereader.codeplex.com/releases/view/40920</a><br />\n<h1>Version 1.2 released (2010-01-28)</h1>\r<b>New features</b><br />Improved user interface<br />Many new options in the now separate preferences dialog<br />New notification class showing the number of new items<br />If a news item has an image as enclosure this is used in the notification instead of the generic RSS icon<br />integration of the Chromium web rendering engine (which is used by Google Chrome) which is much faster and better than the included with Windows<br />Automated update notification if newer version of Desktop Google Reader is released<br />(Optional) minimize to tray<br />Option to directly show the full web page of the item instead of summary in the news feed if\n<ul><li>this is activated within the preferences in general,</li>\n<li>this is activated within the preferences for empty summeraries and/or,</li>\n<li>the summary is simply just the same as the title</li></ul>\nCustom proxy settings<br />Password is now saved encrypted<br />Date and time of news item now displayed next to the title<br />Snarl notification icon can now be an image within the summary of the feed item (can be disabled in Preferences)<br />You now can change the Snarl notification title and text to contain different parts of the feed item<br />Multiple newlines are now merged to a single one in notifications<br />Automated update now enabled for beta / non beta updates (has been always all before)<br />Right clicking a Snarl notification now should mark an item as read as well as remove it from the main window immediatly<br />Summarized Snarl notification now uses &quot;item&quot; if it&#39;s only one new and &quot;items&quot; if there more than one<br />Settings are now migrated on update<br />Improved speed of parsing for Snarl notifications (using own threads now)<br />Subscribe to new feed window now closes automatically after four seconds if subscription has been successfull<br />Unsubscribe from feed added<br />\n<h1>Version 1.2 Beta 1 released (2009-11-14)</h1>\rToday we announce the immediate availability of the first beta of our next version of Desktop Google Reader. There is a very long of changes - find the most important below and the complete list at <a href=\"http://desktopgooglereader.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=35544\">http://desktopgooglereader.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=35544</a>\n<h2>New features since release 1.1:</h2>\r<ul><li>Greatly improved user interface</li>\n<li>Many new options in the now separate preferences dialog</li>\n<li>New notification class showing the number of new items</li>\n<li>(Experimental) integration of the Chromium web rendering engine (which is used by Google Chrome) which is <b>much</b> faster and better than the included with Windows</li>\n<li>Automated update notification if newer version of Desktop Google Reader is released</li>\n<li>(Optional) minimize to tray</li></ul>\n<br />And much more - see <a href=\"http://desktopgooglereader.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=35544\">http://desktopgooglereader.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=35544</a><br /><br />Let us know if you like the changes - the list of ideas and wishes stays long :)<br /><br /><img src=\"/projects/desktopgooglereader/b1449cb7-215a-4b10-a6ec-376171b76531\" alt=\"DesktopGoogleReader1.2_TrayIcon.png\" title=\"DesktopGoogleReader1.2_TrayIcon.png\" />           <img src=\"/projects/desktopgooglereader/2fdf8296-1cb5-47ed-a892-40f5b9718618\" alt=\"DesktopGoogleReader1.2_Preferences.png\" title=\"DesktopGoogleReader1.2_Preferences.png\" />      \n<hr />\n<h1>Version 1.1 released (2009-10-03)</h1>\rMany improvements in many points for the daily usage. Try out navigating through your items using the arrow keys as well as the delete key.<br />See <a href=\"http://desktopgooglereader.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=33911\">http://desktopgooglereader.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=33911</a> for all changes in this release\n<hr />\n<h1>Version 1.0 released (2009-09-05)</h1>\rWe are very, very happy to finally ship today the first final version of Desktop Google Reader. It has been tested as much as possible (being our own main RSS reader) and as far as we can say the features included seem to work without any problems.\n<h2>New features compared to the last Beta 4:</h2>\r<ul><li>Button to mark all items as read at once</li>\n<li>Button to mark all items from one feed as read at once</li>\n<li>Title of currently displayed item displayed seperatly</li>\n<li>Some interface refinements</li></ul>\n<br />While this 1.0 version is out the work on 1.1 with some more features has already been started...\n<hr />\n<h1>Version 1.0 Beta 4 has been released (2009-08-14)</h1>\rMain new feature of this release is an automated setup and uninstaller.<br />It also fixes some minor issues.\n<hr />\n<h1>Version 1.0 Beta 3 has been released (2009-08-13)</h1>\rWe are very happy to announce today the third beta version of our Desktop Google Reader.\n<h2>New in this release</h2>\r<ul><li>Snarl notification system support (see <a href=\"http://www.fullphat.net/\">http://www.fullphat.net/</a>)\n<ul><li>Click on the notification with the left mouse button to open the source news in your default browser and with the right mouse button to mark it as read</li></ul></li>\n<li>Polling interval can be changed</li>\n<li>You can subscribe to a new feed directly in Desktop Google Reader</li>\n<li>You can limit the text length displayed in a Snarl notification</li>\n<li>Interface has been reworked</li>\n<li>About page has been added</li>\n<li>Refresh now button added</li>\n<li>UTF-8 characters are now shown correctly</li>\n<li>Some issues on bad Internet connections resolved</li></ul>\n<br />Please let us know how this version is doing for you<br />\n<h2>Additional features planned for the first Release Candidate</h2>\r<ul><li>Mark all items in one feed as read</li>\n<li>Mark all items in all feeds as read</li>\n<li>A little bit more interface cleanup</li>\n<li>Setup program</li></ul>\nRelease Candidate 1 is rescheduled now for first half of September</div><div class=\"ClearBoth\"></div>",
  "TagList": "RSS,.NET,C#,WPF,csharp,google reader,RSS Reader,snarl,notifications,Desktop GoogleReader,http://feed.x-berry.,",
  "LastEdited": "2013-06-19T06:41:35.783-07:00"
}