{
  "ProjectName": "dmxshader",
  "Title": "Damix Shader Collection",
  "Description": "A collection of ready to use, well-documented, open-source shaders. You can use them to add effects to your existing shader-enabled 3D engine (games, CAD, scientific visualization...). They can be used in both open-source and commercial programs.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A collection of ready to use, well-documented, open-source shaders. You can use them to add effects to your existing shader-enabled 3D engine &#40;games, CAD, scientific visualization...&#41;. They can be used in both open-source and commercial programs.<br /><br />I have encountered a problem during the development of the grass shader; the problem is described in a post on gamedev.net:<br /><br /><a href=\"http://www.gamedev.net/community/forums/topic.asp?topic_id=511926\">http://www.gamedev.net/community/forums/topic.asp?topic_id=511926</a><br /><br />(the presented source code may be a little different from the one released on codeplex, but they have the same bug)<br /><br />At a very basic level the shader is working, but there may be a sort of driver problem with my developmente machine. I need people to test the shader on different configurations, so maybe we will understand what&#39;s going on in the GPU. It shouldn&#39;t be completely my fault, since with the reference device everything is going fine.<br /><br />I also started the development of the other shaders; I will try to release as soon as I can 10 HLSL shaders for DirectX 9; those marked with an X are already in development and they are more or less running fine.<br /><br />X Grass shader<br />X Fur shader (concentric shell method)<br />X Normal mapping<br />X Parallax mapping<br />X Water reflection normal mapping<br />   Water reflection parallax mapping<br />X Glass (normal/reflection/refraction) shader<br />X Edge detection<br />   Vertex motion blur<br />   Bloom<br /><br />Hopefully I will also be able to prepare a decent source package, with included the Visual C++ Express project file, and add it to the CodePlex repository.<br /><br />Thanks for downloading the grass shader! Come back soon, you won&#39;t be disappointed!<br /><br />Dario :-)</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2008-10-23T13:10:34.96-07:00"
}