{
  "ProjectName": "DNAide",
  "Title": "DNAide",
  "Description": "A framework of useful aide (helper) methods targeting web developers including a powerful but easy to use url rewriter, image manipulation (thumbnails, effects, easy to create text based images), sitemap enhancements integrating with seamlessly with the url rewriter, webcontrols, as well as more lower level type conversion helpers etc.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>DNAide (.NET Aide)</h1>\r\n<a href=\"http://www.dnaide.com\">http://www.dnaide.com</a><br /><br />DNAide is a FREE suite of .NET 2.0. helper controls and methods that are here to make your ASP.NET development easier.<br /><br />By using DNAide within your ASP.NET websites you will have access to:<br /><br /><br /><b>Image Manipulation</b><br />\n<ul><li>Resizing, cropping and more advanced filters and effects such as blur, sharpen, greyscale, pixellate etc.</li>\n<li>Dynamic text based images. DNAide will generate dynamic text based images for you and can even be used as an image replacement technique for content in your XHTML tags.</li></ul>\n<br /><br /><b>Friendly URLs and Sitemap Enhancements</b><br />\n<ul><li>A handy URL rewriting module for making your website&#39;s URLs user friendly and memorable; all of which can help your website&#39;s SEO (Search Engine Optimisation) strategy!</li>\n<li>As well as standard url rewriting features (regular expression pattern matching, rewriting, permanent redirects, temporary redirects etc.), what makes DNAide&#39;s rewriter stand out from the crowd is the integration with ASP.NET 2.0.&#39;s sitemap functionality. Through additional sitemap node attributes, you can define rewriting / redirect rules. For example, in theory you could run your site may run off one .aspx webform. Via your sitemap, you can specify your website structure and unique page urls with each page rewritten to the one .aspx webform. </li></ul>\n<br /><br /><b>Javascript &amp; CSS</b><br />\n<ul><li>Automatically compress your .js files! </li>\n<li>Improves upon Page.ReisterClientScriptBlock, you can register your JavaScript includes/blocks of script in the head of your XHTML output as well as any other location in your page.</li>\n<li>DNAide comes complete with a number of built in JavaScript resources such as jQuery, SWFObject as well as custom built scripts for image preloading, ValidationAide (form validation) and AJAXAide to name a few.</li>\n<li>As well as ScriptAide, DNAide also includes a complimentary StyleAide which is used for registering cascading stylesheets etc.</li></ul>\n<br /><br /><b>Other Nice Stuff</b><br /><br />DNAide provides a number of other useful controls and functions including:<br />\n<ul><li>Additional controls such as &quot;FlashMovie&quot; (a webcontrol for embedding your flash movies using SWFObject) and Hyperlink Pager.</li>\n<li>A number of &quot;plumbing&quot; methods easing such things as type conversion, string manipulation methods etc.</li></ul>\n<br /><br />For more information, please visit <a href=\"http://www.dnaide.com\">http://www.dnaide.com</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,SubSonic,css,.NET 2.0,Framework,Toolkit,Library,utility,collections,cool,imaging,URL Rewriting,webcontrols,sitemap enhancements,GDI,DNAide,thumnails,jQuery,elements,image processing,ASP.NET 2.0,asp.net controls,useful .NET classes ,ASP.NET 3.5,Libraries,SM RETURN,helper,",
  "LastEdited": "2007-12-30T01:28:23.763-08:00"
}