{
  "ProjectName": "enginewars",
  "Title": "Engine Wars Chess Client",
  "Description": "EngineWars is Client/Server framework to host chess matches of humans vs humans, humans vs Chess Engines, and engines vs engines in casual play and tournaments.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><br />By Data Juggler Software www.datajuggler.com .<br /><br />We are moving to Windows Azure and are rebuilding the server code, so the server is not live at the moment.<br /><br />Project Description<br />EngineWars is Client/Server framework to host chess matches of humans vs humans, humans vs Chess Engines, and engines vs engines in casual play and tournaments.<br /><br />This project will eventually be hosted on www.enginewars.net (I lost www.enginewars.com because I didn&#39;t renew it once, oops).<br /><br />The goal is to build a build a framework for playing chess that:<br /><br />1. Allows people to play chess over the internet using a rich WPF client.<br />2. Allow developers to easily build chess engines to compete against humans and other chess engines<br />3. Create a series of Engine Starter Kits and helper classes to enable a basic engine to be created by almost any developer.<br />4. Create an Engine Tester tool to help developers discover pitfalls in their engines.<br />5. Build a tournament environment so that developers can compete against other engines<br />6. If possible build UCI and / or Win Board adapters so existing engines can compete.<br />7. Develop of find a Rating system so that human players and engines can be rated.<br /><br />Here is the state of the project:<br /><br />Engine Wars Server<br />1. The Engine-Wars database and 100% stored procedure driven data tier is built using Rad Studio<br />2. The Chess Manager Server - publishes two services Chess Manager Service and Notification Service.<br /><br />Engine Wars Chess Client<br /><br />Right now I am showing all the messages received by the server in a list box, I will eventually scale back the messages but I wanted to verify everything actually works.<br /><br />I have a SQL Server database and the data library (EngineWars.Data) is built using my other code plex project (RAD Studio Code Generation Toolkit http://radstudio.codeplex.com). <br /><br />The Chess board is drawn, and you can switch sides, and you can drag and drop pieces around.<br /><br />The Chess Client and Twiki the Test Engine included with Engine Wars can now both subscribe and send messages to the server and to each other.<br /><br />In addition to Rad Studio, I have several other projects on codeplex:<br /><br />DB Compare - compares two instances of a SQL Server database and compares schema of tables, views and stored procedures.<br />http://dbcompare.codeplex.com<br /><br />Regionizer - A Visual Studio 2010 package that formats a C# document into regions (once you see my code you want to use I think. or hate it).<br />http://regionizer.codeplex.com<br /><br />Smooth Popup - A JQuery popup I haven&#39;t done very much with but it has potential<br />http://smoothpopup.codeplex.com<br /><br />Data Juggler Web Controls - A series of cool web controls for Asp.Net developers<br />http://datajugglercontrols.codeplex.com<br /><br />If you like this project or any of my open source projects you can make a donation on my web site at http://www.daily-click.com , or just tell someone about Daily-Click.com.<br /><br />Thank you,<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,wcf,Chess engine,Chess Client,Web Service,Games,Chess Engines,Strategy,Chess,WPF,",
  "LastEdited": "2017-03-26T08:00:33.8-07:00"
}