{
  "ProjectName": "gaussianblur",
  "Title": "Gaussian Blur",
  "Description": "A Gaussian blur is the result of blurring an image by a Gaussian function. It is a widely used effect in graphics software, typically to reduce image noise and reduce detail.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A Gaussian blur is the result of blurring an image by a Gaussian function. It is a widely used effect in graphics software, typically to reduce image noise and reduce detail. The visual effect of this blurring technique is a smooth blur resembling that of viewing the image through a translucent screen, distinctly different from the bokeh effect produced by an out-of-focus lens or the shadow of an object under usual illumination. Gaussian smoothing is also used as a pre-processing stage in computer vision algorithms in order to enhance image structures at different scales—see scale-space representation and scale-space implementation.<br /><br />Mathematically, applying a Gaussian blur to an image is the same as convolving the image with a Gaussian function; this is also known as a two-dimensional Weierstrass transform. By contrast, convolving by a circle (i.e., a circular box blur) would more accurately reproduce the bokeh effect. Since the Fourier transform of a Gaussian is another Gaussian, applying a Gaussian blur has the effect of reducing the image&#39;s high-frequency components; a Gaussian blur is thus a low pass filter.<br /><br /><br /><table><tr><th> Original </th><th> With noise </th><th> Gaussian blur </th></tr>\n<tr><td> <img src=\"/projects/gaussianblur/f072813a-7f1c-41d4-b183-34b71c3ac0ab\" alt=\"original.jpg\" title=\"original.jpg\" /> </td><td> <img src=\"/projects/gaussianblur/2dd24b63-a789-4655-b892-6358e9993bfe\" alt=\"original_noise.jpg\" title=\"original_noise.jpg\" /> </td><td> <img src=\"/projects/gaussianblur/1b06768d-0c80-4f4d-856f-a1712ab0fb12\" alt=\"original_gauss.jpg\" title=\"original_gauss.jpg\" /> </td></tr></table><br /><br /><b>Credits</b><br />The project was inspired by <a href=\"http://www.codeproject.com/KB/GDI-plus/csharpfilters.aspx\">http://www.codeproject.com/KB/GDI-plus/csharpfilters.aspx</a> and contains part of framework code.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-05-31T08:27:48.393-07:00"
}