{
  "ProjectName": "glq32",
  "Title": "GLQuake32",
  "Description": "GLQuake32 is an attempt to change the original GLQuake's 16 bit world to more modern 32 bit. It makes it easier for newer Quake players and even the old school players to run quake without using the command line parameter \"-bpp 32\". It will also add some cool new effects.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>GLQuake32</b><br />GLQuake32 is an attempt to change the original GLQuake&#39;s 16 bit world to more modern 32 bit. It makes it easier for newer Quake players and even the old school players to run quake without using the command line parameter &quot;-bpp 32&quot;. It will also add some cool new effects.<br /><br /><b>WHY GLQUAKE32:</b><br />There are a few reasons for GLQ32 first is I love the classic GLQuake engine but I hated the<br />fact that it&#39;s default BPP (Bits Per Pixel) was 16. This was a problem because I have a 32bit<br />operating system with a 64bit processor, so if I ran GLQuake all I would see is random colours.<br />Another reason is I have just started mapping and I don&#39;t like the original noclip in Quake so<br />I have changed that.<br /><br /><b>LATEST NEWS:</b><br />GLQuake32 is not dead more on hiatus. I am experimenting at the moment with C to C++ conversion as I think it would be best for the engine to go down the OOP route. Version 0.3 will have loads of new features from coloured lights to fullbright textures. Not only this I plan to include other major revamps to the engine such as a full features menu with a video menu so that you can change video resolution on the fly and many more such features. I thank all who downloaded GLQuake32 and please keep supporting the project.<br /><br /><b>CHANGES FROM THE ORIGINAL GLQUAKE:</b><br />-Fullbright Textures.<br />-VSYNC<br />-New Widescreen Resolutions<br />-New Noclip Movement.<br />-New Inproved Water Warp.<br />-and much, much more...<br /><br /><b>THANKS TO:</b><br />id Software, for releasing the Quake source code.<br />Microsoft, for CodePlex.<br />Everyone at these quake modding communities: QuakeOne, Inside3D and QuakeDev for tutorials and help.<br />MH, for fullbrights code and various other fixes.<br />LordHavoc, for various fixes.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "quake,fps,",
  "LastEdited": "2010-06-06T15:47:35.78-07:00"
}