{
  "ProjectName": "graphingcalculator",
  "Title": "Graphing Calculator in Silverlight",
  "Description": "This was initially an effort to port a WPF graphing calculator written by Bob Brown (Microsoft) into Silverlight but soon after it became necessary to add several features to the code to make it more general and ready for practical use.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Graphing Calculator in Silverlight</b><br /><br />This was initially an effort to port a WPF graphing calculator written by Bob Brown (from Microsoft) into Silverlight but soon after it became necessary to add several features to the code to make it more general and ready for practical purposes.<br /><br />Here are some screenshots of the program:<br /><img src=\"/projects/graphingcalculator/78348be6-1292-4d5f-b4db-04abf84a05a7\" alt=\"Screen\" title=\"Screen\" /><br /><br /><img src=\"/projects/graphingcalculator/9debcb18-21e6-4b82-a441-b90981158b99\" alt=\"3D&#32;Parametric&#32;Plot\" title=\"3D&#32;Parametric&#32;Plot\" /><br /><br /><img src=\"/projects/graphingcalculator/a3eedea2-a57c-439a-bb2d-6860e29efabb\" alt=\"XY&#32;Plot\" title=\"XY&#32;Plot\" /><br /><br /><br />The basic features of the calculator list below:<br />\n<ol><li>Symbolic Parsing of Mathematical Expressions</li>\n<li>Symbolic Differentiation</li>\n<li>2D XY Plots with Zoom</li>\n<li>2D Parametric Plots with Zoom</li>\n<li>3D Parametric Plots (Meshes) with Zoom/Rotate</li>\n<li>Multiple Root Finder</li>\n<li>Syntax highlighted Screen</li></ol>\n\n<ul><li>The function parser was developed by Bob Brown but it was limited to only a few basic mathematical functions. I have extended the parser to include hyperbolic functions, log and log10, sgn, abs, and the exponential function. I am working on adding inverse trigonometric functions.</li>\n<li>The graphing tools are pretty solid for 2D, 2D parametric and 3D parametric graphs. I have used Kit3D (an excellent piece of software by the way) to create 3D representation of the functions. The version of Kit3D that I am using included a module for directional lighting. A big thanks goes to Rafal at <a href=\"http://sildev.net/#demo1\">SilDev.Net</a> for sharing his Kit3D experience with me. I have also implemented full mouse rotation (arcball) and zooming (mouse wheel). I am working on adding polar function plotting to the features list.</li>\n<li>The Bisection-NewtonRaphson algorithm is used to find the roots to functions. It is directly linked to the input function string (from the graphing menu) and it uses the symbolic function differentiation to evaluate the first derivative of the function with respect to x. It works for 2D XY function only.</li>\n<li>The syntax highlighter was written from scratch and is pretty complete. It supports C++, C#, Math, XAML, HTML and APDL (Ansys Parametric Design Language). The languages can easily be extended.</li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-01-04T17:52:23.503-08:00"
}