{
  "ProjectName": "jqcarousel",
  "Title": "JQuery Cycle Carousel for DotNetNuke®",
  "Description": "DNN Module JQuery Cycle Carousel\nThis module will show images as a carousel using the cycle JQuery plugin.\nYou can easyly change Cycle effect and other settings in the module.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nDNN Module JQuery Cycle Carousel<br>\r\nThis module will show images as a carousel using the cycle JQuery plugin.<br>\r\nYou can easily change Cycle effect and other settings in the module.<br>\r\n<br>\r\n<br>\r\nModule Carousel</p>\r\n<p>This module use the&nbsp;&nbsp;jQuery Cycle plugin&nbsp;at the Microsoft Ajax CDN. You can read more about the plugin\r\n<a href=\"http://stephenwalther.com/blog/archive/2010/10/02/jquery-cycle-plugin-on-the-microsoft-ajax-cdn.aspx\" target=\"_blank\">\r\non Stephen Walters blog</a>&nbsp;and on&nbsp;the creators Mike Alsup <a href=\"http://jquery.malsup.com/cycle/\" target=\"_blank\">\r\ndemo page</a>.<br>\r\nSo this module makes it easy to use the plugin in DotNetNuke&reg;.<br>\r\nWhen you install the module on a page it will render images with standard settings. It will actually show your pictures in the root of your portal with a fade effect. This is not so good so what you need to do is to upload your pictures to a folder of your\r\n choice located under the portal root.<br>\r\nIn the Settings of the module you can then refer to this folder and the module will show these images. If you need to show different pictures for different languages you need to place them in a sub folder to the main folder. Those folders must be named like\r\n en-US sv-SE as the culture code for your languages. If you use languages then the main folder is empty and the pictures are located in the folders for the language.\r\n<br>\r\nIn the Settings part you can also change:</p>\r\n<ul>\r\n<li>The base effect of the plugin e.g. fade, zoom etc. </li><li>If you like some parameters of the effect </li><li>A border round the image </li><li>The color of the border </li><li>Padding around the image </li><li>The color of the padding e.g. the background color for the image </li><li>If you like to have different images for different languages </li></ul>\r\n<p>Play around with the module and have fun.<br>\r\n<br>\r\nJan Olsmar<br>\r\n<br>\r\nOlsmar Konsult<br>\r\n<br>\r\n<a href=\"http://www.olsmar.com\">http://www.olsmar.com</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-12-06T03:31:04.917-08:00"
}