{
  "ProjectName": "modelviewer",
  "Title": "XNA Model Viewer",
  "Description": "The XNA Model Viewer allows you to load FBX files and view them. It allows you to test that models will work in XNA, determine the effect of modifying bone transforms, and view animation clips. You can examine the bones and meshes and see the complete hierarchy. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The XNA Model Viewer allows you to load FBX files and view them. It allows you to test that models will work in XNA, determine the effect of modifying bone transforms, and view animation clips. You can examine the bones and meshes and see the complete hierarchy. <br /><br /><b>Installation</b><br />To install, click the Download button.  This will install the application using ClickOnce.  After that, it&#39;ll check for, and install, updates automatically. You must have XNA Game Studio 4.0 Refresh installed to run this application, since it uses elements of the content pipeline.<br /><br /><img src=\"/projects/modelviewer/8aa78cf6-430f-42e6-b75b-e30b36527d0c\" alt=\"modelviewer-2.3.png\" title=\"modelviewer-2.3.png\" /><br /><br />This program allows you to load an XNA model and view it. It has many unique features. It loads both rigid models and skinned models and will work with models that mix rigid parts and skinned parts. It can load more than one model at a time for comparison purposes. It allows you to view the entire bone tree, all meshes, and all animation clips (only one now, thanks to XNA 4.0) for a model. Animations can be previewed and directed to models.<br /><br />XNA only allows you to load one animation at a time from an FBX file as of XNA 4.0. The solution for that problem is to save multiple FBX files with a different animation in each file. ModelViewer can load multiple files at the same time. In the Anim tab the animation clip for one model can be assigned to a different model. To use this with animated models, load the based model in a base pose with no animation first. Then load FBX files with animation in them for each animation you would like to view. Click on the animation items and select the Anim tab and assign the animation to the base pose model to audition it.<br /><br />A valuable feature is the ability to manipulate individual bones in the tree. A bone can be selected in the tree view, then scaling, rotation, and translation can be applied to the bone. This is useful for determining where the actual pivot points are and the orientation of the local coordinate systems. A jog button jogs these degrees of freedom momentarily so they can be easily located.<br /><br />The program exports the graphical model is a custom XML format ModelX. Both a model and animation format are available. This is useful for converting graphical models into a form that can be loaded in OpenGL programs. See the grafx library <a href=\"http://grafx.codeplex.com/\">http://grafx.codeplex.com/</a> for code that loads and displays ModelX files. New code is under development that will also load and display animated ModelX files in Java and on Android devices.<br /><br />I&#39;m trying to make much of this work like 3DS Studio Max. That&#39;s the basis for the color scheme. <br /><br />See more XNA information at <a href=\"http://metlab.cse.msu.edu\">http://metlab.cse.msu.edu</a> including additional XNA tools and information.<br /><br />Please feel free to contact me if you are interested in working on this project.<br />\n<h1>Basic Instructions</h1>\r\nJust start the program and select File/Open. It will load an FBX model and then display it in the viewer. The left mouse button is pitch and yaw on the model. The right mouse button is pan and tilt. The mouse wheel or both mouse buttons zoom. You can expand the bones in the tree viewer and click on them. Then you can change the scaling, rotation, and translation of the bone. The small arrows next to the controls jogs that degree of freedom.<br /><br /><br />The program is configured for the HiDef profile. If you need to use the Reach profile, change the project to Reach and change the other two occurrences of <i>HiDef</i> in ContentBuilder.cs and GraphicsDeviceService.cs.<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "XNA,model,viewer,3D,fbx,",
  "LastEdited": "2013-03-17T12:30:46.787-07:00"
}