{
  "ProjectName": "ncal",
  "Title": "NetAdvantage for Composite Application Library",
  "Description": "The NetAdvantage for Composite Application Library (NCAL) from Infragistics enables NetAdvantage for WPF to be used in a composite WPF application.  NCAL is a lightweight layer of code that provides region adapters for key Infragistics WPF components.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The NetAdvantage for Composite Application Library &#40;NCAL&#41; from Infragistics enables NetAdvantage for WPF to be used in a composite WPF application.  NCAL is a lightweight layer of code that provides region adapters for key Infragistics WPF components.\n<h2>Background</h2>\rThe Patterns and Practices group at Microsoft published <a href=\"http://www.codeplex.com/CompositeWPF\">Composite Application Guidance</a> that shows how to design and implement a composite application, built in WPF.  A core piece of this guidance comes in the form of a source code library, CAL, which provides much of the plumbing code necessary to create well-structured composite applications in WPF. <br /><br />Composite applications require support for abstracting away the UI controls that happen to display, or contain, the Views provided by Modules.  CAL includes a set of region adapters for the UI controls included as part of Microsoft’s WPF framework.  Region adapters are responsible for providing this layer of abstraction, by keeping the state of a UI control in sync with the state of a Region and its Views.<br /><br />The purpose of NCAL is to assist Infragistics users in creating applications that leverage CAL, by offering a set of region adapters made for specific NetAdvantage for WPF controls. All of the source code for NCAL, and the accompanying sample application and unit tests, are included in the NCAL Visual Studio solution.\n<h2>What is in NCAL?</h2>\rThe library consists of the following major pieces:\n<ul><li>Microsoft’s CAL source code, in the ‘CAL’ solution folder.</li>\n<li>A Quick Start document, in the ‘Documentation’ solution folder, which reviews NCAL and reviews how to use it in a composite WPF application.</li>\n<li>A set of projects that constitute a sample application, showing how to use NCAL, located in the ‘Samples’ solution folder.  The sample application consists of several Modules, each of which lives in its own project, an Infrastructure project, and the SampleBrowser project that contains the shell Window and bootstrapper.</li>\n<li>A set of unit test projects, that contain tests for the core NCAL classes, and various parts of the sample application, which is located in the ‘Unit Tests’ solution folder</li>\n<li>The core NCAL classes are in the Infragistcs.Composite.Wpf project.  This project contains region adapters and related classes.</li>\n<li>A library of proxy elements used to decouple Modules from a specific version of the Infragistics control assemblies, located in the Infragistcs.Composite.Wpf.Proxies project.</li></ul>\n<h2>System Requirements</h2>\rNCAL depends on the Composite Application Library v1, released in July 2008.  In addition to the system requirements imposed by CAL, it also requires that you have NetAdvantage for WPF installed on your system.  NCAL v1 was built and compiled against NetAdvantage for WPF v8.2, which is available <a href=\"http://www.infragistics.com/dotnet/netadvantage/wpf.aspx#Downloads\">here</a>.\n<h2>StartUp Project</h2>\rThe sample projects allow you to quickly see NCAL in action, as well as how to leverage it in code.  In order to run the samples, be sure to set the &#39;Infragistics.Composite.Wpf.SampleBrowser&#39; project as the Startup Project.  To do this in Visual Studio 2008 simply open Solution Explorer, right-click on the &#39;Infragistics.Composite.Wpf.SampleBrowser&#39; project, and click on the &quot;Set as StartUp Project&quot; item in the menu.<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Composite,WPF,Adapters,Infragistics,",
  "LastEdited": "2009-01-12T06:39:59.81-08:00"
}