{
  "ProjectName": "Presto",
  "Title": "Presto",
  "Description": "Presto is an automated deployment tool. It allows users to create deployment steps and then have app servers update themselves when new versions of an app are ready. This allows for automated deployments to dev, QA, and production environments. C# 4.0 and RavenDB.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1><b>Project Description</b></h1>\rPresto is an automated deployment tool. It allows users to create deployment steps and then have app servers update themselves when new versions of an app are ready. This allows for automated deployments to dev, QA, and production environments. C&#35; 4.0 and RavenDB.<br />\n<h1><b>Overview</b></h1>\r\nDeploying applications can be time-consuming and error-prone. The whole point of Presto is to have a central location to configure applications and servers. The servers will update applications when new versions are available.<br /><br />The general process flow looks like this:<br /><br />1. Configure applications<br />2. Configure servers<br />3. Configure custom variables<br />4. Copy an application&#39;s binaries to a production release location<br />5. Have the application servers automatically update the application using the new binaries<br /><br />Steps 4 and 5 get repeated for as many deployments necessary to complete a dev or QA cycle.<br /><br />There are three main pieces to Presto:<br /><br /><b>Presto Dashboard</b>: The C# 4.0/WPF/MVVM UI. The Presto Dashboard allows users to create application servers, applications with tasks, and custom variable groups. The Presto Dashboard also has tabs for viewing installation summaries and logging.<br /><br /><b>Presto Database Server</b>: The database (RavenDB).<br /><br /><b>Presto Task Runner</b>: This application runs on every application server. It polls the Presto DB for updates to applications. If an application needs to be installed, the Presto Task Runner will run the tasks (previously set up using the Presto Dashboard) necessary to install the application. The Presto Task Runner runs within the self-updating service host; so when there are new updates to the Presto Task Runner, it updates itself automatically.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Deployment,Automated deployment,db4o,C#,MVVM,WPF,",
  "LastEdited": "2012-12-09T13:09:33.26-08:00"
}