{
  "ProjectName": "prolog",
  "Title": "Prolog.NET",
  "Description": "A .NET-base implementation of Prolog based on the Warren Abstract Machine (WAM) architecture.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>And now, a word from our sponsor...</h1>\rHello all!  <br /><br />After a rather lengthy hiatus, I&#39;ve returned to focus some attention on this project.  Much of the project-related delay involved reworking the logic for bagof and adding support for eval.  (I won&#39;t bore you with the non-project-related reasons...)  I hope the new implementation is closer to that of other Prolog implementations such as GNU Prolog.<br /><br />My next focus will be on addressing suggestions and issues I&#39;ve received, and enhancements to allow Prolog.NET to be more easily integrated with other .NET applications.<br /><br />Thank you again for your interest and patience!<br />\n<h1>Project Description</h1>\rA .NET-base implementation of Prolog based on the Warren Abstract Machine &#40;WAM&#41; architecture.<br /><br />This project contains:\n<ul><li>Prolog - the primary assembly containing the Prolog.NET compiler and interpreter.</li>\n<li>PrologLibrary - an assembly containing external functions callable by Prolog.NET programs.</li>\n<li>PrologSchedule - a WPF application demonstrating the use of Prolog.NET from a client C# application.</li>\n<li>PrologTest - a console application used for testing.</li>\n<li>PrologWorkbench - a WPF application used for editing, running and debugging Prolog.NET programs.</li></ul>\n\n<h2>Notes</h2>\r<ul><li>Please see <a href=\"https://prolog.codeplex.com/documentation?referringTitle=Home\">Documentation</a> page for additional information about Prolog.NET.</li>\n<li>The project source code currently contains TFS source control bindings.  These bindings should be removed if you have not installed the Visual Studio Team Explorer.</li></ul>\n\n<h2>Project Status</h2>\rThis project is under active development.<br />\n<h2>Additional References</h2>\rFor additional information about the Warren Abstract Machine, the following resources are recommended:\n<ul><li><a href=\"http://en.wikipedia.org/wiki/Warren_abstract_machine\">Warren abstract machine (Wikipedia)</a></li>\n<li><a href=\"http://www.ai.sri.com/pubs/files/641.pdf\">An abstract Prolog instruction set</a></li>\n<li><a href=\"http://web.archive.org/web/20030213072337/http://www.vanx.org/archive/wam/wam.html\">Warren&#39;s Abstract Machine: A Tutorial Reconstruction</a></li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "prolog,.net,.net 3.5,WPF,",
  "LastEdited": "2011-11-09T19:33:40.027-08:00"
}