{
  "ProjectName": "rajon",
  "Title": "Rajon",
  "Description": "Rajon is a javascript MVVM library. Basically it creates a \"ViewModel\" for any html element at your webpage. The \"Model\" is binded from the server at the client side using Ajax calls.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Rajon - Rest Ajax Javascript Over Network</h1>\r\nRajon is a javascript MVVM library, that tries to apply the famous and nice WPF pattern to the web development enviroments.<br />Basically it creates a &quot;ViewModel&quot; for any html element at your webpage, the &quot;Model&quot; is then binded from the server at the client side using Ajax calls.<br /><br />You just need to specify a model source, <i>rajon:modelSrc</i>, at the desired html element.<br />The model source can be a REST url, an JSON string or even another viewmodel at the page.<br /><br /><b>Using all Orders from a REST service as model source for a HTML DIV tag:</b><br />&lt;div rajon:modelSrc=&quot;OrderService/Orders&quot; &gt;<br /><br /><b>Using an Order object, identified by number 1, from a REST service as model source for a DIV tag:</b><br />&lt;div rajon:modelSrc=&quot;OrderService/Orders/1&quot; &gt;<br /><br /><b>Using a JSON string as a model source or a DIV tag:</b><br />&lt;div rajon:modelSrc=&#39;= { OrderNumber: 1, ClientName: &quot;ACME&quot; }&#39; &gt;<br /><br />Once you provide a model source you can use the <i>rajon:bind</i> to bind any object property to any HTML element property.<br /><br /><b>Binding the OrderNumber object property to a SPAN tag</b><br />&lt;span rajon:bind=&quot;model.OrderNumber&quot;&gt;<br /><br /><b>Binding the OrderClient object property to a INPUT TEXT tag</b><br />&lt;input  type=&quot;text&quot; rajon:bind=&quot;model.OrderClient&quot;&gt;<br /><br /><b>Binding the TotalWeight object property to a DIV, width property</b><br />&lt;div rajon:bind=&quot;style.width=model.TotalWeight&quot;&gt;<br /><br />You can do a lot more with <b>Rajon</b>:\n<ul><li>use templates;</li>\n<li>create ViewModel client properties;</li>\n<li>update and insert at your model source</li>\n<li>and more....</li></ul>\n<br /><b>Rajon</b>  is plataform independent and runs with any server-side language, such as .Net, PHP, ASP, Java etc...<br /><br />You can add the beta version (<i>rajon-beta0.min.js</i>) at your web page and try it!<br /><br />Please, see our source ciode and samples for detailed information at: <a href=\"http://rajon.codeplex.com/SourceControl/list/changesets\">http://rajon.codeplex.com/SourceControl/list/changesets</a><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "MVVM,jQuery,javascript,ajax,REST,WPF,",
  "LastEdited": "2011-01-21T03:48:59.237-08:00"
}