{
  "ProjectName": "rssfeedmasher",
  "Title": "Rss Feed Masher",
  "Description": "This is a WPF application that uses Reactive Extensions to implement an RSS feed reader.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This is a WPF application that uses Reactive Extensions to implement an RSS feed reader.<br /><br />Note:  this project has been deprecated.  Please visit the current version at <br /><br /><a href=\"https://tcinewsreader.codeplex.com/\">https://tcinewsreader.codeplex.com/</a><br /><br /><br />This is a WPF application that implements an RSS feed masher (i.e., combines multiple feeds into a single presentation object).  It has been written using the Model-View-ViewModel (MVVM) design pattern.  The application uses Reactive Extensions (Rx) to download and assemble the RSS information.  Accordingly, it is useful as a way to explore the integration possibilities between Rx and MVVM.<br /><br />The application also uses HtmlAgilityPack to help parse HTML tags.<br /><br /><img src=\"/projects/rssfeedmasher/7f6a5e53-fe60-49b0-b58e-2ecba4517cf1\" alt=\"RssPicGrabber-exhibit1.jpg\" title=\"RssPicGrabber-exhibit1.jpg\" /><br /><br />The above exhibit shows the main view.  As shown, the left side is devoted to a listbox that contains all of selected/filtered RSS items.  The right side includes a WPF WebBrowser which displays the details for the selected item.  The bottom right includes a list of image tags found in the item.<br /><br />Sorting and filtering are accomplished by the WPF ComboBoxes along the top.<br /><br /><img src=\"/projects/rssfeedmasher/434651eb-0fd1-41d1-82e1-bd4b8fdb1b46\" alt=\"RssPicGrabber-exhibit2.jpg\" title=\"RssPicGrabber-exhibit2.jpg\" /><br /><br />As shown, this tab contains a WPF DataGrid which lists the various feeds.</div><div class=\"ClearBoth\"></div>",
  "TagList": "rss,syndication,wpf,IValueConverter,MVVM,Reactive Extensions,Model-View-ViewModel,DataGrid,DataTemplate,",
  "LastEdited": "2014-03-25T06:36:16.247-07:00"
}