{
  "ProjectName": "simpleslideshow",
  "Title": "SimpleSlideShow",
  "Description": "Simple WPF app to display a rotating collection of full screen images, ideally suited to foyer presentations, etc.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Simple WPF app to display a rotating collection of full screen images, ideally suited to foyer presentations, etc.<br /><br /><br />When a 42 inch Plasma display was donated to my church, we needed a simple application to display a collection of images on the screen.  Simple, to the point that I didn&#39;t want the need for a keyboard / mouse to control the PC.<br /><br />This app was written in about an hour, and fills the need quite nicely.  The ideal setup is as follows:<br />\n<ul><li>Setup a PC so that it boots without a keyboard / mouse attached (BIOS halts on No Errors)</li>\n<li>The PC should automatically log in to a user account (set in registry), and should shut itself down (nicely) when the front panel power button is pressed (set in Power Settings)</li>\n<li>The PC should have SimpleSlideShow.exe in the Startup folder of the automatically logged-in user</li></ul>\n<br />When the program runs, it initially displays a message stating no images were found.  Insert a USB stick containing a collection of JPEG images (1280x720 is a good size for a 42&quot; plasma...), and the magic will begin.  After a collection of images is loaded, subsequent bootups / running of the program will use the existing set of images, but inserting a USB stick again with more images will replace ALL images with those on the memory stick.<br /><br />Currently the images rotate every 10 seconds with a 2 seconds fade in-between, but this can be changed in the code.  The .NET 3.5 SP1 framework is required, and while the quality of output is dependent on the hardware, I have the program running on a Pentium III with a low-quality video card, and the only concession to quality is a stuttering crossfade.<br /><br /><b>Update:</b> One problem found in the initial release was that files on the USB stick that were given a .jpg extension, but were not in fact JPEG images, would cause the program to crash rather ungracefully.  The program has now been modified (version 1.1) to test the validity of JPEG images before they are copied from the USB stick to the hard drive.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-03-08T14:52:29.84-07:00"
}