{
  "ProjectName": "simpleclcl",
  "Title": "SimpleCLCL",
  "Description": "SimpleCLCL is a simple multiclipboard with a kind of modern style. It is inspired by CLCL (thus the name SimpleCLCL). ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>CODEPLEX IS CLOSING DOWN -&gt; THIS APP IS NOW HOSTED HERE</h1>\r\n<h1><a href=\"https://github.com/martinyyyy/SimpleCLCL\">https://github.com/martinyyyy/SimpleCLCL</a></h1>\r\n<h1>What is it?</h1>\rSimpleCLCL is a simple multiclipboard. <br />It is inspired by <a href=\"http://www.nakka.com/soft/clcl/index_eng.html\">http://www.nakka.com/soft/clcl/index_eng.html</a> (thus the name Simple<b>CLCL</b>). <br />It&#39;s written in .NET 4.5 and WPF. This is just a quick&amp;dirty project. A lot of code snippets are copy&amp;paste from everywhere including stackoverflow.<br /><br /><b>Why did you write this?</b><br />Easy, I don&#39;t like the style of the original one and it is missing a few things I really wanted.  <br /><br /><b>Features</b>\n<ol><li>saves up to 150 of your last clipboard entrys (even between restarts)</li>\n<li>only supports text (no pics, files. richtext gets stripped to *only* text when inserted using SimpleCLCL)</li>\n<li>inserts text only to clipboard</li>\n<li>inserts text to clipboard and sends crtl+v to last app</li>\n<li>search the clipboard history</li>\n<li>tooltip for &quot;too long text&quot; (accessible by mouseover and right-arrow key)</li>\n<li>clear history</li>\n<li>favorites</li>\n<li>rightclick to open a textbox for easier copy of text parts</li>\n<li>Run on startup</li></ol>\n<br /><b>How to use</b>\n<ol><li>ALT+C opens the list of saved clipboard items next to the mouse pointer</li>\n<li>select item by cursor, keyboard (up and down key or Shift)</li>\n<li>insert into clipboard and output to last app with space or return</li>\n<li>only copy to clipboard with crtl+c</li>\n<li>begin typing to open search</li></ol>\n<br /><b>Screenshot</b><br /><img src=\"/projects/simpleclcl/22834188-b5c3-4e9a-8960-1a800975a9f0\" alt=\"Unbenannt.png\" title=\"Unbenannt.png\" /><br /><br /><b>Smartscreen / Stuck at 100% installation</b><br />Windows 10 Smartscreen may prevent the program from running because the executable is not signed by a known authority (this costs money). Click on <i>more info</i> in the dialog and press <i>run anyway</i> to bypass the filter.<br /><br />Sometimes Smartscreen doesn&#39;t even work like intended and doesn&#39;t inform the user the program is not known and just crashes. If you see the process &quot;Smartscreen&quot; in your task manager and SimpleCLCL isn&#39;t showing up, kill all Smartscreen process and the installation should run to completion. <br /><br /><b>If Smartscreen keeps on crashing everytime you try to start SimpleCLCL do the following steps.</b>\n<ol><li>Open up the Windows setting &quot;Security and Maintaince&quot;</li>\n<li>On the left side open Smartscreen and disable it</li>\n<li>Kill all Smartscreen processes and SimpleCLCL in task manager</li>\n<li>Run SimpleCLCL.application again and uncheck the &quot;ask me everytime....&quot; checkbox.</li>\n<li>Enable Smartscreen again</li></ol>\n<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "clipboard,multiclipboard,hotkey,wpf,pinvoke,metro,utility,c#,clcl,simpleclcl,",
  "LastEdited": "2017-10-04T00:47:48.847-07:00"
}