{
  "ProjectName": "skypefx",
  "Title": "Skype Voice Changer",
  "Description": "Skype Voice Changer demonstrates how to use NAudio and Skype4COM to allow real-time effects processing of your voice during a Skype conversation. ",
  "MovedLink": "https://github.com/markheath/skypevoicechanger",
  "HomeWiki": "<div class=\"wikidoc\"><b>Skype Voice Changer</b><br />Skype Voice Changer allows you to modify your voice in real-time during a Skype conversation. It works on Windows with the desktop version of Skype. Click the Download link on the right to install it. For full instructions on how to use it, as well as information about the &quot;Pro&quot; version which also lets you record your conversations, visit <a href=\"http://skypevoicechanger.net\">this page</a>.<br />\n<h1>GO PRO AND RECORD YOUR CALLS</h1>\rWe have attempted to fix recent changes to the Skype API which broke Skype Voice Changer. However, for the best experience, we recommend you try out the  <a href=\"http://skypevoicechanger.net?r=skypefx\">Pro Edition</a> . This stills offer <b>free voice effects</b>, but with a greatly simplified and more intuitive user interface, and customers <a href=\"https://skypevoicechanger.net/purchase?r=skypefx\">purchase a license</a> are also able to <b>record their calls</b> and play back <b>pre-recorded sounds</b> as well as use <b>speech synthesis</b>. Get a <b>20% discount</b> by using the coupon code <b>COOLFX</b> at the <a href=\"https://skypevoicechanger.net/purchase?r=skypefx\">checkout</a>. <br /><br /><img src=\"/projects/skypefx/c772e350-eabd-449a-ac51-8ecd12c9ff21\" alt=\"super-pitch.png\" title=\"super-pitch.png\" /><br /><br /><b>For Developers:</b><br />Skype Voice Changer demonstrates how to use NAudio and Skype4COM to allow real-time effects processing of your voice during a Skype conversation. It is developed in C#. It was initially developed to accompany <a href=\"http://markheath.net\">Mark Heath&#39;s</a> Coding4Fun article: <a href=\"http://blogs.msdn.com/coding4fun/archive/2009/02/02/9391048.aspx\">Skype Voice Changer</a>. It demonstrates the use of <a href=\"http://naudio.codeplex.com\">NAudio</a> for audio playback and sample manipulation. Eventually, it is intended that the effects framework in this project will become part of the core NAudio library.</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,audio,NAudio,Skype,*,effects,C# audio,C# audio compose,GeraldoSilva,GeraldoSilva2010,brenda.pelentier1,ASP.NET,joaoortz2,",
  "LastEdited": "2015-07-14T01:56:10.803-07:00"
}