{
  "ProjectName": "sl3d",
  "Title": "SilverLight 3D",
  "Description": "This project will be to use the SilverLight 3 control and provide 3D effects in conjunction with custom functions and framework functions.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">  All references to and from the Silverlight framework is fully owned and copyrighted by Microsoft, to include partially the Silverlight 3D logo.  As such, any and all development of this library is subject to change to the framework deprecation schema.  All references in the library are fully referenced from Calculus and other web-based means.  As such, this library is not an original thought but more of a culmination of thoughts into one library.  Please use this library responsibly!<br /><br />  Once there is a full Minor version produced, i will be setting up a support structure for those wishing to use this on a enterprise wide basis.<br /><br /><b>Project Description</b><br />This project will be to use the SilverLight 3 control and provide 3D effects in conjunction with custom functions and framework functions.<br /><br />To submit features please goto the <a href=\"https://sl3d.codeplex.com/discussions/56696\">Feature Request Thread</a> in the Discussion Forum.  Or send an email to <a href=\"mailto:sl3d@woodsoft.us\">SL3D Team</a><br />\n<h1><b>Blog Site</b></h1>\rI have setup a blog site to help with keeping track of recent updates that are so minor its not worth posting here for anything.  Check it out <a href=\"http://woodassoc.us/blog/b2e/index.php/Prog/projects/silverlight/3d/\">Silver 3D Blog</a> at <a href=\"http://woodassoc.us\">Wood &amp; Associates</a>\n<h1><b>Test Site</b></h1>\rThis is a test directory i am using for the development of this library.  Working on the visual production part of Silverlight to find the hook location to use the calculations.  Anyone able to assist in helping with this in Silverlight, let me know via my account email or above email.<br /><a href=\"http://woodsoft.us/projects/silverlight/test\">Silverlight Test Site</a> (redeveloped with Silverlight 3, and some minor modifications with the framework update)<br />\n<h1><b>Current Version</b></h1>\rWorking on the first deployment.  Major versions will coincide with the release version of Silverlight.  Minor versions will be based on stable versions.  We will only recognize feature request based on the Minor versions (as the Major Version will be associated with the Silverlight release.<br /><br /><a href=\"https://sl3d.codeplex.com/releases/view/31900\">Version 3.0.01</a><br />\n<h1><b>Build Versions</b></h1>\rThese deployments will only be available via Source Code and will not be supported as they are to assist in resolving problems.  Feature requests based on builds will be ignored.<br />\n<h1>Startup</h1>\r5/31/09:<br />  Deployed RC1 that has functionality for Vector and Matrix calculations.<br /><br />5/25/09:<br />  Added the Matrix/Vertex class and working on the object math for the classes.<br /><br />5/18/09:<br />  Starting the breakdown process.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight 3,3D,",
  "LastEdited": "2009-08-24T20:35:19.2-07:00"
}