{
  "ProjectName": "slickcodesearch",
  "Title": "Slick Code Search",
  "Description": "A WPF based application that lets you index and search through your source files (C#).  A Google desktop for your local code.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A WPF based application that lets you index and search through your source files &#40;C&#35;&#41;.  A Google desktop for your local code.<br /><br /><img src=\"/projects/slickcodesearch/8b453520-b0ca-4fd1-ab5f-9a73a4324f3f\" alt=\"slickcode3.jpg\" title=\"slickcode3.jpg\" /><br /><br />When you start Slick Code Search you get this little floating textbox area (like SlickRun).<br /><br /><img src=\"/projects/slickcodesearch/ee16cd6c-6476-46fc-8c32-af066ceec265\" alt=\"slickcode2.jpg\" title=\"slickcode2.jpg\" /><br /><br />In this text area you can type in a Lucene search query. Your search pattern can search for both type and method names. Currently you need to press the enter key to execute the search and update the result list. <br />Example Lucene queries:\n<ul><li>t:ISessi*  -&gt; Searching for a type beginning with &quot;ISessi&quot;</li>\n<li>m:Get* -&gt; Searching for all types that have a method beginning with &quot;Get&quot;</li></ul>\nFor a complete description of the Lucene syntax: <a href=\"http://lucene.apache.org/java/docs/queryparsersyntax.html\">http://lucene.apache.org/java/docs/queryparsersyntax.html</a><br /><br />When you start Slick Code Search for the first time you need to go into the options and add some directories. This is done by right-clicking anywhere on the black textbox area to bring up the context menu and then selecting &quot;Options...&quot;. When all you directories are configured you can select &quot;Start Indexing&quot; from the context menu. The indexing can take some time depending on how many source files you have. \n<h1>Navigation</h1>\rYou can navigate among the search hits by pressing the up/down keys, you can expand a type by pressing the right key and collapse a expanded item by pressing left. Once you have expanded an item you can start navigating its methods with the up/down keys. If you press left while having a method selected a code window should appear with that function in focus. If you have a type selected (in non expanded mode) you can press enter to open the file with the a program that you can specify in the options dialog. <br /><br /><img src=\"/projects/slickcodesearch/65fbdd77-2377-49ac-982d-ff0042de42f1\" alt=\"slickcode_expanded.jpg\" title=\"slickcode_expanded.jpg\" />\n<h1>Participate </h1>\rIf you have any ideas for new features please add it in the issue tracker or if you want to contribute contact the coordinator. \n<h1>Team</h1>\r<ul><li>Torkel &#214;degaard (<a href=\"http://www.codinginstinct.com\">CodingInstinct.com</a>)</li></ul>\n<h2>Just a note</h2>\rThis program was inspired by the application launcher SlickRun and a screencast by Ayende where he developed a code search engine: <a href=\"http://www.ayende.com/Blog/archive/2007/10/28/Hibernating-Rhinos-6--Code-Search-Engine.aspx\">http://www.ayende.com/Blog/archive/2007/10/28/Hibernating-Rhinos-6--Code-Search-Engine.aspx</a>. <br /><br /> </div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,C#,Search,search engine,Codesuche,",
  "LastEdited": "2008-04-07T15:06:25.027-07:00"
}