{
  "ProjectName": "spe",
  "Title": "Studio Post Effect",
  "Description": "Studio Post Effect is an application to create advanced visual effects and pixel shaders, for both designers and developpers.\nYou can then compose even more complex and advanced effects by combining primitve effects the way you want.\nWritten in C# and managed DirectX.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Studio Post Effect is an application to create advanced visual effects and pixel shaders, for both designers and developpers.<br />You can then compose even more complex and advanced effects by combining primitve effects the way you want.<br />Written in C&#35; and managed DirectX.<br /><br /><a href=\"http://sites.google.com/site/studioposteffect\">Studio Post Effect web site</a><br /><br /><img src=\"http://sites.google.com/site/studioposteffect/_/rsrc/1240999273212/home/screen_2009.04.29_18.19.21.png\" /> <img src=\"http://sites.google.com/site/studioposteffect/_/rsrc/1244892100570/home/screen_2009.06.13_20.18.02.png\" /><br /><br />In order to use Studio Post Effect, you should download the source code and run the &quot;Create Delivery&quot; batch to create a runtime environment.<br />Then, once you could run the application, open a project and pick any of the ones located in the Samples directory provided with the source code.<br /><br />As long as Managed DirectX is not supported anymore, this project is not supported anymore either.<br />I plan to rewrite it from scratch using WPF and/or XNA.<br /><br />I provide the source code for the one interested in learning the way to use pixel shaders, recompile and reload them on the fly at runtime, as well as creating, managing and using a workflow system.<br /><br />The code became more and more dirty when the project advanced as long as I encountered several troubles with the way Managed DirectX manages pixel shaders internally, which I didn&#39;t expect when I first designed this application.<br />Also, the code dramatically lacks comments, sorry for that trouble.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "PixelShader,shader,effect,post effect,GPU,DirectX,",
  "LastEdited": "2010-01-09T20:56:21.493-08:00"
}