{
  "ProjectName": "surveysez",
  "Title": "Survey Sez",
  "Description": "SurveySez is a team-based quiz game designed for use on a projector. It demonstrates the M-V-VM pattern using WPF in C#.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\rSurveySez is a team-based quiz game designed for use on a projector. It demonstrates the M-V-VM pattern using WPF in C&#35;.<br />\n<h2>How to Play</h2>\r\nUse the editor to create surveys. A survey has a question and some number of answers. Questions should be in the form &quot;Name something you can ...&quot; or &quot;Name a kind of ...&quot; or any other category description. Answers should be the most common things within that category, but will probably not be all inclusive.<br /><br />Add surveys to a game. A game typically would have three surveys.<br /><br />Find a bunch of friends (at least 6). Hook up a projector. Drag the game window to the public screen. Keep the editor window private. Maximize the game window to take up the full projector screen. Then hit the &quot;Play&quot; button.<br /><br />The first survey question is shown. You can see all of the answers on your private window. Use the following keys:\n<ul><li>1-9: Reveal an answer after 5 seconds.</li>\n<li>0: Display an additional X (up to three) after 5 seconds.</li>\n<li>Backspace: Cancel the 5 second timer.</li>\n<li>+: Go to the next question.</li>\n<li>-: Go back to the previous question.</li></ul>\n<br />Using a wireless number pad, you can walk around a little more, but be sure to stay where you can see your laptop screen but nobody else can.<br />\n<h2>Dependencies</h2>\r\nSurvey Sez depends upon the Correspondence and Update Controls libraries, published here: <a href=\"http://correspondence.codeplex.com\">http://correspondence.codeplex.com</a> <a href=\"http://updatecotrols.codeplex.com\">http://updatecotrols.codeplex.com</a>. Correspondence is used for persistence, and Update Controls simplifies the M-V-VM pattern.<br />\n<h2>M-V-VM</h2>\r\nThe key pattern in Survey Sez is the M-V-VM pattern (a.k.a. View Model, a.k.a. Presentation Model). It is supported by a Navigation Model <a href=\"http://adventuresinsoftware.com/blog/?p=290\">http://adventuresinsoftware.com/blog/?p=290</a>. The surveys are stored in the Correspondence historical model. The current survey and answered questions are stored in the navigation model. The view model brings these two together and publishes properties specifically for the view.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-10-06T14:35:30.697-07:00"
}