{
  "ProjectName": "tbox",
  "Title": "TBox - tool to make developer's life easier.",
  "Description": "TBox is powerful tool, that helps many people work much faster. It can execute unit tests in parallel, manage projects, automate routine tasks and many other.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>TBox is powerful tool with a big set of plugins, that help me and my friends  work much faster.</b> <br />This tool help me with my huge unit tests, with managing a lot of projects, automate all routine daily actions, which I don&#39;t like to do, and many many other. <br />Also it help me with my continuous integration services - automate deploy and run unit tests in parallel much faster.<br />This tool, is like ReSharper for dotnet projects or Visual Assist for c++ projects, but <b>it was designed to simplify work with set of projects</b>, but of course it can help with a single project :).<br /><br /><b>Existing plugins:</b>\n<ul><li><a href=\"https://tbox.codeplex.com/wikipage?title=AppSettings%20manager&referringTitle=Home\">AppSettings manager</a> - Ability to change appsettings in the set of app or web configs. For example you can enable/disable features or configure endpoint for the big set of projects in one click.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Automater&referringTitle=Home\">Automater</a> - Simple tool to automate everything what is possible. You can write your own scripts in c# and save arguments for all scripts, also you can specify arguments from UI. For example you can clear bin,obj,log folders, configure web configs, integrate libs and resources to the set of projects and etc.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Availability%20checker&referringTitle=Home\">Availability checker</a> - Check by timer, availability of the shared folders and web sites.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=BookletPagesGenerator&referringTitle=Home\">BookletPagesGenerator</a> - Page numbers generator, to print information in the book format on your printer. Very useful if your printer works unstable..</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=DevServer%20runner&referringTitle=Home\">DevServer runner</a> - Tool to run standard developer server without visual studio. Very useful if you should run many projects in one time, but don&#39;t have enough memory</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Directory%20processor&referringTitle=Home\">Directory processor</a> - Ability to run any software for any subdirectory of the directory. For example you can run localization tool by one click for resx files in the folders with localizations.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Encoder&referringTitle=Home\">Encoder</a> - You can easy encode/decode strings and change the formatting for easier reading. Format c++, json. xml,html, minimize text to one line and many others.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=File%20watcher&referringTitle=Home\">File watcher</a> - Ability to watch for the set of logs at real time. And see all the information in one stream with tray indicator. Very useful if you have a lot of projects, because you control all logs in one place.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=HtmlPad&referringTitle=Home\">HtmlPad</a> - Simple plugin to edit HTML in WYSIWYG style</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=LocalizationTool&referringTitle=Home\">LocalizationTool</a> - Plugin which can translate strings and save them in any applicable format (JSON, JS, INI and etc)</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Leaks%20Interceptor&referringTitle=Home\">Leaks Interceptor</a> - Created for the analysis of the applications and find any leaks. You can store information for weeks, but not hours as usual.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Notes&referringTitle=Home\">Notes</a> - simple plugin to manage notes.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=NUnit%20runner&referringTitle=Home\">NUnit runner</a> - Tool to run nunit tests in parallel. Support x86, admin rights, cloning of the tests folders and tests synchronization (for example when your tests kill all devservers on end). On the quad core cpu tests run up to 3-4 times faster. Very useful if your tests runs more than 10 minutes, especially if more than hour. </li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=PasswordsStorage&referringTitle=Home\">PasswordsStorage</a> - Tool to manage passwords. Support password generation.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Project%20manager&referringTitle=Home\">Project manager</a> - Easy way to manage your projects. You can rebuild, work with svn and run it&#39;s scripts from tray, collect all your changes for all projects in repo in the one place. Very useful if you have 3 or more projects.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=RegExp%20tester&referringTitle=Home\">RegExp tester</a> - Simple plugin to build regular expressions and test it.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Request%20maker&referringTitle=Home\">Request maker</a> - Ability to build and send any requests. Also you can do DDos to find perfomance issues or memory leaks. This is a good place to store your requests for different features.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Requests%20watcher&referringTitle=Home\">Requests watcher</a> - Ability to watch for the set of requests at realtime. And see all the information in one stream with tray indicator. Analog of the Fiddler, but not requre admin rights, because it uses trace information.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Searcher&referringTitle=Home\">Searcher</a> - Ability to very fast search in the big set of files for words and file names. I use it to search in the more than 512Mb of the sources files</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Services%20commander&referringTitle=Home\">Services commander</a> - Tool to start and stop windows services from menu or by hotkey. Also it is faster to run/stop service by hotkey.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=SkyNet&referringTitle=Home\">SkyNet</a> - plugin to unified distributed computing. Can run unit tests in parallel, run stress testing and etc on the set of the computers. (In development)</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Sources%20Uniter&referringTitle=Home\">Sources Uniter</a> - Simple plugin to unite big set of sources in to the one document. Designed mostly for students.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Sql%20Runner&referringTitle=Home\">Sql Runner</a> - Ability to build, store and run any sql scripts. Also you can do DDos to find perfomance issues. This is a good place to store your sql scripts for different features.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Sql%20watcher&referringTitle=Home\">Sql watcher</a> - Ability to watch for the set of SQL logs at realtime. And see all the information in one stream with tray indicator (Works with NHibernate). Very useful if you can&#39;t use profiler, also it format sql and apply arguments.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Templates&referringTitle=Home\">Templates</a> - Ability to create group of files and folders by template. For example you can create localization, qunit test fixture or project by template.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=TeamManager&referringTitle=Home\">TeamManager</a> - plugin to help with team management. It can generate time report by target process, svn and etc for all users from your team. It help me to fill time journal for my customers. (In development)</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Text%20generator&referringTitle=Home\">Text generator</a> - Small tool to generate text, guid by hotkey. Also it help when you export tables to excel or onenote.</li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Xslt%20tester&referringTitle=Home\">Xslt tester</a> - Small tool to test xslt transformations.</li></ul>\n<br /><b>Existing sub tools:</b>\n<ul><li>ConsoleScriptRunner - can run configured by you scripts with the last provided in UI parameters</li>\n<li>ConsoleUnitTestsRunner - run unit tests in parallel from console and save valid xml report</li>\n<li>runAsx86 - run any dotnet AnyCpu application as x86</li>\n<li>sudo - run any application with admin rights </li>\n<li>NUnitAgent - used for running of the tests in parallel</li></ul>\n<a href=\"https://helpers.codeplex.com/\">https://helpers.codeplex.com/</a><br /><a href=\"https://cpntr.codeplex.com/\">https://cpntr.codeplex.com/</a><br /><br /><b>This tool also support:</b>\n<ul><li>powerfull plugins system with very simple interface.</li>\n<li>global hotkeys for all operations</li>\n<li>scheduler for all operations</li>\n<li>custom user actions based on the existing functilnality.</li>\n<li>themes</li>\n<li>Multithreading anywhere where it make sense. Optimized for multi core cpu.</li>\n<li>Lazy initializations to reduce memory usage.</li>\n<li>localization (ru and en).</li></ul>\n<br />Here you can find documentation:\n<ul><li><a href=\"https://tbox.codeplex.com/wikipage?title=Settings&referringTitle=Home\">Settings</a></li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Information&referringTitle=Home\">Information</a></li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Fast%20Start%20Window&referringTitle=Home\">Fast Start Window</a></li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Advanced%20Description&referringTitle=Home\">Advanced Description</a></li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Plugins&referringTitle=Home\">Plugins</a></li>\n<li><a href=\"https://tbox.codeplex.com/wikipage?title=Plugins%20SDK&referringTitle=Home\">Plugins SDK</a></li></ul>\n<br /><b>Usage</b><br /><br /><br />This tool have written in my free time for using with the real projects. The start point is tray icon. Using tray icon you can open settings window or run any commands from menu.<br /><br /><img src=\"/projects/tbox/b1adb085-5b71-4dd7-99c1-61f707e73170\" alt=\"tray.png\" title=\"tray.png\" /><br /><br />Menu contain 2 parts:<br />In upper part you can find plugins submenus<br />In lower part you can find settings, fast start and exit.<br /><br />You can configure it in settings window:<br /><br /><img src=\"/projects/tbox/b81caef7-e371-46ea-a887-8b849912be5f\" alt=\"settings.png\" title=\"settings.png\" /><br /><br />I will be glad  if you send me issues, error logs or ideas how to improve it.<br /><br />My blog (rus): <a href=\"http://alexh-tbox.blogspot.com/\">http://alexh-tbox.blogspot.com/</a><br /><br /><b>Chocolatey</b><br />You can install this tool via single command:  <br /><div style=\"color:Black;background-color:White;\"><pre>\r\ncinst tbox\r\n</pre></div></div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,nunit,SQL,scripting,Tools,WPF,wcf,Search,Scintilla,encoding,Cassini,regexp,projects managment,leaks finder,Formatters,Time report,",
  "LastEdited": "2015-01-05T08:39:07.797-08:00"
}