{
  "ProjectName": "thepacman",
  "Title": "The Pacman",
  "Description": "A simple single player game similar to Pacman. Developed using XNA game framework and C#. Game demonstrates usage of fuzzy logic for controlling the AI ghosts. This game is developed to test the effect of fuzzy logic AI in Pacman game.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>&nbsp;</p>\r\n<h2><span style=\"color:#0000ff\"><strong>THE PACMAN</strong></span></h2>\r\n<p>&quot;The Pacman&quot; is a game created to mimic the original Pacman game with some improvements in its gameplay using advanced Fuzzy Logic AI controller for the ghosts. The game consists of a character called &ldquo;Pacman&rdquo; who tries to eat all the pellets\r\n present in an arena without getting captured by the &ldquo;ghosts&rdquo;. The arena is filled with pellets which are to be eaten by the pacman. Some pellets are powered up pellets which &ldquo;temporarily&rdquo; makes pacman hefty enough to eat the ghosts,\r\n which makes all the ghosts run away from pacman.<br>\r\n<br>\r\nThe game consists of nearly forty levels and with every level advancement, the game gets more and more tough to play.The levels are designed using pleasing textures which gives the user a better game play. Different types of ghost modes like Hunter, Shy, Random\r\n and Forecast are present, which are acquired by the ghosts using fuzzy logic techniques, so as to make the pacman a more interesting game.</p>\r\n<p>The Detailed Documentation is present&nbsp;<span><strong><a href=\"http://thepacman.codeplex.com/documentation\">here</a>&nbsp;</strong></span></p>\r\n<p><strong>Screenshots:</strong></p>\r\n<p><img src=\"http://img62.imageshack.us/img62/2617/screenshot1xd.png\" alt=\"\"></p>\r\n<p><img src=\"http://img215.imageshack.us/img215/7904/screenshot3oo.png\" alt=\"\"></p>\r\n<p><img src=\"http://img12.imageshack.us/img12/2623/screenshot2lpx.png\" alt=\"\"></p>\r\n<p><img src=\"http://img405.imageshack.us/img405/381/screenshot4to.png\" alt=\"\"></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "PacMan,XNA Game Studio,C#,fuzzy,",
  "LastEdited": "2011-06-10T13:35:03.64-07:00"
}