{
  "ProjectName": "viewmodelgenerator",
  "Title": "ViewModel Generator",
  "Description": "A ViewModel code generator for use with WPF and a MVVM pattern. It generates a ViewModel partial class based on an Entity Framework class. This is currently for use with Visual Studio 2008 and .NET 3.5.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A ViewModel code generator for use with WPF and a MVVM pattern. It generates a ViewModel partial class based on an Entity Framework class. This is currently for use with Visual Studio 2008 and .NET 3.5.<br />\n<h1>Introduction</h1>\r<blockquote>Although it can be used just with the <a href=\"http://msdn.microsoft.com/en-us/magazine/dd419663.aspx\">MVVM pattern</a>, the ViewModel Generator is designed for use with the October 2009 release of the <a href=\"http://msdn.microsoft.com/en-us/library/ff648465.aspx\">Composite Application Guidance</a>.  This was inspired by a real world problem then cropped up during development. It involved a large application with a substatial data model. One the tables had an excess of eighty columns. Each of those values had to be manually mapped to a ViewModel so that a property change would raise a corresponding notification in the View. The relationship between the View and ViewModel became increasingly fragile in direct proportion to the number of properties. The relationship would break any time there was a change in a field name or field type. And since we were in the early stages of development, this happened rather frequently. The ViewModel Code generator was developed in an effort to alleviate the overhead of maintaining the ViewModel and EntityFramework relationship.</blockquote>\n<h1>Getting Started</h1>\r<blockquote>If you have just downloaded the ViewModelGenerator.msi and want to get up and running quickly, please see the <a href=\"https://viewmodelgenerator.codeplex.com/wikipage?title=QuickStart&referringTitle=Home\">Quick Start Guide</a>.</blockquote>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "MVVM,Code Generator,CAG,Entity Framework,ViewModel,PRISM,ViewModelBase,",
  "LastEdited": "2010-06-23T06:04:23.953-07:00"
}