{
  "ProjectName": "VisualizeJobSkills",
  "Title": "Visualize and Analyze Demand for Coding Skills, Using WPF",
  "Description": "Use data visualization app to figure-out which job skills are most in demand. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Why Analyze Job Skills?</h1>\rYou constantly keep learning new skills; you <i>must do so</i> if you want to thrive as a programmer. But are you learning the <i>right</i> skills? If you learn the skills that are in demand, you can enjoy life with a secure and profitable career. But learn skills that no one wants, no matter how cool they are, and risk living in your car! <br /><img src=\"/projects/VisualizeJobSkills/3a24211f-9cf2-43a2-918f-f72bfc9702a6\" alt=\"SleepingInCar.jpg\" title=\"SleepingInCar.jpg\" /><br /><br />I wrote a program to download job skill data from Careers 2.0 (Stack Overflow) and analyze the tags. You can download my code and either run it yourself (to pick good skills to learn), or examine the code and learn from my coding techniques. Instead of running the code, you can read about the results on my blog<a href=\"http://actualrandy.wordpress.com/2014/05/08/earn-the-big-bucks-by-learning-new-job-skills-smartly/\">http://actualrandy.wordpress.com/2014/05/08/earn-the-big-bucks-by-learning-new-job-skills-smartly/</a>.<br /><br />Caveat: if you run my code, please be kind to StackOverflow, don&#39;t hammer their site by scraping their screens over and over!<br />\n<h2>Main Display Grid</h2>\rThe first thing the program does is display the skills, ranked (initially) by their demand on Stack Overflow. Like all WPF grids, you can sort on any column. You can download fresh data or use the file included, which naturally will be stale starting tomorrow!<br /><img src=\"/projects/VisualizeJobSkills/4c84b448-d2ea-49a3-8992-6b4b19e93472\" alt=\"Top15.jpg\" title=\"Top15.jpg\" /><br />\n<h2>If you click the Plus sign, you can get additional details for a skill:</h2>\r<img src=\"/projects/VisualizeJobSkills/e41d1c57-8db9-466b-b1ff-1a846354512c\" alt=\"TagDetails.jpg\" title=\"TagDetails.jpg\" /><br />\n<h2>Interactive Chart</h2>\rAdditionally, you can filter and modify the skills as a bar chart; you have several choices for Y-Axis.<br /><img src=\"/projects/VisualizeJobSkills/51416dfc-3ae8-4ed1-af49-47c02cb0869c\" alt=\"PctRemoteAllowed.jpg\" title=\"PctRemoteAllowed.jpg\" /><br />\n<h2>Two Kinds of Analysis</h2>\rThe main point of the main grid is to make sure your skill set is in demand by employers. But on the second tab, I try to provide ways of identifying skills that are rare or hard to fill. The idea is that those skills command a higher pay.<br />\n<h2>Code Techniques Used for the Program</h2>\r<ul><li>This project opens in Visual Studio 2010 or 2013</li>\n<li>C#</li>\n<li>Regular Expressions - they allow me to extract data from web pages</li>\n<li>File IO - for saving/loading the results</li>\n<li>Reactive Extensions - Microsoft&#39;s asynchronous/multi-threading library</li>\n<li>Linq - to sort/group/count/filter/aggregate/average/analyze job data</li>\n<li>WPF animations - for better user feedback</li>\n<li>WPF user controls - for better UI organization</li>\n<li>WPF templates - to transform a listbox into a bar chart, to nest grids for interactive drill-down</li></ul>\n\n<h2>Potential Modifications and Enhancements</h2>\rIf you want to join this project and help improve it, here are some ideas:\n<ul><li>A friend has suggested adding data from other web sites, such as Monster/Dice, etc.</li>\n<li>If it had a database, we could analyze growth shrinkage trends. The idea being we could download every day and determine which skills are gaining popularity</li>\n<li>I just discovered a minor bug, there might be others</li>\n<li>I would like to modify the bar chart to bind the opacity to some other value</li></ul>\n<br />If you want to contribute, you will need the MS Reactive Extensions, which you can download here <a href=\"http://msdn.microsoft.com/en-ca/data/gg577610.aspx\">http://msdn.microsoft.com/en-ca/data/gg577610.aspx</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "Job Skills,Data Visualization,WPF,C#,Analysis,Linq,Resume Building,RegEx,WPF Animation,WPF custom controls,Regular Expressions,Rx,Reactive Extensions,",
  "LastEdited": "2014-05-09T09:13:38.75-07:00"
}