{
  "ProjectName": "WpfPrintEngine",
  "Title": "WPF Print Engine",
  "Description": "WPF Print Engine makes is easier for .net developers working with WPF applications to leverage printing facility. It is a standalone component that takes in few required and optional parameters to give encapsulate developers from all heavy lifting in order to deal with printing.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>Printing is one of the bizarre part in all these years of my programming experience where i sometimes ran out clue and started figuring out solutions with guess work sometimes. It could just be that i was not good enough or could be that the thousands of\r\n different types of printers to handle were just not easy to tame. However it be, i landed up to a stage where i could address it quite fine to my requirements.</p>\r\n<p><strong>What is WPF Print Engine ? </strong></p>\r\n<p>WPF Print Engine makes is easier for .net developers working with WPF applications to leverage printing facility.</p>\r\n<p>It is a standalone component that takes in few required and optional parameters to give encapsulate developers from all heavy lifting in order to deal with printing.</p>\r\n<h2>Features</h2>\r\n<p>WPF print engine comes with the following features at the moment :</p>\r\n<ul>\r\n<li>Smart print preview to see what it would look like on after printing on the printer and paper you selected\r\n</li><li>Support for changing printer preferences directly </li><li>Scale page content in the print preview to fit in less pages </li><li>Turn on/off page numbers </li><li>Asynchronous printing directly to printer </li><li>Any WPF Visual Support </li><li>Any WPF FrameworkElement Support </li><li>DataTable Support </li></ul>\r\n<h1>More Details on Usage and Demo at : <a href=\"http://blog.saraf.me/2011/05/wpf-print-engine/\">\r\n</a><a href=\"http://blog.saraf.me/2011/05/wpf-print-engine.html\">http://blog.saraf.me/2011/05/wpf-print-engine.html</a></h1>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "wpf,printing,",
  "LastEdited": "2012-01-17T06:28:52.263-08:00"
}