{
  "ProjectName": "wpfshadergenerator",
  "Title": "WPF ShaderEffect Generator",
  "Description": "The WPF ShaderEffect Generator is an integration to Visual Studio to automatically generate the code-behind ShaderEffect classes for shader (*.fx) files in your project as well as compile the *.fx file in your project and add the resulting pixel shader as a resource.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The WPF ShaderEffect Generator is an integration to Visual Studio 2008 and 2010 to automatically generate the (C#) code-behind ShaderEffect classes for shader (*.fx) files in your project as well as compile the *.fx file in your project and add the resulting pixel shader as a resource so that it can be loaded by WPF when needed.<br /><br />After installing you should find a new &quot;WPF Shader Effect File&quot; item template.  If you have existing HLSL files that you would like to start doing this for, just select the .fx file and set the CustomTool property to <b>ShaderEffectGenerator</b>.  See the <a href=\"http://wpfshadergenerator.codeplex.com/documentation\">Documentation</a> for more information.<br /><br />Also for anyone that uses <a href=\"http://shazzam-tool.com\">Shazzam</a> the comment syntax that is used to set different default values or add comments...etc is the same.  So you should be able to use any of their syntax to assist the generator create the correct code for you.  There are only a few differences in the number of tags supported, only because I can get that information from other locations (such as the namespace to generate the code in).  In any event, I&#39;m hoping to keep both projects interoperable so that you can use their tool to test your shaders.<br /><br /><b>You do NOT need to have the DirectX SDK installed to use this project</b><br /><br />If you need syntax highlighting for HLSL in Visual Studio I highly recommend <a href=\"http://nshader.codeplex.com\">NShader</a><br /><br />Silverlight is supported in theory; if anyone runs into a problem using this for Silverlight let me know.<br /><br />For more great WPF stuff, check out my blog: <a href=\"http://www.nickdarnell.com\">http://www.nickdarnell.com</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "Shader,ShaderEffect,WPF,Silverlight,Visual Studio,Visual Studio 2008,VSX,code generation,Code Generator,HLSL,Visual Studio 2010,",
  "LastEdited": "2010-07-23T16:05:43.97-07:00"
}