{
  "ProjectName": "XEFFEX",
  "Title": "XEFFEX",
  "Description": "XEFFEX is a play off the piano gadget. The shapes were manipulated and the sounds are set to different effects. The end goal was too have the pads play a sound and execute a program the user can pre-choose. The options menu allows quit access to your files. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>&nbsp;</strong></p>\r\n<p id=\"license_text\">Copyright (c) 2012 Duchess B. Breinstein<br>\r\n<br>\r\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the &quot;Software&quot;), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge,\r\n publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:<br>\r\n<br>\r\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.<br>\r\n<br>\r\nTHE SOFTWARE IS PROVIDED &quot;AS IS&quot;, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE\r\n FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.</p>\r\n<p><strong>XEFFEX.Gadget</strong></p>\r\n<p>&nbsp;</p>\r\n<p><strong>This gadget allows you to set different .wav files to the keys for your own custom sound synthesizer. It is a play on the piano gadget with lots of mods and no automatic behind the scenes updating. Its a perfect development example to build on and/or\r\n learn from. The desired result is to have programs of your choice launch with a sound of your choice. It has lots of portable potential as well as accessability potential. The Options menu (looks like a wrench) has a browse for files option (works) and an\r\n upload button (not programmed yet).&nbsp;Set this to play&nbsp;your programs like a synthesizer and you have one&nbsp;mean command console!!!&nbsp;<br>\r\n<br>\r\n</strong></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-05-09T11:42:32.86-07:00"
}