{
  "ProjectName": "xnatoolgui",
  "Title": "XNA Tool GUI",
  "Description": "An XNA GUI for tool windows.  This is useful for creating tool windows that allow changing parameters in your program during testing or level creation and see the effects in real time (as opposed to break points to change in code).",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />An XNA GUI for tool windows.  This is useful for creating tool windows that allow changing parameters in your program during testing or level creation and see the effects in real time &#40;as opposed to break points to change in code&#41;.<br /><br />XNA Tool GUI was designed and written to satisfy my needs for a flexable but small (footprint) gui for tool windows in my XNA graphics projects.<br /><br />XNA Tool GUI is intended for windows projects (during design/coding cycles) to help with parameter setting at runtime, and for tool windows during scene creation/parameterization.  This gui could be easily modified to be used on XBox360 if desired, but note that it was not originally intended for &quot;in game&quot; menus.  The main interface devices for the this GUI system is the mouse and keyboard.<br /><br /><b>Current GUI elements</b> (see screenshot below)\n<ul><li>Tab Control/Tab Pages</li>\n<li>Label</li>\n<li>TextBox</li>\n<li>CheckBox</li>\n<li>RadioButton/RadioGroup</li>\n<li>ListBox</li>\n<li>Tree control</li>\n<li>Horizontal Slider/Labeled Slider</li>\n<li>Vertical Scrollbar</li></ul>\nSee the Documentation page (link above) for more information.<br /><br /><b>Screen Shot</b><br />The following screen shot is the right side of an XNA graphics project (just right side to keep image size down):<br /><img src=\"/projects/xnatoolgui/677d239b-ec20-4285-ace1-8f66f5645b28\" alt=\"XNAToolGUI_pic1.png\" title=\"XNAToolGUI_pic1.png\" /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "XNA,GUI,XNA GUI,XNA Libraries,XNA 3.1,XNA Game Studio,XNA game engine,xna menu,XNA Forms,Xna Component,",
  "LastEdited": "2010-09-20T20:37:22.377-07:00"
}