{
  "ProjectName": "YourLog4NetViewer",
  "Title": "LogViewer for Log4Net",
  "Description": "LogViewer is a WPF application allowing to view Log4Net log files.\nLogs must be in Xml (just need a few lines in your application config file to configure it to use this format).\nSearch, log merging, filtering are already supported but the project is open for new enhancements.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>This project has been moved to GitHub.  New features to come!  <a href=\"https://github.com/rhessinger/LogViewerForLog4Net\">https://github.com/rhessinger/LogViewerForLog4Net</a></b><br /><br /><b>Project Description</b><br />LogViewer is a WPF application allowing to view Log4Net log files.<br />Logs must be in Xml &#40;just need a few lines in your application config file to configure it to use this format&#41;.<br />Search, log merging, filtering are already supported but the project is open for new enhancements.<br /><br /><img src=\"/projects/YourLog4NetViewer/e9f08684-877e-45d7-a721-85b76e9eecd6\" alt=\"LogViewer.png\" title=\"LogViewer.png\" /><br /><br /><b>Setup</b><br />Download latest binaries, unzip in any folder. Launch LogViewer.exe. That&#39;s all.<br />To be able to manage your Log4Net logs with this application you must modify the way logs are formated. Open the LogViewer About Box and you&#39;ll see a little code sample that you must copy within your app.config file. Once it is done, your application will generate XML log files that can be read by LogViewer. Of course you can add this Log4Net configuration beside the existing one if any. <br />For more information about Log4Net XML output please read the Log4Net documentation (<a href=\"http://logging.apache.org/log4net/index.html\">http://logging.apache.org/log4net/index.html</a>).<br /><br /><b>History</b><br />First version has been created by Ken C Len and published on CodeProject in 2009.<br />CodePlex version is an enhanced release by Olivier Dahan, MVP CAD 2010, MVP C# 2009.<br /><br />This software is under .NET 4.0 and WPF. Project can be edited using VS2010 and Blend 4.<br /><br /><b>License</b><br />I&#39;m publishing this enhanced version of the original code with the permission of original author. This particular release is under the Ms-RL license.<br /><br /><b>Future</b><br />Any contribution to this project will be appreciate. There are many things that can be done to make this usefull tool even better. Feel free to contact me to be involved in next releases !<br /><br /><b>Source code</b><br />To build the project you&#39;ll need to reference WPF.Themes DLL. This is also a CodePlex project : <a href=\"https://yourlog4netviewer.codeplex.com/wikipage?title=http%3a%2f%2fwpfthemes.codeplex.com%2f&referringTitle=Home\">http&#58;&#47;&#47;wpfthemes.codeplex.com&#47;</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "log4net,",
  "LastEdited": "2017-05-24T06:41:12.403-07:00"
}