{
  "ProjectName": "advancedresourcetab",
  "Title": "Advanced Resource Tab for Blend",
  "Description": "Advanced Resource Tab is an extension to Blend for Visual Studio 2012 which adds an additional tab window to get more control over the default resource tab.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project moved to GitHub</h1>\rPlease look at <a href=\"https://github.com/TimoKorinth/advanced-resource-tab\">https://github.com/TimoKorinth/advanced-resource-tab</a> to find the current release of this project.<br />\n<h1>Advanced Resource Tab</h1>\rfor <b>Blend for Visual Studio 2012</b><br /><br />Advanced Resource Tab is an extension to Blend for Visual Studio 2012 which adds an additional tab window to get more control over the default resource tab.<br /><br />By default the resource dictionaries in the resource tab of Blend for Visual Studio 2012 (previously Expression Blend) aren&#39;t in any useful order. If you got a large number of resources in your solution this is a real pain and time killer, searching for the resources you want. As long as I can imagine, this is fact in Expression Blend.<br /><br />To get around this annoying bug, I&#39;ve created the Advanced Resource Tab for Blend.<br />\n<h2>Features</h2>\r<ul><li>Sorting resource dictionaries in the resource tab (ascending / descending)</li>\n<li>Provide buttons to expand / collapse all resource dictionaries</li>\n<li>Quick Searching / Filtering of resources in the resource tab</li>\n<li>Include (sub-)resources in searching / filtering</li>\n<li>Enhances the default resource tab window</li>\n<li>Regular Blend extension (one dll)</li></ul>\n<img src=\"http://download-codeplex.sec.s-msft.com/Download?ProjectName=advancedresourcetab&amp;DownloadId=704854\" /><br />\n<h2>Installation</h2>\rAll you have to do is to copy the <i>AdvancedResourceTab.Extension.dll</i> into the extension folder of Blend. Typically this is &quot;<i>C:\\Program Files (x86)\\Microsoft Visual Studio 11.0\\Blend\\Extensions</i>&quot;.<br />\n<h2>Usage</h2>\rNow, if you start Blend, by default the resource dictionaries in the resource tab are in an alphabetically order (ascending).<br /><br />But if you want more control over the default resource tab, you have to activate the Advanced Resource Tab window:<br /><img src=\"https://www.codeplex.com/Download?ProjectName=advancedresourcetab&amp;DownloadId=704034\" /><br /><br />After activating the Advanced Resource Tab window, you can move / dock it in Blend. Make sure to dock it on top of the existing resource tab, so you can see both at a time. Before dropping it, a white layer is visible to indicate that it&#39;s going on top of the tabs:<br /><img src=\"https://www.codeplex.com/Download?ProjectName=advancedresourcetab&amp;DownloadId=704035\" /><br /><br />Now you have full control over the resource tab in Blend. Just change the ordering or type in a resource dictionary name to get live result filtering in the resource tab.</div><div class=\"ClearBoth\"></div>",
  "TagList": "xaml,blend,extension,.net,wpf,silverlight,visual studio,",
  "LastEdited": "2015-03-09T03:38:15.203-07:00"
}