{
  "ProjectName": "AgControlSuite",
  "Title": "Ag Control Suite - Custom Controls for Silverlight",
  "Description": "The Ag Control Suite is yet another set of custom controls for Silverlight.  This collection strives to include controls that go beyond what is currently available to the community but still provide much needed functionality.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>What is the Ag Control Suite?</h2>\rThe Ag Control Suite is yeat another suite of custom Silverlight 2 controls.  I haven&#39;t done an official count but I think I have seen at least ten available in some way, shape or form.  This suite has spawned from the work I am doing for a commercial product.  You can find further details on this (and the controls itself) on my blog:  <a href=\"http://blogs.thecodearchitects.com\">http://blogs.thecodearchitects.com</a>.<br /><br />I will attempt to only include useful, or mainstream, controls in this suite.  I also hope to ensure they offer all of the appropriately functionality and that they are fully documented and include unit tests and samples.  I don&#39;t currenly have the samples online but I will attempt to remedy this in short order.<br /><br />In order to improve these controls (and the suite itself) please use the <a href=\"http://agcontrolsuite.codeplex.com/WorkItem/List.aspx\">issue tracker</a> to report bugs and request additional features and controls.<br /><br /><b>The Controls</b><br />Currently the suite is not much of a <i>suite</i> as it only contains two completed controls.  Those are:\n<ul><li>GridSplitter</li>\n<li>Slider</li></ul>\n<img src=\"/projects/AgControlSuite/a60f869e-4ef0-4a13-9162-3ba9cb733d72\" alt=\"GridSplitter.jpg\" title=\"GridSplitter.jpg\" /><br />The <b>GridSplitter</b> is a more enhanced version of the standard GridSplitter that is included with Silverlight.  For those that don&#39;t know, a GridSplitter separates two Grid columns (or rows) and allows them to be resized.  It has been updated to provide a customizable <i>handle</i> that is used to fully collapse/expand the target Grid column.<br /><br /><img src=\"/projects/AgControlSuite/ece30cdf-989f-4d50-b048-647e4f202e7a\" alt=\"Slider.jpg\" title=\"Slider.jpg\" /><br />The <b>Slider</b> control is a bit more involved as the existing Silverlight Slider control could not be inherited (in this situation).  Again, my blog (<a href=\"http://blogs.thecodearchitects.com/?p=121\">http://blogs.thecodearchitects.com/?p=121</a>) details this in the first in a series of articles that covers these controls in details.<br /><br />There are a couple controls that I am currently working on that will be included in a future update:\n<ul><li>DropDownButton</li>\n<li>PopupMenu</li></ul>\nThe <b>DropDownButton</b> control is a button that includes a drop down indicator (similar to the one found on a <b>ComboBox</b>) which is used to display a <b>ContextMenu</b>.  The <b>ContextMenu</b> options are used to change what action the button performs.  The <b>PopupMenu</b> control will allow you to create context menus.<br /><br />The solution provided includes sample pages that include a project for the controls, a project containing samples that demonstarte how to use the controls and (in most cases) unit tests.<br /><br />I want to end this overview by thanking <b>Berico Tailored Systems (BTS)</b>, who holds the copyright for this project, for allowing me to release the code to the community.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Slider,GridSplitter,",
  "LastEdited": "2009-09-08T10:35:32.067-07:00"
}