{
  "ProjectName": "aggravation",
  "Title": "Aggravation",
  "Description": "A computer version of the classic board game Aggravation.  This was built in Silverlight 4, and makes use of Prism and Behaviors.  ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong><span style=\"text-decoration:underline\">Aggravation Board Game</span><br>\r\n</strong>My family members have been playing this board game for some time now and I wondered if I could create a computer version of it.&nbsp; So I chose Silverlight and gave it a shot.</p>\r\n<p>I used the Prism modularity patterns to make this a modular application.&nbsp; This allows me to easily swap out the game board designs with&nbsp;different ones just by changing the module catalog.&nbsp; I supply two different game boards.&nbsp; Simply specify\r\n one to use in Catalog.xaml.&nbsp;</p>\r\n<p>The gameboards are set up using Silverlight Behaviors to specify the elements that make up the game board.&nbsp; This allows game boards to be quickly created in Expression Blend.</p>\r\n<p>This was built on Silverlight 4, but I am looking to update it to Silverlight 5 soon.&nbsp; There are&nbsp;few known issues in this first release, and is pretty stable right now.<br>\r\n<br>\r\nYou can try it out at this link to my server:<br>\r\n<a href=\"http://mcpro.com/aggravation/\" target=\"_blank\">http://mcpro.com/aggravation/</a><br>\r\n<br>\r\n<em>Please mail me with any questions or interest on this project.</em><br>\r\n<em><a href=\"mailto:dotnethero@mcpro.com\">dotnethero@mcpro.com</a></em><br>\r\n<br>\r\n<img src=\"http://www.codeplex.com/Download?ProjectName=aggravation&DownloadId=485667\" alt=\"\" width=\"650\"><br>\r\n<br>\r\n<img src=\"http://www.codeplex.com/Download?ProjectName=aggravation&DownloadId=485668\" alt=\"\" width=\"650\"><br>\r\n<br>\r\n<img src=\"http://www.codeplex.com/Download?ProjectName=aggravation&DownloadId=485669\" alt=\"\" width=\"650\"></p>\r\n<p><img src=\"http://www.codeplex.com/Download?ProjectName=aggravation&DownloadId=498673\" alt=\"\" width=\"650\"></p>\r\n<div><span lang=\"EN\">\r\n<p><strong><span style=\"text-decoration:underline\">Object</span></strong><br>\r\nThe first player to move all four player pieces from the base area to the home area wins. On a player's turn, the player draws a card from the deck. The player moves along the game track the number of spaces equal to the card value. The cards 2-10 are face\r\n value, and the Ace, King, Queen, Jack, and Joker cards have a value of 1.<br>\r\n<br>\r\n<strong><span style=\"text-decoration:underline\">Gameplay</span></strong><br>\r\nThe player moves from base to start by drawing a Joker, Ace, or Six. When one of these cards is drawn, the player moves to the start location and no further. Only one piece can occupy the start location. The player draws again. Anytime the player draws a Six,\r\n Ace, King, Queen, Jack, or Joker they get to take another turn. The player moves around the game board clockwise the full card value until they reach their own home area. You must move the full card value, and must move into home the exact number of moves.&nbsp;</p>\r\n</span></div>\r\n<p><strong><span style=\"text-decoration:underline\">Regular moves</span></strong><br>\r\nPlayers cannot land on or move past their own piece, but can <span lang=\"EN\">move past other players.\r\n<br>\r\nIf a player lands on another player, then the landed on player is sent back to their base. If the player draws a four, then the player must move backwards four spaces.<br>\r\n<br>\r\n<strong><span style=\"text-decoration:underline\">Fast Track and Super Fast Track</span></strong><br>\r\nThe inner locations in the triangles are fast track locations. If a player lands on one of these locations by exact count, they are on the fast track. The player can move clockwise between fast track locations on their next turn. This allows a player to advance\r\n the game board quickly. If the fast track move is not used in the next turn, then the player loses the chance to move along the fast track. You can move into the regular game track for the remaining card value at any fast track location.<br>\r\n<br>\r\nThe super fast track is the location in the middle of the game board. You can move to the super fast track location by exact count. The only way out of super fast track, is to draw a card value of one. You can exit into any of the fast track locations.</span></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-09-28T21:53:39.017-07:00"
}