{
  "ProjectName": "alumnicenter",
  "Title": "UMC Information System Alumni Center Website",
  "Description": "This project is our final task for course Internet Programming II at Study Program of Information System, Faculty of Technology and Science at University of Ma Chung (UMC). UMC is private educational institution, first university in Indonesia applying Microsoft technology thoroughly called the total solution, which established in Malang, East Java, Indonesia.\r\n\r\nWe named our project 'UMC Information System Alumni Center'. It doesn't mean this project is really used to be official website for our alumni ties, but only simulation for us to tried to built one complex website that have functional feature like real alumni center. This project fully created with Microsoft Visual Studio 2010 with framework ASP.NET 4.0, Visual Basic programming language, Silverlight 4, and SQL Server 2008. For addition, we use some Ajax feature in order to enhanced satisfaction of website usage.\r\n\r\nThis website main features are:\r\n-Multilevel user (admin, non-core staff, member, guest)\r\n- Registering as alumni\r\n- Full function of maintenance article (show, add, edit, and delete) and commenting article also available\r\n- Jquery enhanced photo gallery\r\n- User tracking based on name or location\r\n- Job vacancy management\r\n- LinkedIn-like user profile customizable\r\n- Facebook-like event management with RSVP\r\n- and many other small but still useful features\r\n\r\nIf you wanna try online example of this project, visit http://ar2.charlezz.com. This project language currently is Indonesian, sorry for inconvenience if you don't understand Indonesian.\r\n\r\nWe realize that this project still definitely lacking in many things, so don't be hesitate to criticize or ask something to us, we'll be excited to hear some words from you for this project. Thank you!\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">This project is our final task for course Internet Programming II at Study Program of Information System, Faculty of Technology and Science at University of Ma Chung (UMC). UMC is private educational institution, first university in Indonesia applying Microsoft technology thoroughly called the total solution, which established in Malang, East Java, Indonesia. For further information visit <a href=\"http://www.machung.ac.id\">http://www.machung.ac.id</a><br /><br />We named our project &#39;UMC Information System Alumni Center&#39;. It doesn&#39;t mean this project is really used to be official website for our alumni ties, but only simulation for us to tried to built one complex website that have functional feature like real alumni center. This project fully created with Microsoft Visual Studio 2010 with framework ASP.NET 4.0, Visual Basic programming language, Silverlight 4, and SQL Server 2008. For addition, we use some Ajax feature in order to enhanced satisfaction of website usage.<br /><br />This website main features are:<br />-Multilevel user (admin, non-core staff, member, guest)<br />- Registering as alumni<br />- Full function of maintenance article (show, add, edit, and delete) and commenting article also available<br />- Jquery enhanced photo gallery<br />- User tracking based on name or location<br />- Job vacancy management<br />- LinkedIn-like user profile customizable<br />- Facebook-like event management with RSVP<br />- and many other small but still useful features<br /><br />If you wanna try online example of this project, visit http://ar2.charlezz.com. This project language currently is Indonesian, sorry for inconvenience if you don&#39;t understand Indonesian.<br /><br />We realize that this project still definitely lacking in many things, so don&#39;t be hesitate to criticize or ask something to us, we&#39;ll be excited to hear some words from you for this project. Thank you!<br /><br />Regards, <br /><br />Anak Agung Ngurah P.A. and Muhammad Rizqi<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-06-08T08:27:04.657-07:00"
}