{
  "ProjectName": "amp",
  "Title": "Accessible Media Project",
  "Description": "A collection of tools to enable the creation of accessible media experiences using silverlight and WPF. The first tools are player skins which incorporate captioning, audio description, and sign translation; and demonstrate expose custom controls to assistive technology with UIA.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The Accessible media project is a collection of tools for making websites using media more accessible.<br /><br />The first release is a basic video player, whose main aim is as a vehicle for demonstrating how to achieve WCAG 2.0 AAA accessibility using Silverlight.<br /><br />In the first release, the player supports the following accessibility features, which should bring websites using it to AA.<br />\n<ol><li>Reading closed captions from W3C timed text files and switching on and off\n<ol><li>Uses a simple Timed text at present.</li>\n<li>No audio present is signalled for video with no audio track</li></ol></li>\n<li>Reading audio description (audio files and associated captions) from W3C timed text.\n<ul><li>Descriptions can be extended to pause the main video to fit in longer descriptions</li>\n<li>Premixed audio in second soundtrack also supported for simple descriptions</li></ul></li>\n<li>Switchable sign translation video can be overlaid on the main video.</li>\n<li>caption and sign language is keyed of current locale but can be changed</li>\n<li>Keyboard navigation \n<ol><li>Tab navigation using IsTabStop and TabIndex</li>\n<li>Keyboard shortcuts  using keyboard events</li></ol></li>\n<li>ISO standard accessibility icons</li>\n<li>Full screen mode</li>\n<li>UIA integration using UIA&#39;s AutomationPeer</li>\n<li>User preferences stored in IsolatedStorage.</li></ol>\n<br /><br />Our second release is a set of tools for creating media players using the Expression Encoder product more directly. It consists of a an accessible template and an associated plugin which allows non-programmers to create a silverlight player directly from a set of assets.<br /><br />This template includes the same access features as the version one player, with a slightly different look and feel. It does not include the user preferences dialog.<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Accessibility,Media Player,timed text,dfxp,",
  "LastEdited": "2009-03-21T05:31:46.763-07:00"
}