{
  "ProjectName": "aspzonecommerce",
  "Title": "aspZone Commerce",
  "Description": "This project is intended to be my ASP.NET MVC / WCF / Silverlight / DDD / TDD learning experience",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Partially based on inspiration from Rob Conery and his MVC Storefront webcasts, I am writing my own eCommerce application. I could use an off-the-shelf product, or an open source product, but how fun would that be? I know there are a gazillion eCommerce software packages out there. Who needs another one? My goal is not the end result, but the learning experience of a new way of developing software.<br /><br />I am trying to use TDD (Test Driven Development), but it is hard. I&#39;m not used to coding that way. I have been in more of a test after development mindset.<br /><br />I am trying to use DDD (Domain Driven Design). That is not so hard, I have usually started by designing the database schema first, but I&#39;ve always kept the appearance of my model classes in mind when doing so. It is a nice shift to start with writing my domain objects first.<br /><br />I am using NHibernate for the first time, but I&#39;ve used other ORM&#39;s for many years. I am also using LINQ to NHibernate. I think I&#39;ve found a few bugs already, I will have to isolate a test case and post it here, and see if I can&#39;t contribute something back to that community.<br /><br />I plan to use the ASP.NET MVC framework for the customer side of the application. I plan to use silverlight for the admin interface. I plan to expose a WCF service for the silverlight code to talk to the back end.<br />\n<h2>How to contribute?</h2>\r\nI am not at the stage where I really want other folks to join the project, I need to lay down a bunch more groundwork. It&#39;s nothing more than a place for me do do my playing around at this stage. At some point, I will open things up for other contributors. But, if you see that I am doing something wrong, feel free to submit a patch.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET MVC Commerce,",
  "LastEdited": "2008-06-12T07:55:22.43-07:00"
}