{
  "ProjectName": "autoscroller",
  "Title": "AutoScroller for Silverlight ScrollViewer",
  "Description": "AutoScroller is a C# class for Silverlight. It adds automatic scrolling to a ScrollViewer. This is useful, for example, in a drag-and-drop interface inside a ScrollViewer: If an object is dragged to the edge, automatic scrolling can be triggered",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>AutoScroller</h1>\r\nThis is for automatically scrolling a scrollviewer. An example use would be when dragging an object to the edge of a scrollviewer. An example project showing its use in a drag and drop application is provided.<br /><br />AutoScroller is a C&#35; class for Silverlight. It adds automatic scrolling to a ScrollViewer. This is useful, for example, in a drag-and-drop interface inside a ScrollViewer&#58; If an object is dragged to the edge, automatic scrolling can be triggered<br /><br />See blog post regarding this: <a href=\"http://chaosorganised.com/wordpress/?p=65\">Silverlight AutoScroller Example</a><br /><br />Rationale: ScrollViewer is a sealed class. Applying the functionality to it via a separate class seems like a neat approach. <br /><br />Please refer to the documentation.<br />\n<h2>Notes</h2>\r<ul><li>If the background of the content element is null, then the handlers will not respond while they are over empty spaces within the content (unless a content element has captured the mouse). Setting the background of the content element to Transparent will fix this, if it is an issue.</li>\n<li>If mouse events have the handled property set to true by controls, it will prevent event bubble up, and may interfere with automatic scroll function.</li>\n<li>AutoScrolling will work on a ScrollViewer with a Scrollbar&#39;s visibility set to Hidden. It won&#39;t work on that axis if the Scrollbar&#39;s visibility is set to Disabled. </li></ul>\n<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Silverlight 2.0,ScrollViewer,Silverlight NPE,",
  "LastEdited": "2011-12-06T18:03:02.043-08:00"
}