{
  "ProjectName": "autoexpandover",
  "Title": "AutoExpandOver - Show popup on mouseover, focus, click in Silverlight",
  "Description": "AutoExpandOver lets a user define \"header\" content and \"popup\" content. Then, depending on settings it will popup when the user hovers, clicks, or gives focus to the \"header\" content. The popup uses the hidden overlay strategy so it has those benefits/quirks.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />AutoExpandOver lets a user define &#34;header&#34; content and &#34;popup&#34; content. Then, depending on settings it will popup when the user hovers, clicks, or gives focus to the &#34;header&#34; content. The popup uses the hidden overlay strategy so it has those benefits&#47;quirks.<br />\n<h2>Features (properties?)</h2>\r<ul><li>ValidateChildGrid (validate any DataGrids that are inside the popup before closing)</li>\n<li>OpenOnClick</li>\n<li>CloseOnClick (closes when you click outside the popup)</li>\n<li>OpenOnFocus</li>\n<li>OpenOnHover</li>\n<li>CloseOnHover (closes when you hover outside the popup)</li>\n<li>HoldOpenWhenFocused (When CloseOnHover=True if you hover off the popup the popup will close...unless HoldOpenWhenFocused=True and a control inside the popup has focus)</li>\n<li>Works inside DataGrid cell (wrap it in &lt;grid&gt; tags and it will go over your DataGrid, I love this!)</li>\n<li>OpenDelay (for hover)</li>\n<li>CloseDelay (for un-hover)</li>\n<li>MakeModal (defaults to true, setting to false can cause event timing issues and poor behavior)</li>\n<li>PopupClosing, PopupClosed events</li>\n<li>PopupOpening, PopupOpened events</li></ul>\n\n<h1>Things to keep in mind!</h1>\r<ul><li>It usually works best to define the height and width of the AutoExpandOver or place it in a container</li>\n<li>When the popup comes up the default behavior is to hide the content</li>\n<li>If the header content is larger then the popup and you have CloseOnHover=True the popup may close immediately because the header content is no longer visible and your mouse is not over the popup</li>\n<li>I try to make sure the header and popup content are the same size or that the popup is bigger, or set CloseOnHover=False</li>\n<li>If you see it opening and closing seemingly at random put some background colors in so you can see whats really going on</li>\n<li>There are some debugging messages in the immediate window whiel debugging</li></ul>\n\n<h2>Things I want to add</h2>\r<ul><li>Validation states</li>\n<li>resizing of popup</li>\n<li>dragging(moving) popup</li></ul>\n<br />This project is a work-in-progress. It works, and works well, for what I am using it for but there are several features that have been started but are unfinished since I myself have not had a need for those features.<br />What may be more useful then anything is some of the code snipits in the project. This grew from something else so there may be code remnants left behind. I also should have made it custom rather then basing it on ContentControl.<br /><br />Anyway, use and enjoy.</div><div class=\"ClearBoth\"></div>",
  "TagList": "silverlight 3,silverlight control,Popup,Overlay,DataGrid Popup,readonly cell,",
  "LastEdited": "2009-09-24T10:15:02.657-07:00"
}