{
  "ProjectName": "cbxGameCode",
  "Title": "cbxGameCode",
  "Description": "cbxGameCode (Formerly called Zider Engine) is a generic collection of 100+ game related projects and utilities for XNA, Unity, & Silverlight. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong><span style=\"font-size:x-large\"><span style=\"text-decoration:underline\">cbxGameCode</span>&nbsp;</span></strong></p>\r\n<p>cbxGameCode (Formerly called Zider Engine) is a collection of 100&#43; game related projects and utilities for XNA and\r\n<a href=\"http://unity3d.com/\" target=\"_blank\">Unity</a>. It is intended to provide generic commonly used game logic.</p>\r\n<p>This main page does not get updated very often so click the &quot;<a href=\"http://ziderengine.codeplex.com/SourceControl/list/changesets\">Source Code</a>&quot; tab to get the current change set and keep up to date with the changes that are being made.</p>\r\n<p>&nbsp;</p>\r\n<p><strong><span style=\"text-decoration:underline\">July 20, 2012</span></strong></p>\r\n<p>Been working on the project again and will be including <a href=\"http://unity3d.com/\" target=\"_blank\">\r\nUnity</a> support. As far as I can tell Unity is where I will be spending the vast amount of my time moving forward. It just has everything a XNA developer would want including cross platform support windows/mac/linux/webplayer/xbox/wii/ps3/android/flash/iOS\r\n iPad etc.</p>\r\n<p>And it is a feature complete easy to use ready to run game engine with editor and three supported languages C#, JavaScript, boo. A large user community, endless YouTube videos, integrated asset store, regular updates, the list goes on and on. Not to mention\r\n at least for me porting my xna code over to Unity has been a breeze.</p>\r\n<p>As with learning any new platform/environment there are learning pains. It&rsquo;s taken me a few months to start getting comfortable using it finding my way around etc.</p>\r\n<p>Oh and did I mention it&rsquo;s free? There is a pro version but the differences are somewhat trivial.</p>\r\n<p>So having said that the existing Zider code base and related libraries/tools etc will be refactored to operate under Unity as well. I will continue to support XNA in the mean time because it gives me a great opportunity to abstract and and make my code more\r\n platform independent should I need to port it to some other platform in the future.</p>\r\n<p>The title of this project will be changing to cbxGameCode, as what I am working on is becoming more of a general purpose mish mash of various game related code.</p>\r\n<p>&nbsp;</p>\r\n<p><strong><span style=\"text-decoration:underline\">April 4, 2012 <br>\r\n</span></strong><br>\r\nMicrosoft is up to something with windows 8. Seems like they are pushing for integrated html5 in some aspects and there has been little or no mention about the future of XNA on the Win8 platform. But they are coming out with a new abstraction layer for the\r\n windows os programming stack and there are rumors of a xna like similarities with parts of it from what I have read. Have to wait and see what happens I guess.</p>\r\n<p>I mention this because xna as we know it may be going bye bye. In favor of Win8&rsquo;s new programming model(s). That&rsquo;s the part that concerns me. Depending on how big the change is I may have a lot more work ahead of me.&nbsp; The end goal of zider\r\n in terms of it&rsquo;s capabilities is not a complicated one (think minecraft style block worlds only done better ;) ) but I work on a large number of other projects and so progress has always been slow. Zider as a whole is by far the largest project I work\r\n on, and has been migrated from xna 3 then to 4 then to Silverlight 4 now its currently being updated to Silverlight 5. Time has flown by since XNA 3. Given my rate of progress I wonder if xna and Silverlight/xna will bite the dust in favor of html 5, JavaScript,\r\n Win8 and the like. Leaving me with a engine built on top of an obsolete platform.</p>\r\n<p>I&rsquo;ve already started thinking about how I can take aspects of xna and abstract them into a custom platform and build zider on top of that. This will help make it more platform independent and hopefully I&rsquo;ll have less migration issues in the future.\r\n This being something I should have did day one when I started this project but I didn&rsquo;t think it would take as long as it has. :(</p>\r\n<p><br>\r\n<span style=\"text-decoration:underline\"><strong>August 20, 2011</strong></span> <br>\r\n<br>\r\nBeen submitting check-ins to this project here and there see the Source Code for check in notes\r\n<a href=\"http://ziderengine.codeplex.com/SourceControl/list/changesets\">http://ziderengine.codeplex.com/SourceControl/list/changesets</a>\r\n<br>\r\n<br>\r\nJuly 30, 2011 <br>\r\nIt's been a long time coming but I decided to update the Zider code base here on CodePlex with what I currently have on file on my computer. The code base is most likely completely different from the previous Release 2 Zider code base.\r\n<br>\r\n<br>\r\nI have also got Zider running under Silverlight 4, and will port it to SL5 when it becomes available. More info will be posted at a later time.</p>\r\n<p>===================================</p>\r\n<p>Please not this project is under a constant state of change. Some small some large. If you have issues with the code feel free to use the &quot;Issue Tracker&quot; feature and provide feedback.</p>\r\n<p><a href=\"http://www.codeplex.com/ZiderEngine/WorkItem/List.aspx\">http://www.codeplex.com/ZiderEngine/WorkItem/List.aspx</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "game,XNA,XNA game engine ,Zider,Side Scroller,Platformer,GameComponents,engine,XNA Game Studio,2d/3d engine,bDownload,",
  "LastEdited": "2012-07-20T03:27:51.36-07:00"
}