{
  "ProjectName": "CellSimulation",
  "Title": "Cell Simulation",
  "Description": "This is Momentum Test Universe. Modeled with classical mechanics, linear momentum. Try to analyse special tactics to survive in a mass velocity driven universe.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\rThis is Momentum Test Universe. Modeled with classical mechanics, linear momentum. Try to analyse special tactics to survive in a mass velocity driven universe.<br /><img src=\"/projects/CellSimulation/d2fc4a3b-40d1-4a8a-b5aa-efb1962f345d\" alt=\"25-06-2015&#32;18-15-04.png\" title=\"25-06-2015&#32;18-15-04.png\" />\n<h1>Demo</h1>\r<object data=\"data:application/x-silverlight-2,\" type=\"application/x-silverlight-2\" style=\"height:285px;width:880px;\"><param name=\"source\" value=\"http://titan830.startdedicated.com/CellSimulation/ClientBin/CellSimulation.xap\"></param><param name=\"windowless\" value=\"true\"></param><param name=\"minRuntimeVersion\" value=\"5.0.61118.0\"></param><param name=\"autoUpgrade\" value=\"true\"></param><p>You need to install Microsoft Silverlight to view this content. <a href=\"http://go.microsoft.com/fwlink/?LinkID=149156&v=5.0.61118.0\" style=\"text-decoration:none;\">Get Silverlight!<br /><img src=\"http://go.microsoft.com/fwlink/?LinkID=108181\" alt=\"Get Microsoft Silverlight\" style=\"border-style:none;\" /></a></p></object><iframe style=\"visibility:hidden;height:0;width:0;border-width:0;\"></iframe><br /><a href=\"http://titan830.startdedicated.com/CellSimulation/\">http://titan830.startdedicated.com/CellSimulation/</a>\n<h1>Momentum</h1>\rIn classical mechanics, linear momentum or translational momentum (pl. momenta; SI unit kg m/s, or equivalently, N s) is the product of the mass and velocity of an object. For example, a heavy truck moving rapidly has a large momentum—it takes a large or prolonged force to get the truck up to this speed, and it takes a large or prolonged force to bring it to a stop afterwards. If the truck were lighter, or moving more slowly, then it would have less momentum.<br /><br />Like velocity, linear momentum is a vector quantity, possessing a direction as well as a magnitude:<br /><br /><i>p = m x v</i><br /><br />Linear momentum is also a conserved quantity, meaning that if a closed system is not affected by external forces, its total linear momentum cannot change. In classical mechanics, conservation of linear momentum is implied by Newton&#39;s laws; but it also holds in special relativity (with a modified formula) and, with appropriate definitions, a (generalized) linear momentum conservation law holds in electrodynamics, quantum mechanics, quantum field theory, and general relativity.<br />\n<h1>Simulation Idea</h1>\r\nThe idea is simple. I am trying to define a basic universe and analyse predefined financial tactics for companies.<br />\n<ol><li>Universe is modeled according to rules of the momentum.\n<ol><li>Any ball hits other the momentum will be preserved m1v1=m2v2</li>\n<li>The small ball will join to the big ball. Big eats small. The joint new ball&#39;s equation will be <i>m x v = m1 x v1 + m2 x v2</i>.</li>\n<li>At the and of the simulation the biggest mass will dominate the universe. If any ball reaches a mass bigger than the sum of all other objects (bigger than the half of the total universes mass) will dominate the universe.</li></ol></li>\n<li>Every white balls are dummy mass in the universe.</li>\n<li>Every green ball are smart mass in the universe. The are dropping mass for movement in the universe according to their predefined tactics.\n<ol><li>Catch Small: Tries to catch smallest object in the universe</li>\n<li>Evade Big: Tries to evade biggest object in the universe</li>\n<li>No Speed: Tries to stay still in the universe.</li>\n<li>CatchNearest: Tries to catch nearest object which is smaller than himself.</li>\n<li>CatchSlow: Tries to catch slowest object which is smaller than himself.</li>\n<li>CatchFast: Tries to catch fastest object which is smaller than himself.</li>\n<li>CatchSmallAndEvadeBig: In one turn Catch Small and other turn evade big.</li>\n<li>CatchNearestAndEvadeBig: In one turn Catch Nearest and other turn evade big.</li>\n<li>FollowBig : Follow the biggest object without touching it.</li>\n<li>Matador : Evade big objects that coming towards it like a matador.</li>\n<li>CatchMomentum:  Tries to catch object with highest momentum which is smaller than himself.</li></ol></li></ol>\n<br /><img src=\"/projects/CellSimulation/829ad634-3f6c-48a5-9921-55e1c5d7a528\" alt=\"1.png\" title=\"1.png\" /><br /><img src=\"/projects/CellSimulation/9ef790a0-ff86-4246-a07b-e96952df3e93\" alt=\"2.png\" title=\"2.png\" /><br /><img src=\"/projects/CellSimulation/55cfddf2-bebd-4136-9f37-a98deb559614\" alt=\"3.png\" title=\"3.png\" /><br />\n<h2>follow me on twitter: <a href=\"http://twitter.com/oguzkoroglu\">twitter.com/oguzkoroglu</a></h2>\r<h2>my linked in profile : <a href=\"http://tr.linkedin.com/in/oguzkoroglu/\">http://tr.linkedin.com/in/oguzkoroglu/</a></h2>\r<h2>my personal web site : <a href=\"http://oguzkoroglu.net/\">http://oguzkoroglu.net/</a></h2></div><div class=\"ClearBoth\"></div>",
  "TagList": "Simulation,c#,silverlight,",
  "LastEdited": "2015-07-12T12:19:58.02-07:00"
}