{
  "ProjectName": "claims",
  "Title": "Claims Processing Reference Architecture",
  "Description": "Claims Processing Reference Architecture provides quality services in the field of Auto Insurance Claims Processing however these components can be leveraged for other forms of claims processing such as: Home, Medical, Mortgage, and other general claims processing services to work on behalf of clients for better advanced services. Today, global insurance industry is facing a challenge to provide cutting edge services and value added customer experience coupled with faster response time and easily adaptable services.  Like with the other Financial Services architectures released, this reference architecture leverages the ACORD standard throughout. This insurance interoperability with both Commercial Off The Shelf (COTS) and custom built applications in your enterprise.\n\nThis reference architecture leverages the base architecture from the Life Insurance Reference Architecture. Claims processing is a logical extension of that business functionality.\n\nTechnologies Used:\n  - SharePoint Server 2007\n  - Business Data Catalog (BDC)\n  - Silverlight 1.1\n  - SQL Server\n  - Web Services\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Claims Processing Reference Architecture provides quality services in the field of Auto Insurance Claims Processing however these components can be leveraged for other forms of claims processing such as&#58; Home, Medical, Mortgage, and other general claims processing services to work on behalf of clients for better advanced services. Today, global insurance industry is facing a challenge to provide cutting edge services and value added customer experience coupled with faster response time and easily adaptable services.  Like with the other Financial Services architectures released, this reference architecture leverages the ACORD standard throughout. This insurance interoperability with both Commercial Off The Shelf &#40;COTS&#41; and custom built applications in your enterprise.<br /><br />This reference architecture leverages the base architecture from the Life Insurance Reference Architecture. Claims processing is a logical extension of that business functionality.<br /><br />Technologies Used&#58;<br />  - SharePoint Server 2007<br />  - Business Data Catalog &#40;BDC&#41;<br />  - Silverlight 1.1<br />  - SQL Server<br />  - Web Services<br /><br /><br />For more information on these types of architectures see Mike Walker&#39;s Blog at: <br /><a href=\"http://blogs.msdn.com/MikeWalker\">http://blogs.msdn.com/MikeWalker</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "SOA,Business Application,OBA,BDC,ACORD,SharePoint,Silverlight,Financial,Insurance,Claims Processing,Silverlight 2.0,",
  "LastEdited": "2008-04-25T11:21:08.7-07:00"
}