{
  "ProjectName": "codeendeavortemplate",
  "Title": "Code Endeavors DotNetNuke Templates for C# and VB.NET",
  "Description": "The Code Endeavors DotNetNuke Module Templates utilize the Visual Studio Content Installer to enable the developer to create DotNetNuke modules quickly.  After they are installed, simply open the File menu, expand New Project, and choose one of the templates to model your module ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The Code Endeavors DotNetNuke Module Templates utilize the Visual Studio Content Installer to enable the developer to create DotNetNuke modules quickly.  After they are installed, simply open the File menu, expand New Project, and choose one of the templates to model your module <br /><br /><b>Code Endeavors Compiled AJAX DotNetNuke Module Template (C# and VB.NET)</b><br />The Code Endeavors AJAX Template offers the skeleton structure for creating highly efficient AJAX templates.  It encourages the developer to encapsulate logic within client-side objects to minimize naming conflicts.  It also demonstrates how to use the new AJAX callback framework (ControlMethods) in the new ClientAPI.  Additionally, it offers a solution to manage localization of messages in your javascript along with allowing modules to communicate safely on the client-side.<br /><br />All templates utilize an installation wizard that allows for easy configuring of the new DotNetNuke 5.0 Module Manifest.  Additionaly, custom MSBuild tasks are configured to allow for easy packaging and installation of module on local DotNetNuke instance.<br /><br /><img src=\"/projects/codeendeavortemplate/440e4483-3f85-43ab-af31-9c2cf878d801\" alt=\"DNNTemplate.png\" title=\"DNNTemplate.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,templates,DotNetNuke,DNN,Skinning,container,C#,VB.NET,visual studio addin,Silverlight,Silverlight 2.0,MSBuild,Template,Visual Studio,DNNDEV Endeavors,Try,",
  "LastEdited": "2008-12-04T19:39:36.973-08:00"
}