{
  "ProjectName": "comictool",
  "Title": "ComicTool - a pure Silverlight CBR/CBZ viewer",
  "Description": "Comic tool is a pure silverlight cbr/cbz viewer that aims to be as lightweight as possible while having basic viewing features.  Files an be opened via a URL and other input mechanisms will be added.  Cross-platform on Macs/Windows via any silverlight supported browser.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Comic tool is a pure Silverlight 4 cbr/cbz viewer that aims to be as lightweight as possible while having basic viewing features. Files an be opened via a URL and other input mechanisms will be added. Indexing and export features will be added with an out of browser mode.  Basic viewing features will should remain simple and intuitive.  No feature overload.<br /><br />The silverlight application itself only requires the xap file and a hosting html page.  No backend ASP.NET/WCF services are required.  To use URLs across domains, a clientaccesspolicy.xml file is needed on the destination domain: <a href=\"http://msdn.microsoft.com/en-us/library/cc197955(VS.95).aspx\">http://msdn.microsoft.com/en-us/library/cc197955(VS.95).aspx</a><br /><br />I try to keep the latest version updated here: <a href=\"http://hathcock.co.uk/c/\">http://hathcock.co.uk/c/</a><br />\n<h1>Comic Tool feature:</h1>\r<ul><li>Zooming</li>\n<li>CBZ/CBR support</li>\n<li>Drag file from local machine support</li>\n<li>Editing/Saving\n<ul><li>Delete Pages</li>\n<li>Add/Reorder Pages?</li>\n<li>Save edited comics as PDF</li>\n<li>Save viewed file with no changes</li></ul></li>\n<li>Keyboard Shortcuts</li>\n<li>Translation Viewing (via ComicInfo schema with embedded SVG to display foreign languages)</li>\n<li>OOB Support on Windows and OS X</li></ul>\n\n<h1>ToDos</h1>\r<ul><li>Fix CBZ export (need to work on SharpCompress for zipping)</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "cbr,cbz,nunrar,silverlight 4,Silverlight,Comics,",
  "LastEdited": "2011-05-20T10:07:11.793-07:00"
}