{
  "ProjectName": "continuum4sl",
  "Title": "ContinuumSL",
  "Description": "This project is a Silverlight 5 port of one of my other Codeplex projects called Continuum.  The project is designed to manage personal finances via a means of a simulation-like environment.  Changes can be made which immediately get reflected in graphs projecting its effects over whatever timeframe you choose.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This project is a Silverlight 5 port of one of my other Codeplex projects called Continuum.  The project is designed to manage personal finances via a means of a simulation-like environment.  Changes can be made which immediately get reflected in graphs projecting its effects over whatever timeframe you choose.<br /><br /><img src=\"http://obeliskos.com/Continuum/Continuum4SL-small.png\" /><br /><br />You can try out the lastest build of Continuum for Silverlight, live at this link :<br /><a href=\"http://obeliskos.com/Continuum/Continuum.html\">http://obeliskos.com/Continuum/Continuum.html</a><br /><br />This sandboxed, easy-to-deliver version makes it very easy to try out continuum.  Most of the functionality of the original Continuum has been ported over, excluding market functionality.<br /><br />The user interface is rather complex and works best with 1280x720 resolution or above when installed out of browser.  If running within browser you may need even higher.  You can hide right panel controls to have larger graph areas, and a fullscreen mode exists (however no data entry can be done in this mode).<br /><br />User data is stored within Silverlight Isolated Storage and can additionally be encrypted, if you choose to do so.<br /><br />While I intend to clean up and enhance the source code as I learn new functionality, this is not intended to be best practice design... rather an experiment to see how quickly i can port an existing Winforms application.<br /><br />Compiling Source code requires Silverlight 5 Tools, Silverlight 5 Tooklit, and Visual Studio 2010 or Expression Blend 5 (a free preview is available which wont expire for nearly a year).  The Blend preview already includes Silverlight 5 Tools so you would just need the Toolkit.<br /><br />I was able to use my logic classes, changing only persistence functions, but the User interface was complete port.  Using the Silverlight Toolkit i was able to derive equivalent parity of controls between the two (most significantly ZedGraph was replaced by Silverlight Toolkit Chart control).<br /><br />Being a personal finance app, this is open source to allow users to peer review security, privacy and accuracy.<br /><br />I hope to develop documentation regarding its usage in the future, but with &#39;Add Sample Data&#39; functionality, new users can likely figure out how to use.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-05-20T18:45:12.22-07:00"
}