{
  "ProjectName": "CrmAttachmentImage",
  "Title": "Silverlight CRM Attachment Image",
  "Description": "The Silverlight CRM Attachment Image leverages the REST End Point to provide a simple way to add a changable image to a CRM 2011 form/entity using a Silverlight application.  The image is stored in the notes, leveragin core CRM.\r\n\r\nCurrently this project is still in the making.  If you have any suggestions on how to make it better, I'm open to suggestions.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The Silverlight CRM Attachment Image leverages the REST End Point to provide a simple way to add a changable image to a CRM 2011 form&#47;entity using a Silverlight application.  The image is stored in the notes, leveragin core CRM.<br /><br />Currently this project is still in the making.  If you have any suggestions on how to make it better, I&#39;m open to suggestions.<br /><br /><b>How to add the Attachment Image Silverlight control</b><br /><br />Please follow these steps:\n<ol><li>Upload the xap as a web-resource</li>\n<li>Create a text-field that is not searchable to store the annotationid (guid)</li>\n<li>Add the Web-Resource to the form\n<ol><li>Check the checkbox to pass the id and type, etc.</li>\n<li>In the parameters add the fields and their values seperated by a pipe |\n<ul><li>Example: field=new_imageattachmentid|subject=&#39;Contact&#39;&#39;s Image&#39;|prefix=&#39;img-&#39;</li>\n<li>Available fields are:\n<ul><li>field - The name of the field you are using to store the annotationid of the attachment.  It is required, and the field <b>MUST BE ON THE FORM</b> (it does not need to be visible).</li>\n<li>subject - The subject for attachments - the following substitutions are available\n<ul><li>%s - The name of the file</li></ul></li>\n<li>prefix - The prefix for all attachment images (this is used to filter the results, etc)</li>\n<li>hidebuttons - Used to hide the buttons that are in the silverlight control so that you can use the ribbon to control the application</li>\n<li>savefirst - Used to set the message that is displayed on a form that is in Create Mode</li>\n<li>webcam - Set to true if you want to enable the webcam <b>it is not currently tide to hidebuttons</b></li>\n<li>max-width- maximum width for all images</li>\n<li>max-height - maximum height for all images</li>\n<li>max-webcam-width - maximum webcam image width, overrides max-width for web-cam images</li>\n<li>max-webcam-height - maximum webcam image height, overrides max-height for web-cam images</li></ul></li></ul></li></ol></li></ol>\n<br /><b>TODO</b>\n<ul><li>Currently there is not an example of the ribbon integration - once created &amp; tested it will be included.</li>\n<li>Add a resize option so that all uploaded images are decreased to a specified width or height.</li></ul>\n<br /><b>NOTE</b><br />The delete button does not delete the image from the attachments it only unlinks it, clearing the ID.  If you want it to delte the note, that could be done with a little bit more code in the Delete method.<br /><br /><b>Thanks</b><br />Thanks to some of the comments (WalterN &amp; NAG) that have helped me fix some of the bugs I was not seeing in my initial debugging and testing.</div><div class=\"ClearBoth\"></div>",
  "TagList": "CRM 2011,CRM,Silverlight,Microsoft Dynamics,Image,Photo,WebCam,gif,",
  "LastEdited": "2011-09-18T19:27:26.943-07:00"
}