{
  "ProjectName": "CryptoZip",
  "Title": "CryptoZip",
  "Description": "Command line utility to compress and encrypt files. Uses Zip64 to support large (>4gb) files and AES 256-bit encryption on the entire filestream because zip passwords are just not very secure.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Command line utility to compress and encrypt files. Uses Zip64 to support large &#40;&#62;4gb&#41; files and AES 256-bit encryption on the entire filestream because zip passwords are just not very secure.<br /><br />The CryptoZip Visual Studio 2008 solution consists of two projects so far:\n<ul><li>a CryptoZipLib class library which handles the compression/encryption and is compiled to be compatible with Silverlight applications.</li>\n<li>a CryptoZipLite console application that provides a very simple frontend to the CryptoZipLib functionality.</li></ul>\n<br /><b>CryptoZipLib</b><br />The CryptoZipLib assembly merely provides two static methods: Zip and Unzip. They use the Silverlight-compatible SharpZipLib API to compress a file but take the additional step of wrapping the ZipInputStream and ZipOutputStream in a CryptoStream that uses AES-256 as its encryption algorithm.<br /><br /><b>CryptoZipLite</b><br />CryptoZipLite is a fairly simple console application that accepts details about the encryption/decryption operation as parameters and passes them off to the CryptoZipLib methods to do the work.<br /><br /><i>usage:</i> cryptoziplib<br />         -e (encrypt)<br />         -d (decrypt)<br />         -i input filename<br />         -k encryption key<br />         -o output folder<br />         -? show syntax summary<br /><br />The functionality so far is fairly basic but it will take one file as a parameter and compress it and encrypt it in one pass. The resulting file will have a .cryptozip extension and will not be able to be opened by any other ZIP applications because of the encryption. Future plans for the project are as follows:\n<ul><li>IsolatedStorage support for Silverlight applications. Even though the CryptoZipLib assembly is Silverlight-compatible, it currently can&#39;t be used by Silverlight because it uses FileStreams for direct file access and Silverlight only supports IsolatedStorageFileStreams.</li>\n<li>An option to strip the encryption off a .cryptozip file to just leave the .zip.</li>\n<li>Build a WPF application to serve as a more user-friendly frontend than the console app. This is really the main goal of the project and will just be called CryptoZip.</li></ul>\n<br />If you&#39;re looking for a commercial or other open-source product with similar functionality, these are a few great options:\n<ul><li>axCrypt, <a href=\"http://www.axantum.com/AxCrypt\">http://www.axantum.com/AxCrypt</a></li>\n<li>7zip, <a href=\"http://www.7-zip.org\">http://www.7-zip.org</a></li>\n<li>WinRAR, <a href=\"http://www.rarlab.com\">http://www.rarlab.com</a></li>\n<li>WinZip will also work but I&#39;m not a fan.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Encryption,compression,",
  "LastEdited": "2009-02-11T05:30:44.117-08:00"
}