{
  "ProjectName": "darwin",
  "Title": "Silverlight and .Net Genetic Programming (SLNGP)",
  "Description": "The Silverlight and .Net Genetic Programming (SLNGP) project aims to enable easy and simple .Net software using Genetic Programming. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>What Is This All About?</h1>\rThe Silverlight and .Net Genetic Programming (SLNGP) project aims to enable easy and simple .Net software development using Genetic Programming. <br /><br /><b>Semi-Formal definition:</b> Genetic Programming is a sub-branch of metaheuristic algorithms using computer program population evolution with the goal of evolving an optimal solution in a given search domain. <br /><br /><b>Informal definition:</b> Genetic Programming is so cool it makes you bleed from the eyes when you first encounter it. <br />Empires and kings have long sought out the magic secret of Genetic Programming. <br />Learning Genetic Programming will make your software development skills more marketable, enable you to build skynet, make you a better person and increase your sex appeal. <br />\n<h1>What&#39;s the Silverlight and .Net Genetic Programming edge? </h1>\r<ol><li><b>Barrier of Entry:</b> Getting started with Genetic Programming requires spending days learning the fundamentals and rolling out your own implementation. This project means to reduce barrier of entry to Genetic Programming down to 30 minutes. </li>\n<li><b>Debugging:</b> Debugging evolutionary programs is extremely hard. Through the cunning use of rich data visualization we hope to enable straight and simple debugging of evolutionary algorithms. </li>\n<li><b>Extensibility:</b> There are many variants of Genetic Programming Operators. This project takes on extensibility as a 1st class citizen and makes absolutely no hard coded assumptions about anything that can be avoided. </li>\n<li><b>Documentation:</b> Lots of code samples, unit tests and documentation will be available on this wiki once the project ships. </li></ol>\n\n<h1>Why Silverlight?</h1>\rSilverlight brings to the table a nexus of 3 powerful attributes:\n<ol><li><b>The .Net framework in the Browser</b> - Enabling Genetic Programming to use the full .net framework through in-browser applications. </li>\n<li><b>Top-notch UI framework</b> - Enabling best of breed visual debugging experience for your Genetic Programming runs. </li>\n<li><b>Easy networking</b> - Genetic Programming has multiple models that require splitting up runs to multiple machines (Island models, Client-Server, Spatially embedded, etc). Using Silverlight we can easily distribute work to multiple clients without installing any additional software. </li></ol>\n  \n<h1>When is this shipping?</h1>\rSoon. Here&#39;s a print screen to tie you over:\n<ul><li>Hunting for a program that can derive &quot;(X + 1)&quot; from a collection of 1-&gt;2, 2-&gt;3, 3-&gt;4, 4-&gt;5, 5-&gt;6 etc.</li></ul>\n<img src=\"/projects/darwin/2982a9f1-7655-4bcc-832d-575412ee557b\" alt=\"GeneticProgramBasicSample.png\" title=\"GeneticProgramBasicSample.png\" /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-01-24T03:21:29.683-08:00"
}