{
  "ProjectName": "dbschemaviewer",
  "Title": "DB Schema Viewer",
  "Description": "DB Schema Viewer is a Silverlight widget that allows to display a database diagram  on an existing website via javascript.\r\n\r\nIt implements advanced RIA options like table rearranging by drag and drop, zooming, ...",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />DB Schema Viewer is a Silverlight widget that allows to display a database diagram  on an existing website via javascript.<br /><br />It implements advanced RIA options like table rearranging by drag and drop, zooming, ...<br /><br /><img src=\"/projects/dbschemaviewer/27217e56-c67f-4b8b-a4ba-99ea1c5eb97b\" alt=\"snapshot.jpg\" title=\"snapshot.jpg\" /><br /><br />Right now is a subset of DBSchemaEditor(<a href=\"http://www.dbschemaeditor.com\">DBSchemaEditor</a>). Hope to get some collaborators or time to start customizing it.<br /><br />It can be integrated on almost any web dev technology (ASP .net, PHP, JSP...). Just plug the OBJECT / asp:Silverlight tag in your HTML or ASP .net pages, a brief diagram about how to load a diagram via javascript:<br /><br /><img src=\"/projects/dbschemaviewer/32705584-30f1-4ad5-9711-9a8399b9dc8f\" alt=\"jsinstantiation.jpg\" title=\"jsinstantiation.jpg\" /><br /><br />The diagram is passed in a parameter to the SL plugin via javascript as a string (XML format). <br /><br />About the XML diagram structure (you can <a href=\"/projects/dbschemaviewer/f24c7d16-2ea6-45f9-ab8a-6b94d944850d\">download here a sample DB XML</a>), is quite simple:<br /><br />\n<ul><li><b>Header:</b> (diagram metadata like size of the canvas, las internal ID used). </li>\n<li><b>Tables:</b> tables definitions (tables and fields, important use a unique ID for each table or field). </li>\n<li><b>Relations:</b> relation between tables definitions (this relations support multi relations fields, important use a unique ID for each relation).</li></ul>\n<br />About the type of each table field, right now is not used in the current version, but will be soon, the current type mapping (numeric ID to DB type) can be downloaded from this <a href=\"/projects/dbschemaviewer/ad8609ea-44a0-448d-add8-694311e83c73\">link</a>.<br /><br />Hope as well to fully integrate it with DBSchemaEditor diagrams (save to local a diagram and directly use it on the Viewer).<br /><br /><br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-08-08T04:57:21.613-07:00"
}