{
  "ProjectName": "descry",
  "Title": "Descry: Exploring Infographic Visualizations",
  "Description": "Ever wonder what goes into building an effective visualization? Look no further. We decided to roll up our sleeves and explore the topic. We're calling it Project Descry.\nProject Descry demonstrates the power of data and information visualization as a communication tool.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Introduction</h2>\rWelcome to <a href=\"http://www.visitmix.com/Lab/Descry\">Descry</a> Interactive Infographics data visualizations! This is the <a href=\"http://www.visitmix.com/About\">MIX Online</a> team’s third project - source release.  As with all our projects, we&#39;re distributing the source through CodePlex.<br />\n<h2>What this is</h2>\r\nThis is a set of four interactive visualization samples that we are releasing as a part of <a href=\"http://www.visitmix.com/Lab/Descry\">Project Descry</a>. This CodePlex project makes available the source code for each visualization as well as all the source design assets for the entire project. You are welcome to download, extend, learn from and contribute to the project. The visualizations are:\n<ol><li><a href=\"http://www.visitmix.com/labs/descry/theobesityepidemic/\">The Obesity Epidemic</a> addresses concerns about the ever growing obesity problem in the U.S.  We utilize Silverlight to show Tee-Shirt sizes as a way to help people visualize obesity. The Silverlight application relays statistical information via the DOM to the web page for display. Selection of the obesity rate data is done using LINQ queries on an external XML data file.</li>\n<li><a href=\"http://www.visitmix.com/labs/descry/theirfirstwords/\">Their First Words</a>, displays incidences of word usage for a given word search of presidential inaugural addresses. This sample shows tight the integration between Silverlight and the HTML DOM, and we show search results using the advanced text rendering capabilities of the browser. A squarified TreeMap displays word search results by employing advanced LINQ queries against the inaugural data.</li>\n<li><a href=\"http://www.visitmix.com/labs/descry/awebsitenameddesire/\">A Website Named Desire</a> is an interactive infographic of the amorphous web site creation process, began as a real world poster that we wished to move onto the web. This project enhances the real world experience by enabling annotation of high resolution graphical content with markers, Canvases which scale, slide and are interactive, in a compelling and intuitive way.</li>\n<li>Last we present the <a href=\"http://www.visitmix.com/labs/descry/socialtimeline/\">Social Timeline</a> interactive visualization which allows users to download FriendFeed entries for a particular FriendFeed user, view them on a timeline and pivot on this data in several ways. This sample demonstrates some advanced control concepts such as virtualization and theming.</li></ol>\n\n<h2>What this isn’t</h2>\r\n<ol><li>Descry is not a toolkit. It contains classes and fragments of code or design elements that someone might reuse, but it was not our design goal to make this content generic enough to start plugging in data without redesign and work.</li>\n<li>This is not how Microsoft recommends building infographics or visualizations. This code is about how we built, what we thought were four interesting Interactive Infographic data visualizations. Hopefully you&#39;ll learn a thing or two, and maybe even contribute to the project.</li>\n<li>The Descry source is not meant for non-developers. To do anything with this code would require making modifications to source and recompilation, and that requires a Silverlight/Web development environment to be set up.</li></ol>\n\n<h2>Getting Started with Descry</h2>\r\n<ul><li>Visit <a href=\"http://www.visitmix.com/Lab/Descry\">VisitMix.com/lab/descry</a> to see the interactive infographics in action in your browser.</li>\n<li>Download source for: <a href=\"http://www.codeplex.com/descry/Release/ProjectReleases.aspx?ReleaseId=22738\">The Obesity Epidemic</a></li>\n<li>Download source for: <a href=\"http://www.codeplex.com/descry/Release/ProjectReleases.aspx?ReleaseId=22740\">Their First Words</a></li>\n<li>Download source for: <a href=\"http://www.codeplex.com/descry/Release/ProjectReleases.aspx?ReleaseId=22742\">A Website Named Desire</a></li>\n<li>Download source for the: <a href=\"http://www.codeplex.com/descry/Release/ProjectReleases.aspx?ReleaseId=22743\">Social Timeline</a></li>\n<li>And, we are especially pleased to let you peek inside the creative process that led to these visualizations, with our release  of the <a href=\"http://www.codeplex.com/descry/Release/ProjectReleases.aspx?ReleaseId=22749\">design assets</a>.</li>\n<li>Also we now have uploaded a simple sample that shows how to customize the TreeMap control <a href=\"https://descry.codeplex.com/releases/view/26550\">Customizing the TreeMap Control Sample</a></li></ul>\n\n<h2>About us</h2>\r\n<a href=\"http://www.visitmix.com/About/nishkoth\">Nishant Kothary</a>, <a href=\"http://www.visitmix.com/About/allenjs\">Joshua Allen</a>, and <a href=\"http://www.visitmix.com/About/hanshu\">Hans Hugli</a>.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Data Visualization,FriendFeed,Descry,Infographic,Interactive,Timeline,TreeMap,virtualization,Essential,Silverlight 2.0,Linq,C#,ASP.NET 3.5,visualization,graph,",
  "LastEdited": "2009-04-23T12:48:50.19-07:00"
}