{
  "ProjectName": "dhd",
  "Title": "Diary of Healthy Diet",
  "Description": "Diary of Healthy Diet (Dziennik Zdrowej Diety) to projekt w technologii Silverlight mający na celu poznanie tej platformy oraz wszystkich interesujących funkcjonalności w jej otoczeniu.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Diary of Healthy Diet - Dziennik Zdrowej Diety<br /><br />Do powstania tego projektu zainspirował mnie konkurs Macieja Aniserowicza (http://www.maciejaniserowicz.com/page/Konkurs-daj-sie-poznac.aspx), a także zmiana pracy i rozpoczęcie przygody z Silverlight na poważnie.<br /><br />Założenia biznesowe jakie sobie postawiłem to stworzenie aplikacji w technologii Silverlight pozwalającej ludziom na zapoznanie się z najpopularniejszymi metodami odchudzania się (mam ślub stąd ten pomysł ;) ). Zainteresowany użytkownik będzie m&#243;gł założyć własny dziennik, w kt&#243;rym będzie codziennie wpisywał efekty pracy nad sobą poczynając od godzin posiłk&#243;w, składu posiłk&#243;w, ilości posiłk&#243;w poprzez własne wymiary (biceps, klatka, pas, biodra etc.), kończąc na aktywności fizycznej (siłownia, jogging). Zainteresowane osoby będą mogły udostępnić sw&#243;j dziennik publicznie dzięki czemu wraz z czasem utworzy się duża baza danych na temat efektywności danej diety w por&#243;wnaniu do wieku, sylwetki, płci etc.<br /><br />Technologie jakie mają mi pom&#243;c w powyższy zadaniu to:<br />- .NET Framework 4.0,<br />- Silverlight 4,<br />- Prism,<br />- MVVM,<br />- Unity,<br />- log4net,<br />- Entity Framework 4,<br />- Expression Blend 4.<br />- WCF RIA Services,<br />- PivotViewer.<br /><br />W większości są to dla mnie nowe tematy tak więc postaram się podzielić z wami własnymi doświadczeniami.<br /><br />Zapraszam do śledzenia moich poczynań :-) <br /><br /><br />\n<hr />                          KOMUNIKAT                                       \n<hr />\n<br />Projekt, okazał się dość dużym wyzwaniem biznesowym dlatego też postanowiłem stworzyć w pierwszej <br />kolejności prototyp zawierający szereg ciekawych funkcjonalności, kt&#243;re wykorzystam w powyższym projekcie.<br /><br />Z niewiadomych przyczyn (wrong Repository UUID) nie udało mi się dorzucić projektu prototypu do <br />istniejącego SVN dla projektu Dziennik Zdrowej Diety dlatego też stworzyłem nowy. <br />Zinteresowanych zapraszam pod adres: <b><a href=\"http://devprototype.codeplex.com\">http://devprototype.codeplex.com</a></b><br /> </div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-11-22T15:48:21.58-08:00"
}