{
  "ProjectName": "dot2silverlight",
  "Title": "Dot2Silverlight",
  "Description": "Dot2Silverlight is a project thats enables to render graphs (written in Dot format) in Silverlight.\ndot2silverlight, dot, silverlight, C#, graphviz, xdot, plain, layout graphs, shortest path",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Dot2Silverlight is a project thats enables to render graphs &#40;written in Dot format&#41; in Silverlight.<br />dot2silverlight, dot, silverlight, C&#35;, graphviz, xdot, plain, layout graphs, shortest path<br /><br />Dot2Silveright is a Silverlight control for viewing graphs rendered by dot/GraphViz  --- <a href=\"http://www.graphviz.com\">http://www.graphviz.com</a>. The current viewer control has the usual navigation -- i.e. zoom, scroll -- and supports hit testing on nodes, which can be used for different purposes.<br /><br />In this first version, the control displays all the nodes as  rectangles. <br />In the future, I will provide the different shapes and arrows supported by Graphviz.<br />Also, it is possible to display labels on edges as is allowed by Dot.<br /><br />I decided to develop this Dot to Silverlight Converter because I am building a tool for Program Verification and Slicing <br />(<a href=\"http://gamaepl.di.uminho.pt/gamaslicer\">http://gamaepl.di.uminho.pt/gamaslicer</a>)under ASP.net environment, and I need to display the Control Flow Graph (CFG) for the program under analysis.<br />The graph should be dislpayed on the web in an interactive mode, not just  as a static image. <br />So, the idea of using, in the ASP.net context, Silverlight to display/animate a Dot graph came up.<br /><br />Please try it and leave your comments. <br />You can play with a demo at  <a href=\"http://gamaepl.di.uminho.pt/dot2silverlight\">http://gamaepl.di.uminho.pt/dot2silverlight</a><br />Keep in touch for future versions.<br /><br />The architecture of the current version is depicted in the figure below.<br /><br />Dot2Silveright accepts as input a file in  DOT format, a format which contains only the information about the nodes and edges of a graph and calls a WebService to activate Graphviz dot; dot reads the DOT file, generates the graph layout and export  to xDot format (a format which also contains<br />information about node and edge positions). Then a parser (built using AnTLR) processes the plain format file and generates C# code to create a data structure (an internal representation of the  graph) that stores the information about nodes, edges and the position of all graphical elements.  <br />Silveright is then able to read that data structure, show it and even animate it.<br /><br /><img src=\"/projects/dot2silverlight/72c6b359-faa6-43ba-8ef2-0640b1e0e3ab\" alt=\"Dot2Silverlight.png\" title=\"Dot2Silverlight.png\" /><br /><br />Screenshot of the application:<br /><br /><img src=\"/projects/dot2silverlight/70977ba4-79bd-45dc-bfbb-97e87fd56c1f\" alt=\"Screenshot.jpg\" title=\"Screenshot.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "dot,graph,graph layout,graphviz,Silverlight 3,",
  "LastEdited": "2010-05-09T15:09:47.32-07:00"
}