{
  "ProjectName": "eventr",
  "Title": "eventr",
  "Description": "Eventr is a Silverlight deep zoom reference application. The interesting bits are implemented in the SuperDeepZoom control, which may be either dropped straight in to your project (turnkey) or you can open it up and see what makes it tick.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Eventr is a Silverlight deep zoom reference application. The interesting bits are implemented in the SuperDeepZoom control, which may be either dropped straight in to your project &#40;turnkey&#41; or you can open it up and see what makes it tick.<br /><br />New blog series (of one post so far:)) on Eventr usage <a href=\"http://blog.webjak.net/2009/07/09/eventr-your-flexible-deepzoom-reference-app/\">http://blog.webjak.net/2009/07/09/eventr-your-flexible-deepzoom-reference-app/</a><br /><br />For a running example see here: <a href=\"http://www.imsilverlight.com/sites/SuperDeepZoom/sample/iframe.html\">http://www.imsilverlight.com/sites/SuperDeepZoom/sample/iframe.html</a><br /><br />Features include basic deep zoom interaction, including mouse wheel, zoom clicking etc.<br /><br />More advanced functionality includes deep linking, fly though and slide show. <br /><br />SuperDeepZoom allows you to pass in your own custom data objects which can be linked up to individual deep zoom sub images. When an image is viewed this data object will be made available again to the UI for data binding. The custom object can be any class you like, for example you might have a simple class that has Name, Title, and URL -&gt; similar to the example. You could go more advanced and have objects that include URL&#39;s to videos etc.<br /><br />It&#39;s important to note that the SuperDeepZoom control does not deal with any custom data and its templated so there is very little hard coding in the control. It is completely up to the host application to define and provide data to the control for overlays.<br /><br />SuperDeepZoom is fully templatable. It supports custom overlays for each image in the control, this means you can use the custom data objects explained above to show an overlay above each image in the collection. The sample uses this feature to show the hit counts of each image (ordered from most to least). Pressing &quot;g&quot; in the demo will turn on hit count mode. The overlay you see in this mode uses templating and data binding (from a custom ItemsControl). <br /><br />The fly through overlay is another feature. You can see your current fly through by pressing &quot;f&quot; at any time (it won&#39;t appear until you navigate to a couple of images first). Then you will see your path through the system. You can create a link to send to a friend by zooming in on an image and selecting &quot;Link this to a friend&quot;. When they load your URL they will be given the option to take you customised tour through the project. <br /><br />The fly through overlay is also templatable, so you aren&#39;t stuck with the blue and red theme that it employs be default :)<br /><br />Video is supported in this version. You may add a video to any image in the collection by editing ImageData.xml in the web project and adding a new attribute called video (case sensitive). Place your video in ClientBin/View/VideoName.wmv, then reference it with your new attribute (video=&quot;VideoName.wmv&quot;. You can also use absolute video URLs from the internet. When in a slide show, the slide show will be paused until the video finishes playing.<br /><br />Included is also a very simple deep zoom collection builder which can take a folder of images and build a wrap panel style deep zoom collection for you.<br /><br />Make sure you set the Web project as start up and select iframe.html as the start page.<br /><br />There will be a series of blog posts coming shortly on my blog <a href=\"http://blog.webjak.net\">http://blog.webjak.net</a> so keep an eye out.<br /><br />I hope you enjoy this project, it&#39;s been great fun to work on... as always I welcome your comments and feedback. <br /><br />Cheers - and happy deep zooming, <br /><br />Jordan (@jakkaj)</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-07-13T19:16:33.843-07:00"
}