{
  "ProjectName": "EventTrivia",
  "Title": "Event Trivia",
  "Description": "A Silverlight trivia application which can be played in between sessions at an event. It has been used at PDC09, PDC10 and MIX10 so far. Written by Pete Brown at Microsoft.\r\n\r\nThis is not an actively developed project. Instead, the source was just made available to help others.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A Silverlight trivia application which can be played in between sessions at an event. It has been used at PDC09, PDC10 and MIX10 so far. Written by Pete Brown at Microsoft.<br /><br />This is not an actively developed project. Instead, the source was just made available to help others.<br /><br />The PDC trivia application (more generically called the Event Trivia or Conference Trivia app) is a full-screen web-delivered Silverlight application that displays trivia questions on the big screen in the time between breakout sessions at a conference. So far, it has been used at PDC09, MIX10, and PDC10.<br /><br />The previous versions had only trivia questions, and a very conference-themed display. The latest version, rewritten for PDC10, has a Halloween theme in recognition of the timing of the conference. The overall architecture for the runtime trivia portion hasn&#39;t changed, but the implementation details have. In addition, for the PDC2010 version, I added Twitter integration with tweets popping up as tombstones on the bottom half of the application.<br /><br /><img src=\"http://10rem.net/media/69250/WindowsLiveWriter_BuildingthenewPDCTriviaApplication_B214_image_thumb.png\" /><br /><br />One other change is the removal of the images from the questions. While the database still supports images, I removed them in order to avoid any potential copyright issues (including images I purchased from various sites) which would prevent releasing this application on codeplex.<br /><br />Additional Information on my blog post <a href=\"http://10rem.net/blog/2010/11/03/building-the-new-pdc-trivia-application\">http://10rem.net/blog/2010/11/03/building-the-new-pdc-trivia-application</a> (including architecture info)<br />\n<h2>Usage</h2>\r\nYou are free to use this in your own events, modify the application, add or remove trivia question (or fix mistakes in existing questions/answers), and otherwise have fun with this at any conference or event.<br /><br />If you do use this at your own event, I&#39;d love it if you could send me a photo of the app in action up on the big screens.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-04-16T14:07:13.92-07:00"
}