{
  "ProjectName": "Farseersimplesamples",
  "Title": "Farseer Physics Engine Simple Samples",
  "Description": "As you might know, the original Farseer Physics Engine samples can be alittle hard to understand at first sight. Therefore I have created a small collection of \"Simple Samples\" / tutorials which shows you how to do different things with the engine, as simples as possible.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />As you might know, the original Farseer Physics Engine samples can be alittle hard to understand at first sight. Therefore I have created a small collection of &#34;Simple Samples&#34; &#47; tutorials which shows you how to do different things with the engine, as simples as possible.<br /><br /><img src=\"/projects/Farseersimplesamples/408bc3fc-c47d-4099-a335-2f9ed7af41fd\" alt=\"farseersimplesamples.png\" title=\"farseersimplesamples.png\" /><br /><br /><b>How to use the samples</b><br />To run the samples you need either Visual Studio 2008 SP1 or the free Visual Web Developer Express SP1, both needs the Silverlight Tools plugin installed.<br />You find all you need right here: <a href=\"http://silverlight.net/GetStarted/\">http://silverlight.net/GetStarted/</a><br /><br />When above is in place just download the latest release, right click the project you wanna run and set it as the &quot;Start up project&quot;. Hit Ctrl-F5 (No debug) or F5 (Debug) to run the project.<br /><br />Silverlight only runs if it is hosting in a HTML page, therefore the outcome of an Silverlight application project will be a .xap/.dll and <b>not</b> a .exe. These samples are created as simple as possible and uses the auto generated .html page, that VS2008 creates, to host and run the samples. Therefore you should be able to run the samples by doing as described above.<br /><br /><b>Visit my blog</b><br />I have also made some post on my blog about these &quot;simple samples&quot; for using the Farseer Physics Engine. Actually they started at my blog and I am now cleaning them up, updating to the latest Silverlight/Farseer version and putting them here on CodePlex.<br /><a href=\"http://laumania.net/?tag=/farseer+physics+engine\">http://laumania.net/?tag=/farseer+physics+engine</a><br /><br /><b>Feedback</b><br />Feedback is always welcome, so please leave a comment, either on <a href=\"http://www.laumania.net\">http://www.laumania.net</a> (my blog) or here on Codeplex, and let me know what you think about this. It&#39;s always interesting to hear what other people think about what your doing.<br /><br />- Enjoy</div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,game,Physics,Farseer,Tutorial,Samples,.NET 3.5,Silverlight,Farseer Physics Engi,.NET Game,",
  "LastEdited": "2009-07-21T13:41:22.06-07:00"
}