{
  "ProjectName": "flycomet",
  "Title": "FlyComet",
  "Description": "A simple ASP .Net comet implementation enabling ActiveMQ JMS Publisher to push live updates to the client using IHttpAsyncHandler.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>FlyComet</h1>\r<h2>Project Description:</h2>\r A simple ASP .Net comet implementation enabling push live updates from ActiveMQ JMS Publisher to or any other publishers to the jquery client or silverlight using IHttpAsyncHandler. <br />\n<h2>Features</h2>\rFlyComet is released as version 1.0 with the following features.\n<ul><li>Support for Push Messages through a client publisher</li>\n<li>Supports jQuery Client for receiving live updates from IIS Comet</li>\n<li>Supports Silverlight Client for receiving live push updates</li></ul>\n   <br />   For details of how to use the project, please refer to the following links.<br />   \n<ol><li><a href=\"http://www.codersource.net/2011/12/08/flycomet-client-publisher/\">How to publish/push data to the server from a client for FlyComet</a></li>\n<li><a href=\"http://www.codersource.net/2011/11/20/how-to-use-flycomet-in-a-asp-net-mvc3-project/\">How to Receive live updates on a Asp .Net MVC 3 application using jQuery</a></li>\n<li><a href=\"http://www.codersource.net/2011/12/08/flycomet-for-silverlight/\">How to Receive live updates on a Silverlight application</a></li></ol>\n   <br />   The flycomet extension uses the JSON Library from Newtonsoft, NMS libraries from activemq and log4net. <br />   <br />   The current release is good enough for usage after proper testing by end developers. We do not have any license fee for both personal/commercial use of this software. We also use lot of opensource and free software. This is our small give back to the community. When we say free, it is just the software. There is no guaranteed support. <br /><br />Developed &amp; Maintained by <a href=\"http://www.codersource.net\">codersource.net</a><br />Supported by <a href=\"http://www.pmsquaresoft.com\">PMSquare Soft Services Pvt Ltd</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "Comet,IHttpAsyncHandler,Push Notification,Reverse Ajax,asp .net mvc,Silverlight,",
  "LastEdited": "2013-11-21T05:29:53.39-08:00"
}