{
  "ProjectName": "groceries",
  "Title": "Groceries Shopping Helper",
  "Description": "Groceries Shopping Helper is a Silverlight RIA which will help users create grocery shopping lists. The application can maintain lists, recipes, stores and store locations. Contains a Windows Mobile client that will guide the user thru the store using location order",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Please note that this is a project under construction! No complete feature sets have been implemented yet.</b><br /><br /><b>Project Description</b><br />Groceries Shopping Helper is a Silverlight RIA which will help users create grocery shopping lists. The application can maintain lists, recipes, stores and store locations. Contains a Windows Mobile client that will guide the user thru the store using location order<br /><br /><br />Groceries Shopping Helper is a Silverlight RIA which will help users create grocery shopping lists. The application can maintain <b>lists</b>, <b>items</b>, <b>recipes</b>, <b>stores</b> and <b>store locations</b>. Contains a <b>Windows Mobile</b> client that will guide the user thru the store using location order.<br /><br />Silverlight app can print lists, also where items are sorted according to the location of the item in the store. Users can walk thru the store, getting items from each aisle as they move thru the store. Gone are the days where you are at the last aisle of the store remembering that you needed to pick up something in the first aisle.<br /><br /><b>Maximize your shopping power! Use Groceries Shopping Helper.</b><br /><br />Application can also be used for other stores than grocery stores. Items hold prices, so an estimate can be given for a particular shopping list. Recipes hold quantities of each item, so shopping for a meal is easy. Just add the recipe to the list, and Groceries Shopping Helper (GSH) will add the items needed to your list.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "windows mobile,groceries,shopping,shopping list,convenience,Silverlight,RIA Services,",
  "LastEdited": "2010-02-06T06:36:41.167-08:00"
}