{
  "ProjectName": "HDViewSL",
  "Title": "HD View SL",
  "Description": "HD View SL is a Silverlight application for viewing large, stitched panoramic images in a variety of formats -- especially those created by Microsoft Image Composite Editor.  HD View SL relies on Silverlight's \"Deep Zoom\" features to enable smooth panning and zooming.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h3>About HD View SL</h3>\r\nHD View SL is a Silverlight application for viewing large, stitched panoramic images in a variety of formats -- especially those created by Microsoft Image Composite Editor.  HD View SL relies on Silverlight&#39;s &#34;Deep Zoom&#34; features to enable smooth panning and zooming.<br /><br /><b>New:</b> HD View SL is now capable of viewing KML PhotoOverlays and Zoomify images, in addition to Deep Zoom and HD View XML files.  To preview files in these formats and embed HD View SL in your blog or web page, see our <a href=\"http://research.microsoft.com/en-us/um/redmond/groups/ivm/HDView/Preview/\">HD View Preview page</a>.<br /><br /><b><a href=\"http://research.microsoft.com/en-us/um/redmond/groups/ivm/HDViewSL/\">Try HD View SL</a></b><br /><br /><img src=\"/projects/HDViewSL/08260ac3-2c08-4bc0-b582-d9d5258c6763\" alt=\"Screenshot-480.jpg\" title=\"Screenshot-480.jpg\" /><br /><br />We have several goals in sharing the source of HD View SL with the community:\n<ul><li>Improve the panorama viewer.</li>\n<li>Encourage customization of the panorama viewer.</li>\n<li>Help developers learn about and understand Silverlight.</li></ul>\n<h3>Creating Panoramic Images</h3>\r\nYou can use a wide variety of programs to stitch a panoramic image together from several overlapping photos.  HD View SL is designed to be used with panoramic images created by <b><a href=\"http://research.microsoft.com/en-us/um/redmond/groups/ivm/ICE/\">Microsoft Image Composite Editor</a></b> (also known as ICE).  Once you provide ICE with a set of overlapping photos, the program will automatically align them and blend them into a seamless panorama.  You can adjust the projection surface and orientation, then export to a variety of formats.  When you tell ICE to export an image in the Deep Zoom tileset format, it will produce the image tiles as well as a web page for viewing the panorama; the Silverlight application used within that web page is HD View SL.<br /><br />You can also use our <b><a href=\"http://research.microsoft.com/en-us/um/redmond/groups/ivm/HDView/HDPhotoshopPlugin.htm\">HD View Photoshop Plugin</a></b> to create image tiles for use with HD View SL.  Once you&#39;ve installed the plugin, you can export from Photoshop to HD View SL by selecting &quot;HD View &amp; Deep Zoom...&quot; from the File:Export menu and choosing &quot;Silverlight Deep Zoom&quot; as the output type.<br />\n<h3>Viewing Panoramic Images</h3>\r\nThere are several ways to view a panoramic image.  QuickTime VR, for example, displays images by projecting them onto the interior of a 3D cylinder or cube.  By contrast, <b><a href=\"http://research.microsoft.com/en-us/um/redmond/groups/ivm/HDView/\">HD View</a></b> projects images onto a surface that morphs from a cylinder or sphere into a flat plane, depending how far you zoom out.  This technique provides perspective-correct rendering (so straight lines don&#39;t appear warped) when you zoom in, but still permits you to see the whole image when you zoom out.<br /><br />HD View SL is a Silverlight-based alternative to the original HD View browser plug-in.  Here&#39;s a summary of the differences between the two viewers:<br /><br /><table><tr><th> </th><th> HD View </th><th> HD View SL </th></tr>\n<tr><td> rendering technology </td><td> DirectX </td><td> Silverlight </td></tr>\n<tr><td> operating system </td><td> Microsoft Windows </td><td> Microsoft Windows or Mac OS </td></tr>\n<tr><td> browser </td><td> IE or Firefox </td><td> IE, Firefox, or Safari </td></tr>\n<tr><td> supported formats </td><td> HD View XML, KML, Zoomify XML, Deep Zoom XML, single JPEG </td><td> HD View XML, KML, Zoomify XML, Deep Zoom XML </td></tr>\n<tr><td> projection </td><td> cylindrical, spherical, or fisheye (3D) </td><td> orthographic (2D), with wrapping for 360-degree panoramas </td></tr>\n<tr><td> color correction </td><td> yes </td><td> no </td></tr>\n<tr><td> tone mapping </td><td> yes </td><td> no </td></tr>\n<tr><td> hardware acceleration </td><td> yes </td><td> no </td></tr>\n<tr><td> open source </td><td> no </td><td> yes </td></tr></table><br /><br />While HD View provides better rendering and faster performance, HD View SL is available to a broader set of users and can be customized.<br />\n<h3>Building HD View SL</h3>\r\nThe current version of HD View SL works with the released version of Silverlight 2.  To build the project, you&#39;ll need to have the usual tools for Silverlight 2 development, available from the Silverlight <a href=\"http://silverlight.net/GetStarted/\">Get Started</a> web page:\n<ul><li>Visual Studio 2008 SP1 or Visual Web Developer Express with SP1</li>\n<li>Silverlight Tools for Visual Studio 2008 SP1</li>\n<li>optionally, Expression Blend 2 SP1</li></ul>\nNote that after you download the source code for HD View SL and open the solution file in Visual Studio, you will need to indicate which project and web page to use when running or debugging the application.  This is accomplished in two steps:\n<ol><li>Right-click on the HDViewSLWeb project and select &quot;Set as StartUp Project&quot;.</li>\n<li>Within the HDViewSLWeb project, Right-click on Examples.html and select &quot;Set As Start Page&quot;.</li></ol>\nPressing F5 (Start Debugging) should now launch a local web server, start your default web browser, and display the examples web page.<br />\n<h3>Testing HD View SL</h3>\r\nHD View SL has been tested using the officially released version of Silverlight 2 and the following configurations:\n<ul><li>Windows Vista SP1 and Internet Explorer 8.0.6001.18783</li>\n<li>Windows Vista SP1 and Firefox 3.5</li>\n<li>Windows Vista SP1 and Chrome 2.0.172.33</li>\n<li>Windows Vista SP1 and Opera 9.64</li>\n<li>Windows Vista SP1 and Safari 4.0 (530.17)</li>\n<li>Mac OS X (10.5.7) and Safari 4.0.1 (5530.18)</li>\n<li>Mac OS X (10.5.7) and Firefox 3.5</li>\n<li>Mac OS X (10.5.7) and Opera 9.64</li>\n<li>Mac OS X (10.5.7) and Camino 1.6.8</li></ul>\nHD View SL is capable of opening images in five different ways:<br /><br /><table><tr><th> HTML </th><th> XML </th><th> image tiles </th></tr>\n<tr><td> from a web server </td><td> HD View XML embedded in the HTML </td><td> from a web server </td></tr>\n<tr><td> from a web server </td><td> HD View XML from a web server </td><td> from a web server </td></tr>\n<tr><td> from a web server </td><td> Deep Zoom XML from a web server </td><td> from a web server </td></tr>\n<tr><td> from a local file </td><td> HD View XML embedded in the HTML </td><td> from local files </td></tr>\n<tr><td> from a local file </td><td> Deep Zoom XML from a local file (same folder) </td><td> from local files </td></tr></table><br /><br />The first three techniques are tested by Examples.html in the Development\\HDViewSLWeb project, which must be launched from a web server (typically, by debugging from Visual Studio).  These examples fetch high-resolution image tiles that are stored on the research.microsoft.com web server.  The last two techniques are tested by Examples.html in the LocalTest folder, which must be launched directly from the local disk after copying the latest HDViewSL.xap to that folder.  The image tiles for these tests are included in the LocalTest folder, but only low-resolution tiles are provided in order to reduce the storage requirements.</div><div class=\"ClearBoth\"></div>",
  "TagList": "HD View SL,",
  "LastEdited": "2009-07-14T17:27:46.32-07:00"
}