{
  "ProjectName": "HelloWorldWebPart",
  "Title": "How to build a Hello World SilverLight Web Part in 10 easy steps",
  "Description": "Blog Article Teaser:\n\n\"I really like doing things in 10 easy steps, because although there is a lot of good tips and tricks out there for Silverlight, it’s not always easy to get from A-Z for beginners. In similar fashion to my 10 steps on SharePoint and Visual Studio workflows, I hope this post helps you connect the dots on SharePoint and Silverlight. In this two part series, we’re going to build the conventional “Hello World” application in Silverlight. We are then going to wrap that Silverlight application within a SharePoint web part and deploy the web part into a MOSS/WSS site collection.\"",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Blog Article Teaser&#58;<br /><br />&#34;I really like doing things in 10 easy steps, because although there is a lot of good tips and tricks out there for Silverlight, it&#8217;s not always easy to get from A-Z for beginners. In similar fashion to my 10 steps on SharePoint and Visual Studio workflows, I hope this post helps you connect the dots on SharePoint and Silverlight. In this two part series, we&#8217;re going to build the conventional &#8220;Hello World&#8221; application in Silverlight. We are then going to wrap that Silverlight application within a SharePoint web part and deploy the web part into a MOSS&#47;WSS site collection.&#34;<br /><br />Post 1: <a href=\"http://philwicklund.com/Lists/Posts/Post.aspx?ID=22\">http://philwicklund.com/Lists/Posts/Post.aspx?ID=22</a>: Introduction to Silverlight Development<br />Post 2: <a href=\"http://philwicklund.com/Lists/Posts/Post.aspx?ID=23\">http://philwicklund.com/Lists/Posts/Post.aspx?ID=23</a>: Deploying a Silverlight application into SharePoint</div><div class=\"ClearBoth\"></div>",
  "TagList": "silverlight,silverlight webpart,silverlight web part,hello world,sharepoint webpart,sharepoint web part,webpart,webparts,web part,web parts,silverlight webparts,",
  "LastEdited": "2008-05-26T18:55:38.073-07:00"
}