{
  "ProjectName": "HybridClock",
  "Title": "Hybrid Clock for Silverlight 2.0",
  "Description": "Hybrid Clock for Microsoft Silverlight 2.0 contains the \"best of both worlds\": Analog and Digital controls in perfect harmony used for Date/Time visualization. It's written in XAML, C# and JavaScript and could enhance any Silverlight-enabled .NET Web application.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Hybrid Clock for Microsoft Silverlight 2.0 contains the &#34;best of both worlds&#34;&#58; Analog and Digital controls in perfect harmony used for Date&#47;Time visualization. It&#39;s written in XAML, C&#35; and JavaScript and could enhance any Silverlight-enabled .NET Web application.<br /><br />The following demo page adds the button to the Bing Map with functionality to open NASCAR MAP in a full-screen mode. Notice, that in order to put the button control on the top of the map it was placed in &quot;&lt;div&gt;&quot; element with z-index set to 100 (in this particular case, even z-index:1 will do the job; in real-life development project make sure that the object on the top has its z-index properly set).<br /><br /><img src=\"/projects/HybridClock/38ee61fd-601b-4bfe-b4b9-7b4291a36d22\" alt=\"Hybrid&#32;Clock&#32;for&#32;Silverlight&#8482;&#32;2.0&#32;by&#32;Alex&#32;Bell\" title=\"Hybrid&#32;Clock&#32;for&#32;Silverlight&#8482;&#32;2.0&#32;by&#32;Alex&#32;Bell\" /><br />\n<h5>Overview</h5>\rHybrid Clock is, by far, the most sophisticated animated Date/Time visualization control developed for Microsoft Silverlight™ 2.0. Originaly created by Microsoft as analog clock for Silverlight™ 1.0 it was upgraded by Dr. Alexander Bell (the Author) to work with Silverlight 2.0. This revised version (see the working <a href=\"http://www.alexanderbell.us\">sample</a>) combines &quot;the best of both worlds&quot;, namely: digital and analog UI components. Its original analog design was enhanced by embedding the Date/Time digital scale into clock&#39;s face layout. Clock&#39;s readings are dynamically updated every 1 sec; time granularity of its digital scale could be reduced to 0.1 sec and further upon necessity. The list of enhancement also includes the animated resizing feature, which properties could be set separately for X or Y axes. <br /><br />At the core of digital scale is the DateTime.js module, included in this package. It has the value of its own, allowing web developers to add the virtual high-resolution Digital Clock to essentially any type of HTML elements, which supports the innerHTML property.<br />\n<h5>Package</h5>\rHybrid Clock 2.0 package includes several core components:<br />1. HybridClock.xaml file located in xaml folder: <br />2. Script files located in js folder<br />    - Silverlight.js (V 2.0) <br />    - DateTime.js <br />    - HybridClock.js <br />    - HybridClockExt.js<br />\n<h5>Usage</h5>\rHybrid Clock could be addefd to ether .htm or .aspx page in several steps outlined below: <br /><br />1. Create &quot;xaml&quot; and &quot;js&quot; folders in your web root application directory and copy the core components listed in section &quot;Package&quot; <br />2. Add the references to .js files to the &lt;head&gt; section of the web page as shown below (note: proper tags should be added): <br />  &lt;script type=&quot;text/javascript&quot; src=&quot;js/Silverlight.js&quot; &gt;&lt;/script&gt; <br />  &lt;script type=&quot;text/javascript&quot;;  src=&quot;js/DateTime.js&quot; &gt;&lt;/script&gt; <br />  &lt;script type=&quot;text/javascript&quot; src=&quot;js/HybridClock.js&quot; &gt;&lt;/script&gt; <br />  &lt;script type=&quot;text/javascript&quot;src=&quot;js/HybridClockExt.js&quot; &gt;&lt;/script&gt; <br />3. Create &lt;div&gt; element on the page and assign it the id=&quot;ClockHost&quot;. <br />4. Add function references to onload and onunload event of the opening body tag as show below: <br />  &lt;body onload=&quot;CreateSilverlightClock(); StartDigitalClock()&quot; onunload=&quot;StopDigitalClock(); StopSilverLightDigitalTimeDate()&quot;&gt; <br />5. Run your page to see the Hybrid Clock working<br />\n<h5>Customization</h5>\rIn order to customize the animated resizing effect, modify the values of following properties in HybridClock.js file (sample follows): <br />    var scaleXfrom = 0; <br />    var scaleXto =0.7; <br />    var scaleXdur = &quot;00:00:02&quot;; <br />    var scaleYfrom = 0; <br />    var scaleYto = 0.7;<br />    var scaleYdur = &quot;00:00:01&quot;; <br /><br />Logo customization (currently showing &quot;Alex Bell&quot; brand name) could be done by modifying the following section in HybridClock.xaml file: <br /> TextBlock x:Name=&quot;clockLogo&quot; <br /> FontFamily =&quot;Calibri&quot; <br /> FontWeight=&quot;Light&quot; <br /> FontSize=&quot;16&quot; <br /> Foreground=&quot;Silver&quot; <br /> Opacity=&quot;0.5&quot; <br /> Canvas.Top=&quot;70&quot; <br /> Canvas.Left=&quot;115&quot; <br /> Text=&quot;Alex Bell&quot;&gt; <br />\n<h5>Further enhancement</h5>\rThe most obvious Hybrid Clock enhancement could be achieved by adding the gallery of clock face design layout, i.e.. Themes. The project could be also extended by adding the second scale, digital or analog, or both, showing the &quot;World Time&quot;, i.e. the time in two different locales. I would assume, that numerous other ehnancements exist and would like to encourage my colleagues to try their own ones. Feel free to drop me a line or two should you have any questions or need for discussion: you can do it right here in comments section, or you can email me at: <a href=\"mailto:bell@alexanderbell.us\">AlexBell</a><br /><br /><table><tr><td> .NET </td><td> ASP.NET </td><td> Silverlight™ </td><td> GUI </td><td> Clock </td><td> XAML </td><td> JavaScript </td><td> Analog </td><td> Digital </td><td> AJAX </td></tr></table></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Silverlight Controls,Silverlight 2.0,Hybrid Clock,Clock,ASP.NET 2.0,ASP.NET 3.5,watch,Ajax,.NET,ASP.NET,time,xaml,GUI,analog,Digital,javascript,C#,Visual Studio,Mirshahreza,",
  "LastEdited": "2015-02-17T18:38:37.633-08:00"
}