{
  "ProjectName": "InfoKiosk",
  "Title": "Info Kiosk (Silverlight / TFS)",
  "Description": "This project actually consists of two parts; \n\n+ The core part is a Silverlight application which serves content in a PowerPoint like approach, meaning that one page after another is displayed based on a controller (XML) file. Each page is a Silverlight Application which is dynamically loaded. What each Silverlight application does is up to the application but the base idea is that each application generates some content to display. We are using this to display TFS related information such as the status of each TFS Build and Open, Resolved and Closed bug per project and so on.\n\n+ The second part is the development of various informational \"pages\" to display within the InfoKiosk. There are 3 projects included, one is the TFS Build Status, TFS Project Status and InfoPage Sample. The included TFS Build Status \"page\" can be compared to the build bunny, build lamp and other similar projects. This \"TFS Build Status\" info page displays all build types it finds within a TFS Server.\n\nThe the solution is based on Silverlight 2.0 (RC1) and based on a \"plug-n-play\" design. The Silverlight page is meant to run in full screen mode on a TV or Monitor to show a development team about various areas of interest of their projects. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This project actually consists of two parts&#59; <br /><br />&#43; The core part is a Silverlight application which serves content in a PowerPoint like approach, meaning that one page after another is displayed based on a controller &#40;XML&#41; file. Each page is a Silverlight Application which is dynamically loaded. What each Silverlight application does is up to the application but the base idea is that each application generates some content to display. We are using this to display TFS related information such as the status of each TFS Build and Open, Resolved and Closed bug per project and so on.<br /><br />&#43; The second part is the development of various informational &#34;pages&#34; to display within the InfoKiosk. There are 3 projects included, one is the TFS Build Status, TFS Project Status and InfoPage Sample. The included TFS Build Status &#34;page&#34; can be compared to the build bunny, build lamp and other similar projects. This &#34;TFS Build Status&#34; info page displays all build types it finds within a TFS Server.<br /><br />The the solution is based on Silverlight 2.0 &#40;RC1&#41; and based on a &#34;plug-n-play&#34; design. The Silverlight page is meant to run in full screen mode on a TV or Monitor to show a development team about various areas of interest of their projects. <br /><br /><b>Note</b><br />The code currently available is provided as is and came from a proof-of-concept project. There is still a lot of work to do to clean up the code, add documentation, write tests and so on.<br /><br /><b>Participants Welcome</b><br />Hi, I like to see this &quot;product&quot; to become a complete view into the life of a development team with &quot;mission critical&quot; information displayed for everybody to see and react against. It should be the &quot;water cooler&quot; discussion area where you see some info which concerns you whether it is your own project or somebody elses.<br /><br />I invite you to join this project and develop more of those cool informational pages and get to the bottom of TFS.<br /><br /><b>Sample Pictures</b><br />The pictures below show two controls displayed in full screen. These two pages would rotate one after another like a slideshow...<br /><img src=\"/projects/InfoKiosk/fcf377d7-a166-42e1-993b-0cf83e54690a\" alt=\"TFS&#32;Bug&#32;Info&#32;Page\" title=\"TFS&#32;Bug&#32;Info&#32;Page\" /><br />Picture 1: TFS Bug Information page (Page 1 / 2) The Graph is created using VisiFire.<br /><br /><img src=\"/projects/InfoKiosk/3c8f80d1-3203-4198-a79d-4c24249e4f56\" alt=\"TFS&#32;Build&#32;Status&#32;Info&#32;Page\" title=\"TFS&#32;Build&#32;Status&#32;Info&#32;Page\" /><br />Picture 2: TFS Build Status Information page (Page 2 / 2)<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "TFS,Silverlight 2.0,TFS Build Status,Digital Dashboard,Team System,Team Foundation,TeamDevelopment,Team Build,build tools,Bug Tracking,Team Data,Sharepoint,tfs board,",
  "LastEdited": "2008-09-07T10:19:13.38-07:00"
}