{
  "ProjectName": "InteractiveFictionSP",
  "Title": "Stefan's Senior Project: Interactive Fiction",
  "Description": "This is a senior project to complete my high school graduation. The vision is for a dynamic story generator and expressed in the form of a play manuscript. It will be written for Silverlight in C# using MS Visual Studio.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This is a senior project to complete my high school graduation. The vision is for a dynamic story generator and expressed in the form of a play manuscript. It will be written for Silverlight in C&#35; using MS Visual Studio.<br /><br /><br /><br /><b>Dinner With The Barclays</b><br /><br />Dinner With The Barclays is the game I made out of the engine which was my senior project. In the game, the player is invited to a dinner party. At the party, the player meets and interacts with the various characters. Later during the evening, a character is murdered and the player must use his knowledge and relationships with the other characters to determine who the murderer is and bring them to justice. The entire story is told in the form of a play.<br /><br />You must have Microsoft Silverlight installed for this to work.<br /><br /><br /><b>How to Play</b><br /><br />The player inputs commands in the form of sentences built from the drop-up menus at the bottom of <br />the screen. The first is the verb menu, the second is the direct object menu and the third is the<br />second object menu. The direct object is the character whom the player is talking TO. The second object <br />can be a character or a line of the play. If it is a character, it is the person the player is <br />talking ABOUT. If it is a line of the script, it is the line which the player has clicked on.<br /><br />There are options in the top right. The player can choose to maximize his screen, highlight his lines<br />or even activate text-to-speech as long as he has access to the internet.<br /><br /><br /><br /><b>Credits</b><br /><br />Model Programmer and designer: Stefan Faridani<br />UI Programmer: Ben<br />Project Mentor: Rory</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-04-03T21:58:53.147-07:00"
}