{
  "ProjectName": "iTextSharpSL",
  "Title": "iTextSharp MPL for Silverlight & Windows Phone",
  "Description": "This is a port of the iText Sharp (4.2) that was the last version published under the Mozilla Public License for Silverlight and Windows Phone. You can use this version in a commercial application and it does not require your app to be released as open source. You do not need any kind of license from anyone to use this unless you want to change the publishing information (where it sets iText as the publisher)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This is a port of the iText Sharp &#40;4.2&#41; that was the last version published under the Mozilla Public License for Silverlight and Windows Phone. You can use this version in a commercial application and it does not require your app to be released as open source. You do not need any kind of license from anyone to use this unless you want to change the publishing information &#40;where it sets iText as the publisher&#41;<br /><br /><br /><b>Why do this?</b><br /><br />It may seem weird as there already is a Silverlight port of iText Sharp on Codeplex. The main reason is that while I was investigating this port I discovered that it is in fact an AGPL port of iText Sharp which means that any code that you write using this library MUST be released as AGL. The cost of a license of iText latest version is not cheap, so I created this port for those who have use for it for Windows Phone and Silverlight (I may even make some enhancements).<br /><br /><b>Current State</b><br />I am finishing up my port of the Windows Phone code to place out here, and will be publishing the source soon. <br /><br />This code is to be considered in testing mode. Yes, you can use it (I am), but realize that it might not work the way you want. I could use some help testing it and getting things a little firmer on it. It does work, as you can see from the sample app.<br /><br /><b>Planned Extensions</b><br />I am planning on investigating a way to be able to read a PDF or at least render the page as an image. </div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-06-12T07:56:32.44-07:00"
}