{
  "ProjectName": "iTunes2",
  "Title": "iTunes 2.0",
  "Description": "iTunes as an online rich internet application. Using ajax.asp.net and silverlight im going to bring the iTunes experience completely online.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">For the period of 1 month i set out on a prototyping adventure to see if iTunes could indeed be created as an ajax / silverlight web application. The end prototype web application proved that we could deliver the iTunes experience online.<br /><br />Now begins the development phase of the project. Converting the prototype into a real application.. Let&#39;s begin!<br /><br />The sample website with the prototype can be found here. <a href=\"http://www.blendcandy.com/jf000019.aspx\">http://www.blendcandy.com/jf000019.aspx</a><br /><br />Check out the blog, i have posted every step of my journey <a href=\"http://advertboy.wordpress.com/project-silverlight-11/\">http://advertboy.wordpress.com/project-silverlight-11/</a><br />\n<ul><li>The sourcecode for the prototype can be found in the &quot;Releases&quot; area appropriately labelled &quot;prototype&quot;</li></ul>\n\n<ul><li>I have just added a new package to this website, it&#39;s the source code to another Apple related source code. &quot;A beautiful Website&quot; will ultimately be a package of web controls written in SilverLight that when mixed together will result in an amazingly beautiful website, in the likeness of Apple&#39;s website.</li></ul>\n<br />Check out the project here at my blog, i post every control i create here <a href=\"http://advertboy.wordpress.com/beautiful-website/\">http://advertboy.wordpress.com/beautiful-website/</a><br /><br />UPDATE: <br /><br />=======================================<br />iTUNES moves out of PROTOTYPE and into DEVELOPMENT<br />=======================================<br /><br />I have officially moved the project out of prototype and i have now begun full development. Be sure to stay in touch with this project, it&#39;s gonna take off over the next couple of weeks! <br /><br />Check out the releases, it&#39;s appropriately labelled &quot;Development&quot;</div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,Silverlight,Blend,iTunes,Interesting,",
  "LastEdited": "2007-09-30T13:22:02.72-07:00"
}