{
  "ProjectName": "leanandon",
  "Title": "LeanAndon",
  "Description": "LeanAndon is a Silverlight implementation of a generalised visual board (Scrum Wall, Kanban Board) intended to work with TFS. It is aimed at agile teams which cannot use physical boards.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Introducing LeanAndon</h1>\r\nLeanAndon is an open source Silverlight implementation of a Scrum / Kanban board for Microsoft Team Foundation Server, providing a rich graphical experience for several popular Process Templates.  It aims to address the limitations of other TFS process interfaces and reduce the overhead of project collaboration by focusing on ease of interaction and high value information.<br /><br />Originally a traditional Japanese paper lantern, the term Andon has been adopted by the manufacturing industry to refer to a system of identifying a quality or process issue.  It will come as no surprise that this approach was pioneered by the Toyota Production System and forms part of Lean manufacturing.  At the heart of the Andon system is a signboard to serve as a visual indicator of the process.  LeanAndon provides a process signboard to support Lean software development.<br /><br />It is widely acknowledged that the traditional whiteboard scrum and index card approach is preferable, and we recommend this above all else.  However there are situations when the traditional approach is not ideal or not possible:<br />\n<ul><li>The Agile team is distributed across different locations</li>\n<li>Tighter integration with Visual Studio and TFS is required</li>\n<li>You build TFS driven Scrum / Kanban software for a living…</li></ul>\n<br />You can read more about the construction and features of LeanAndon on our <a href=\"http://leanandon.blogspot.com\">development blog</a>.<br /><br /><b><i>The project has just started and we are aiming to create a first release around the release of TFS2010</i></b></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-02-12T13:36:28.153-08:00"
}