{
  "ProjectName": "logo",
  "Title": "Turtle Logo (programming language) for Kids",
  "Description": "Turtle Logo for Kids teaches kids step by step the basic of computers programmong. LOGO is a computer programming language used for functional programming, and is used for generating basic shapes using a turtle cursor.\nIt's developed in C# on Silverlight using Visual Studio 2010.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Turtle Logo for Kids teaches kids step by step the basic of computers programmong. LOGO is a computer programming language used for functional programming, and is used for generating basic shapes using a turtle cursor.<br />It&#39;s developed in C&#35; on Silverlight using Visual Studio 2010.<br /><br /><b>Turtle Logo for Kids</b> was developed for children experimenting their first programming steps. It guides kids step by step with the basics of computers programming. <br /><br /><br /><img src=\"/projects/logo/752e9560-6d72-4fdf-ae56-c689d084e435\" alt=\"My&#32;Image\" title=\"My&#32;Image\" /><br /><br /><br />Logo&#39;s best-known feature is the turtle, which is an on-screen cursor, which can be given movement and drawing instructions, and is used to programmatically produce line graphics.<br /><br />As a father of twin daughters at age 7, I developed this program to teach my daughters the basics of programming through a game that makes use of geometric shapes, just as they would draw these lines and shapes on a paper.<br /><br />Visual Studio 2010 + Silverlight 4 is a great tool for this purpose, since it easily enables programming short movements in a very short time.<br /><br />My vision is that this game will generate the next generation of developers, and maybe the kids playing today with <b>Turtle Logo for Kids</b> will be the future developers in Visual Studio 2020.<br /><br />online demo at <a href=\"http://www.yuvbz.com/logo.html\">http://www.yuvbz.com/logo.html</a><br /><br /><br /><b>Turtle Logo for Kids Syntax</b><br />Standard Commands <br />fd &lt;n&gt; – Move the turtle forward by &lt;n&gt; steps. <br />bk &lt;n&gt; – Move the turtle backward by &lt;n&gt; steps. <br />rt &lt;n&gt; – Rotate the Turtle &lt;n&gt; degrees to the right. <br />lt &lt;n&gt; – Rotate the Turtle &lt;n&gt; degrees to the left.<br />repeat &lt;n&gt; –repeat the transaction within the parenthesis.<br />color – change the color of the drawing line in a loop from a list of selected colors.<br /><br />for more info about logo: <a href=\"http://en.wikipedia.org/wiki/Logo_(programming_language)\">http://en.wikipedia.org/wiki/Logo_(programming_language)</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "powershell,Logo,Turtle graphics,oojl,programming for kids,hebamohasseb,",
  "LastEdited": "2013-09-08T16:02:38.83-07:00"
}