{
  "ProjectName": "MOSSDAL",
  "Title": "MOSSDAL: MOSS Data Access Layer for data from the Sharepoint Lists Service",
  "Description": "MOSSDAL is a lightweight framework for working with Sharepoint MOSS List data using the List web Service.  It can be used with silverlight or regular .NET code.  It simplifys the creation of service queries and the loading of results into business objects.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">My name is Jonathan Cartwright and I am the designer / developer of MOSSDAL.  This is an active project and as such feedback and discussion is welcome.  I will make every attempt to address issues and feature requests, so leave comments.  If there is a problem with MOSSDAL, comment on it.  If there is a feature that you would like to see added, tell me about it.  <br /><br />I have noticed downloads of the .NET framework but not the samples.  This leads me to believe that the downloads were misleading.  To get started, I would download the <a href=\"http://mossdal.codeplex.com/releases/view/44217\">NET Sample</a> or the <a href=\"http://mossdal.codeplex.com/releases/view/44217\">Silverlight Sample</a>.  They both use a list called &quot;sites gallery&quot;.  There is a list template in each of the sample zips to create that library.  There is also a readme file that gives the basic steps to get started with the samples.<br /><br /><b>What is MOSSDAL?</b><br />MOSSDAL is a lightweight framework for Silverlight and .NET that helps a developer access data in SharePoint Lists.  It accesses data using the SharePoint Lists web service and loads that data into business objects created by the developer.   It also simplifies the creation of service queries and the loading of results into business objects.<br /><br /><b>What is in this framework?</b><br />The framework consists of a two custom attributes, a base class that can load list service xml into custom business objects, a static class for helping create CAML queries and a service helper class for fetching data.<br /><br /><b>How does MOSSDAL work?</b><br />MOSSDAL uses special attributes to decorate business object classes and fields or properties.  These attributes help MOSSDAL to map list fields to properties or fields in the business object.  To retrieve data from SharePoint, MOSSDAL uses helper classes called Service Helpers.  The framework uses DotNetServiceHelper for .NET and SilverlightServiceHelper in Silverlight.  In .NET, the framework Service Helper fetches data synchronously.  Since Silverlight does not allow synchronous service calls, the SilverlightServiceHelper uses asynchronous calls and an ObservableCollection.  Once the Service Helper has retrieved data it uses the load method in the SharepointListItem base class to load data from the xml service response into the business object.  This is done with reflection using the SharepointListField attribute.  Data is returned to the caller as a List of objects of the business class in .NET and as an ObservableCollection of objects of the business class in Silverlight.<br /><br /><b>How do I get started using MOSSDAL?</b><br />First download the<a href=\"http://mossdal.codeplex.com/releases/view/43771\">NET Sample</a> or the <a href=\"http://mossdal.codeplex.com/releases/view/44217\">Silverlight Sample</a>.  In the download, there is a list template called sitesgallery.  Install the template and create a list with it. Now you should be able to run the sample. <br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-05-04T04:57:51.587-07:00"
}