{
  "ProjectName": "mpwp",
  "Title": "Media Player Web Part",
  "Description": "The Media Player Web Part makes it easier to integrate media into SharePoint.It is a universal Media Player Web Part.It queries a media player HTML template from a SharePoint list located anywhere in your farm.Media-file URL, size, title, description, autoplay options can be set.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Short Project Description</b><br />The Media Player Web Part makes it easier to integrate media into SharePoint.It is a universal Media Player Web Part.It queries a media player HTML template from a SharePoint list located anywhere in your farm.Media-file URL, size, title, description, autoplay options can be set.<br /><br /><b>Detailed Project Description</b><br />Have you ever inserted some HTML code into a Content Editor Web Part (CEWP), to display a media player such as the Windows Media Player, the famous FLV JW Player or a Silverlight player, then asked your users to change the HTML Code to display their media file? You thought everything was going fine, but then you wanted to change the HTML code to maybe increase the font-size for the title, set the player to play the file automatically, etc. You however noticed that such change didn&#39;t reflect the web parts already in place, this is exactly what the Media Player Web Part prevents from happening.<br /><br />The HTML code is stored in a SharePoint list that can be anywhere in your farm, as long as the user accessing the page containing the Web Part is able to access that list. The Media Player Web Part (MPWP) queries the HTML code from that list and replaces placeholders with values obtained from user input (such as File URL, Width, Height, Autoplay, Title, Description). If a change is made to the HTML code in that list, the change will reflect all MPWP&#39;s obtaining the HTML code from that list, unlike adding the HTML code to a Content Editor Web Part then exporting it and importing it into the Web Part Gallery. Therefore the Media Player Web Part can be duplicated multiple times in the Web Part Gallery referencing unlimited amounts of HTML codes for e.g. different players (e.g. FLV, Silverlight, etc). In short the Media Player Web Part is a <b>universal</b> Media Player Web Part!<br /><br /><a href=\"https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&amp;hosted_button_id=BAEMZDGMJHKNQ\"><img style=\"border:none;\" src=\"https://www.paypal.com/en_US/GB/i/btn/btn_donateCC_LG.gif\" alt=\"Donate\" title=\"Donate\" /></a><br /><br /><img src=\"/projects/mpwp/070384a7-d47b-4e24-b21b-19001bda49e4\" alt=\"mediaplayerwebpart_toolpane.png\" title=\"mediaplayerwebpart_toolpane.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Media,Player,Media Player,Sharepoint,SharePoint 2007,Web Part,Flash,Silverlight,html,MPWP,Media Player Web Par,List,sharepoint list,WMP,windows media player,alternative,WebPart,Universal,FLV,MP4,",
  "LastEdited": "2011-01-01T15:45:02.32-08:00"
}