{
  "ProjectName": "multicolumntreelist",
  "Title": "Silverlight Multi Column Collapsible Tree List",
  "Description": "The MultiColumnTreeList is a great way to visualize and edit hierarchical data in a collapsizble multi-column tree grid. Binding to it is as simple as binding to a tree!",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The MultiColumnTreeList is a great way to visualize and edit hierarchical data in a collapsizble multi-column tree grid. Binding to it is as simple as binding to a tree&#33;<br /><br /><b>MultiColumnTreeList</b> is a much wanted collapsible multi-column tree list control. Built on <b>DataGrid</b> and works just like the TreeView, in virtual mode with on-demand loading and rendering of rows.<br />\n<ul><li>Easily bind column templates to your hierarchy&#39;s node values using Binding and Converters.</li>\n<li>Familiar HierarchicalDataTemplate based hierarchy resolution.</li>\n<li>Rich DataGrid based UI.</li>\n<li>Expand All or Collapse All support.</li></ul>\n<br /><img src=\"/projects/multicolumntreelist/8e1255d4-be53-490f-9f2c-6dc3705c858c\" alt=\"MultiColumnTreeList.png\" title=\"MultiColumnTreeList.png\" /><br /><br />This control was developed by <b>RadiantQ</b> (<a href=\"http://www.radiantq.com\">http://www.radiantq.com</a>). We specialize in Silverlight based GanttControls for Project and Resource management.<br /><br />RadiantQ also specializes in providing project implementation services for Silverlight based projects, especially GUI intensive applications where our expertise would be a great asset for your projects. Please visit our website for more information.<br /><br /><b>Licensing:</b> Along with the &quot;GNU General Public License version 2&quot; requirements, you are also not allowed to resell all or portions of this control, in source or binary form, as part of a control library product.<br /><br />Download stable from <b>Downloads</b> tab or get the latest from SVN in the <b>Source Code</b> tab.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-01-19T13:11:53.69-08:00"
}