{
  "ProjectName": "MyWordGame",
  "Title": "MyWordGame",
  "Description": "Thie is the Silverlight version of a word game from the project 'MyWGP', a word game publisher, with an extionsion of a stroy page.  ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><br />\n<h1>MyWordGame</h1>\r\nMyWordGame is not just designed to serve as an usual word game but more as a great educational tool that can be utilized by school teachers in any grade.  It has following two sections:\n<ol><li>Word Game - where the definition/synonym/example sentence of a word are displayed.  A user can either type in a word or choose a word (MyWordGame Alternative) to play the game.</li>\n<li>Story - all the words in the game are originated from the story and this encourages a player not only to learn different words but also the use of words in sentences as he/she plays the game.  </li></ol>\n<br />This particular version (2.0) of <b>MyWordGame</b> is developed in <b>.NET Framework 4 in VS2009 Beta version using </b>Silverlight 3.0* technology in <b>C#</b>, <b>Linq</b>, and <b>Xml</b> and later an additional <b>.NET Framework 3.5</b> version in VS2008 Pro is added.  There are also two different types of games: 1. MyWordGame and 2. MyWordGame Alternative.  While the first one mandates a user type a word for the game, the other provides a set of words for the user to choose.  <br /><br />This game can easily be facilitated once a word file is created in proper xml-structure and placed in the server along with an executable, .xap file.   There is an application called &quot;MyWGP (MyWordGameProvider)&quot; that allows a user create/update/manage their word files for their own word games.  The new version of MyWGP is still under the deveopment process.  <br /><br /><b>Sample Demo:</b> Visit <a href=\"http://www.dbsoup.org\">http://www.dbsoup.org</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight 2.0,.NET 3.5,LINQ to XML,C#,C# 3.5,C# 3.0,Silverlight 3,Visual Studio 2008,xml,Framework 4,Framework 3.5,",
  "LastEdited": "2010-04-13T07:27:49.023-07:00"
}