{
  "ProjectName": "NavFx",
  "Title": "Silverlight NavFx",
  "Description": "A framework for building complex Sliverlight 2.0 applications with simple or complex navigation between pages.  Pages can be packaged in the application package (xap) or loaded dynamically from Silverlight libraries.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A framework for building complex Sliverlight 2.0 applications with simple or complex navigation between pages.  Pages can be packaged in the application package &#40;xap&#41; or loaded dynamically from Silverlight libraries.<br /><br />Silverlight 2.* makes it possible to create complex applications that are packaged in a .xap file that is deployed to a hosting web site.  The more pages in the application the bigger the xap file and the longer a user has to wait while it downloads.  To minimise initial download time you can seperate pages into Silverlight libraries and load them dynamically.<br /><br />NavFx is a framework that supports the packaging of Silverlight pages in libraries, loading them dynamically and navigating between them.  Based on these articles <a href=\"http://www.theadvents.com/?p=11\">Optimizing Silverlight with Dynamic Modules</a>, <a href=\"http://www.theadvents.com/?p23#more-23\">Basic Silverlight Navigation</a> by Thomas Holloway NavFx provides the following features.<br />\n<ul><li>Dynamic loading of pages from a Silverlight Library</li>\n<li>Navigation (GoToPage, Next, Previous, Back and Forward)</li>\n<li>Navigation History (forwards and back)</li>\n<li>Registration of pages</li>\n<li>Cache management (Clear Cache, Remove Page)</li>\n<li>Pinned pages</li></ul>\n<br />More information including How To articles can be found on <a href=\"http://www.mikehanson.com\">My Blog</a><br /><br /><b>Updated binaries and templates released 18th May 2009</b></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Silverlight 2.0,Silverlight NavFx,MyList.SilverLight,Silverlight NPE,Silverlight 3.0,",
  "LastEdited": "2009-05-18T13:44:37.963-07:00"
}