{
  "ProjectName": "nunrar",
  "Title": "NUnrar - Unrar in pure C#",
  "Description": "NUnrar is a native C# unrar library that supports forward-only (i.e. Network) streams and Silverlight.  No intermediate buffering necessary.  Random access is also available.\r\n\r\nIt was ported from the JUnrar version of unrar (http://java-unrar.sourceforge.net/) by Edmund Wagner.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />NUnrar is a native C&#35; unrar library that supports forward-only &#40;i.e. Network&#41; streams and Silverlight.  No intermediate buffering necessary.  Random access is also available.<br /><br />It was ported from the JUnrar version of unrar &#40;http&#58;&#47;&#47;java-unrar.sourceforge.net&#47;&#41; by Edmund Wagner.<br /><br />NuGet <a href=\"http://nuget.org/List/Packages/nunrar\">http://nuget.org/List/Packages/nunrar</a><br />\n<h2>SharpCompress is the future for NUnrar <a href=\"http://sharpcompress.codeplex.com/\">http://sharpcompress.codeplex.com/</a> (with SOLID support)</h2>\r\n<img src=\"http://download.famouswhy.com/awards/Famous_Software_Award_Logo.png\" /><br /><a href=\"http://download.famouswhy.com/nunrar/\">http://download.famouswhy.com/nunrar/</a><br />\n<h1>License</h1>\r\nUnRAR - free utility for RAR archives<br />License for use and distribution of<br />FREE portable version<br /><br />The source code of UnRAR utility is freeware. This means:<br /><br />1. All copyrights to RAR and the utility UnRAR are exclusively<br />owned by the author - Alexander Roshal.<br /><br />2. The UnRAR sources may be used in any software to handle RAR<br />archives without limitations free of charge, but cannot be used<br />to re-create the RAR compression algorithm, which is proprietary.<br />Distribution of modified UnRAR sources in separate form or as a<br />part of other software is permitted, provided that it is clearly<br />stated in the documentation and source comments that the code may<br />not be used to develop a RAR (WinRAR) compatible archiver.<br /><br />3. The UnRAR utility may be freely distributed. It is allowed<br />to distribute UnRAR inside of other software packages.<br /><br />4. THE RAR ARCHIVER AND THE UnRAR UTILITY ARE DISTRIBUTED &quot;AS IS&quot;.<br />NO WARRANTY OF ANY KIND IS EXPRESSED OR IMPLIED. YOU USE AT <br />YOUR OWN RISK. THE AUTHOR WILL NOT BE LIABLE FOR DATA LOSS, <br />DAMAGES, LOSS OF PROFITS OR ANY OTHER KIND OF LOSS WHILE USING<br />OR MISUSING THIS SOFTWARE.<br /><br />5. Installing and using the UnRAR utility signifies acceptance of<br />these terms and conditions of the license.<br /><br />6. If you don&#39;t agree with terms of the license you must remove<br />UnRAR files from your storage devices and cease to use the<br />utility.<br /><br />Thank you for your interest in RAR and UnRAR.<br /><br /><br />Alexander L. Roshal</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,RAR,unrar,compression,silverlight,",
  "LastEdited": "2011-09-28T01:25:27.207-07:00"
}