{
  "ProjectName": "odaf",
  "Title": "Open Data App Framework (ODAF)",
  "Description": "The Open Data Application Framework (ODAF) is a framework that allows cities to easily map existing civic Open Data landmarks, and allow users to rate, comment, and tag them - and also create new landmarks. Desktop and mobile client code, plus server backend code is included.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The Open Data Application Framework &#40;ODAF&#41; is a framework that allows cities to easily map existing civic Open Data landmarks, and allow users to rate, comment, and tag them - and also create new landmarks. Desktop and mobile client code, plus server backend code is included.<br /><br />It includes a desktop client using <a href=\"http://www.microsoft.com/maps/isdk/silverlight/\">Bing Maps for Silverlight</a>, a mobile client for the <a href=\"http://apple.com/iphone\">iPhone</a> using <a href=\"http://www.bing.com/toolbox/blogs/maps/archive/2008/04/29/tracking-virtual-earth-tile-usage.aspx\">Bing Maps</a>, and an <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=53289097-73ce-43bf-b6a6-35e00103cb4b&amp;displaylang=en\">ASP.NET MVC</a> server back-end using <a href=\"http://www.microsoft.com/sqlserver/2008/en/us/default.aspx\">SQL Server 2008</a>. <br />\n<ul><li>UPDATE: Now VanGuide is available for Windows Phone 7: <a href=\"http://vanguidewp7.codeplex.com/\">VanGuideWP7</a> **</li></ul>\n<br />The Open Data is retrieved by parsing <a href=\"http://en.wikipedia.org/wiki/Atom_(standard)\">ATOM</a> feeds that contain URL data-sources that link to <a href=\"http://en.wikipedia.org/wiki/Keyhole_Markup_Language\">KML</a> data. <a href=\"http://twitter.com/oauth_clients/new\">Registration for a Twitter App</a> is required, for the OAuth authentication (<a href=\"http://apiwiki.twitter.com/Twitter-REST-API-Method:-oauth-access_token-for-xAuth\">xAuth</a> access required, send your app id to <a href=\"mailto:API@twitter.com\">API@twitter.com</a> to request access). Twitter authentication is used to authenticate users on the system.<br /><br />Interact with a social map of civic Open Data by rating, tagging, or commenting on existing civic Open Data landmarks. When you comment on an Open Data landmark, you can opt to update your status on Twitter with your comment as well. You can also add your own landmarks, or see other landmarks that people have added - and you can also rate, tag or comment on those as well. An <a href=\"https://twitter.com/signup\">existing Twitter.com account</a> is required for sign in to rate, tag, or comment on a landmark, add a landmark or tweet about a landmark.<br /><br />Open Data landmarks are places such as schools, libraries, drinking fountains, fire halls, community centres, bus / train stops, and parking lots. As an example, The City of Vancouver has opened up this civic data on their website at <a href=\"http://data.vancouver.ca\">http://data.vancouver.ca</a> and most of this data has been imported into the <a href=\"http://www.microsoft.com/windowsazure/windowsazure/\">Windows Azure</a> cloud using the Open Source framework for hosting Cloud-based Open Data Catalogues: Open Government Data Initiative <a href=\"http://ogdi.codeplex.com/\">OGDI</a> website at <a href=\"http://vancouverdata.cloudapp.net\">http://vancouverdata.cloudapp.net</a>. <br /><br />VanGuide, an application that uses Open Source <a href=\"http://odaf.codeplex.com\">ODAF</a> framework, uses <a href=\"http://ogdisdk.cloudapp.net/\">OGDI</a> as its primary source for City of Vancouver Open Data. VanGuide has a website for the desktop at <a href=\"http://vanguide.cloudapp.net\">http://vanguide.cloudapp.net</a> that uses Microsoft&#39;s Silverlight technology to map the data using Microsoft&#39;s Bing Maps, and a free mobile application for the iPhone (on the iPhone App Store at <a href=\"http://itunes.com/apps/vanguide\">http://itunes.com/apps/vanguide</a>) that uses Microsoft&#39;s Bing Maps to provide an equivalent experience for the small screen.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "open data,Open Government,iPhone,Silverlight,.NET,C#,twitter,OAuth,xAuth,Bing Maps,Azure,ASP.NET MVC,KML,ATOM,SQL Server,",
  "LastEdited": "2010-08-17T11:17:53.417-07:00"
}