{
  "ProjectName": "odata",
  "Title": "Open Data Protocol - .NET/Silverlight/WP7 Libraries and Frameworks",
  "Description": "This is an open source release of several different libraries for the Open Data Protocol (OData). For more information on OData see http://www.odata.org.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Note: We moved OData .NET library to GitHub.  Source code &amp; issues:   <a href=\"https://github.com/OData/\">https://github.com/OData/</a>.  Tutorials: <a href=\"http://odata.github.io/\">http://odata.github.io/</a>.</b><br />\n<h2>Glib Marketing Statement</h2>\rThe <a href=\"http://www.odata.org/\">Open Data Protocol</a> (OData) is a Web protocol for querying and updating data that frees your data from silos that exist in applications today. It supports an ecosystem of powerful, interoperable clients and servers.<br />\n<h2>Why You Care About OData</h2>\rOData lets REST services describe both the data and the data model as resources. The model is machine-readable. This lets generic clients (think web browsers but for data) operate on any OData service.<br /><br />OData is being used to expose information from sources including relational databases, document databases, file systems, content management systems, and traditional Web sites.<br />\n<h2>Why You Care About This Project</h2>\rThis site contains a framework (WCF Data Services) and a library (ODataLib) that make it easier to implement OData clients and servers on a variety of .Net platforms.<br /><br />This project contains full source for each library and framework. Binary distributions are available via <a href=\"http://www.nuget.org/\">NuGet</a>.<br /><br /><b>Framework: batteries included</b><br /><blockquote>Use this when you want a full OData stack. This makes it easy to get started. It will place some constraints on your code. In exchange, it will significantly reduce the amount of code that you have to write.</blockquote>\n<b>Library: do the hard parts but leave you in charge</b><br /><blockquote>Use this when the framework is too constraining. Use the framework if you can; you will have a lot less code to write.</blockquote>\n<blockquote>The library implements the most tricky parts of supporting OData, but it doesn&#39;t do everything. This allows you to choose which parts to use, when to call them, and to maintain control of the overall process.</blockquote>\n<h2>The Framework: WCF Data Services Client</h2>\r<a href=\"https://odata.codeplex.com/wikipage?title=WCF%20Data%20Services%20Client&referringTitle=Home\">WCF Data Services Client</a> makes it easy to build an OData client in .Net.<br /><br />Platforms: .Net 3.5, .Net 4.0, .Net 4.5 (current RC), Silverlight 4.0, and WP7.<br />Source: under WcfDataServicesClient<br />Binaries: <a href=\"http://nuget.org/packages/Microsoft.Data.Services.Client\">WCF Data Services Client</a> (NuGet)<br />\n<h2>The Library: ODataLib</h2>\r<a href=\"https://odata.codeplex.com/wikipage?title=ODataLib&referringTitle=Home\">ODataLib</a> provides key components for both OData clients and OData services written with .Net. Its main features are:<br />\n<ul><li>Use components independently or in conjunction with each other.</li>\n<li>Contains both server and client components.</li>\n<li>Use only what you need.</li>\n<li>Your application remains in charge. ODataLib only does stuff when you ask it to.</li></ul>\n<br />Platforms: .Net 3.5, .Net 4.0, .Net 4.5 (current RC), Silverlight 4.0, and WP7.<br />Source: under ODataLib<br />Binaries: <a href=\"http://nuget.org/packages/Microsoft.Data.OData\">ODataLib</a> (NuGet)<br />\n<h2>Additional Details</h2>\rTo download the latest built of the Windows Phone 7 library and the Visual Studio 2010 tools visit the <a href=\"http://odata.codeplex.com/releases/view/54698\">downloads page</a> and select the ODataClient_BinariesAndCodeGenToolForWinPhone.zip download or use the direct <a href=\"http://odata.codeplex.com/releases/view/54698#DownloadId=161862\">link</a>. </div><div class=\"ClearBoth\"></div>",
  "TagList": "OData,WP7,Services,Silverlight,Mirshahreza,library,",
  "LastEdited": "2015-06-06T15:27:30.443-07:00"
}