{
  "ProjectName": "OdcPhone",
  "Title": "Odyssey Phone",
  "Description": "Windows Phone 7 WP7 Silverlight Toolkit\n\nfeatures:\n* specialized JumpListCollectionView which can be used to bind to a JumpListBox for grouping items and offer a quick jump list.\n\n* page animations within page navigation in xaml with extendable animations. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1><strong>Project Description</strong></h1>\r\n<p>&nbsp;</p>\r\n<p><strong>&nbsp;</strong>Windows Phone 7 WP7 Silverlight Toolkit<br>\r\n<em>build a very responsive and fast UI with a varity of page transitions, controls and behaviors</em></p>\r\n<p>Features:</p>\r\n<ul>\r\n<li>QuickJumpLists </li><li>&nbsp;Feathered&nbsp;turnstile&nbsp;effect on any kind of page, </li><li>continuum effect </li><li>&nbsp;very fast TimePicker and DatePicker (much faster startup time than those from Silverlight Toolkit and even from Telerik)\r\n</li><li>ItemPicker and Dropdown control to present only the selected item and open a popup/dropdown to choose from a list\r\n</li><li>Window control to open additional content on demand on the same page over the current content (faster and more fluent in response than a popup)\r\n</li><li>Context Menus on every Control bindable on any Framework within the Control. </li><li>CommandButton to easily bind the butto with a Command from ViewModel </li><li>DelegateCommand to bind with a ViewModel </li><li>Fast ListBox replacements with intervalled Item loading on startup to minimize required startup time, including jump list support\r\n</li><li>Behaviors and Actions for various page transitioning either when a Page loads/unloads or due to an event (Swing, Swivel, Continuum, Zoom,&nbsp; Feather)\r\n</li><li>MessageEventTrigger to bind an event with a message box to confirm before raising actions in order to separate the view from the model as far as possible\r\n</li><li>DelayedEventTriggrer to perform actions due to an event on a view after a delay (e.g. to start a page transition some milliseconds before navigating to another page)\r\n</li><li>Many AttachedProperties, for instance to set the focus on a textbox when the page loads automatically, or for immediate binding of the text of a textbox\r\n</li><li>MVVM toolkit (ViewModelBase, ModelBase, DelegateCommand) </li><li>IndexedDataSource for creating an items source for OdcListBox that maintains QuickJumpItems and automatically keeps an alphabetic order, even if the source changes\r\n</li><li>GroupedDataSource which is like IndexedDataSource but intended to be used for a grouped jump list.\r\n</li><li>AppUtils to simplify Access to ApplicationBar which is unfortunately not bindable, e.g. for localizing the items of the ApplicationBar, or settings IsEnabled along with changes to the ViewModel\r\n</li><li>WeakCollectionChangedListener and WeakNotifyPropertyChangedListener for loosely coupled binding between View and ViewModel/Model.\r\n</li><li>and more... </li></ul>\r\n<p>&nbsp;</p>\r\n<ul>\r\n<li>Screenshots </li></ul>\r\n<p><a href=\"http://download.codeplex.com/download?ProjectName=OdcPhone&DownloadId=160247\"><img title=\"JumpListBox\" src=\"http://download.codeplex.com/download?ProjectName=OdcPhone&DownloadId=160248\" border=\"0\" alt=\"JumpListBox\" width=\"791\" height=\"316\" style=\"padding-left:0px; padding-right:0px; display:inline; padding-top:0px; border-width:0px\"></a></p>\r\n<p>&nbsp;</p>\r\n<div id=\"scid:5737277B-5D6D-4f48-ABFC-DD9C333F4C5D:cbd34efb-b8cf-450f-b25a-80b1a0db924d\" style=\"margin:0px; display:inline; float:none; padding:0px\">\r\n<div><a href=\"http://www.youtube.com/watch?v=TBXWQvlHMpU&feature=youtube_gdata_player\" target=\"_new\"></a></div>\r\n</div>\r\n<hr>\r\n<h2>Requirements</h2>\r\n<ul>\r\n<li>Visual Studio 2010 </li><li>Windows Phone 7 </li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "WP7,jumplists,JumpList,Animation,windows phone 7,Silverlight,grouping,jump list,CollectionView,turnstile,swing,Transition,Dropdown,",
  "LastEdited": "2011-05-18T12:43:55.16-07:00"
}