{
  "ProjectName": "OpenRPOSBackOffice",
  "Title": "OpenRPOS BackOffice",
  "Description": "Developed using Silverlight, the BackOffice client provides an intuitive user interface that enables the management of restaurant data.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Note that this project will be deleted shortly.  The OpenRPOS projects have been consolidated into a single &quot;Well Done&quot; project.  Please follow us at this address:<br /><br /><a href=\"https://welldone.codeplex.com/\">https://welldone.codeplex.com/</a><br /><br /><br /><b>Project Description</b><br />Developed using Silverlight, the BackOffice client provides an intuitive user interface that enables the management of restaurant data.Developed using Silverlight, the BackOffice client provides an intuitive user interface that enables the management of restaurant data and includes the following features:<br /><b>-Account management –</b> Provides users with the ability to update personal information that may change, such as mailing address, phone, and e-mail, as well as the ability to change their password.<br /><b>-Employee data management –</b> Enables managers to update information for employees to include managing roles, pay rates, personal data, and login information.<br /><b>-Inventory control –</b> Provides management with a means to manage the inventory of raw goods kept on-hand. With this feature, managers can predict the current need for products based on historical trends, minimizing overall costs which can lead to a substantial cost savings over time through waste management.<br /><b>-Menu item management –</b> Provides managers with the ability to manage items on the menu, to include the ability to create new menu items based on available ingredients, update existing menu items, and adjust prices.<br /><b>-Reporting –</b> Provides the ability to generate a variety of reports to include reports that span daily, weekly, and monthly intervals. These reports include sales, cost of goods sold, cost of waste, and cost of labor.<br /><b>-Scheduling –</b> Provides the ability to manage schedules on a weekly basis, to include support for employee schedule preferences, notes, schedule templates, copying schedules, recurring schedules, filtering by roles, overlap detection, and printing. The scheduling module was designed to simplify the task of managing employees on a weekly basis.<br /><b>-Time and Attendance –</b> The time and attendance module provides the ability to manage employee time sheets, enabling managers to make adjustments to punch records as needed. Any adjustments made to punches are annotated and retained for auditing purposes. Punch record data from the time and attendance module is used in cost of labor calculations.<br /><img src=\"/projects/OpenRPOSBackOffice/b63e116d-594d-47de-b9f7-5f381d85b013\" alt=\"OpenRPOSBackOffice.jpg\" title=\"OpenRPOSBackOffice.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Point of Sale,Restaurant POS,",
  "LastEdited": "2015-03-08T18:26:14.673-07:00"
}