{
  "ProjectName": "PAC4SL",
  "Title": "Presentation Abstraction Control for Silverlight - PAC4SL",
  "Description": "PAC4SL is a delivery framework used for developing Silverlight applications that uses the Presentation Abstraction Control delivery pattern.  \r\nThis delivery pattern is centered on team development with Silverlight. \r\nThe focus of the pattern is spreading out of application logic into focused delivery tiers. \r\n\r\nThe framework was developed in C# on the 4.0 framework and Silverlight 4.0\r\nThe framework is designed to be used with C# and Silverlight 4.0 or higher.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />PAC4SL is a delivery framework used for developing Silverlight applications that uses the Presentation Abstraction Control delivery pattern.  <br />This delivery pattern is centered on team development with Silverlight. <br />The focus of the pattern is spreading out of application logic into focused delivery tiers. <br /><br />The framework was developed in C&#35; on the 4.0 framework and Silverlight 4.0<br />The framework is designed to be used with C&#35; and Silverlight 4.0 or higher.<br />\n<h2>Current Project Status</h2>\rThe updated CodePlex version is 0.75 Working release<br /><br />In this release we are focusing on getting the initial framework released and into your hands to start previewing. This version is functionally complete, but does not have the source documentation loaded into CodePlex yet. With this limitation in mind, we have added a small primer to get you loaded into a project.<br />See the <b>documentation</b> section for more details.<br /><br />\n<h2>What is coming in the next release</h2>\rWith the initial focus being to get the bits up for review, the documentation is still in review. The team is currently working on getting the documentation into something usable for everyone. Here is what is coming in the next build around documentation and guidance.<br />\n<ul><li>Architecture Guide - Focus is on the architecture of the pattern, its tenets and why we created the framework. </li>\n<li>Pattern Walkthrough Guide - Step by step walkthrough of each area of the pattern, providing you with a guided tour. </li>\n<li>Team Delivery Guide - Lessons learned guide of how we use the pattern to deliver Silverlight applications, and recommended approaches for running your own team.</li></ul>\n<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "silverlight 4,PAC,PAC4SL,Team Development,",
  "LastEdited": "2011-06-12T20:11:52.693-07:00"
}