{
  "ProjectName": "phonesm",
  "Title": "Windows Phone Streaming Media",
  "Description": "HTTP Live Streaming (HLS) and MPEG-2 Transport Stream support for Windows Phone 7, Windows Phone 8,  Silverlight, and Windows 8.1/Windows Phone 8.1.",
  "MovedLink": "https://github.com/henricj/phonesm",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rHTTP Live Streaming &#40;HLS&#41; and MPEG-2 Transport Stream support for Windows Phone 7, Windows Phone 8,  Silverlight, and Windows 8.1&#47;Windows Phone 8.1.<br /><br />A MediaStreamSource has been implemented that supports HTTP Live Streaming (HLS).  It supports playing MPEG-2 transport streams (.ts segments) containing H.264 video and MP3 or AAC audio as well as MP3 streams (.mp3 segments) and AAC streams (.aac segments) on Windows Phone 7, Windows Phone 8, Silverlight, and Windows 8.1/Windows Phone 8.1. Both live and prerecorded programs can be played, but seek only works for prerecorded programs.  Playback of &quot;AES-128&quot; mode encrypted streams is supported.<br /><br />Raw MPEG-2 transport streams, MP3 streams, and AAC streams can be played.  Note that stream types already supported by the underlying platform should probably be left to the platform (e.g., MP3).<br /><br />There is also limited support for PLS playlists.  Only the first entry is played, which is sufficient to play many internet radio stations.<br /><br />In addition to the formats supported on the other platforms, Windows 8.1 also supports transport streams containing MPEG-2 video and/or AC-3 audio and .ac3 streams as long as the operating system has support for those media types.<br /><br />There are sample application for all but Silverlight that use the Player Framework (<a href=\"http://playerframework.codeplex.com/\">http://playerframework.codeplex.com/</a>). Both WP7 and WP8 have background audio player sample applications.  All of the platforms have sample code that initializes and plays media in a MediaElement.<br /><br />Visual Studio 2012 Professional or better (Express does not support Portable Class Libraries) and the Windows Phone 8 SDK is required.  Visual Studio 2013 Community or better is required for Windows 8.1 and Windows Phone 8.1.<br /><br />See the <a href=\"https://phonesm.codeplex.com/documentation?referringTitle=Home\">Documentation</a> for more information.<br />\n<h2>Limitations</h2>\r\n<ul><li>The Player Framework plugin is fleshed out enough to start a stream, pause it, and seek.  Dealing with many practical application concerns like cleanly shutting down playback, dealing with navigation, and tombstoning needs to be implemented.  The HlsView application handles some of these issues, but does so rather inelegantly (i.e., everything is in MainPage.xaml.cs). </li>\n<li>There is no support for changing the bitrate during playback. Neither manual control nor automatic bitrate selection is available.</li>\n<li>Error reporting is primitive and consists mainly of Debug.WriteLine() calls.  The HlsView apps report exceptions that end playback, but the SamplePlayer apps do not.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2015-05-28T18:06:43.547-07:00"
}