{
  "ProjectName": "PicasaLight",
  "Title": "PicasaLight",
  "Description": "PicasaLight is a Silverlight 2 project that gets and displays albums and photos from Picasa Webalbums. It is written in VB.NET and XAML.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><table><tr><th> <a href=\"http://www.codeplex.com/PicasaLight/SourceControl/ListDownloadableCommits.aspx\">The source code of version 1.2 is now available</a> </th></tr></table>\n<h2>Project Description</h2>\rPicasaLight is a Silverlight 2 project that gets and displays albums and photos from Picasa Webalbums. It is written in VB.NET and XAML.<br />\n<h2>How to get started</h2>\rThe source code, an ASP.NET proxy and a test page are available under the &quot;Source Code&quot; tab. Also, don&#39;t forget to take a look at the license (the <b>Ms-RL license</b> implies some restrictions!).<br />There is a running <b>demo</b> available on <a href=\"http://www.wouterdevinck.net/photos\">http://www.wouterdevinck.net/photos</a>.<br />\n<h2>The author</h2>\rThis application is written by <b>Wouter Devinck</b>, a Belgian Microsoft Student Partner. You can read more about him on his website and blog: <a href=\"http://www.wouterdevinck.net/blog\">http://www.wouterdevinck.net/blog</a><br />\n<h2>Architecture</h2>\rSilverlight can make cross-domain calls. That means that if your Silverlight application is on www.example.com and the webservice you want to call is on another domain (let’s say www.myperfectapi.org) you can use that service from Silverlight. However, the external server needs to allow your domain to use its service (for example by allowing any domain to use it). Silverlight has its own XML-based format to do that, but it also supports the older crossdomain.xml file that Adobe Flash uses. There’s only one limitation: Silverlight will only go looking for this file in the root of the external server. Unlike Flash, you cannot point Silverlight at a specific file in a specific directory.<br /><br />The <a href=\"http://code.google.com/apis/picasaweb/overview.html\">Picasa Web Albums Data API</a> has a crossdomain.xml file: <a href=\"http://photos.googleapis.com/data/crossdomain.xml\">http://photos.googleapis.com/data/crossdomain.xml</a> But, as you can see in the link, that file is not in the root. Google has even formally refused to put a cross-domain policy file in the root!<br /><br />The only workaround for this problem is to build a proxy. That proxy needs to be a page that takes a few parameters, calls the Picasa API and then returns the XML that the API generates. We can then use the power of LINQ to XML within Silverlight to get all the information we need out of that XML. The proxy can be written in virtually any server side language. I have written one in ASP.Net, but I’m looking for someone who wants to write one in PHP. The benefit of ASP.Net is of course that you can use a .Net language (C# or VB), just like in Silverlight. You don’t need to learn another language. The benefit of PHP is that you can find free hosting for it (just make sure to check the TOS ;-)).<br /><br />This diagram may help making it clear:<br /><br /><img src=\"/projects/PicasaLight/6c36289e-7342-44cc-b3a6-4c8d5c3018d4\" alt=\"architecture.png\" title=\"architecture.png\" /><br />\n<h2>Changelog</h2>\r<ul><li>1.0 (27 nov 2008)\n<ul><li>Initial release</li></ul></li>\n<li>1.1 (28 nov 2008)\n<ul><li>Added next and previous buttons</li>\n<li>Added spinning thing when loading an enlarged photo</li></ul></li>\n<li>1.1.1 (28 nov 2008)\n<ul><li>Added copyright info and link to the project page</li></ul></li>\n<li>1.2 (2 dec 2008)\n<ul><li>Proxy on fixed port (50321) to enable local testing. You can now download the project, open it and run it without having to set up a proxy manually.</li>\n<li>Spinning thing when loading enlarged photos replaced with spinning Picasa logo</li>\n<li>The Silverlight and Picasa logos are now embedded in the XAP package</li>\n<li>Added: animation while downloading the thumbnails</li>\n<li>Redesigned (using templates) the close, next and previous buttons</li></ul></li></ul>\n\n<h2>Screenshot </h2>\r<img src=\"/projects/PicasaLight/a3545d6a-9e8f-422f-a67b-111a30a0c49b\" alt=\"screenshotv1.1.1.png\" title=\"screenshotv1.1.1.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Picasa,Silverlight,Silverlight 2.0,Silverlight 2,Silverlight Toolkit,Picasa Web SDK,REST,Photo Gallery,ASP.NET,ASP.NET 2.0,PhotoAlbum,",
  "LastEdited": "2009-01-29T07:47:00.123-08:00"
}