{
  "ProjectName": "pks",
  "Title": "Podcasting Kit for Sharepoint",
  "Description": "!!! What is Podcasting Kit for SharePoint?\nPodcasting Kit for SharePoint (PKS) is an accelerator for social media, using podcasting and social networks to deliver the next generation knowledge management solution to Microsoft customers. Built on top of Office SharePoint Server 2007, PKS delivers an integrated experience with a wide variety of devices including PC, Zune, Windows Mobile phones and other podcast capable devices.\nPKS is the productization by Microsoft EPG (Enterprise Partner Group), the Microsoft Office Sharepoint Server and Zune teams of the Microsoft internal solution “Academy Mobile” deployed internally by EPG to serve the Microsoft sales and marketing field. \n \nHere are some key data points to include:\n* Customize your own PKS UI design \n* Listen and watch audio/video podcasts with Microsoft Silverlight anytime, anywhere on your PC or mobile device (Zune, PocketPC, or SmartPhone)\n* Share content by producing your own audio/video podcasts and publish them on PKS on your own\n* Connect and engage with podcasters through Microsoft Office, Instant Communicator, five star rating system, and comments\n* Get automatic podcast updates by subscribing to RSS feeds fully compatible with Zune and other podcasting mobile devices\n** Simple RSS feed based on a defined podcast series (ex: all podcasts for a curriculum)\n** Simple RSS feed based on a person (ex: all podcasts from an instructor)\n** Dynamic RSS feed based on search results (ex: all podcast by keywords)\n* Retrieve instant ROI and metrics with the ability to track the number of podcasts downloaded and/or viewed, instant feedback via rating system and comments, and subscribers via the RSS feed.\n* The solution will be distributed and delivered free of charge here on CodePlex.\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h3>There are known issues preventing the upgrade of sites to SharePoint 2010 Beta where the Podcasting Kit for SharePoint (PKS) has been installed.  We are working on a solution for customers who want an Enterprise Podcasting Site on SharePoint 2010.  In the meantime our recommendation is to not attempt to upgrade sites to SharePoint 2010 Beta where the PKS has been installed, as the upgrade will fail.</h3>\r<hr />\n<h3><b>Download the PKS August 2009 Beta Release:</b> </h3>\rDownload <b><a href=\"https://pks.codeplex.com/releases/view/32327\">PKS August 2009 Beta</a></b><br />Discuss <b><a href=\"https://pks.codeplex.com/discussions/67752\">PKS August 2009 Beta Released   </a></b><br />\n<h3><b>Have your PKS Deployment Showcased</b></h3>\r<a href=\"https://pks.codeplex.com/discussions/64051\">Tell us about your PKS deployment</a><br />\n<h3>What Can You Do With Podcasting Kit for SharePoint (PKS)?:</h3>\r<ul><li>Listen and watch audio/video podcasts, anywhere on your PC or mobile device (Zune, SmartPhone, or any podcasting device)</li>\n<li>Share content by producing your own audio/video podcasts and publish them on PKS on your own.</li>\n<li>Connect and engage with podcasters via your integrated instant messaging program </li>\n<li>Find the most relevant content using the five star rating system, tag cloud, search engine and provide your feedback via comments.</li>\n<li>Get automatic podcast updates by subscribing to RSS feeds fully compatible with Zune and other podcasting devices\n<ul><li>Simple RSS feed based on a defined podcast series</li>\n<li>Simple RSS feed based on a person</li>\n<li>Dynamic RSS feed based on search results (will be implemented later in 2009)</li></ul></li>\n<li>Play podcasts in real-time using Microsoft&#174; Silverlight™ and progressive playback</li>\n<li>Retrieve instant ROI and metrics with the ability to track the number of podcasts downloaded and/or viewed, instant feedback via rating system and comments, and subscribers via the RSS feed</li>\n<li>Access the richness of SharePoint to extend the solution: workflows, community sub-sites, access rights, editorial and more</li>\n<li>Customize your own PKS User Experience</li></ul>\n\n<h3>PKS Demo Podcast</h3>\r\n<a href=\"http://silverlight.services.live.com/invoke/103520/PKSOverviewDemo/iframe.html\"><img style=\"border:none;\" src=\"http://5ha64a.blu.livefilestore.com/y1pNGQVCZybPa6K_9jhG6Qd7PwoWMOopsR8_tR3Z1Sp_zxmJnX4nGojQHaeY9hW4b_S3b9tasu0e6nOBpOaZOvxHs20sf2P-zlo/thumbnail.JPG\" /></a><br />\n<h3>Now that you know what it does, why would you use it?</h3>\rIf you or your organizations are interested in podcasting, have SharePoint Server 2007 deployed and about to develop your own podcasting solution then look no further. PKS will save you time, reduce your risk of developing a solution ground-up, and of course will save you money. Moreover, you will find on codeplex a vibrant community of people, organizations and partners who are available to help you, and share with you their own experiences. We strongly recommend that you work with an integration partner for the deployment and maintenance of your own PKS environment. We have listed several partners that we know, but you could just ask your local partner or IT departement to help you out.<br />PKS is not a traditional Microsoft Product in a sense that it is distributed with its source code, using the Public License license and free of charge (if you already own SharePoint Server 2007). It is not supported by Microsoft, and we recommend that you ask your integration partner for such a support. Since the PKS&#39;s code is distributed any partner who understands development for SharePoint 2007 will be able to deliver this support for you.<br /><br /><a href=\"http://b4fmiw.blu.livefilestore.com/y1p_-AEebQT5DEuFCU2V1sDC4vsePyeDGpLxNIyVFe8bnSXhfrgamEdu4Uvf3jmdetfhJ9gkJl3HMAdKAE6EoOlLNkglgWBkQc0/PKS_Overview.pptx?download\">PKS Detailed Overview Slide Deck</a><br /><a href=\"http://jdxlea.bay.livefilestore.com/y1pT6LTBllikkekdfUXnwdQC7Aj2CPsmmXM9HtcwKegeL2Z0ScSC-vPwEP0bsQkqQeyjsL9woRRkpInSTRMGB9uelNtP8GheS3B/PKS_Tech_Preview-_Silverlight_Player.wmv?download\">Silverlight 2.0 Playback Demonstration</a> (1 minute podcast)<br /><a href=\"http://wfangw.bay.livefilestore.com/y1pT6LTBllikkc9vJqblTp6Cxwgr6B6eQOMN_iohvLvwdceDdtI6wLZHwC3PN0rQBd6mpjpna7Bf4JZA3sQg3fSw5KUT2qW0RN1/Silverlight%202.0%20Upload.wmv?download\">Silverlight 2.0 Reliable Upload Demonstration</a> (2 minutes podcast)<br /><a href=\"http://jdxlea.bay.livefilestore.com/y1pT6LTBllikkdqeNI9NmTbnE2ETINWgDKPqN1IXqcomqs3kN6l8A02XyPQKzZzSEw-6EVn9hrHlq0Bzb5zMqrHcM-Tbp6Chzws/PKS_Tech_Preview-_Filtering.wmv?download\">Filtering in PKS</a> (39 second podcast)<br /><a href=\"http://jdxlea.bay.livefilestore.com/y1pT6LTBllikkdVNtikpTid0L28tcPddglfh9D58_oJLjxdk-Q-lKXFXM4JpD2hSxqWt8tbL1rtEzNHuBQMyrYU0FqxmgnioAdG/PKS_Tech_Preview_-_Change_values_in_the_Taxonomy.wmv?download\">Change Values in Taxonomy</a> (2 minute podcast)<br /><a href=\"http://jdxlea.bay.livefilestore.com/y1pT6LTBllikkfuD8y2rX-1Wl06jCZkpWI3sPYPbpaByvDR8u0RxXW-h83lrYnQDvcVpqvfutgqjRqlQY9yzGp_Sqy1aKvDWa4p/PKS_Tech_Preview_-_Add_you_own_categories.wmv?download\">Add Your Own Categories</a> (3:25 minute podcast)<br /><br /><img src=\"http://5ha64a.blu.livefilestore.com/y1p_QUU6MWSXmspcRlLxD1vqSNdDYl0-hQMivocN-2eX-2pvkTXuaupngGrXLVwK3M-yoa3qaLEt_17tXhmC1zhhlhW2ediVkks/pks-home.JPG\" /><br />\n<h3><b>PKS Roadmap:</b> </h3>\r<img src=\"http://6xq1xw.blu.livefilestore.com/y1pY97LEvKjihcWyAOdZy3u_S7pJAocn59snLvvD8dE1p38my8C8qm9hpTJVguykpYWAT-2NORgiHrxXaPT4mbytQmGNucLpGIe/pks_roadmap_png24.jpg\" /><br />Important reminder: it is recommended to only deploy stable release to production.<br />This roadmap is subject to change. The feature / capability list for each release will be communicated several weeks before the release is shipped.<br />The PKS will continue to be developed and maintained monthly way beyond the March 2009 beta release.<br />\n<h3><a href=\"http://www.codeplex.com/pks/Wiki/View.aspx?title=PartnerNetwork\">PKS Partner Network</a></h3>\r\nPKS Partners are Microsoft Groups, customers, and/or partners, formally recognized by the PKS team, who have committed to integrating their existing product into PKS or building a new enhancement for PKS from the ground up.  We want to hear the most compelling features that you have seen in other Web 2.0 tools that you would like to see in PKS.  Our goal is to build a community that will help realize the promise of new technology offerings, business models and social structures that enables efficient integration among people, content and data.<br /><br />We&#39;ve started a <a href=\"https://www.codeplex.com/Thread/View.aspx?ProjectName=pks&amp;ThreadId=28918\">list of feature ideas</a> that potential partners should review before joining the PKS Partner Network.  This list includes features that improve the PKS mobile experience, rating and commenting capabilities, filtering options, tagging methods, and more.\n<h4><b>Why Join the PKS Partner Network?</b></h4>\rPodcasting &amp; social networking are exploding technologies in the digital world. PKS is slated to be the premiere enterprise podcasting experience available to the public. Joining the PKS Partner Network allows the opportunity to contribute to this experience and promote greater exposure to your company and/or product.<br /><br />When you decide to work with PKS, your enhancement has the potential to reach thousands of users within Microsoft, its customers, partners, and the general public. Within 7 months of launch, the predecessor of PKS, Academy Mobile, gained over 6000 unique users and over 50,000 downloads just from the internal Microsoft audience alone. These numbers are already increasing exponentially as PKS is released publicly creating a mindshare around enterprise podcasting &amp; social networking, PKS and our on-boarded Child Projects. We believe this exposure creates a strong climate for marketing and branding of your company and products.  <br /><br />It is entirely possible for anyone to download our source code and integrate their own feature(s) into a version of PKS without formally engaging with us.  However, PKS Partners receive the following benefits:  \n<ul><li>Available funding to help the most promising projects. Check out our <a href=\"https://pks.codeplex.com/discussions/28918\">PKS Feature Ideas List</a> to find a full list of some of the things we would love to see built.</li>\n<li>Be a part of the PKS capability roadmap shared with the world.</li>\n<li>High industry exposure via joint marketing efforts such as, press releases, events, case studies, blogs, marketing campaigns and more to help you sell your enhancements and products.</li>\n<li>Work with other PKS partners that can help you implement the kit in your environment and provide additional support via CodePlex.</li>\n<li>First to get PKS implementation opportunities if you become a PKS Partner and join the PKS Partner Network.</li>\n<li>Your CodePlex project and a link to your organization is formally showcased on our PKS CodePlex project homepage.</li>\n<li>You will also have the opportunity to have two one hour consultation meetings with our chief architect and your primary developer(s).  </li></ul>\n<h4><a href=\"http://www.codeplex.com/pks/Wiki/View.aspx?title=PartnerNetwork\">Learn More About the PKS Partner Network and How To Join</a></h4>\r<h4><b>Current PKS Partners:</b> (On-boarded projects)</h4>\r<ul><li><a href=\"http://www.microsoft.com/services\">Microsoft Enterprise Services</a> are the consulting and support services of the Microsoft Corporation. Microsoft Services, has over 4500 consultants (MCS) and 3,800 support engineers (Premier) in 82 countries covering 44 languages.  MCS offers the deepest expertise available on the Microsoft technology stack with direct connections to the Microsoft product teams.  For more information about PKS services and support, contact <a href=\"mailto:mrandys@microsoft.com\">Randy Simmons</a>.</li>\n<li><a href=\"http://www.3sharp.com/\">3Sharp</a> - As the primary developers of the Podcasting Kit for SharePoint, 3Sharp has very deep insight into how to get to value quickly, both from the kit’s extensive out-of-the-box capabilities and from customizations and additions. You can see 3Sharp’s public-facing deployment of PKS, which allows for both anonymous and authenticated access, at <a href=\"http://GetSharp.3Sharp.com/\">GetSharp</a>.  For more information about how 3Sharp can help you with your PKS projects, please email us at <a href=\"mailto:GetSharp@3Sharp.com\">GetSharp@3Sharp.com</a>, or call Jeff Bean, 3Sharp PKS Product Manager, at 425-882-1032 x1012. </li>\n<li><a href=\"http://www.accenture.com/\">Accenture</a> is a global management consulting, technology services and outsourcing company. We participated in the PKS pilot program, along with several of our clients. Accenture is leveraging and extending SharePoint and the PKS to offer Web 2.0 based learning and collaboration solutions to its clients. In addition to technology implementation, we help our clients drive measurable business value by addressing the strategy, people and process components that are necessary to achieve high performance. For more info, contact <a href=\"mailto:thomas.w.hoglund@accenture.com\">Thomas Hoglund</a>. </li>\n<li><a href=\"http://www.nintex.com/\">Nintex</a> - is a leading innovator of exciting software products that extend Microsoft technology. We focus on building software which bridges the gap between what can be delivered by Microsoft today and common functionality requested by customers. This PKS partnership has enabled Nintex to leverage a platform that will add increasing value to our customers and partners.  Nintex&#39;s <a href=\"http://www.codeplex.com/pks/Wiki/View.aspx?title=Nintex\">current enhancement</a> is a podcasting feature that allows everyone to record a podcast directly from your browser! </li>\n<li><a href=\"http://www.elearningforce.us\">ElearningForce</a> is a eLearning Software development company commercializing the Learning Management System (LMS) for SharePoint <a href=\"http://www.sharepointlms.com/\">SharePointLMS</a>. As a PKS Partner ELearningForce enables customers to utilize the power of PKS inside SharePointLMS Courses and deliver Podcasts to students, greatly enhancing their learning experience.</li>\n<li><a href=\"http://www.socialmediaenterprise.com\">Social Media Enterprise (SME)</a>provides best of breed consulting for the full life cycle implementation of Microsoft&#39;s Podcasting Kit for SharePoint (PKS).  Our services were first collectively brought together by Microsoft to serve their own podcasting needs for their award winning implementation of AcademyMobile (processor to PKS).  Providing both partner and customer end to end implementation support, SME offers platform design and development, business development, marketing/evangelism, podcast production design, filming/editing and operations/support.  For more information, contact <a href=\"mailto:pamela@pyramideproductions.com\">Pamela Chiriboga at SME</a>. </li>\n<li><a href=\"http://www.sysgain.com\">Sysgain</a> is passionate about bringing the value of the Podcasting Kit for SharePoint to mobile users. In Spring 2009 Sysgain will release the PKS Mobile Services add-on through CodePlex. PKS Mobile Services is the foundation on which an array of mobile client apps, across all platforms, can be built to enable a rich mobile PKS experience. Mobile capabilities will include: search, streaming audio/video, review/rating submissions, and the ability to connect to multiple PKS sources securely. To learn more about PKS Mobile Services and how it can transform knowledge sharing across your mobile workforce, contact <a href=\"mailto:mbrophy@sysgain.com\">Michael Brophy, VP Product Strategy</a> or 425-629-6272 x1.</li></ul>\nHere are some of the things we&#39;d love to see built, you&#39;ll find the full list in the <a href=\"https://www.codeplex.com/Thread/View.aspx?ProjectName=pks&amp;ThreadId=28918\">discussion boards</a>.:\n<ul><li><a href=\"https://www.codeplex.com/Thread/View.aspx?ProjectName=pks&amp;ThreadId=28898\">Facebook like features: add to co-workers, the wall…</a></li>\n<li><a href=\"https://www.codeplex.com/Thread/View.aspx?ProjectName=pks&amp;ThreadId=28902\">Netflix-like homepage (rate and comment your latest downloaded podcasts)</a></li>\n<li><a href=\"https://www.codeplex.com/Thread/View.aspx?ProjectName=pks&amp;ThreadId=28912\">Tell a story: assemble podcasts together in a wiki type environment</a></li>\n<li><a href=\"https://www.codeplex.com/Thread/View.aspx?ProjectName=pks&amp;ThreadId=28904\">“Content being watched right now” banner</a></li>\n<li><a href=\"https://www.codeplex.com/Thread/View.aspx?ProjectName=pks&amp;ThreadId=28903\">Offline rating and commenting: rate and comment just by replying to a weekly digest email</a></li>\n<li><a href=\"https://www.codeplex.com/Thread/View.aspx?ProjectName=pks&amp;ThreadId=28915\">Filtering v2: extended filtering solution, similar to what newegg.com is doing...</a></li>\n<li><a href=\"https://www.codeplex.com/Thread/View.aspx?ProjectName=pks&amp;ThreadId=28919\">Use existing meta tags as suggestions during upload process</a></li></ul>\n<h3>PKS FAQs:</h3>\r<a href=\"http://www.codeplex.com/pks/Wiki/View.aspx?title=FAQ\">Read</a> the PKS Frequently Asked Questions.\n<h3>History of PKS:</h3>\r<a href=\"http://www.codeplex.com/pks/Wiki/View.aspx?title=History\">Read</a> about how PKS was started.</div><div class=\"ClearBoth\"></div>",
  "TagList": "RSS,Sharepoint,podcasting,eLearning,podcast ,SharePoint 2007,Wouter,Zune,pks,cbq,MyList.SilverLight,PKS at Work,pkgod,",
  "LastEdited": "2009-11-16T12:39:39.21-08:00"
}