{
  "ProjectName": "policyserver",
  "Title": "Silverlight and Flash Policy File Server",
  "Description": "Scalable high performance policy file server for both Silverlight and Adobe Flash. To serve a cross domain policy file on any chosen port, e.g 843, 943 etc.\n\nThis project is written in C# .NET using the Reactor pattern and can be configured depending on the size of your project",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Home Page</b><br /><a href=\"http://policyserver.turnitin.co.uk\">http://policyserver.turnitin.co.uk</a><br /><br /><b>Project Description</b><br />Scalable high performance policy file server for both Silverlight and Adobe Flash. To serve a cross domain policy file on any chosen port, e.g 843, 943 etc.<br /><br />This project is written in C&#35; .NET using the Reactor pattern and can be configured depending on the size of your project<br /><br /><b>Notes</b><br />I wrote this application ages ago for a Flash based video streaming and chat website. However it just so happens it also works with Silverlight if you configure it with the correct policy file format. Any way I thought I&#39;d release it, be shame to see it go to waste.<br /><br />Because I&#39;ve done nothing to document this tool just quickly a comment about each of the arguments in the sample config file below:<br /><br /><pre>\n&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;\n&lt;configuration&gt;\n  &lt;appSettings&gt;\n    &lt;add key=&quot;listeningPorts&quot; value=&quot;943&quot; /&gt;\n    &lt;add key=&quot;bindTo&quot; value=&quot;0.0.0.0&quot; /&gt;\n    &lt;add key=&quot;threadPoolCount&quot; value=&quot;10&quot; /&gt;\n    &lt;add key=&quot;policyFile&quot; value=&quot;policyfile.xml&quot; /&gt;\n  &lt;/appSettings&gt;\n&lt;/configuration&gt;\n</pre><br /><br /><u>listeningPorts</u> - Is a comma separated list of port numbers on which this instance should listen. If you need to serve different files on different ports you should configure and launch separate instances of the policy server.<br /><u>bindTo</u> - If you have multiple IP addresses on the host machine, use this property to specify the IP to bind to. Otherwise 0.0.0.0 to bind to all. There is no current support for multiple bindings.<br /><u>threadPoolCount</u> - The number of threads created to handle requests. I&#39;ve found that this should be the same as the number of cores of your machine if you dedicate a server. You should do your own experimentation.<br /><u>policyFile</u> - File path of the policy file to serve. Policy server makes no attempt to validate or understand the content of this file, that is your responsibility.<br /><br /><br /><b>Words from me (the author)</b><br />I know that there are little resources available for telling you how to serve these mystery policy files, it seems both Microsoft - <i>although slightly better than</i> - and Adobe neglected to provide this information. So here&#39;s one I made earlier. I ran it using Fire Daemon so that I could serve multiple files on different ports bound to different IP addresses. Any way thanks for taking a look. Please feel free to contact me if you have any questions, find any bugs or would like to contribute.<br /><br />Thanks all and good luck,<br /><br />Liam.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-07-27T13:03:44.293-07:00"
}