{
  "ProjectName": "pomodoro",
  "Title": "Pomodoro",
  "Description": "Pomodoro timer for Windows Phone 7.1 in Silverlight 4 to help you get the most out of time management. Download the full C# source code and modify it to fit your needs.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Pomodoro timer for Windows Phone 7.1 in Silverlight 4 to help you get the most out of time management. Download the full C&#35; source code and modify it to fit your needs.<br /><br />Francesco Cirillo created the Pomodoro Technique&#174; in the 1980s. It is now practiced by professional teams and individuals around the world. Visit <a href=\"http://www.pomodorotechnique.com/\">http://www.pomodorotechnique.com/</a>, read the book.<br /><br /><img src=\"/projects/pomodoro/1222bf73-8e72-43e1-be2c-635e8a119e98\" alt=\"CodePlex.png\" title=\"CodePlex.png\" /><br /><br /><b>Features:</b><br />\n<ul><li>Draggable egg timer wheel, vibrates after rewind.</li>\n<li>Sound effects taken from a real pomodoro.</li>\n<li>Allows background music to play unhindered.</li>\n<li>Optionally keeps running under locked screen.</li>\n<li>View in Marketplace, <a href=\"http://www.windowsphone.com/marketplace\">Pomodoro</a> (n/a, pending certification)</li></ul>\n<br /><b>Description:</b><br /><br />I&#39;m a big fan of the <a href=\"http://www.pomodorotechnique.com/\">Pomodoro Technique</a>. Like other populair productivity practises such as <a href=\"http://en.wikipedia.org/wiki/Getting_Things_Done\">Getting Things Done</a> and <a href=\"http://en.wikipedia.org/wiki/Kanban_(development)\">Kanban</a> it offers the most simplistic tools to get started, review accomplishments and keep going. All you need is a pen, paper and an egg timer. You have to love that approach.<br /><br />Sure, it&#39;s not the tools that make things happen; tools simply help focus on the task at hand. Any agile approach that sets out a road map and prioritises tasks to do -right now- works. Iterative progress, step by step. The Pomodoro Technique promotes keeping track of time while jotting down the work accomplished and distractions from what we need to do. As with all good productivity practises the crux is in charting continuous improvement. In time management the main effect is in awareness of where you wasted time. It&#39;s all about finding out what works best for you to get the job done fast.<br /><br />POM, the Pomodoro timer, is nothing but a simple countdown timer. The Windows Phone app has a draggable scroll wheel like the one on your physical egg timer. Makes an awful sound, just like your real egg timer. Download the source, I&#39;m sure you can improve on those unpleasant wav samples for a start. :-)<br />\n<ul><li>Preview the app in Windows Marketplace.</li>\n<li>Download the release package or checkout the repository.</li>\n<li>Make sure you have the Windows Phone 7.x SDKs installed.</li>\n<li>Fire up the emulator, connect a Windows Phone and have fun.</li></ul>\nInspired by <a href=\"http://www.tomighty.org/\">Tomighty</a> and <a href=\"http://www.globalnerdy.com/2010/10/14/windows-phone-app-challenge-1-the-pomodoro-timer/\">App Challenge</a>, this project was written to get some hands on experience in publishing a Silverlight app for the new marketplace. Had some troubled experiences publishing Windows Mobile apps in the old market. (<i>&quot;Hey you, marketing girl @DevDays2009. Still owe me 70 euro?&quot;</i>) Noticeably things improved a lot, it&#39;s almost more fun than Android Market. Albeit some fields should be prefilled from XAP-manifest to make it really easy, the certification is dead-simple now. (Even signing is done for you.) Try it out with a DreamSpark voucher or subscribe to a paid membership.<br /><br />Below, a photo of the original egg timer. That was a Christmas gift from my employer, somewhat six years ago. It broke last summer, so with the digital replacement in line I guess this one is for the bin. ;-)<br /><br />Patrick de Kleijn<br /><br /><br /><img src=\"/projects/pomodoro/015fb8f0-d75e-4248-81f7-aaef6e5d57f7\" alt=\"InhollandEggTimer.png\" title=\"InhollandEggTimer.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-12-26T12:58:15.313-08:00"
}