{
  "ProjectName": "ProbabilityNot",
  "Title": "Probability Not",
  "Description": "How often does an expected background fluctuate up to some number of events? Silverlight 3 program that graphically calculates this (gaussian background expectation, poisson sampling for # of events).",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />How often does an expected background fluctuate up to some number of events&#63; Silverlight 3 program that graphically calculates this &#40;gaussian background expectation, poisson sampling for &#35; of events&#41;.<br /><br /><b>Getting A Running Version</b><br />You can find this application by pointing your web browser at <a href=\"http://d0.phys.washington.edu/~gwatts/prob/\">http://d0.phys.washington.edu/~gwatts/prob/</a>.<br /><br /><b>A Bit More Information</b><br /><br />I had this idea when I didn&#39;t really understand the <a href=\"http://cdms.berkeley.edu/\">CDMS</a> dark matter <a href=\"http://arxiv.org/abs/0912.3592v2\">search results</a>. They had expected 0.8 events +/- 0.3 (these results were released just before Christmas 2009). They claimed 23% probability of this fluctating up to 2 events. About 10 minutes with a calculatator will show you this is right, but I thought it might be nice to make a plot. And an interactive one (feature creep!). This was also one of my first attempts to use SliverLight as an aid in my science.<br /><br />Usage is pretty simple:<br /><img src=\"/projects/ProbabilityNot/61a15e5e-2e50-4211-8773-75147d9e1277\" alt=\"demo.png\" title=\"demo.png\" /><br /><br />You enter the # of background events, the width of the background (always taken to be a gaussian) first. Then you enter either the probability or the # of events (and <i>Probability Note</i> will calculate the other one). It will also update the plot to show the gaussian background and the resulting Poisson distribution, with a shaded portion to indicate where the probability you entered lies.<br /><br />More info can be found in the Documentation section.<br /><br />This was my second (and much simpler) attempt at using Silverlight for some very basic science. For the version 1.0 release, I had the following difficulties:\n<ol><li>I have the Probability and Number of events set up as items in the GUI. These are 100% correlated. So I had to have special logic that would prevent circular changes - modify the probability, which would modify the # of events, which would modify the probability, etc. In general, it would be very nice to have some framework that would allow one to write the calculations off in another thread, and not worry about GUI. The framework would do data flow analysis and properly hook everything up to the GUI.</li>\n<li>The <a href=\"http://www.codeplex.com/Silverlight\">Silverlight Toolkit</a> contains some fantastic graphing code. It is pretty trivial to make a good looking plot. However, performance is not that good (updating 100 bins line plot can take close to 1/2 a second), and there are some basic things that need fixing (like the ymax of an axis). I had to add a bunch of extra code in order to work around the performance problems.</li></ol></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-12-28T21:54:03.407-08:00"
}