{
  "ProjectName": "riagenicsynapse",
  "Title": "Synapse:Silverlight A Simple Silverlight Framework",
  "Description": "Synapse:Silverlight is a simplified framework for Silverlight. It's purpose is to help developers and designers produce basic LOB solutions that don't require pattern/framework studying as a pre-requisite.\n\nSimply put, its the fisher price of frameworks.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Summary</b><br />Synapse&#58;Silverlight is a simplified framework for Silverlight. It&#39;s purpose is to help developers and designers produce basic LOB solutions that don&#39;t require pattern&#47;framework studying as a pre-requisite.<br /><br />Simply put, its the fisher price of frameworks.<br />\n<h1>Introduction</h1>\rAs a former Product Manager and Evangelist for Silverlight, one of my biggest concerns in kick starting a Silverlight project is getting past the way in which we orchestrate how the files/folders are setup. It becomes an issue even more so for those of you out there who are just starting out in the Silverlight space and are keen to get focused and started on producing a quick application vs adopting a framework which requires it&#39;s own learning stream unto itself.<br /><br />Armed with this concern, I set about creating what I have called a &quot;Fisher Price&quot; framework for upcoming Silverlight developers and designers. <b>Synapse:Silverlight</b> is a simplified framework which I hope will keep developers/designers focused on producing the specific visuals and data bindings between server and client. The purpose of this framework is to also enable a more automated prescribed User Experience when making Line of Business solutions inside Silverlight. This framework will take care of how your screen orchestration will flow along with lazy-loading .xap package files to help breakup the file sizes attached to a large project within Silverlight. <br />\n<h2>Synapse:Silverlight main objectives are:</h2>\r\n<ul><li>Simplify the project creation process.</li>\n<li>Reduce XAP package files down to bare bones whilst automating the preloading/loading of XAP packages remotely (preloaders etc included)</li>\n<li>Reduce friction in switching between Screens and their respective sub-layout changes.</li>\n<li>Automate the Installation and Preloading experience whilst providing designers/developers are customizable workflow that breaks away from the dreaded Silverlight Rotating Balls.</li>\n<li>Reduce the addiction attached to DataGrids and Tree&#39;s by providing examples of how to approach large datasets in LOB solutions that are simplified and less &quot;screw this, <b>snap-in datagrid here</b> ..UI is done..&quot;</li>\n<li>Provide simplified approaches to MVVM for the entire Solution.</li>\n<li>Provide simplified skinning and styling workflow to reduce complexity placed on designers.</li>\n<li>Reduce the addiction to 3rd party controls. I will go a pepsi challenge with anyone world-wide on why the 3rd party controls are needed.</li>\n<li>Reduce Expression Blend propertygrid overkill by enabling developers/designers to have a more focused approach to how they tweak/nudge their visuals into place.</li></ul>\n\n<h2>More Information</h2>\rVisit my blog <a href=\"http://www.riagenic.com\">http://www.riagenic.com</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,silverlight 4.0,silverlight 4,Expression Blend,Framework,MVVM,skinning,skining,skins,Silverlight Controls,Silverlight Toolkit,",
  "LastEdited": "2010-04-26T06:48:06.323-07:00"
}