{
  "ProjectName": "riba",
  "Title": "RIBA - Rich Internet Business Application for Silverlight, RIA Services, MVVM",
  "Description": "RIBA is an sample LOB application with many features to show how to build distributed and secure Line of Business applications based on Silverlight 4, RIA Services and patterns like MVVM. A NHibernate sample with RIA Services is included.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nRIBA is an example LOB application with many features to show how to build distributed and secure Line of Business applications based on Silverlight 4.<br>\r\nAn important part of RIBA is it's own MVVM Framework library, which is designed to be easily usable for business applications built in Silverlight 4.<br>\r\n<br>\r\n<strong>Live Demo of Included MVVM Advanced Tutorial NHibernate Sample</strong><br>\r\n<a href=\"http://mvvm.granwehr.net\">Click here</a> to view the Silverlight application using NHibernate and SQlite.&nbsp;&nbsp;&nbsp;&nbsp;\r\n<span style=\"color:#ff0000\"><strong>NHibernate-Version&nbsp; NEW</strong></span></p>\r\n<p><strong>Live Demo of included multilingual RIBA Authentication Sample<br>\r\n</strong><a href=\"http://riba1.granwehr.net/step1/ribatestpage.html\">Click here</a> to view the Silverlight application.<br>\r\n<br>\r\n<strong>Documentation</strong><br>\r\nDocumentation can be found in the doc folders within the source.<br>\r\n<br>\r\n<strong>Key Features of MVVM module<br>\r\n</strong></p>\r\n<ul>\r\n<li>A ViewModelBase to inherit from that contains all that is needed </li><li>A fully templatable NavigationService-Control whith cusomizable animations </li><li>Automatic implementation of INotifyPropertyChanged </li><li>MessageBox-From-Viewmodel </li><li>ChildWindow-From-ViewModel </li><li>Out-of-the-box exchange of shared data and private data collections </li><li>Easy Inter-ViewModel-Messaging </li></ul>\r\n<p><br>\r\n<strong>Key Features of completed RIBA project</strong></p>\r\n<ul>\r\n<li>Fully MVVM thanks to usage of the MVVM framework </li><li>Distributed Line-Of-Business-Application </li><li>Example Implementation of different data-layers through RIA,&nbsp;NHibernate </li><li>POCO </li><li>Dynamic DLL-Loading </li><li>Multi-language support through ressources or T4-Code </li><li>Some more... </li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-11-10T01:43:22.02-08:00"
}