{
  "ProjectName": "richtextedit",
  "Title": "Silverlight rich text editor",
  "Description": "This is the first rich text editor for silverlight and supports various well known features. This is all font formatting silverlight does support, including SUB/SUP formatting, homogenous underlining of multi-font-selections, blockquotes, unordered lists, block alignment, insertion of custom framework elements, secure content serialization, find&replace with regular expressions, clipboard support for formatted text, integrated scroll viewer, custom design, macros and many more.\nIt ships with a preliminary documentation, an extensive demo and is still in beta state. I plan the first release candidate for silverlight beta 2.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><ul><li>I AM CURRENTLY SEARCHING FOR SOMEONE WHO WILL CONTINUE DEVELOPING THIS EDITOR, BECAUSE I DONT HAVE THE TIME TO ADD FURTHER IMPROVEMENTS!!!! IF YOU ARE INTERESTED, PLEASE CONTACT ME!</li></ul>\n*********************************************************************************************************************<br /><br /><b>Project Description</b><br />This is the first rich text editor for silverlight and supports various well known features. This is all font formatting silverlight does support, including SUB&#47;SUP formatting, homogenous underlining of multi-font-selections, blockquotes, unordered lists, block alignment, insertion of custom framework elements, secure content serialization, find&#38;replace with regular expressions, clipboard support for formatted text, integrated scroll viewer, custom design, macros and many more.<br />It ships with a preliminary documentation, an extensive demo and is still in beta state. I plan the first release candidate for silverlight beta 2.<br /><br />You will find a working online-demo at : <a href=\"http://michaelsync.net/2008/05/04/silverlight-rich-text-editor-demo\">http://michaelsync.net/2008/05/04/silverlight-rich-text-editor-demo</a><br /><br /><img src=\"/projects/richtextedit/116127c9-3921-46aa-9af5-ed631b08137f\" alt=\"Preview.jpg\" title=\"Preview.jpg\" /><br /><br />This is an incomplete feature list:<br />\n<ul><li>Copy/Paste formatted text between RichTextBoxes and copy/paste from/to clipboard of unformatted but macro-enabled text. This means in windows clipboard even things like emoticons will be kept. </li>\n<li>You may insert line breaks, unordered lists and blockquotes. </li>\n<li>You may use various keyboard selection features like End/Home/PageUp/PageDown/Left/Up/Right/Down, Ctrl+A/End/Home, Ctrl+Shift+End/Home/Left/Right, Shift+End/Home/PageUp/PageDown/Left/Up/Right/Down and so forth... </li>\n<li>Supports direct Unicode character input using Ctrl+[NumPad]. </li>\n<li>All silverlight font formatting is supported and even some more like SUP/SUB formatting. </li>\n<li>You may define macros and a proper object class that should replace matching text, like emoticons... </li>\n<li>In contrast to many other rich text editors, this one is fully real-time. That means no preview is required because the editor allows editing all things directly. </li>\n<li>If you only use macros and IRichTextObject to extend the control, you will automatically get support for secure content serialization of all control elements. Content serialization also supports to reload content and edit it again. </li>\n<li>Secure content serialization gets rid of any potential security leak when storing user typed formatted text on a server and presenting it to visitors, because it is fully verifiable. </li>\n<li>You may restrict font formatting to a well defined custom subset. This allows you to ensure that all user typed input matches your needs or website design. (this feature is currently not implemented, but only prototyped)</li>\n<li>Snapshots allow convenient access to formatted content and also Find&amp;Replace with regular expressions for example... </li></ul>\n<br />This is a compressed image of the Demo application, it looks much better in real-time ;-):<br /><br /><img src=\"/projects/richtextedit/6b4d373e-4da2-44ec-828d-54ead3f051a2\" alt=\"Demo_Compressed.jpg\" title=\"Demo_Compressed.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,RTE,Silverlight rich tex,editor,controls,wpf texteditor,silverlight rte,sontek-favorite,*,",
  "LastEdited": "2008-07-28T08:57:57.493-07:00"
}