{
  "ProjectName": "salusemediakit",
  "Title": "Saluse MediaKit for Silverlight",
  "Description": "A Silverlight library that includes a MP3 decoder to provide raw audio data for consumption.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Overview</h2>\rA Silverlight library that includes a MP3 decoder to provide raw audio data for consumption.<br /><br />In Silverlight 3, there isn&#39;t an out-of-the-box method of accessing the raw audio data that the MediaElement produces when playing back MP3.<br /><br />Saluse MediaKit for Silverlight, includes a custom MediaStreamSource (for use with the MediaElement) that decodes MP3 files and also returns the raw audio data for your use.<br />The Raw MP3 MediaStreamSource uses a custom SeekableStream that allows MP3 files loaded from any other stream type (HTTP response stream included) to be semi-seekable and works around the issues in using MediaStreamSource over HTTP.<br /><br />With MediaKit, you can also modify the audio data before it is consumed (by MediaElement, for example) so that you can apply effects (echo), corrections (pitch shift), functionality (pan) in real-time<br /><br />The sample demo included demonstrates the playing of MP3 files from your local machine or from a web address (<i>make certain that the website allows direct streaming of mp3 files</i>).<br />It showcases the use of raw audio data to create a peak meter(Fast Fourier Transforms), oscilloscope and other simple visualizations.<br />It also showcases the audio effects capabilities, such as Pan, Echo and a real-time Pitch Shifter.<br /><br />For latest news, please see the blog at <a href=\"http://prefix.teddywino.com\">http://prefix.teddywino.com</a><br />\n<h2>Demo</h2>\rA live demo can be seen at <a href=\"http://prefix.teddywino.com/post/SilverlightMediaKitLiveDemo.aspx\">http://prefix.teddywino.com/post/SilverlightMediaKitLiveDemo.aspx</a>\n<h2>Screenshots</h2>\r<img src=\"/projects/salusemediakit/5abfc74d-c5f5-475d-8fb4-03baf8c170e5\" alt=\"mediakit.jpg\" title=\"mediakit.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "silverlight,audio,mediastreamsource,fft,mp3 decoder,mp3,stream,effects,",
  "LastEdited": "2010-02-03T05:39:58.113-08:00"
}