{
  "ProjectName": "samsungremotewp7",
  "Title": "Samsung Remote WP7/Silverlight",
  "Description": "This is an unofficial app to allow you to control any modern Samsung TV's over WiFi with your Windows Phone.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1><strong>Note: this project is no longer being maintained on CodePlex. You can get the latest version on\r\n<a href=\"https://github.com/parnic/samsungremotewp7\">GitHub</a>.</strong></h1>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Project Description</strong><br>\r\nThis is an unofficial app to allow you to control any modern Samsung TV's over WiFi with your Windows Phone. As long as your phone is on the same network as your TV, you can do anything a TV remote can do and more! Change channels, adjust the volume, navigate\r\n around the Smart Hub, and even fill out certain text fields with your phone's keyboard (note: only available where the TV supports this feature; note that the built-in YouTube app, among others, doesn't support this even with the original remote). Use the\r\n same app to connect to as many Samsung TV's as you have in your house and control them all!<br>\r\n<br>\r\nHere are the TV's that this should work with:</p>\r\n<ul>\r\n<li>LED 6500 series or higher (model code starts with 'U') </li><li>LCD 650 series or higher (model code starts with 'L') </li><li>PDP 6500 series or higher (model code starts with 'P') </li></ul>\r\n<p><br>\r\nWhen in doubt, look for an option like &quot;network remote&quot; on the TV's menu. You may try toggling this off and back on if it doesn't work right away.<br>\r\n<br>\r\nNOTE: If the TV is currently in the &quot;Smart Hub&quot; and you've never connected the remote before, you may need to exit the hub first, approve the phone connection, and then launch back into the hub. Furthermore, this app cannot turn your TV on - the TV's wireless\r\n remote server is only running when it is powered on. These are both a limitation of the TV, not the app.<br>\r\n<br>\r\nThis app was not written by an employee of Samsung and is not an officially-licensed, -endorsed, or -approved Samsung product. All trademarks and copyrights are the property of their owners.<br>\r\n<br>\r\n<a href=\"http://windowsphone.com/s?appId=eee32829-f405-40b4-93d1-568bbda1664d\">View the app on the Windows Phone Marketplace.</a></p>\r\n<p>&nbsp;</p>\r\n<p><strong>Version history</strong></p>\r\n<p>v1.1:</p>\r\n<ul>\r\n<li>Fixed crash that sometimes happened when a tv search timed out. </li><li>Improved app performance. </li><li>Added 'about' page with a contact link, FAQ, and 'rate me' link. </li><li>Added in-app new version notification. </li></ul>\r\n<p>v1.2:</p>\r\n<ul>\r\n<li>Added 'misc' page with more options such as inputs, PiP, etc. </li><li>Added 3D mode button next to qwerty/source. </li><li>Added 'should vibrate on key press' setting. </li></ul>\r\n<p>v1.3:</p>\r\n<ul>\r\n<li>Added small ads on the TV list page only. Many people have offered to pay money for the app, but I figured this would be a good compromise instead. (Note that Microsoft's advertising solution is what's causing the new app usage services)\r\n</li><li>Changed the keycode for the 'Internet@TV' button to hopefully work for more users (my TV doesn't have this mode at all).\r\n</li><li>Added teletext buttons to the 'misc' page. Note that I'm in the US where we don't have Teletext, so please contact me via the app if it doesn't work as expected.\r\n</li><li>Added and renamed a few buttons on the 'misc' page by request. </li></ul>\r\n<p>v1.4:</p>\r\n<ul>\r\n<li>Added a trial mode that's equivalent to the full app, but with ads (still on the TV list only). You can now purchase the app to remove the ads on this page.\r\n</li></ul>\r\n<p>v1.5:</p>\r\n<ul>\r\n<li>Fixed ES model TVs. </li></ul>\r\n<p>v1.6:</p>\r\n<ul>\r\n<li>Holding the volume up/down keys will now cause them to continue sending volume up/down commands until they are released.\r\n</li><li>Fixed WP8 compatibility. </li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "wp7,wp71,wp7dev,samsung,remote,remote control,wp8,wp8dev,",
  "LastEdited": "2014-04-25T12:17:37.147-07:00"
}