{
  "ProjectName": "scrypt",
  "Title": "Scrypt RSA Cryptography for Silverlight 3+ and Windows Phone 7",
  "Description": "The Scrypt RSA Library provides asymmetric encryption capabilities for Microsoft Silverlight 3+ and Windows Phone 7.  In this initial release we've added RSA Encryption with support for key sizes from 256-bit to 4096-bit. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>If you like this library, please rate it! Also, please leave feedback / reviews. I like to know what other people think of my work, both good and bad.</p>\r\n<p>Project is now available on NuGet! <a href=\"http://www.nuget.org/List/Packages/DH.Scrypt.dll\">\r\nhttp://www.nuget.org/List/Packages/DH.Scrypt.dll</a></p>\r\n<p><strong>UPDATE 1/6/2012: </strong>The NuGet package has been fixed.&nbsp; It now contains assemblies for Silverlight 3, 4 and 5.<br>\r\n<br>\r\n<strong>Project Description</strong><br>\r\nThe Scrypt RSA Library provides asymmetric encryption capabilities for Microsoft Silverlight 3&#43; and Windows Phone 7. In this initial release we've added RSA Encryption with support for key sizes from 256-bit to 4096-bit.\r\n<br>\r\n<br>\r\nThis library is fully compatible with .NET's built in RSACryptoServiceProvider. Successful testing has been done on a Windows Phone 7 device as well. The release download is compiled for Silverlight 3.<br>\r\n<br>\r\nFor some usage examples, please visit my blog:<br>\r\n<a href=\"http://www.dustinhorne.com/post/Asymmetric-Encryption-and-Signing-with-RSA-in-Silverlight.aspx\">http://www.dustinhorne.com/post/Asymmetric-Encryption-and-Signing-with-RSA-in-Silverlight.aspx</a><br>\r\n<br>\r\n<strong>Licensing Clarification</strong><br>\r\nI wanted to make a small clarification to the licensing for Scrypt. While I don't publish the source for all of my works, I fully support the open source community. In doing so, I am providing the Scrypt library without limitation. All I ask is that you post\r\n a review of the project here on CodePlex if you use it in your project and provide a link to the project in your application only if doing so is unobtrusive (for instance on a Help or About screen, but only if it fits naturally and does not affect your project).\r\n You are free to use this library in both your open and closed source applications, both free and for sale, without limitation. I hope you find this library useful!<br>\r\n<br>\r\n<strong>Limitations</strong><br>\r\nThis library limits the allowed key size to the range of 256-bit to 4096-bit. This is strictly due to the functionality of the employed BigInteger class that is used which initializes a fixed array for data storage. While this size can be increased to allow\r\n for larger keys, I found the negative impact on performance to be unacceptable. Likewise, I performed a full conversion of the BigInteger class to utilize generics instead of fixed arrays but the performance impact of this approach was also unacceptable.<br>\r\n<br>\r\n<strong>Acknowledgements</strong><br>\r\nThis project uses a modified version of the C# BigInteger class by Chew Keong TAN, with several fixes and enhancements.</p>\r\n<p>A huge thank you goes out to Nick Martyshchenko for providing CspBlobImport and CspBlobExport functionality for compatibility with the Windows SDK (Unmanaged).&nbsp;&nbsp;Thanks Nick!&nbsp; And you can visit Nick's blog @\r\n<a href=\"http://nsentinel.blogspot.com\" target=\"_blank\">http://nsentinel.blogspot.com</a>&nbsp;(Russian).</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-01-06T08:53:11.467-08:00"
}