{
  "ProjectName": "securesilverlight",
  "Title": "Secure SharePoint Silverlight Web Part -  Silverlight Security & Auditing",
  "Description": "The Secure Silverlight WebPart provides both builtin security using default SharePoint security mechanisms as well as site collection specific auditing to record an event a Silverlight file is newly hosted in the SharePoint environment. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The Secure Silverlight WebPart provides both builtin security using default SharePoint security mechanisms as well as site collection specific auditing to record an event a Silverlight file is newly hosted in the SharePoint environment. <br /><br /><b>Tested In SharePoint 2007 &amp; SharePoint 2010</b><br /><br />Silverlight is becoming a more common UI platform when developing composite SharePoint applications. While other technologies have attempted in the past to offer dynamic or interactive content, Silverlight fills this gap by providing interaction for true line-of-business applications with tight integration with web services and LINQ allow robust end‐to‐end communication and manipulation of hierarchical business data.<br /><br /> SharePoint 2010 projects now are Silverlight aware and can deploy as part of the SharePoint Solution package files. This is accomplished through the use of SharePoint Modules with ElementFile deployment types. And while the support is directly built-in, such automation always introduces the following security risks:<br /><br />Auditing - Quality audits are performed to verify conformance to standards through review of objective evidence. This helps in measuring something or calculating a value for it.<br /><br />Security Enforcement – Providing a singular place to configure security rights which is immediately made aware to, and consumed by, the application.<br />In order to address these concerns, the Security Enhanced Silverlight WebPart Host For SharePoint provided baked in features targeting each of these requirements. <br /><br />For more reading/information about the WebPart, please visit the following links:<br /><br /><a href=\"http://www.sharepointsecurity.com/sharepoint/sharepoint-development/free-web-part-secure-silverlight-sharepoint-web-part\">http://www.sharepointsecurity.com/sharepoint/sharepoint-development/free-web-part-secure-silverlight-sharepoint-web-part</a><br /><br /><img src=\"http://www.sharepointsecurity.com/wp-content/uploads/2010/11/Cube_1.jpg\" /><br /><br />Adam Buenz<br />SharePoint MVP -<a href=\"http://www.sharepointsecurity.com\">http://www.sharepointsecurity.com</a><br /><br />Jeff Larson<br /><br /><br /><b></b>Please use the project at your own risk, however if you run into issues use the contact form in the aforementioned site.<b></b></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-11-10T15:29:07.76-08:00"
}