{
  "ProjectName": "silvermenu",
  "Title": "SilverMenu",
  "Description": "SilverMenu brings some of the menu functionality of Silverlight for Windows Phone 7 to the XNA world.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />SilverMenu brings some of the menu functionality of Silverlight for Windows Phone 7 to the XNA world.<br /><br />It is always painful to do a pretty GUI menu for our game or 3d application in XNA and this library helps with that by reading the menu from a XML file and with only a few lines of code we have a pretty Silverlight alike menu working in our XNA application.<br /><br />This library resulted after the fastidious work I had when working on the menus of the Puzzle Jumble game (<a href=\"http://puzzlejumble.zpx.pt\">http://puzzlejumble.zpx.pt</a>) by ZPX (<a href=\"http://www.zpx.pt\">http://www.zpx.pt</a>).<br /><br /><b>Update</b><br />I found out about a new library Xnaml <a href=\"https://msmvps.com/blogs/valentin/pages/xnaml-component.aspx\">https://msmvps.com/blogs/valentin/pages/xnaml-component.aspx</a> which, at first sight, renders the SilverMenu useless. This made me question the purpose in continuing this project.<br />I just made an update for SilverMenu (11-05-22) since I was still using it for a game I was working on (Think Fast! for WP7) but with the eminent arrival of Silverlight in XNA it will definitely render SilverMenu useless. Check the comments for this new commit in the Source Code section.<br /><br /><br />Better than trying to describe what it does, check this video <a href=\"http://www.youtube.com/watch?v=HKOPc4Qut8Q\">http://www.youtube.com/watch?v=HKOPc4Qut8Q</a>.<br />In the future, the goal is to try to achieve a richer experience like this one <a href=\"http://www.youtube.com/watch?v=NWRDrZUQxzo\">http://www.youtube.com/watch?v=NWRDrZUQxzo</a>.<br /><br /><img src=\"/projects/silvermenu/e1f351db-9ccb-47a7-8cd7-4eeb059db172\" alt=\"sm01.jpg\" title=\"sm01.jpg\" /><img src=\"/projects/silvermenu/e5ba7163-1754-4384-82d8-74ea0ee8500a\" alt=\"sm02.jpg\" title=\"sm02.jpg\" /><br /><br /><b>First release coming soon</b> but you can still <b>download</b> the current work in progress source code which has a <b>working sample</b>.<br /><br /><br /><b>Known limitations / Things to add in future:</b>\n<ul><li>gesture support in silver menu (priority! coming in the next update.) - <b>Completed.</b></li>\n<li>buttons (priority! coming in the next update.) - <b>partially implemented, work in progress.</b></li>\n<li>doesn&#39;t allow different transition times for different page transitions.</li>\n<li>doesn&#39;t support changes between portrait and landscape.</li>\n<li>doesn&#39;t allow complex effects (like mirroring an image.)</li>\n<li>menu transitions with fade outs.</li></ul>\n<br /><br />It would be nice to have an editor where we could build the menu and export it as a SilverMenu XML.</div><div class=\"ClearBoth\"></div>",
  "TagList": "menu,XNA,WP7,Silverlight,wp7dev,GUI,",
  "LastEdited": "2011-05-21T17:02:29.34-07:00"
}