{
  "ProjectName": "SilverTime",
  "Title": "Silverlight Virtual Earth World Clock",
  "Description": "This is a world clock using Virtual Earth for the world clock.  It uses Silverlight and Virtual Earth through the VIEWS wrapper (also a codeplex project).  Originally it was created as a simple, but flashy :) demo of Silverlight for global aware apps.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Help Wanted</b><br /><br /><b>Project Description</b><br />This is a world clock using Virtual Earth for the world clock.  It uses Silverlight and Virtual Earth through the VIEWS wrapper &#40;also a codeplex project&#41;.  Originally it was created as a simple, but flashy &#58;&#41; demo of Silverlight for global aware apps.<br /><br /><b>Details</b><br />SilverTime is an example of a Silverlight application.  Initially it was intended to be a quickly written demo for a presentation, with a global aspect.  The VIEWS Virtual Earth Silverlight wrapper was chosen because it made it easy to get a map and reasonable latitude/longitude coordinates from that map.  Besides its really cool, and extreme overkill for a world clock :)<br /><br /><b>Dependencies</b>\n<ul><li>Silverlight Beta 2 is the first dependency <a href=\"http://silverlight.net/GetStarted/\">http://silverlight.net/GetStarted/</a></li>\n<li>The VIEWS Virtual Earth Wrapper for Silverlight <a href=\"http://www.codeplex.com/views\">http://www.codeplex.com/views</a> codeplex project is another.</li>\n<li>And that uses Virtual Earth <a href=\"http://msdn.microsoft.com/en-us/library/bb429619.aspx\">http://msdn.microsoft.com/en-us/library/bb429619.aspx</a></li>\n<li>Clock data came from the tz (olson) database <a href=\"http://www.twinsun.com/tz/tz-link.htm\">http://www.twinsun.com/tz/tz-link.htm</a> <a href=\"http://en.wikipedia.org/wiki/Zoneinfo\">http://en.wikipedia.org/wiki/Zoneinfo</a></li></ul>\n<br /><b>Serious Bugs</b><br />This was intended for flashiness, but I ran out of time to make the daylight savings times behave properly:\n<ul><li>Daylight savings times are recognized, but the transition between daylight and standard time (and vice versa) is very inaccurate.  DO NOT USE.</li>\n<li>I didn&#39;t really parse the data for the transition very well.</li>\n<li>I used the Pythagorean theorem to figure out how far from a timezone point a click is.  \n<ul><li>This doesn&#39;t account for the fact that the earth is round, so some points are &quot;closer&quot; in real life, even though the latitude is way different.</li>\n<li>This only gets you the closest city.  So if you click somewhere that in real life is within a time zone, but the closest known city is in another, you&#39;ll get inaccurate results (except that the city name may help you catch the error).</li></ul></li></ul>\n<br /><b>Things that&#39;d be cool to do</b><br />Again, I didn&#39;t do everything that&#39;d be cool\n<ul><li>It&#39;d be nice to have better timezone regions, and perhaps the UTC+/- timezones for places in the middle of an ocean or otherwise lacking a nearby city.</li>\n<li>Highlighting the found city/point would be cool.  </li>\n<li>Bird&#39;s Eye view for the found point would be fun.</li>\n<li>Comparing multiple locations would be fun.</li>\n<li>Etc., etc. etc.</li>\n<li>The tz data includes city/timezone latitude and longitude information.</li></ul>\n<br /><b>Making it work</b><br /><br />Silverlight Virtual Earth World Clock<br /><br />To just run it:\n<ol><li>Install Silverlight Beta 2 Runtime <a href=\"http://silverlight.net/GetStarted/\">http://silverlight.net/GetStarted/</a></li>\n<li>Download the release and unzip it locally.</li>\n<li>Open WorldClock.html</li></ol>\n<br />or to get the source project<br />\n<ol><li>Install Visual Studio and Silverlight Tools Beta 2 (not just the runtime) <a href=\"http://silverlight.net/GetStarted/\">http://silverlight.net/GetStarted/</a></li>\n<li>Download the project from the source code tab</li>\n<li>Unzip, open the project, Build &amp; Run.</li></ol>\n<br /><b>Updating the Project</b>\n<ul><li>You can grab new bits from the VIEWS project when its available (2 dlls and a .js file)</li>\n<li>You can grab the latest tz database.  That&#39;s a bit more of a pain because it needs to be ported into the format of the data.cs file.</li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight 2.0,Silverlight,Virtual Earth,Clock,",
  "LastEdited": "2009-09-22T09:19:08.353-07:00"
}