{
  "ProjectName": "silverdesigner",
  "Title": "Silver Designer",
  "Description": "Silver Designer is a designer project in C# / Silverlight and looks like Adobe InDesign Lite. It gives just the basic functionality and runs in the browser.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rSilver Designer is a designer project in C&#35; &#47; Silverlight and looks like Adobe InDesign Lite. It gives just the basic functionality and runs in the browser.<br />\n<h1>Demo</h1>\rAt this link <a href=\"http://titan830.startdedicated.com/Silverdesigner/\">http://titan830.startdedicated.com/Silverdesigner/</a> there is a working instance of the Silver Designer. It is always the last version of the product and available on web. Try and use it, have fun.<br />\n<h1>What is Silverlight</h1>\rIt is a plugin like Adobe Flash created by Microsoft. Silverlight applications runs in browser like client applications. Necessary languages C# / XAML. Get Started Silverlight from here <a href=\"http://msdn.microsoft.com/en-us/silverlight/bb187358.aspx\">http://msdn.microsoft.com/en-us/silverlight/bb187358.aspx</a><br />\n<h1>Silver Designer IDE</h1>\r<h2>Document Object Model</h2>\r<img src=\"/projects/silverdesigner/c51a4d88-282f-40d9-b096-858ac83af56c\" alt=\"DOM.png\" title=\"DOM.png\" /><br />This project has it&#39;s own object model. This software serialize the whole object model into a file with Newtonsoft Json Library <a href=\"https://json.codeplex.com/\">https://json.codeplex.com/</a> when user wants to save the project. Also with the same procedure reads and presents the json file.\n<h2>Embed in resources</h2>\r<img src=\"/projects/silverdesigner/b20f63a9-4b93-43e0-9976-d0a9c8b623fe\" alt=\"001.png\" title=\"001.png\" /><br />All image resources would be embeded in the project file and will be seriliazed as base64 string into the json file while saving. So there will be just a single project file, no local image files, paths and no project folder or something like that. This makes projects much more portable, just copy and paste or send via mail or etc...\n<h2>Document</h2>\r<img src=\"/projects/silverdesigner/e15b7931-5350-4740-8892-d664e412cdcd\" alt=\"002.png\" title=\"002.png\" /><br />Document is top main object of the project. Each project is a document. Document has <b>page</b>s, width and height and orientation.\n<h2>Page</h2>\rPages are the child objects of the <b>Document</b>. Each page has the size of the parent document. Pages are inherited from the container object of the Document object model of the silver designer. So this makes all pages also including the document himself is a container.\n<h2>Container</h2>\r<img src=\"/projects/silverdesigner/473f2030-5444-437d-9ae2-83cb0067dae3\" alt=\"003.png\" title=\"003.png\" /><br />Container is a object that can holds other <b>containers</b> and <b>non-container objects</b> like <b>Text, Video, Image</b> etc... How to draw a container in the page is so easy, select from toolbox the container, the mouse cursor will be changed and draw with left button pressed. The drawn container will be selected automatically. <b>Properties</b> tab in the <b>right pane</b> will be show the properties of the container. Also Container could have a name change from <b>right pane object tree</b> tab.\n<h2>Image</h2>\r<img src=\"/projects/silverdesigner/75fc0f71-d7c2-409d-b2b7-d9ed6f739446\" alt=\"004.png\" title=\"004.png\" /><br />As explained before all images could embeded into the project file. In this project we call it <b>resources</b>. User can add an <b>image object</b> in a container (page, document are also containers) from toolbox. Image object will be immediately selected and in the properties tab in the right pane user can give the name of the embeded resource or any kind of <b>url</b>. Ability to give url to the image object is also a important functionality because images could be hosted in a server.\n<h2>Video</h2>\rFor now videos can be only links. So videos should be stored in a <b>server</b> or <b>local folder</b> and files can be given as source like <i>file:///folder/filename.wmv</i>. But <b>embeded videos</b> in the file will be the incoming feature of this product. By the way product has the capability of playing every format which Microsoft Silverlight supports simultaneously when design time.\n<h2>Text</h2>\r<img src=\"/projects/silverdesigner/d2f33b26-baa5-4708-b5a7-3551e9ac6c15\" alt=\"005.png\" title=\"005.png\" /><br />Designer can except in text property of the text component both <b>plain text</b> and <b>html</b>. Also there is in built in <b>TinyMce</b> editor. <a href=\"https://tinymce.codeplex.com/\">https://tinymce.codeplex.com/</a>\n<h2>Document View</h2>\r<img src=\"/projects/silverdesigner/3c272167-bfd2-4996-a578-2841e368d231\" alt=\"006.png\" title=\"006.png\" /><br />Designer could arrange pages according to the position property of the page.<br />\n<h2>follow me on twitter: <a href=\"http://twitter.com/oguzkoroglu\">twitter.com/oguzkoroglu</a></h2>\r<h2>my linked in profile : <a href=\"http://tr.linkedin.com/in/oguzkoroglu/\">http://tr.linkedin.com/in/oguzkoroglu/</a></h2>\r<h2>my personal web site : <a href=\"http://oguzkoroglu.net/\">http://oguzkoroglu.net/</a></h2></div><div class=\"ClearBoth\"></div>",
  "TagList": "silverlight,c#,dom,xaml,adobe,indesign,designer,ide,",
  "LastEdited": "2014-04-10T23:22:12.13-07:00"
}