{
  "ProjectName": "silverlightcodecamp",
  "Title": "Silverlight Code Camp Starter Template",
  "Description": "The Silverlight Code Camp Starter template is designed to provide a simple solution to quickly raising a Code Camp web site using Silverlight.  The initial goal for the template was to decrease complexity and server requirements.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The Silverlight Code Camp Starter template is designed to provide a simple solution to quickly raising a Code Camp web site using Silverlight.  The initial goal for the template was to decrease complexity and server requirements.<br /><br /><b>More Information</b><br />This template was originally created by <a href=\"http://www.xperimentality.com\">Todd Miranda</a> for use on the <a href=\"http://www.alabamacodecamp.com\">Alabama Code Camp</a> site.<br />The site currently utilizes Silverlight 1.0 which decreases concern for installing a beta product.<br />Site data is stored in XML so no database is necessary.<br />There is no server side processing, removing the requirement for any particular server side processing.<br />The site should be deployable to any web server that can server html, js, images, and xml files.<br /><br /><b>Getting Started</b><br />Setting up the site is very simple and requires few steps.  Currently, the main home page and the agenda page require manual modification.  The remaining pages are all driven from the XML file.\n<ol><li>Unzip the web site.</li>\n<li>Modify the templates/Home/HomeContent.xaml file as your needs demand.  The hyperlink mouse events are located in the last few lines of the Page.xaml.js file and the correct URIs should be placed there.</li>\n<li>Modify the templates/Agenda/AgendaContent.xaml file as your needs demand.</li>\n<li>Modify the speakers.xml file.  This file is located in both the templates/Sessions and the templates/Speakers folders.  The same file is currently used in both locations so you can modify one of them and then copy it to the other directory.</li>\n<li>Modify the contributors.xml file located in the templates/Contributors folder.</li>\n<li>In order to help optimize the retrieval of assets, assets are packaged in zip files by content area.  So the files in the Contributors, Speakers, and Sessions sub-folders of the templates folder should all be zipped up and the corresponding zip file in those folders replaced with the new zip file.</li>\n<li>That&#39;s it.  Copy the web site to your server and navigate to the default.html page.</li></ol></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Code Camp,",
  "LastEdited": "2008-04-16T15:28:38-07:00"
}