{
  "ProjectName": "silverlightspherecon",
  "Title": "Silverlight Sphere Control",
  "Description": "This is a Silverlight spherical selection control that I built that uses the projection transformations in Silverlight.  It includes several modes (including random, rows, columns, vertical carousel, horizontal carousel, and checkered) and events.\r\n\r\nUpon selecting one of the elements (which are arranged in a spherical pattern, hence the name), the sphere rotates until the control is at the front face of the sphere.\r\n\r\nEvents are available to hook into (on element selected, rotation finished, etc.).\r\n\r\nThis control has several display patterns:\r\n-Random (elements are dispersed randomly over the sphere area)\r\n-Checkered (elements use an alternating row/column checkered pattern)\r\n-Columns (elements are dispersed in primarily column-type pattern)\r\n-Rows (elements are dispersed in primarily row-type pattern)\r\n-Vertical Carousel (elements are all aligned on a single vertical plane)\r\n-Horizontal Carousel (elements are all aligned on a single horizontal plane)\r\n\r\nIt was built in Silverlight 3 but the code example is in Silverlight 4.  It should be compatible with any version of Silverlight that has the projection transformations.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This is a Silverlight spherical selection control that I built that uses the projection transformations in Silverlight.  It includes several modes &#40;including random, rows, columns, vertical carousel, horizontal carousel, and checkered&#41; and events.<br /><br />Upon selecting one of the elements &#40;which are arranged in a spherical pattern, hence the name&#41;, the sphere rotates until the control is at the front face of the sphere.<br /><br />Events are available to hook into &#40;on element selected, rotation finished, etc.&#41;.<br /><br />This control has several display patterns&#58;<br />-Random &#40;elements are dispersed randomly over the sphere area&#41;<br />-Checkered &#40;elements use an alternating row&#47;column checkered pattern&#41;<br />-Columns &#40;elements are dispersed in primarily column-type pattern&#41;<br />-Rows &#40;elements are dispersed in primarily row-type pattern&#41;<br />-Vertical Carousel &#40;elements are all aligned on a single vertical plane&#41;<br />-Horizontal Carousel &#40;elements are all aligned on a single horizontal plane&#41;<br /><br />It was built in Silverlight 3 but the code example is in Silverlight 4.  It should be compatible with any version of Silverlight that has the projection transformations.<br /><br /><img src=\"http://www.murtaya.com/Mike/CodePlex/SphereControlExample.png\" /><br /><br />Link to a the running example:<br /><a href=\"http://www.murtaya.com/Mike/CodePlex/SphereControlExample/TestPage.html\">http://www.murtaya.com/Mike/CodePlex/SphereControlExample/TestPage.html</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "3D,Silverlight,Carousel,Sphere,selection control,",
  "LastEdited": "2011-10-30T19:03:25.537-07:00"
}