{
  "ProjectName": "SilverlightUGStarter",
  "Title": "Silverlight User Group Website Starter Kit",
  "Description": "The Silverlight User Group Starter Kit will contain the functionality for creating a rich Silverlight User Group Website.  The project will be implemented with Silverlight 3 and will explore the new features and apply it to User Group functionality.  ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Something Spacial</h1>\r<i>A Silverlight User Group Website Starter Kit</i><br /><br /><b>Project Description</b><br />Something Spacial is a Silverlight Website Framework written in Silverlight 3, which has as its goal to make it very easy to build a User Group website using this project as starting point.<br /><br />It is targeted mainly to cover the needs of a <u>User Group website</u>, but it can easily be adapted to suit other purposes.  <br /><br /><b>Functionality for Initial Release</b><br /><br />At this time, Something Spacial is not yet released - but its intended release functionality is as follows:<br />\n<ul><li>Design set with Something Spacial signature cloud theme</li>\n<li>Live twitter feed with recent updates scroller</li>\n<li>Carousel content panes for all content types</li>\n<li>Basic content management system - built in-house</li>\n<li>Built in support for event management including: \n<ul><li>Content section for Details on upcoming event inluding custom title field.</li>\n<li>RSVP for users to register themselves to event</li>\n<li>Support for media types such as video, audio, and image (shadow box link from page)</li>\n<li>Current display of event and archive of previous events (archive pops out in shadow box)</li>\n<li>Time, date, and location fields for easy display of basic information for each event plus a link and map to view location on Bing Maps+</li></ul></li>\n<li>Content panels allow support to aggregate and display RSS feed data (useful for integration with any alternative Content Management System)</li>\n<li>Ability to display Twitter feed in main panel, if desired.</li>\n<li>News and/or Blog integration into chosen content panel</li></ul>\n<br /><br />More information will be released in the near future with a Beta release of this web application tool.<br /><br /><b>Prereq.</b><br /><br />SQL Server/Express &amp; Visual Studio<br />Silverlight <a href=\"http://silverlight.net/GetStarted/\">http://silverlight.net/GetStarted/</a><br />RIA Services <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=76bb3a07-3846-4564-b0c3-27972bcaabce&amp;displaylang=en\">http://www.microsoft.com/downloads/details.aspx?FamilyID=76bb3a07-3846-4564-b0c3-27972bcaabce&amp;displaylang=en</a><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Ag3 Starter Kit,Silverlight,User Group,Silverlight User Gro,Silverlight 3,UG Starter Kit,Something Spacial,Silverlight Website,User Group Manager,User Group Tools,Event Management,Twitter Silverlight,Silverlight Tweets,Silverlight Tool,RIA,RIA Services,KimSchmidt,",
  "LastEdited": "2009-08-27T08:09:40.023-07:00"
}