{
  "ProjectName": "SilverlightCoverFlow",
  "Title": "Silverlight Cover Flow",
  "Description": "Cover flow implemented in Silverlight 3.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Cover flow implemented in Silverlight 3.<br /><br /><br />I wanted to start getting into Silverlight 3 and learn more about extending the ItemsControl.  So, I decided to do a cover flow control (there are surprising few out there).  I&#39;ve uploaded the source and can be downloaded in the downloads section and a live example can be viewed <a href=\"http://coverflow.darickcarpenter.net/\">here</a>. <br /><br />I tried to make if fairly robust.  It can take any controls by using the data template (which must be done for now, I haven&#39;t implement a DisplayMemberPath yet).  Also the layout is pretty flexible and offers control over the following:<br />\n<ul><li>Space between items</li>\n<li>Space between the selected item and the other items</li>\n<li>The angle non selected items are at</li>\n<li>The the depth of non selected items</li>\n<li>The scale of non selected items (depth and scale offer very similar effects, but are slightly different)</li>\n<li>The duration it take to switch selected items</li>\n<li>the easing function of the animations</li></ul>\n<br />All of these items can be changed dynamically as shown in the example.  Items can also be switch by next, previous, next page, previous page, first, last, or by clicking on them.  The keyboard can also be used.  The arrow keys work (the cover flow slider needs to have focus for the arrow keys to work so I am using some of the alphabet keys <a href=\"https://silverlightcoverflow.codeplex.com/wikipage?title=A%2cS%2cD%2cW%2cQ%2cE&referringTitle=Home\">A,S,D,W,Q,E</a> as well).<br /><br />A few of the new Silverlight beta 3 things are:\n<ul><li>PlaneProjection</li>\n<li>Easing</li>\n<li>Element Data Binding (I think this one is pretty cool, all the sliders are bound this way)</li>\n<li>GPU Acceleration on media playback</li>\n<li>H264 high def video playback</li></ul>\n<br />A quick note about the GPU Acceleration.  I tried using this on the cover flow control, and it seemed to work until you scroll/flow down the list to far then it starts to freak out.  Maybe the silverlight people can look at this.  But if that can be fixed in the release version, that should speed things up quite a bit.<br /><br />edit: As of v 0.2 it runs pretty smooth, unles there are a lot of items and you click on first/last and it is at the opposite end, then it will be choppier, but other than that, it should run pretty smooth. I tried it with almost 400 items and I didn&#39;t notice any difference that if there were 60.<br /><br />The data is from Apple Quicktime movie trailers and so are the movie files being played.  I didn&#39;t spend much time on the actual viewing experience of the movie trailer since that wan&#39;t the purpose.<br /><br />I welcome any feedback or any suggestion on how make this control better/faster.  This is my first ItemsControl so, there may be better ways of doing things. <br /><br /><br />Version 0.02:\n<ul><li>Optimized the code so it runs much smoother, even with many items.</li></ul>\n<br /><img src=\"/projects/SilverlightCoverFlow/21805c02-2f68-4bd4-863d-c5dfa97dfc5b\" alt=\"coverflow.jpg\" title=\"coverflow.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,CoverFlow,",
  "LastEdited": "2012-11-27T11:48:32.157-08:00"
}