{
  "ProjectName": "silverlightuploader",
  "Title": "Silverlight File Uploader",
  "Description": "The Silverlight File Uploader is a Silverlight 2 control (compatible with Silverlight 2, 3, and 4) for uploading multiple files concurrently.  This is the most flexible, user-friendly, developer-friendly, well-documented and tested Silverlight uploader project on CodePlex.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\rThe Silverlight File Uploader is a Silverlight 2 control &#40;compatible with Silverlight 2, 3, and 4&#41; for uploading multiple files concurrently.  This is the most flexible, user-friendly, developer-friendly, well-documented and tested Silverlight uploader project on CodePlex.<br /><br />More so than the other open-source Silverlight uploaders out there, this project is focused on providing a control that is easy to slot into your application with minimal effort.  It provides more detailed examples, help, and code comments.  It provides more information for server-side handling of the files, and has a stronger focus on robust error handling.<br />\n<h3>Example Usage</h3>\rIn addition to downloading the example, I have created a short user&#39;s guide for this control.  Follow the link below to see the guide.<br /><a href=\"https://silverlightuploader.codeplex.com/wikipage?title=Example%20Usage&referringTitle=Home\">Example Usage</a><br /><br />Update: I have added an additional guide, <a href=\"https://silverlightuploader.codeplex.com/wikipage?title=Integrating%20with%20an%20Existing%20Website&referringTitle=Home\">Integrating with an Existing Website</a>, which describes how to integrate this control into an existing website.<br />\n<h3>General Features</h3>\r<ul><li>User-friendly UI with progress bars</li>\n<li>Upload any number of files simultaneously</li>\n<li>Upload files of any size</li>\n<li>Allow users to select multiple files or just a single file</li>\n<li>Limit which file types a user can select via a standard file filter</li>\n<li>Set the maximum file size that a user is allowed to upload</li>\n<li>Manage the list of files as they are being uploaded: cancel an uploading file, or remove a pending file before it has begun uploading</li></ul>\n\n<h3>Developer Features</h3>\r<ul><li>Very fast -- implemented using an http handler to upload files; the maximum number of concurrent uploads can be configured and defaults to 2</li>\n<li>Uploads each file in chunks; defaults to 3 MB, but can be changed to any value that you feel is appropriate</li>\n<li>Has a web server control that makes it very easy to use in ASP.NET applications</li>\n<li>Has a javascript object with several events for easily responding to the uploader on your web pages</li>\n<li>Easy server-side post-processing of files, see <a href=\"https://silverlightuploader.codeplex.com/wikipage?title=Example%20Usage&referringTitle=Home\">Example Usage</a> for more details</li>\n<li>Complete working example solution</li>\n<li>Extra support is built in for using this control with an ASP.NET server application, but the Silverlight control is completely generic and will work with PHP or any of your favorite server technologies</li></ul>\n\n<h3>Screenshot</h3>\rHere is a screenshot of what the file uploader looks like in action:<br /><img src=\"/projects/silverlightuploader/e0449d3e-5801-4a2f-ae8e-c21044881b21\" alt=\"fileuploaderscreenshot.png\" title=\"fileuploaderscreenshot.png\" /><br />\n<h3>Comparison of Open-Source Silverlight Uploaders</h3>\rThere are two other open-source uploaders on CodePlex as of the creation of this project -- what is different about them?\n<ul><li>All of the other examples that I have found give you a basic example of uploading files into a directory on the server... and that&#39;s it.  This is not a very realistic situation -- you almost always want to process the files, put them into a database, create thumbnails, etc.  Our project is designed to make it easier to slot this control directly into your application&#39;s architecture with minimal effort.</li>\n<li>None of the other examples have very good documentation or comments in the code.</li>\n<li>The other examples have a less streamlined user experience that requires extra clicks.</li></ul>\nHere are some more detailed notes on the other CodePlex projects:\n<ul><li><a href=\"http://slfileupload.codeplex.com/\">http://slfileupload.codeplex.com/</a> This project is a great example of the basic techniques required, and I used it as a reference for this project.  Unfortunately it has some bugs, and the Silverlight UI is not very presentable.  It is NOT stable enough for use in a production environment.</li>\n<li><a href=\"http://silverlightfileupld.codeplex.com/\">http://silverlightfileupld.codeplex.com/</a> This project is more similar to our project, and adds a feature to resize images prior to uploading.  While that feature is nice, it suffers from the general weaknesses noted above.  Its handling of the user&#39;s files allows some potential issues as well -- a user could potentially delete a file in the middle of a download.</li></ul>\n\n<h3>About the Authors</h3>\rThis project was written by Peter Coley of Virtual Chemistry, Inc. (VCI) <a href=\"http://www.virtualchemistry.com\">http://www.virtualchemistry.com</a><br />VCI specializes in using .NET, Silverlight, SharePoint, and more to solve tough problems in web-based data management.</div><div class=\"ClearBoth\"></div>",
  "TagList": "silverlight,silverlight 2.0,file upload,upload controls,uploader,multiple files,.NET 3.5,C#,ASP.NET,Silverlight NPE,Numero uno,",
  "LastEdited": "2009-06-18T11:30:59.817-07:00"
}