{
  "ProjectName": "silverlightmedia",
  "Title": "SilverlightMedia JavaScript Library",
  "Description": "A JavaScript library making it quick and easy to work with any web-based media player built with Silverlight.\r\n\r\nYou can take control of any Silverlight media player using pure JavaScript. This facilitates useful scenarios e.g. creating HTML controls, displaying player status, etc.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>The SilverlightMedia JavaScript Library</b><br />A JavaScript library making it quick and easy to work with any web-based media player built with Silverlight.<br /><br />You can take control of any Silverlight media player using pure JavaScript. This facilitates useful scenarios e.g. creating HTML controls, displaying player status, etc.<br /><br />Download here: <a href=\"http://silverlightmedia.codeplex.com/releases/view/59691\">SilverlightMedia JavaScript source code, with a working example</a>.<br /><br /><b>Harness the power of Silverlight</b><br /><br />Silverlight applications are, by default, seamlessly integrated with the web page. This means true two-way access between Silverlight and the JavaScript and HTML DOM. With standard JavaScript code, you can work directly with the objects, properties. methods and events within Silverlight.<br /><br />SilverlightMedia takes advantage of this advanced capability of Silverlight, providing you the web developer with the ability to control Silverlight-based media players, from online radio players to embedded video players, using very simple JavaScript code. SilverlightMedia takes care of the standard JavaScript code, leaving you to concentrate on the interesting stuff.<br /><br />In case you hadn&#39;t noticed, this is powerful stuff; in Flash you&#39;d have to write explicit additional &quot;ActionScript&quot; code for each specific aspect of the Flash application you want to expose to JavaScript! Thus, Silverlight&#39;s JavaScript bridge enables completely knew way of thinking about and developing the web client applications. Welcome to the next-generaton of web apps...<br /><br /><u>Notes</u><br />\n<ul><li>The current version of SilverlightMedia is tested on Silverlight 2.0 media players so far, and thus referred to as &quot;SilverlightMedia&quot;.</li>\n<li>This is an open-source project and a work in progress. Feel free to help us improve it.</li>\n<li>This type of web app needs to be on a web server to work properly, and you may need to ensure that the web server is set to correct Silverlight files (*.XAP) with the correct MIME type (&quot;application/x-silverlight-app&quot;). <a href=\"http://blogs.technet.com/b/jorke/archive/2007/09/11/silverlight-mime-types-in-iis6.aspx\">How to set MIME types in IIS and Apache</a><br /><br />Additional information is available here: <a href=\"http://codeplex.codeplex.com/wikipage?title=Start%20a%20Project\">Project Startup Guide</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-01-24T02:47:41.797-08:00"
}