{
  "ProjectName": "silverlightC64",
  "Title": "Pete Brown's Silverlight C64 Emulator",
  "Description": "A commodore 64 emulator ported to Microsoft Silverlight by Pete Brown",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br /><br />A commodore 64 emulator ported to Microsoft Silverlight by Pete Brown<br /><br />&quot;Just to prove Silverlight was up to the task&quot;<br /><br />This is the raw (and I do mean raw), buggy source code for a Frodo-based port of a C64 emulator for <b>Silverlight 3 Beta</b>. Future revs may move to a port of Vice, but I wanted to make the current source available while I mull that decision over.<br /><br />Currently only a small set of games work or partially work. C64 basic commands and typical disk access work. Up to four drives are supported. Currently no sound support. <b>The emulator is pretty CPU intensive</b> due to zero optimization and lots of array copies; if you&#39;re not running a fast dual core machine, you&#39;re going to see something close to 100% CPU utilization. This isn&#39;t a deficiency in Silverlight, rather the result of some pretty inefficient translation from pointers to array copies. This will be fixed.<br /><br />If you want to use the function keys the browser normally eats, you need to run the application out of browser. Most other keys are mapped. Run-stop is mapped to Escape.<br /><br />The interesting thing about the approach I used, is the display is a 50fps video, generated at runtime in Silverlight 3. This uses the enhanced MediaStreamSource (managed codec) support introduced in Silverlight 3.<br /><br /><b>Additional Information</b><br /><br />A video showcasing this emulator may be found on Channel 9 here:<br /><a href=\"http://channel9.msdn.com/posts/Dan/Honorable-Mention-MIX09-Show-Off-Contest-Silverlight-Commodore-64-Emulator/\">http://channel9.msdn.com/posts/Dan/Honorable-Mention-MIX09-Show-Off-Contest-Silverlight-Commodore-64-Emulator/</a>.<br /><br />A podcast Scott Hanselman did with me at MIX09 covers this emulator<br /><a href=\"http://www.hanselman.com/blog/HanselminutesPodcast155AC64EmulatorWithSilverlight3ByPeteBrown.aspx\">http://www.hanselman.com/blog/HanselminutesPodcast155AC64EmulatorWithSilverlight3ByPeteBrown.aspx</a><br />(and yes, 1mhz, not 1hz :)   )<br /><br /><b>References</b><br /><br />Frodo Emulator: <a href=\"http://frodo.cebix.net/\">http://frodo.cebix.net/</a><br />Sharp C64: <a href=\"http://sourceforge.net/projects/sharp-c64\">http://sourceforge.net/projects/sharp-c64</a><br /><br />Frodo is the best place to go for reference. Sharp C64 is what I used as a starting point, but it has some bugs that Frodo does not. Note that Frodo itself is a very CPU-intensive emulator when compared to others. Starting with a C# port still saved me a ton of time and allowed me to understand how everything worked without getting back into C/C++ right away. Sharp C64 was written by Stuart Carnie <a href=\"http://aussiebloke.blogspot.com\">http://aussiebloke.blogspot.com</a>, based on the Frodo source code.<br /><br /><b>Screen Shot</b><br /><br /><img src=\"http://10rem.net/pub/blog/Silverlight3TakingSilverlightOutoftheBro_E367/image_thumb_3.png\" /><br /><br /><br /><b>Other Silverlight Information</b><br /><br />If you&#39;re interested in Silverlight, be sure to subscribe to my blog at <a href=\"http://10rem.net\">http://10rem.net</a> and<br />Follow me on Twitter at <a href=\"http://twitter.com/pete_brown\">http://twitter.com/pete_brown</a><br /><br /><b>Attention Mac and Linux Users</b><br /><br />The code unfortunately has a dependency on Windows. Specifically, I needed to use platform-specific key codes to map some of the keys that Silverlight does not natively recognize. I&#39;m working with some folks in the moonlight community to get the correct linux keycodes. <b>However, I still need Mac keycodes, as I do not have a mac to test with.</b> If you&#39;re interested in helping me out there, please contact me in the dicussion list or via my blog.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "silverlight,commodore,c64,HintonBR,emulator,RIA,",
  "LastEdited": "2012-02-02T13:16:26.43-08:00"
}