{
  "ProjectName": "silverspatial",
  "Title": "SilverSpatial",
  "Description": "This project helps bridge the gap between Silverlight and Geo-Spatial data type (such as SQL Spatial). It implements the Well-Known-Binary (WKB) format for importing/exporting data, and will eventually support a few spatial manipulation/translation functions.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This project helps bridge the gap between Silverlight and Geo-Spatial data type &#40;such as SQL Spatial&#41;. It implements the Well-Known-Binary &#40;WKB&#41; format for importing&#47;exporting data, and will eventually support a few spatial manipulation&#47;translation functions.<br /><br />It is still early in the projects development, so all the features that will be included within the project are yet to be defined. The project currently supports importing/exporting data via the <a href=\"http://dev.mysql.com/doc/refman/5.0/en/gis-wkb-format.html\">Well-Known-Binary (WKB) format</a>.<br /><br />A secondary, but still main, goal of this project is also to work at keeping the overall file size of the assembly (.dll) as small as possible to reduce its footprint within the overall size of the Silverlight applications for which it is used within.<br /><br />Also, the goal of this project is not to provide a Silverlight based mapping control since both the <a href=\"http://deepearth.codeplex.com\">DeepEarth</a> project and <a href=\"http://msdn.microsoft.com/en-us/library/ee681884.aspx\">Microsoft&#39;s Bing Maps Silverlight Control</a> fullfill this very well. Instead this project is meant to be used along-side either of those controls, or some other control, within an application.<br />\n<h2>Special Thanks</h2>\rI must give a special thanks to the <a href=\"http://sharpmap.codeplex.com\">SharpMap</a> project, from which I was able to integrate the Well-Known-Binary support. Without that project to look at for reference, it would have taken quite a bit longer to implement. So, I must give credit where it is due.<br />\n<h2>Contributors</h2>\r\n<b>Chris Pietschmann</b> - Chris is a Microsoft MVP for the Windows Live Platform, a <a href=\"http://carto.com\">Co-Founder of Carto LLC</a>, and the <a href=\"http://simplovation.com\">Owner of Simplovation LLC</a> a software development consulting company that specializes in Mapping/GIS related application development. You can find Chris on his blog at <a href=\"http://pietschsoft.com\">http://pietschsoft.com</a>, or on Twitter at <a href=\"http://twitter.com/crpietschmann\">@crpietschmann</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "gis,spatial,WKB,geospatial,silverlight,",
  "LastEdited": "2010-12-01T08:21:38.153-08:00"
}