{
  "ProjectName": "SilverlightFileUpld",
  "Title": "Silverlight File Upload",
  "Description": "Silverlight file uploader that supports multi-file upload, resize images before upload with image thumbnail, individual progress and overall progress indicator, fast upload, ASP.NET server control, and is highly customizable.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Silverlight file uploader that supports multi-file upload, resize images before upload with image thumbnail, individual progress and overall progress indicator, fast upload, ASP.NET server control, and is highly customizable.<br /><br />Use this Silverlight File Uploader in silverlight projects or directly on ASP.Net pages with the included server control.  <br />\n<h2>Differences from other upload controls</h2>\r<ul><li>Fast! Does not use webservices to upload the file.  This is slower because each file chunk must be uploaded to the webservice and then return before another chunk can be uploaded, or if chunks aren&#39;t used then only small files can be uploaded.  </li>\n<li>Large files can be uploaded.  The developer has the ability to limit file size, and total upload size, and is not limited to the maxRequestLength in the web.config.  The upload control uploads files in chunks, but are much larger chunks than a webservice would use, the default is 4Mb which is the default maxRequestLength, but can be much larger (I would recomend around 25-30Mb).  This way the maxRequestLength can be kept small to avoid denial of service attacks, but still upload large files and avoid possible buffer overuns.</li>\n<li>Files can be resumed.  Also detects if a file by the same name has already been uploaded and asks if the user wants to overwrite it.</li>\n<li>Images (only jpg) can be resized before upload (thanks to fluxcapacity <a href=\"http://fluxcapacity.net/open-source/\">http://fluxcapacity.net/open-source/</a>).</li>\n<li>Thumbnails can be displayed for images (jpg and png for now).</li></ul>\n\n<h2>Other features</h2>\r<ul><li>Select multiple files to upload.  Remove one file or the entire list.</li>\n<li>Turn off mutiple uploads so user can only select one file.</li>\n<li>Restrict the type of files users are able to select with a filter.</li>\n<li>View upload progress of individual files and entire process.</li>\n<li>Fire a javascript function when all uploads are complete.</li>\n<li>Asynchronous upload, gui remains usable.</li>\n<li>Upload multiple files concurrently.</li>\n<li>Set the chunk size to upload.</li>\n<li>Set the maximum total upload size allowed to upload and the maximum file size to upoad.</li></ul>\n<br />The source has the silverlight source, server control source, and example source.  There are also test solutions included. Right now there is only a basic example, but I may add more complex examples.  I have tested this on IIS 6 but not in a production invironment and should be considered a beta.  <br /><br />I wanted to add some comments to the code and organize it better before I published it, but I&#39;m not sure when I would get to it.  So I&#39;ll just put it out there.<br /><br />Please feel free to make comments or suggestions.<br />\n<h2>PHP Example</h2>\rI&#39;ve added an example using PHP, get it <a href=\"http://www.codeplex.com/SilverlightFileUpld/Release/ProjectReleases.aspx?ReleaseId=20156\">here</a><br />\n<h2>Donate</h2>\rIf you would like to support the development of this control, you may <a href=\"https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&amp;hosted_button_id=955345\">donate</a> using paypal.<br /><br /><img src=\"/projects/SilverlightFileUpld/0b92dd75-d329-48b4-8f58-95dc0273fd8f\" alt=\"screenshot1.jpg\" title=\"screenshot1.jpg\" /><br /><br /><img src=\"/projects/SilverlightFileUpld/d2dff5dc-ca02-41f4-a0e7-e6e190a43eb2\" alt=\"screenshot2.jpg\" title=\"screenshot2.jpg\" /><br /><br /><img src=\"/projects/SilverlightFileUpld/95faf5c9-5e72-4d04-aa00-69111ed0bafc\" alt=\"screenshot3.jpg\" title=\"screenshot3.jpg\" /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Silverlight File Upl,upload,FileUploaderSLb,dv,",
  "LastEdited": "2008-12-03T15:48:11.323-08:00"
}