{
  "ProjectName": "silverpart",
  "Title": "SilverPart 2.2",
  "Description": "This project includes a Silverlight wrapper Web Part that can be used in MOSS 2007 or WSS 3.0 to expose Silverlight 2 (RTM) content. \n\nThe goal of this project is to create a generic web part that has custom properties that provide flexibility for embedding different Sil",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><img src=\"/projects/silverpart/ae4d84af-70c1-4df2-ae29-d1862b351204\" alt=\"silverpart.jpg\" title=\"silverpart.jpg\" /><br /><br /><b>Project Description</b><br /><br />This project includes a Silverlight wrapper Web Part that can be used in MOSS 2007 or WSS 3.0 to expose Silverlight 2 &#40;RTM&#41; content. <br /><br />The goal of this project is to create a generic web part that has custom properties that provide flexibility for embedding different Sil<br /><br /><img src=\"/projects/silverpart/3ca16677-6729-4882-b107-4cb1c01e954e\" alt=\"RIA.jpg\" title=\"RIA.jpg\" /><br /><br /><b>Software Requirements</b><br />\n<ul><li>Server\n<ul><li>.NET Framework 3.0</li>\n<li>MOSS 2007 (or WSS 3.0)</li></ul></li>\n<li>Client\n<ul><li>Silverlight 1.0 or Silverlight 2 or Silverlight 3 plug-in installed</li>\n<li><b>UPDATED</b>: Compatible with Firefox 3+ and IE8 (Release 2.1)</li></ul></li></ul>\n<br /><b>Features</b><br />\n<ul><li><b>UPDATED</b>: Fixed bug with Current User (<b>Release 2.2</b>)</li>\n<li><b>UPDATED</b>: Works in Firefox (<b>Release 2.1</b>)</li>\n<li><b>UPDATED</b>: Works for anonymous users (<b>Release 2.1</b>)</li>\n<li>Ability to expose Silverlight Applications 1.0 or Silverlight 2 Applications in SharePoint 2007 or WSS 3.0 websites</li>\n<li>Support for Silverlight 2 applications (.xap files)</li>\n<li>Enhanced Web Part Editor to expose only relevant properties when a plug-in version is selected</li>\n<li>No need to create a createSilverlight.js wrapper file to instantiate the Silverlight control (Silverlight 1.0)</li>\n<li>The Silverlight control parameters are configured via Web Part properties</li>\n<li>Each control is instantiated with an unique ID to avoid conflicts when using multiple Silverlight controls on the page</li>\n<li>Ability to specify multiple JavaScript code-behind files (Silverlight 1.0)</li>\n<li>Built-in default values for the most common Silverlight properties</li>\n<li>Ability to pass parameters to the Silverlight control via the initParams property</li>\n<li>No need to make changes to the SharePoint web.config file (e.g. configure Ajax Extensions)</li>\n<li>No need to have ASP.NET 3.5 Extensions installed (it doesn&#39;t use the ASP.NET Silverlight Control to instantiate the plugin)</li>\n<li>Ability to configure the image and URL to download Silverlight in case the plugin is not installed (by default points to Silverlight 2 Beta 2 installation file, but it can be manually configured)</li>\n<li>Ability to set Windowless property in order to use Transparent Color. Keep in mind that if you don&#39;t need this feature don&#39;t turn it on since it may have some performance issues (as per Silverlight documentation).</li>\n<li>This version has two new properties, Current User and Current Site. This allows you to retrieve the user and site and pass as a Initial Parameter to the Silverlight control. This gives you some flexibility to customize the control for the current logged user.</li>\n<li>The webpart dll is not installed on the GAC and can be shared between web applications.</li></ul>\n<br /><b>Known Limitations</b><br />\n<ul><li>The onLoad and onError events are not exposed via the SilverPart Web Part properties </li></ul>\n<br /><b>Planned Future Enhancements</b><br />\n<ul><li>Audience Targetting to show/hide Web Part based on security groups</li>\n<li>Implement Interface to allow connections between other webparts</li></ul>\n<br /><b>Documentation</b><br />\n<ul><li>SilverPart Installation Instructions - Coming soon</li>\n<li>SilverPart Configuration Instructions - Coming soon</li></ul>\n<br /><b>Use of CodePlex Projects</b><br />\n<ul><li>SilverPart uses The SharePoint SmartTemplates for Visual Studio available on CodePlex - <a href=\"http://www.codeplex.com/smarttemplates\">http://www.codeplex.com/smarttemplates</a></li></ul>\n<br /><b>License</b><br />\n<ul><li>Please check this project&#39;s license - <a href=\"http://www.codeplex.com/silverpart/license\">http://www.codeplex.com/silverpart/license</a></li></ul>\n\n<h4><u>Please report any errors using the Issue Tracker. Please read the license</u></h4>\r\nThe software is licensed &quot;as-is.&quot; You bear the risk of using it. The contributors give no express warranties, guarantees or conditions.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,SharePoint,MOSS,WSS,RIA,SilverPart,MOSS & Silverlight,",
  "LastEdited": "2011-03-01T08:29:55.413-08:00"
}