{
  "ProjectName": "SilverDB",
  "Title": "Silverlight Database",
  "Description": "This is database for Silverlight project that can be stored in Isolated Storage",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">News:<br />New release is posted on 8/23/2009<br /><br />This project implements a Isolated Storage (IsolatedStorage) based database for Silverlight.  The usage of this software is very simple.  You create a new database by Calling CreateDatabase.  You can add tables to the database by calling db.CreateTable&lt;T&gt; where T is the type of entity to be stored in table rows.  You can save database by calling Save, and open the database by calling OpenDatabase.  This database supports version changes, so you can update your application and still be able to open the database.   You can now also send/receive a database to/for WCF service without having to write any communicaiton code.  You can look for basic use of this database by examining test Silverlight application.  Encryption and compression have been implemented; just provide a password to use encryption.  Compression is based on SharpZipLib - you will have all the rights specified under that project.  See <a href=\"http://slsharpziplib.codeplex.com/license\">http://slsharpziplib.codeplex.com/license</a> for details.  Also lazy loading has been implemented.  If you open database with lazy loading flag, tables will be loaded when first accessed.  Feel free to look documentation help file under current download for API details.  The source code file contains unit test project that you can also examine for usage details.<br /><br />Here is a list features on the radar:\n<ul><li>Isolated Storage quota checks, possibly with ability to automatically request more space</li></ul>\n<br />If you are prompted for password for signed key file, it is &quot;SilverlightDatabase&quot;<br /><br />Please submit your comments and features requests, they are appreciated.<br />Let me know if you need additional documentation, and I will provide it.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Database,IsolatedStorage,Silverlight Database,",
  "LastEdited": "2009-08-23T10:53:37.913-07:00"
}