{
  "ProjectName": "SilverlightSocial",
  "Title": "Zune Social on Silverlight",
  "Description": "Zune Social cards built with Silverlight! Very early alpha, but hopefully more features coming soon!\r\n\r\nAny comments, suggestions or questions are appreciated.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Hello, all!<br /><br />This project was started as a fun, interesting way for me to learn Silverlight, C#, and data structures. The code is a bit ugly in places, and doesn&#39;t completely replicate the official Zune Card functionality, but bear with me; I&#39;m going to try and make it look and feel as close to the original as I can. If you&#39;ve got an idea about how to make it better (or better than the offical zCard), send me an e-mail at Adam <a href=\"https://silverlightsocial.codeplex.com/wikipage?title=at&referringTitle=Home\">at</a> ZuneThoughts.com or post in the forums there. <br /><br /><br /><br />Right now, this is what I&#39;ve got going on in version 1:<br />-Enter your Zune Tag in the box, and click the Run It button. Your Favorites, Recently Played, and three most popular songs from your eight most played artists will show up as text in the box at left.<br /><br />-Album art from a random album in this series of data will show up in the two album boxes. Right now this is more just for show, but the album, artist and track name show up in this space too.<br /><br />-Clicking either of the albums displays a new track, with its associated artist, album, and two album art pieces. It&#39;s pretty fun to just flip through this. You can go backwards and forwards through your albums with the + and - buttons.<br /><br />-To view another Zune Card, enter your friend&#39;s Zune Tag in the box and click Run It again.<br /><br /><br />Comments, questions, and coding help are always appreciated. Contact me at Adam <a href=\"https://silverlightsocial.codeplex.com/wikipage?title=at&referringTitle=Home\">at</a> ZuneThoughts.com, or come visit ZuneThoughts.com for questions and more Zune stuff.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Silverlight 2.0,Zune,",
  "LastEdited": "2008-12-18T19:30:06.41-08:00"
}