{
  "ProjectName": "silverlightheatmap",
  "Title": "Silverlight US Heat Map Control",
  "Description": "A Silverlight User Control for data visualization of simple State-Value data.\n\nThe programmer assigns data to the control (datatype Double) for each State in the US and a color for the map. The control will then display a vector map of the US with 10 different shades of the chosen color that varies with the value assigned to each state.  In order words if the programmer assigns the color Blue and California has a value of 100 while Nevada has a value of 80, Nevada will have a lighter shade of blue.  A color key appears in the bottom showing the range of values for each shade.\n\nThe end user can point to a state with the mouse and the value assigned to that state will be displayed.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A Silverlight User Control for data visualization of simple State-Value data.<br /><br />The programmer assigns data to the control &#40;datatype Double&#41; for each State in the US and a color for the map. The control will then display a vector map of the US with 10 different shades of the chosen color that varies with the value assigned to each state.  In order words if the programmer assigns the color Blue and California has a value of 100 while Nevada has a value of 80, Nevada will have a lighter shade of blue.  A color key appears in the bottom showing the range of values for each shade.<br /><br />The end user can point to a state with the mouse and the value assigned to that state will be displayed.<br /><br /><b>Sample URL</b><br />View an example at <a href=\"http://datawin-wwwroot.s3.amazonaws.com/USMapControlSample/MapControlSampleTestPage.html\">http://datawin-wwwroot.s3.amazonaws.com/USMapControlSample/MapControlSampleTestPage.html</a><br /><br /><b>Credits</b><br />Kenny Jacobson&#39;s site:<br /><a href=\"http://www.datawinconsulting.com\">http://www.datawinconsulting.com</a><br /><br />I used the XAML of the US map created by Maciej Skierkowski at:<br /><a href=\"http://blogs.msdn.com/sskier/archive/2007/04/22/united-states-map-in-xaml.aspx\">http://blogs.msdn.com/sskier/archive/2007/04/22/united-states-map-in-xaml.aspx</a><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2008-07-28T08:16:35.053-07:00"
}