{
  "ProjectName": "silvertile",
  "Title": "SilverTile",
  "Description": "Silverlight library for 2d tile-based games",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>A simple library for tile-based 2d games in Silverlight 4 (it should work in 3 as well).</b><br /><br />The source code incudes a sample game where you have two game areas and lots of monsters to hunt down. <br /><br /><img src=\"/projects/silvertile/9ac611f6-e364-4a01-b62e-1cde4948d989\" alt=\"SilverTile\" title=\"SilverTile\" /><br /><i>The graphics in the game are based on the graphics from the first The Legend of Zelda, but with slight modifications.</i><br /><br /><b>The library is almost feature complete now and offers the following:</b>\n<ul><li>A game surface control where your game is rendered\n<ul><li>This gives you an easy way to display the game while having regular silverlight controls for the UI of the game</li></ul></li>\n<li>Background tiles and moving sprites in the foreground\n<ul><li>Background sprites are static, but can be updated</li>\n<li>Foreground sprites are moveable and can be animated</li></ul></li>\n<li>Uses XAML for game design\n<ul><li>You can define your game areas in XAML</li>\n<li>You can setup all sprites and animations in XAML</li>\n<li>Infrastructure like area transitions and spawn points for enemies are also defined in XAML</li></ul></li>\n<li>Collision detection\n<ul><li>Two modes of collision detection are supported</li>\n<li>Either collides / does not collide (simple boolean check)</li>\n<li>Collision with direction (sprite 1 collides with sprite 2 at its left and bottom sides)</li></ul></li>\n<li>Game infrastructure\n<ul><li>You setup a GameWorld object that knows about the entire game</li>\n<li>The GameWorld can contain an unlimited number of game areas and sprites</li>\n<li>The GameWorld allows you to reuse objects to easily maintain game state</li></ul></li>\n<li>Pluggable architecture\n<ul><li>All SilverTile types are based on interfaces - this allows you to easily build your own implementations</li>\n<li>All types are overridable, no sealed classes</li>\n<li>While SilverTile does offer implementations you are free to replace any with your own </li></ul></li>\n<li>Test-driven development\n<ul><li>SilverTile was developed using a test-driver development methodology</li>\n<li>More or less all features are tested and all tests work properly</li></ul></li></ul>\n<br /><b><a href=\"http://blog.rag.no/post/SilverTile-Old-school-gaming-on-a-modern-platform-%28part-1-of-many%29.aspx\">See here</a> for my SilverTile developer diary.</b><br /><br />*Also, if you have Silverlight 4 installed, you can <a href=\"http://rag.no/st/SilverTile.html\">try out the sample application here</a>. I update the sample application every now and then, so it may not be entirely up-to-date.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-02-03T12:47:10.177-08:00"
}