{
  "ProjectName": "sltimezoneconv",
  "Title": "Silverlight TimeZone Converter",
  "Description": "This is free open-source library that provides you an easy and efficient method to convert date-time values between different time zones",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Silverlight TimeZone Converter</h1>\r<h5>This is free open-source library that provides you an easy and efficient method to convert date-time values between different time zones</h5>\r\nThis is a class library for Silverlight framework that provides logic to convert time from one timezone to another one.<br /><br /><br /><br />By default, Silverlight framework provides only ability to convert between UTC and local time zone(time zone on client PC).<br /><br />If you want to use different from local client timezone and interact with the server, there is no such possibility.<br /><br />Below is a use-case where the library can be helpful:<br />1) Data is stored on server (in any time zone, but for simplicity let&#39;s suppose in UTC)<br />2) Silverlight client accesses data through WCF<br />3) Data should be displayed with accounting on timezone user selected in application settings. It can be any zone regardless of his PC timezone.<br />4) That&#39;s why when Silverlight app gets data from CRM, it uses this library to convert data from UTC(or any other time zone) to the zone user selected.<br /><br /><br /><b>Also, library provides an easy way to interact with MS Dynamics CRM 2011 data with proper time zone conversion. It gets user settings where user time zone stored and client code can use TimeZone helper to convert all dates retrieved from MS CRM 2011 to user specific time zone (and vise versa)</b><br />\n<h5>For detailed instructions regarding how to use it go to <a href=\"https://sltimezoneconv.codeplex.com/documentation?referringTitle=Home\">documentation</a></h5>\r\n<h4>If you are experienced any issues write to us:</h4>\r<h4>1) Discussions tab</h4>\r<h4>2) Email discussion group: <a href=\"https://groups.google.com/d/forum/silverlight-timezone-converter\">https://groups.google.com/d/forum/silverlight-timezone-converter</a></h4></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2016-08-02T03:18:55.667-07:00"
}