{
  "ProjectName": "smf",
  "Title": "Microsoft Media Platform: Player Framework",
  "Description": "Microsoft's open source media player framework - a component of the Microsoft Media Platform. This project was formerly known as the Silverlight Media Framework (SMF). ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Microsoft Media Platform: Player Framework v2.7 </h1>\rfor Silverlight and Windows Phone<br />\n<h3>THIS PROJECT HAS MOVED TO <a href=\"http://PLAYERFRAMEWORK.CODEPLEX.COM\">http://playerframework.codeplex.com</a>. THIS PROJECT PAGE REMAINS ONLY FOR THE SILVERLIGHT AND WINDOWS PHONE 7 VERSIONS.</h3>\r\n<h4>Update 6/11/2012: New version (SMF 2.7) now available with support for the Smooth Streaming Client SDK (SSME 2.0) and a number of other bug fixes and improvements. See the downloads page for details.</h4>\r\n<ul><li>Want to learn more?  Check out the <a href=\"https://smf.codeplex.com/wikipage?title=SMF%20v2%20%22How%20To%22%20Documentation&referringTitle=Home\">SMF &#34;How To&#34; Documentation</a> for videos, online examples, sample code and more!</li>\n<li>Looking for a comprehensive HTML5-based Player Framework? Check out the MMPPF for HTML5 <a href=\"http://playerframework.codeplex.com\">here</a>. (We are in the process of merging these two projects and moving the content on this site over to that one.)</li></ul>\n\n<h2>Overview</h2>\r\n<h3>What is the Microsoft Media Platform: Player Framework (MMPPF)?</h3>\r\nMicrosoft&#39;s open source media player framework - a component of the Microsoft Media Platform. This project was formerly known as the Silverlight Media Framework &#40;SMF&#41;.  enables developers to quickly deploy a robust, scalable, customizable media player for <a href=\"http://www.iis.net/extensions/SmoothStreaming\">IIS Smooth Streaming</a> delivery. The MMPPF builds on the core functionality of the <a href=\"http://www.iis.net/download/SmoothClient\">Smooth Streaming Client</a> (formerly known as the &quot;Smooth Streaming Player Development Kit&quot;) and adds a large number of additional features, including an extensibility API that allows developers to create plugins for the framework. The MMPPF also now includes full support for Windows Phone 7 so developers can incorporate high-end video playback experiences in their Windows Phone 7 applications.<br /><br />The MMPPF is built on a proven code base with dozens of leading Smooth Streaming deployments, including Wimbledon, Sunday Night Football on NBCSports, the UEFA Super Cup on Canal+, Roland Garros and the Tour de France on France T&#233;l&#233;visions and many others and by providing developers with source code they can more easily build these experiences for their deployments. Key features in the framework include DVR, rewind, alternate language tracks, in-stream data feeds and analytics tracking. The MMPPF is designed for future third-party extensibility and component modularity, as well as support for other media delivery scenarios beyond Smooth Streaming. <br />\n<h3>New in version 2.x</h3>\r\nThe SMFv2 release introduces a whole new, more modular architecture with an extensive plug-in API for 3rd-party developers and partners. It will also enable developers to selectively exclude libraries that aren&#39;t needed in their projects in order to avoid unnecessary file size increases. The v2 framework will include plug-ins for <a href=\"http://www.w3.org/TR/ttaf1-dfxp\">Timed Text</a> (DFXP),URL frame linking, a metadata framework, support for the <a href=\"http://msaf.codeplex.com/\">Microsoft Silverlight Analytics Framework</a>, support for multiple audio tracks, improved bitrate monitoring, support for Silverlight 4 global styling, a JavaScript API, a logging plug-in, and a host of other new features. It also takes advantage of the new <a href=\"http://codebetter.com/blogs/glenn.block/archive/2009/11/29/mef-has-landed-in-silverlight-4-we-come-in-the-name-of-extensibility.aspx\">Managed Extensibility Framework (MEF)</a> in Silverlight 4. More information in this <a href=\"http://smf.codeplex.com/Thread/View.aspx?ThreadId=155396\">thread</a>...<br />\n<h3>Features</h3>\r<h4>New in v2</h4>\r<ul><li>Re-architected to be more modular, flexible</li>\n<li>Plugin API</li>\n<li>Accessibility support via W3C Timed Text standard for closed captioning (DFXP format)</li>\n<li>Support for multiple audio tracks</li>\n<li>Support for multiple SSME instances (used for multicam like in Sunday Night Football app)</li>\n<li>URL frame linking</li>\n<li>Improved bitrate monitoring</li>\n<li>Support for Silverlight 4 global styling</li>\n<li>Support for the Managed Extensibility Framework (MEF)</li>\n<li>JavaScript API</li>\n<li>Logging plugin</li>\n<li>Support for the <a href=\"http://msaf.codeplex.com\">Microsoft Silverlight Analytics Framework</a></li>\n<li>Documentation (API docs available now, detailed User Guide coming soon)</li>\n<li>Media plugins (IIS Smooth Streaming, Progressive Download, Windows Media Streaming, etc)</li>\n<li>Design-time DLL for improved authoring experience in Blend and Visual Studio</li>\n<li>MSI installer so all the right goo gets put in all the right places</li>\n<li>Smooth Streaming data graph overlay (used for demonstrating bitrate switching in live demos, useful for debugging)</li></ul>\n<br />New in SMF 2.2\n<ul><li>Added support for Windows Phone 7, this includes a new set of binaries and a new Solution included in the source download </li>\n<li>Updated SMF and SMF for Windows Phone to v1.1 of the Smooth Streaming Media Element </li>\n<li>Fixed an issue in SMFPlayer that was preventing the databinding of SMFPlayer.CurrentPlaylistItem from working correctly. </li>\n<li>Added PlaylistItem.Duration </li>\n<li>Added a fix to TimedTextmarkerProvider for an issue that was causing captions to only display for the first Playlist Item. </li>\n<li>Fixed an issue with TimedTextMarkerProvider that was preventing captions from displaying when SMFPlayer.IsStartPositionOffset = true </li>\n<li>In the previous release the Smooth Streaming and Progressive player examples were missing their HTML and ReadMe files, these have been added back for this release.</li></ul>\n<br />New in SMF 2.3\n<ul><li>Added support for the latest version of the <a href=\"http://www.iis.net/download/SmoothClient\">IIS Smooth Streaming Client (SSME v1.5)</a></li>\n<li>Fixed several bugs</li>\n<li>Added several API enhancements</li>\n<li>Improved design templates for Windows Phone 7</li>\n<li>See the downloads page for a full, detailed listing of changes in v2.3</li></ul>\n<br />New in MMPPF for Silverlight and Windows Phone 2.4 (formerly known as SMF)\n<ul><li>A new SMF plugin designed to capture health and diagnostic information for smooth streaming players. Captured information can then be sent to a variety of destinations including the new <a href=\"http://smf.cloudapp.net/healthmonitor\">Health Monitoring tool</a>.</li>\n<li>New smooth streaming health monitoring tool to visualize the health of a smooth streaming player. </li>\n<li>Sample app demonstrating how to capture basic health information locally within your player. </li>\n<li>Sample app demonstrating how to capture health information and send it to a remote server.</li>\n<li>See the downloads page for a full, detailed listing of changes in v2.4</li></ul>\n<br />New in MMPPF for Silverlight and Windows Phone 2.5\n<ul><li>Stereoscopic 3D support</li>\n<li>Standards based advertising support</li>\n<li>Fixed several bugs</li>\n<li>Uses SSME 1.5 Update 1</li>\n<li>See the downloads page for a full, detailed listing of changes in v2.5</li></ul>\n<br />New in MMPPF for Silverlight and Windows Phone 2.6\n<ul><li>Improvement: Windows Phone version targets Mango</li>\n<li>Improvement: Supports SSME 1.5 Update 2</li>\n<li><a href=\"http://smf.codeplex.com/workitem/list/advanced?keyword=&amp;status=Fixed&amp;type=Feature&amp;priority=All&amp;release=MMP%20Player%20Framework%202.6%20(Silverlight%20and%20WP7)%7CMMP%20Player%20Framework%202.6%20Beta%20(SL4%20and%20WP7)&amp;assignedTo=All&amp;component=All&amp;sortField=LastUpdatedDate&amp;sortDirection=Descending&amp;page=0\">18 new features</a></li>\n<li><a href=\"http://smf.codeplex.com/workitem/list/advanced?keyword=&amp;status=Fixed&amp;type=Issue&amp;priority=All&amp;release=MMP%20Player%20Framework%202.6%20(Silverlight%20and%20WP7)%7CMMP%20Player%20Framework%202.6%20Beta%20(SL4%20and%20WP7)&amp;assignedTo=All&amp;component=All&amp;sortField=LastUpdatedDate&amp;sortDirection=Descending&amp;page=0\">33 bug fixes</a></li></ul>\n<br /><b>Also includes all features from SMFv1.1</b> <a href=\"http://smf.codeplex.com/wikipage?title=SMF%20v1.1&amp;referringTitle=Home\">more...</a><br />\n<h3>Download</h3>\r<i>Click on the &quot;Downloads&quot; tab at the top of this page to access downloads for the SMFv2</i><br />\n<h3>Planned for future releases:</h3>\r<ul><li>Support for advertising standards like <a href=\"http://www.iab.net/vast\">VAST</a>, <a href=\"http://openvideoplayer.sourceforge.net/mast/mast_specification.pdf\">MAST</a> and VPAID via the plugin API</li>\n<li>Metadata framework</li></ul>\n<br /><b>NOTE: SMFv2 and the <a href=\"http://www.iis.net/download/SmoothClient\">IIS Smooth Streaming Client 1.0</a> require Silverlight 4 for deployment. For deployment to earlier versions of the runtime, take a look at <a href=\"http://smf.codeplex.com/wikipage?title=SMF%20v1.1&amp;referringTitle=Home\">Silverlight Media Framework 1.1</a> in the &quot;Downloads&quot; section of this site.</b><br /><br /><img src=\"/projects/smf/8efe25a0-7213-4fb6-9178-e907126575b6\" alt=\"MMPPF_SL_WP_Architecture_v2.6.jpg\" title=\"MMPPF_SL_WP_Architecture_v2.6.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Smooth Streaming,Video,IIS,DVR,Media,Framework,favorites,SMFsl4,Projects,wmv,",
  "LastEdited": "2013-02-07T15:16:46.343-08:00"
}