{
  "ProjectName": "soprism",
  "Title": "SoPrism",
  "Description": "SoPrism is a Solution Visual Studio Template using best practices to build a Silverlight composite application. This template generate a full Silverlight application based on a solid architecture including the Model-View-ViewModel (MVVM) pattern and PRISM framework.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><a href=\"https://soprism.codeplex.com/wikipage?title=Fran%c3%a7ais&referringTitle=Home\">Fran&#231;ais</a> \n<h3>Overview</h3>\rSoPrism is a Solution Visual Studio Template using best practices to build a Silverlight composite application. This template generate a full Silverlight application based on a solid architecture including the Model-View-ViewModel &#40;MVVM&#41; pattern and PRISM framework.<br />\n<h3>Details</h3>\rThis template creates a Silverlight composite application based on Prism Framework. The architecture is based on PRISM framework and includes Model-View-ViewModel (MVVM) pattern, a logging block, a configuration settings block and exception handling component in Silverlight. This template provides many components to help you build a composite silverlight application. This version of <b>SoPrism</b>  targets Microsoft Silverlight 4.0.<br />\n<h3>Demo</h3>\rA demo project based on SoPrism will be released soon on Codeplex. Please follow this project to be notified.<br />\n<h3>Notes</h3>\rThe <b>SoPrim</b> Visual Studio Template was shown for a session at Microsoft TechDays 2011 in Paris.<br />\n<h3>Additional Links</h3>\r<ul><li><a href=\"http://compositewpf.codeplex.com\">Prism 4.0</a></li>\n<li><a href=\"http://silverlight.codeplex.com\">Silverlight 4 Toolkit</a></li>\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff648951.aspx\">Enterprise Library 5.0</a></li>\n<li><a href=\"http://happynet.codeplex.com\">HappyNet 1.1</a></li></ul>\n\n<h3>Contact</h3>\rThis application has been developped and published thanks to So@t.<br />To visit our Silverlight website, here you go :  <a href=\"http://silverlight.soat.fr\">http://silverlight.soat.fr</a>.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Prism,MVVM,Visual Studio 2010,Composite,",
  "LastEdited": "2011-12-14T00:06:10.767-08:00"
}