{
  "ProjectName": "speedtest",
  "Title": "Speed Test",
  "Description": "Speed Test is a multi user test case management application designed for software testers. It is similar to TestLink, another open source app, but written for the desktop with reports provided via a Silverlight web app.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>ALERT: THIS PROJECT IS NO LONGER ACTIVE. In its current state, it is not suitable for production use. The software was originally designed to be used by the company that I worked for, but the conversion was delayed and delayed until it just died. The software has known issues that would have to be addressed before being used in a production environment. </b><br /><br /><b>Project Description</b><br />Speed Test is a multi user test case management application designed for software testers. It is similar to TestLink, another open source app, but written for the desktop with reports provided via a Silverlight web app.<br />Speed Test is finally in Beta. Please post any issues with either the installation or the applications on the Issue Tracker page. Enjoy!<br /><a href=\"https://speedtest.codeplex.com/wikipage?title=Screen%20Shots&referringTitle=Home\">Reports screen shots</a><br /><img src=\"/projects/speedtest/8ea4e72f-9944-4fe3-b92e-d5a05fda1a01\" alt=\"MainWindow.png\" title=\"MainWindow.png\" /><br /><br /><b>Components</b><br />\n<ul><li>Speed Test PG\n<ul><li>This is the main desktop applications that allows users to connect to the PostgreSQL database.</li></ul></li>\n<li>Speed Test Reports\n<ul><li>Composed of a Silverlight GUI and a .NET web service as a backend, the reporting apps allow reports on any aspect of the system. This particular piece is fairly portable and could be used on almost any project to provide reporting.</li></ul></li>\n<li>Speed Test Report Designer (future)\n<ul><li>The reporting app, while portable, does nothing to make report creation simpler. That is the function of this app. Eventually, this will be integrated with the Silverlight GUI, but is a .NET app for now.</li></ul></li>\n<li>Speed Test Server Setup\n<ul><li>This is a simple wizard that was created to simplify setting up the server, including creating the databases and loading the necessary data, as well as installed all of the required components.</li></ul></li></ul>\n<br /><br /><b>Features</b><br />Desktop GUI - Runs faster and provides quick access to the most commonly used features.<br />Simplified and functioning Bulk Assignments<br />Full Text Search across all elements (Plans, cases, suites, attachments, results)<br />Attachments<br />\tDrag and drop files or text<br />Execution History<br />XML Test Case Steps<br />\tSimplified entry in a list of steps, rather than a freeform text box.<br />\tAutomatic numbering of steps and results<br />User Display Preferences<br />Test case library<br />Organized platform for future features<br />Separate reporting system<br />More detailed reports<br />\tProgress by Environment <br />\tCase assignments to multiple users<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "testing,Silverlight 3,Reporting,Test Case,Test Suite,Test Plan,Desktop,PostgreSQL,Test,quality assurance,open source testing,open source,",
  "LastEdited": "2011-04-14T09:34:53.14-07:00"
}