{
  "ProjectName": "sso",
  "Title": "Single Sign On - Light Weight",
  "Description": "Single Sign On (SSO) solution for cross domain sites which do not share cookies, session ids etc.\n\nBuilt using WCF Service. A Silverlight based site is also added to see the Online Users and their requested Tokens (for testing purpose).",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><u><b>Project Description</b></u><br /><br />A light Weight Single Sign On Solution that helps the cross domains to allow single sign on. <br />This Solution depends on Token generation with different encryptions and the sites will use these tokens to bypass the login page of different applications.<br /><br />All the tokens have very short life time (configurable) so that it is practically impossible to break the encryption.<br /><br /><u><b>Application Run instructions</b></u><br />1) Run the application in a normal way by hitting <b>F5</b> or <b>Ctrl+F5.</b><br />2) By default, Silverlight based application is the startup one which displays the online users and their requested tokens for testing<br />    or monitoring purpose.<br />3) Invoke the Authentication Web Service in any fashion and call the methods one by one. <br />4) You will the calling results on Silverlight application.<br />5) You can use <u><b>SingleSignOn.Administration</b></u>, <u><b>FirstWebSite</b></u>, <u><b>SecondWebSite</b></u> to play with Single Sign On.<br /><br /><u><b>Request to Application User</b></u><br />1) Please feel free to send your comments or wish lists.<br />    Please use <b>Discussions</b> tab.<br /><br /><u><b>Technologies Used:</b></u><br />1) .Net 3.5<br />2) WCF - for authentication service<br />3) ASP.Net - for web site testing<br />4) Silverlight 2 - To track the service behavior of online users and their tokens.<br /><br /><u><b>Configurable Features</b></u><br />1) Login Time Out<br />2) Token Time Out<br />3) Recycle Time</div><div class=\"ClearBoth\"></div>",
  "TagList": "SSO,Single Sign On,",
  "LastEdited": "2009-09-23T21:20:47.2-07:00"
}