{
  "ProjectName": "streetscene",
  "Title": "StreetScene",
  "Description": "StreetScene is a sample project showing how to use Microsoft technologies such as ASP.NET, Azure and Silverlight to build rich applications.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Welcome to the CodePlex site for StreetScene. This project is designed to act as an accelerator built upon the Microsoft Platform using Azure and the .NET stack that can be used to help show how to create similar solutions and how to use properly some of the latest Microsoft technologies. This site is designed to hold the solution accelerator that we are distributing the source code for, allowing partners to collaborate and help with the development, of just feedback to use on bugs and issues. To see an online hosted demonstration of the solution below in action plase use the <a href=\"http://streetscene.cloudapp.net\">http://streetscene.cloudapp.net</a> site.<br /><br /><b>StreetScene</b> has high standards of code quality, and demonstrate how specific issues can be addressed; however they are not meant to be deployed &#39;as is&#39; into a production environment as they do not have the functional richness or manageability of a product. <b>StreetScene</b> can be quickly set up as a POC, allowing architects and IT Pros to get up to speed on the related concepts and technology, or to showcase capabilities to IT or Business Executives.<br /><br />Using StreetScene architecture, <a href=\"http://www.spenta.es/en-US/Pages/default.aspx\">Spenta</a> has developed <a href=\"http://www.streetcare.com/\">StreetCare</a>. This crowsourcing reporting tool, promotes citizen colaboration for a better care of the city.<br /><br />From a technology perspective, this project talks about Windows Azure, SQL Azure, AppFabric Access Control Services V2, Silverlight and BingMaps among others. Whilst from a developer perspective, this project talks about ASP.NET MVC2, M-V-VM, Unity, RIA Services, WCF and Entity Framework. Regardless of the point of view, <b>StreetScene</b> talks about helping you on using technology in a proper way to solve typical business scenarios.<br /><br /><b>StreetScene User Interface to view events</b><br /><br /><img src=\"/projects/streetscene/7cb79746-767f-4eef-b01b-b474cfc8e07f\" alt=\"ViewEvent.jpg\" title=\"ViewEvent.jpg\" /><br /><br /><b>StreetScene User Interface to create events</b><br /><br /><img src=\"/projects/streetscene/4b5b362d-bf4b-4351-8dbb-f56132d0be45\" alt=\"CreateEvent.jpg\" title=\"CreateEvent.jpg\" /><br /><br /><b>StreetScene Global Architecture</b><br /><br />The following diagram shows the main technologies and environments involved in the StreetScene application.<br /><br /><img src=\"/projects/streetscene/9d7c1186-93b9-461e-ba4a-23779e45af33\" alt=\"architecture.gif\" title=\"architecture.gif\" /><br /><br /><br />Brought to you by:<br /><br /><br /><img src=\"/projects/streetscene/ad726741-5d17-4a9f-9203-c0100ea1ff01\" alt=\"spenta.png\" title=\"spenta.png\" /><br /><br /><br /><b>Resources</b><br /><br />Technical documentation is available <a href=\"http://streetscene.codeplex.com/releases/view/59432\">here</a>.<br />Source code is available <a href=\"http://streetscene.codeplex.com/SourceControl/list/changesets\">here</a>.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-01-28T05:31:48.333-08:00"
}