{
  "ProjectName": "SyncStream",
  "Title": "SyncStream",
  "Description": "SyncStream is a seamless file synchronization utility with desktop client and a asp.net website. The user keeps his files under a certain a folder and everything in there is synchronized with the SyncStream website. The user can have multiple desktops and changing a file in a place will sync the files at other places. \n\nThe web client will be built with asp.net MVC framework and JQuery for javascript and fully Ajax supported UI. SyncStream will use SQL Server 2008/2005 for database. However the main storage will be provider based and initially the file system will be used as storage provider. We will add support for Amazon S3 and similar services. \n\nThere are several websites like LiveMesh, Dropbox  already in place. But this is going be a open source initiative. \n\nIn future a silverlight client may be developed as well to access remote files. \n\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />SyncStream is a seamless file synchronization utility with desktop client and a asp.net website. The user keeps his files under a certain a folder and everything in there is synchronized with the SyncStream website. The user can have multiple desktops and changing a file in a place will sync the files at other places. <br /><br />The web client will be built with asp.net MVC framework and JQuery for javascript and fully Ajax supported UI. SyncStream will use SQL Server 2008&#47;2005 for database. However the main storage will be provider based and initially the file system will be used as storage provider. We will add support for Amazon S3 and similar services. <br /><br />There are several websites like LiveMesh, Dropbox  already in place. But this is going be a open source initiative. <br /><br />In future a silverlight client may be developed as well to access remote files. <br /><br /><br /><br />We have just started to write the specification. The version 0.1 of the specification document which specifies the release 1.0 has been released. See the release section. We will be releasing files several times each week. We plan to have specification finished by the end of September. Development will continue while specification is being written. <br /><br /><b>Objectives for the first major Release</b><br />The goals of the project is to provide the following services:<br /><br />1. Seamless file sync with among different PCs<br />2. Web Based access for the files with Ajax<br />3. Support to store different revisions<br />4. File Sharing with peers and public file access<br />5. Zip file upload and extraction on the server<br />6. Download a folder as a zip file<br />7. Picture Gallery with Silverlight Support<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2008-09-24T01:07:40.197-07:00"
}