{
  "ProjectName": "tinycontainer",
  "Title": "Tiny Container",
  "Description": "TinyContainer is a minimal yet powerful Dependency Injection Framework and IOC Container.  This was initially written for Silverlight. And we also have a version for .NET 4 and Win Phone 7. And I have future plan for mono",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />TinyContainer is a minimal yet powerful Dependency Injection Framework and IOC Container.  This was initially written for Silverlight. And we also have a version for .NET 4 and Win Phone 7. And I have future plan for mono<br /><br /><b>The Philosophy of TinyContainer</b><br />  The main philosophy behind creating this container is to provide the minimal set of Container functionality for Silverlight and as well as for .net. There are a lot of IOC Containers available. But most of them are having a lot of features which you may not require in most of the cases. I have always looked for a simple and small IOC Container that does most of the frequently used functionality. So as they said the best way to get something you want is to create it, I created TinyContainer. <br /><br /><b>I want you to help me make it better</b><br />   It is still in its beta and does requires a lot of work to come as a stable product. If you like the idea of having a very tiny and fast IOC Container with all the frequently used functionalities please do contribute through coding, writing unit tests or simply by reporting bugs. <br /><br /><b>The Core</b><br />  At present If you download the source code you can also see in all the way the code works. It is at present having the following functions in the <b>IContainer</b> interface, the main interface of <br />the project.  <br />\n<ol><li><b>Register&lt;T&gt;(object)</b></li>\n<li><b>Register&lt;T,C&gt;()</b></li>\n<li><b>Resolve(type)</b></li>\n<li><b>Resolve&lt;T&gt;()</b></li>\n<li><b>IsRegistered&lt;T&gt;()</b></li>\n<li><b>Remove(object)</b></li></ol>\n <br />Please do check the <a href=\"https://tinycontainer.codeplex.com/documentation?referringTitle=Home\">documentation</a> section for method references.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,IOC,dependency injection,silverlight 4,",
  "LastEdited": "2011-06-22T14:06:09.97-07:00"
}