{
  "ProjectName": "triploa",
  "Title": "TripLOA",
  "Description": "TripLOA is a generalized Car sharing (it is trip sharing) Web based system. The system has been developed in the Application Oriented Laboratory at University of Pisa. The system provides support to users for posting trips and joining them (and provide anonymized communications and feedback). It is implemented in C# and uses maps (google and Virtual Earth. A nice feature is the integration with Facebook (and possiblty with other Social Networks) to suggest trips with potential friends, and the stats which are displayed using Silverlight that accounts for the amount of CO2 saved by sharing.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />TripLOA is a generalized Car sharing &#40;it is trip sharing&#41; Web based system. The system has been developed in the Application Oriented Laboratory at University of Pisa. The system provides support to users for posting trips and joining them &#40;and provide anonymized communications and feedback&#41;. It is implemented in C&#35; and uses maps &#40;google and Virtual Earth. A nice feature is the integration with Facebook &#40;and possiblty with other Social Networks&#41; to suggest trips with potential friends, and the stats which are displayed using Silverlight that accounts for the amount of CO2 saved by sharing.<br /><br /><br /><b>Introduction</b><br />In the CS master degree at University of Pisa there is a course called Application Oriented Laboratory (12 ECTS credits) whose goal is to make a large software development experience. For four months students (this year were 60) develop an application all together, following software development practices typical of software industries. Every year the application is released in Open Source form so that the huge amount of work has some hope to contribute not only to fill a line in the students records. This year the application has been really impressive, it is called TripLOA and it is a generalized form of car sharing, built on top of technologies such as ASP.NET, SQL 2008, Silverlight, Google maps and Virtual Earth, Java Mobile, and Windows Mobile. This year the application has become an <a href=\"http://triploa.di.unipi.it\">online service</a>.<br /><br />The goal of publishing this software is to share a large codebase and possibly maintain it if people is willing to contribute.<br /><br /><b>Just a glance</b><br />Since the system is live the best thing you can do is to go and try it, here are few screenshots.<br /><img src=\"/projects/triploa/f5b18809-341a-47c4-aa2f-c12adb12e239\" alt=\"tripscr.png\" title=\"tripscr.png\" /><br />Trip booking and creation is supported through WYSIWYG interface using Google maps and Virtual Earth.<br /><img src=\"/projects/triploa/0212ee3a-dc18-45a1-b6d9-298dc5907cb9\" alt=\"statsscr.png\" title=\"statsscr.png\" /><br />Statistics about trips, savings, a emission reductions made using Silverlight.<br /><img src=\"/projects/triploa/4c3473d0-890c-462c-9055-28f0263a4e3a\" alt=\"profscr.png\" title=\"profscr.png\" /><br />Feedback and control about personal information help creating network of trust. The use of Facebook API allows for friend list import.<br /><img src=\"/projects/triploa/8f584c63-ea43-4690-9146-5645e2570e18\" alt=\"mainscr.png\" title=\"mainscr.png\" /><br />Multi-language interface and access to mobile versions of the system.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2008-07-02T03:30:22.563-07:00"
}