{
  "ProjectName": "ultimateframework",
  "Title": "Ultimate Framework (Silverlight Navigation with Prism and Unity)",
  "Description": "Ultimate framework enables you to easily implement URL driven Silverlight LOB Application, leveraging Prism 4 and Unity for a Modular / Decoupled approach.  Supporting nested and parallel frames navigation in Silverlight with any UserControl object within Silverlight.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nUltimate framework enables you to easily implement URL driven Silverlight LOB Application, leveraging Prism 4 and Unity for a Modular / Decoupled approach. Supporting nested and parallel frames navigation in Silverlight with any UserControl objects.</p>\r\n<p><strong>Features at a glance</strong></p>\r\n<ol>\r\n<li>Unlimited nested Silverlight navigation frames </li><li>Unlimited parallel Silverlight navigation frames </li><li>Uri is always driven by the last child frame in the UI </li><li>New ViewCatalog with similar syntax to the ModuleCatalog in Prism for registering views.\r\n</li><li>Decoupled via Modules using Prism and Unity </li><li>MVVM friendly </li><li>Error handling within frames </li><li>Unauthorised view handling within frames </li><li>Module loading progress </li><li>Custom frame object can be used in any User Control object </li><li>All frames objects are Prism Region Driven, eg. &nbsp;Use of RegionContext within the frame object is still supported.\r\n</li><li>Additional View and Module Loading services for scenarios where a view needs to be loaded manually.\r\n</li><li>Helper command classes to easily bind to Double Click events for any UIElement objects.\r\n</li><li>Future support for transitions (TODO) :) or just extend the source code to inherit the frame object with any custom transition instead of the content control, eg. Telerik Transition control etc...\r\n</li><li>Frame controlled Back/Forward navigation for custom button back / forward binding, or MVVM friendly via Prism's NavigationContext in the view model.\r\n</li></ol>\r\n<hr>\r\n<p>The framework only supports Prism 4 and Unity as the DI container.</p>\r\n<p><a title=\"http://unity.codeplex.com/\" href=\"http://unity.codeplex.com/\">http://unity.codeplex.com/</a></p>\r\n<p><a title=\"http://unity.codeplex.com/\" href=\"http://unity.codeplex.com/\"></a><a href=\"http://compositewpf.codeplex.com/\">http://compositewpf.codeplex.com/</a><br>\r\n<br>\r\nThis robust framework addresses the need for having unlimited nested navigation frames, parallel navigation frames for Silverlight LOB Applications. It includes error handling, authentication, module loading (via prism module loader), helper command classes,\r\n etc... &nbsp;</p>\r\n<p>Build URI, MVVM friendly, modularised/decoupled solutions. &nbsp;</p>\r\n<p>Ultimate Framework extends the Prism framework by reusing some of the interfaces like INavigationAware and IConfirmNavigationRequest that works exactly the same way in Prism. &nbsp;It relies heavily on Unity as a DI and Prism's region implementation.</p>\r\n<p>Ultimate Framework comes with a Custom Frame Control that is basically a content control containing a Prism region object, so there is no need for the Silverlight Page Control / Frame Control anymore, as it will work with any User Control objects. &nbsp;</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p><strong></p>\r\n<hr>\r\nDownload the <a title=\"Sample Project\" href=\"http://ultimateframework.codeplex.com/releases/84440/download/355495\" target=\"_self\">\r\nexample</a>&nbsp;now!</strong>\r\n<p></p>\r\n<p>&nbsp;</p>\r\n<p><em>Documentations/Wiki coming soon!</em></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-03-18T20:59:47.017-07:00"
}