{
  "ProjectName": "views",
  "Title": "Virtual Earth Wrapper for Silverlight",
  "Description": "The Virtual Earth Wrapper for Silverlight (VIEWS) is a wrapper around the JavaScript Virtual Earth control that allows a developer to write a complex Virtual Earth Mashup using a managed language for all client-side scripting. This is accomplished by using the CLR (Common Language Runtime) support in Silverlight 2.0 (or later), and allows coding in C#, VB, Python, or other languages. Many developers already are using a managed language in ASP.NET for server-side tasks, now the same managed language can be used on the client-side as well, leveraging existing knowledge, and providing more continuity and consistency to the end-to-end solution.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2><i>VIEWS or the Virtual Earth Map Control for Silverlight?</i></h2>\rVIEWS was developed before the Virtual Earth Map Control for Silverlight was released. The Virtual Earth Map Control integrates much more tightly with the Silverlight runtime and provides you the ability to geographically align any visual element with the map. Therefore, the official Silverlight Map Control is recommended for the majority of Silverlight projects. However, VIEWS may still prove advantageous for mixed-mode (JavaScript + Silverlight) applications or where functionality is required that the AJAX control provides and the Silverlight control does not.<br /><br />The official Map Control for Silverlight is currently available through <a href=\"http://connect.microsoft.com/directory\">Microsoft Connect</a>. Chris Pendleton also provided a great <a href=\"http://videos.visitmix.com/MIX09/T34F\">introduction</a> to the control at Mix 2009.<br />\n<h2>Description</h2>\rThe Virtual Earth Wrapper for Silverlight &#40;VIEWS&#41; is a wrapper around the JavaScript Virtual Earth control that allows a developer to write a complex Virtual Earth Mashup using a managed language for all client-side scripting. This is accomplished by using the CLR &#40;Common Language Runtime&#41; support in Silverlight 2.0 &#40;or later&#41;, and allows coding in C&#35;, VB, Python, or other languages. Many developers already are using a managed language in ASP.NET for server-side tasks, now the same managed language can be used on the client-side as well, leveraging existing knowledge, and providing more continuity and consistency to the end-to-end solution.<br /><br />See a <a href=\"http://channel9.msdn.com/posts/jbienz/Virtual-Earth-Mapping-in-Silverlight-with-VIEWS\">demo of VIEWS</a> on Channel 9!<br />\n<h2>Documentation</h2>\rWe plan to provide additional documentation, but for now your best resource still remains the <a href=\"http://msdn.microsoft.com/en-us/library/bb429619.aspx\">Virtual Earth SDK</a>. We tried hard to strike the right balance between staying true to the SDK and providing a proper managed interface.<br /><br />For example, <a href=\"http://msdn.microsoft.com/en-us/library/bb429586.aspx\">VEMap</a> is still called <b>VEMap</b>, but the <a href=\"http://msdn.microsoft.com/en-us/library/bb429609.aspx\">onchangeview</a> event was renamed to <b>ViewChanged</b>. Another example is the implementation of the map events themselves. In JavaScript a <a href=\"http://msdn.microsoft.com/en-us/library/bb429584.aspx\">VEMapEvent</a> is passed to a method and the method returns <b>true</b> if the event has been handled. In our managed wrapper, <b>VEMapEvent</b> has been changed to <b>VEMapEventArgs</b> and this class exposes a Boolean <b>Handled</b> property. Finally, .Net <a href=\"http://msdn.microsoft.com/en-us/library/ms229002.aspx\">naming conventions</a> were followed, meaning that a lower case ‘x’ field will have become an uppercase ‘X’ property. We welcome your feedback on these changes.<br />\n<h2>Getting Started</h2>\rPlease see the <a href=\"https://views.codeplex.com/wikipage?title=Getting%20Started&referringTitle=Home\">Getting Started</a> page for instructions on getting VIEWS up in running in your own Silverlight projects.<br />\n<h2>Contributing to VIEWS</h2>\rWe welcome contributions from the community. Here are a few ways you can help:<br />\n<ul><li>Submit bug reports to the <a href=\"http://www.codeplex.com/views/WorkItem/List.aspx\">Issue Tracker</a></li>\n<li>Submit feature requests to the <a href=\"http://www.codeplex.com/views/WorkItem/List.aspx\">Issue Tracker</a></li>\n<li>Volunteer to fix a bug or implement a feature &lt;- Highly recommended :)</li>\n<li>If you would like to submit a bug fix or feature but aren&#39;t an ongoing contributor, please: </li>\n<li>Zip up your code and post them as an attachment to the work item.</li>\n<li>Follow the <a href=\"https://views.codeplex.com/wikipage?title=Assignment%20Agreement%20Instructions&referringTitle=Home\">Assignment Agreement Instructions</a> to become a code contributor (only needs to be done once, not for every submission).</li></ul>\n<br /><b>Please Note:</b> By posting your submission to the Issue Tracker, you agree to do so under the <a href=\"http://www.codeplex.com/Legal/terms.aspx\">CodePlex TOU</a>.<br />\n<h2>Special Thanks</h2>\rVIEWS was originally created by Adam Eversole as an internal Microsoft Research project. The wrapper was further refined and published by Jared Bienz.<br /><br />Thank you Adam and Microsoft Research for contributing this effort to the community!</div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Virtual Earth,",
  "LastEdited": "2009-04-29T12:28:24.07-07:00"
}