{
  "ProjectName": "virtualphotonics",
  "Title": "Virtual Photonics",
  "Description": "Virtual Photonics Technology Initiative",
  "MovedLink": "https://github.com/VirtualPhotonics/VTS/wiki",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Virtual Photonics Technology Initiative</h2>\rVirtual Photonics Technology Initiative<br /><br />View our <a href=\"http://www.virtualphotonics.org/\">project website</a>.<br />\n<h2>Acknowledgement</h2>\r<div style=\"clear:both;height:0;\">&nbsp;</div><a style=\"float:right;padding-left:.5em;\" href=\"http&#58;&#47;&#47;lammp.bli.uci.edu\"><img src=\"/projects/virtualphotonics/db514af3-75bf-44ba-805a-25cdebc0cf52\" alt=\"LAMMP\" title=\"LAMMP\" /></a> Use the following acknowledgement in publications or applications that make use of this open source software or underlying technology and research:<br /><div style=\"clear:both;height:0;\">&nbsp;</div><a style=\"float:right;padding-left:.5em;\" href=\"http&#58;&#47;&#47;www.nibib.nih.gov&#47;\"><img src=\"/projects/virtualphotonics/4d3f1d85-6082-48c5-b7aa-d97d228fb632\" alt=\"NIBIB\" title=\"NIBIB\" /></a> <b>&quot;This work was made possible in part by the Laser Microbeam and Medical Program (LAMMP: P41 EB015890-33), an NIH/NIBIB Biotechnology Resource Center.&quot;</b><br /><br /><div style=\"clear:both;height:0;\">&nbsp;</div><a style=\"float:right;padding-left:.5em;\" href=\"http&#58;&#47;&#47;www.nigms.nih.gov&#47;\"><img src=\"/projects/virtualphotonics/28a89de2-5784-436d-90ef-b566a18fbbaf\" alt=\"NIBIB\" title=\"NIBIB\" /></a> <br />The Virtual Photonics Technology Initiative has four primary goals:\n<ul><li>(a) Design and distribute easy-to-use open-source software tools with graphical-user interfaces that simulate the propagation and distribution of optical radiation in cells and tissues. </li></ul>\n\n<ul><li>(b) Supply educational resources that provide the appropriate foundation for the proper usage of these computational tools. </li></ul>\n\n<ul><li>(c) Develop improved computational models to simulate and design optical diagnostic, imaging, and therapeutic modalities. </li></ul>\n\n<ul><li>(d) Stimulate the formation of an active community of &#39;experts&#39; in Computational Biophotonics interested in offering their expertise and in developing advanced simulation tools to advance this open-source effort. </li></ul>\n<br />The primary vehicle for the accomplishment of these goals is the ongoing development of the Virtual Tissue Simulator (VTS). The VTS is being designed as a modular and scalable platform to provide an integrated suite of computational tools to define, solve, visualize, and analyze relevant forward and inverse radiative transport problems in Biomedical Optics. We intend to develop specific Application ToolKits (ATKs) that will provide a user-interface customized for the simulation of issues specific to an application domain. Examples include Small Animal Imaging and Fiber Optic Probe development.</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,Silverlight,Monte Carlo,Mie Simulation,",
  "LastEdited": "2013-08-23T13:42:31.19-07:00"
}