{
  "ProjectName": "vorbisplayer",
  "Title": "VorbisPlayer",
  "Description": "VorbisPlayer is the audio user control for Silverlight games. It plays loop-sets seamless, it solves the short sound problem, and it can play sound effects with low latency.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />VorbisPlayer is the audio user control for Silverlight games. It plays loop-sets seamless, it solves the short sound problem, and it can play sound effects with low latency.<br /><br /><br /><b>SeuJogo VorbisPlayer</b><br /><br />For the technical fundamentals, full credits go to Atsushi Eno’s <a href=\"http://veritas-vos-liberabit.com/monogatari/2009/03/moonvorbis.html\">MoonVorbis</a> and the Open Source community. MoonVorbis was wrapped into an easy-to-use Silverlight user control, to play Ogg Vorbis sound files.<br /><br />The VorbisPlayer is what everybody has been looking for. The VorbisPlayer solves the short sound problem, is able to play loop-sets seamless, and can play sound effects with low latency.<br /><br />The source code contains two Silverlight projects. <br /><br />One project contains the VorbisPlayer source code. This project can be compiled, and you can reference the resulting .dll in your own project.<br /><br />The second project contains examples, how to use the VorbisPlayer in different situations. Sound is not included. So the examples are only for illustration.<br /><br />The VorbisPlayer has been specifically developed to use in Silverlight games.<br /><br />Backgrounds on the research for this project is desribed in this <a href=\"http://www.seujogo.com/Blog/post.aspx?id=6c05d1c4-56f0-451d-bab9-0e8085ae856c\">article</a><br /><br />The player has been used in the Silverlight game <a href=\"http://www.seujogo.com/Game.aspx?gameId=43\">Slengo</a>.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,sound,mediastreamsource,game,games,ogg,vorbis,audio gap,seamless audio,",
  "LastEdited": "2010-06-10T14:43:17.693-07:00"
}