{
  "ProjectName": "wp7ci",
  "Title": "Windows Phone 7 Continuous Integration Testing Framework",
  "Description": "WP7 CI is a port of the Silverlight Toolkit Test Framework with added CI support, allowing tests to be run in the emulator from the command line",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />WP7 CI is a port of the Silverlight Toolkit Test Framework with added CI support, allowing tests to be run in the emulator from the command line<br /><br /><b>NOTE:</b> WP7-CI 1.1 (now with Mango support!) has a breaking change with 1.0 in that the MSBuild task is now called &quot;Test&quot; instead of &quot;RunUnitTests&quot;. See the <a href=\"https://wp7ci.codeplex.com/releases/view/72082\">download page</a> for a complete changelist.<br />\n<h2>Installation</h2>\r\nDon&#39;t have NuGet? A manual installation package is now available. Read the readme.txt!<br /><br />If you have NuGet, simply add the WP7-CI package from NuGet, which will do the following:<br />\n<ul><li>Add references to the <i>Microsoft.Silverlight.Testing</i> and <i>Microsoft.VisualStudio.QualityTools.UnitTesting.Silverlight</i> assemblies that ship with the package (removing existing references if they exist)</li>\n<li>Add an MSBuild task called &quot;Test&quot; to the project that can be called from the command line (it&#39;s configured by default to fail build if the tests fail)</li>\n<li>Add a TestsPage.xaml and set it as the startup page (you&#39;re free to remove this file)</li>\n<li>Add a SampleTest.cs which contains three tests (one pass, one fail, one error)</li></ul>\n<br />You can then run the tests:<br />\n<ul><li>In Visual Studio by setting the tests project as startup and hitting F5</li>\n<li>At the command line by running msbuild against the project and setting the target to &quot;Test&quot; (it will automatically build your project if required)</li></ul>\n<br />The log will be written to TestResult.trx in the same directory as the XAML output. See <a href=\"https://wp7ci.codeplex.com/wikipage?title=Build%20Properties&referringTitle=Home\">Build Properties</a> for properties that you can override at the command line.<br /><br />If your CI server is run by a windows service, you will need to enable &quot;Allow service to interact with desktop&quot; in the service&#39;s &quot;Logon&quot; options.<br />\n<h2>Features</h2>\r\n<ul><li>MSBuild task for executing tests in the WP7 OS from the command line\n<ul><li>Basic options for emulator vs device</li>\n<li>Adanced options for <a href=\"https://wp7ci.codeplex.com/wikipage?title=Configuring%20multiple%20OS%20emulators&referringTitle=Home\">selecting emulator images</a></li></ul></li>\n<li>Updated <span class=\"codeInline\">Microsoft.Silverlight.Testing</span> assembly that enables service-callback support for WP7</li></ul>\n\n<h2>Project Lifespan and Scope</h2>\r\nThis project will be terminated once there is official support for running in-emulator unit tests in a CI environment. Bug fixes and features will be limited to the automation of running unit tests on the WP7 operating system.<br />\n<h2>Known Issues</h2>\r\n<ul><li>The emulator is not closed after execution completes</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "WP7,",
  "LastEdited": "2011-08-21T12:58:53.717-07:00"
}