{
  "ProjectName": "wp7explorer",
  "Title": "Windows Phone 7 Isolated Storage Explorer",
  "Description": "WP7 Isolated Storage Explorer is a tool designed to help developers and testers interact with the isolated storage file for Silverlight Windows Phone 7 applications.\nThe explorer can work both as a desktop application for testers or integrated in Visual Studio for developers.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />WP7 Isolated Storage Explorer is a tool designed to help developers and testers interact with the isolated storage file for Silverlight Windows Phone 7 applications.<br />The explorer can work both as a desktop application for testers or integrated in Visual Studio for developers.<br /><br />Whenever a WP7 application/project involves storing data locally the the device, it will be to the isolated storage file.  A common difficulty is accessing the data for testing or rapidly restoring the application&#39;s data/state after the isolated storage has been reset, usually during the testing and development life-cycle.<br /><br />One of the usual workarounds has been to add code to handle data transfers (to a WCF service or a remote Web Service) or just hard code test data, but this takes a lot of time and migrating the code from one project to another can take significant effort.<br /><br />To help solve these issues and facilitate faster development for a WP7 application, the WP7 Isolated Storage Explorer includes the following features designed to make your life easier:\n<ul><li><b>Easy installer.</b> One simple setup file that sets everything up on a development or testing machine.</li>\n<li><b>Easy integration.</b> Add a single reference to your project and one line of code and you&#39;re done.</li>\n<li><b>Display the isolated storage file from multiple applications at the same time.</b></li>\n<li><b>Desktop client that handles all the common operations.</b>  The client handles operations such as bidirectional file transfer, creating folders, deleting files and folders and can perform parallel operations on multiple remote applications</li>\n<li><b>The same intuitive client integrated in Visual Studio.</b>  Developers can debug and check the data in the isolated storage file without leaving the IDE.</li>\n<li><b>Works in the background so your phone application will not be interrupted by operations.</b>  The explorer has been tested to handle invalid operations gracefully and to not interfere with the application&#39;s purpose.</li></ul>\n\n<h2><a href=\"https://wp7explorer.codeplex.com/releases/view/61282\">WP7 Isolated Storage Explorer v1.0 Beta</a> released</h2>\r<b>To learn how to used the WP7 Isolated Storage Explorer, check out the <a href=\"https://wp7explorer.codeplex.com/documentation?referringTitle=Home\">Documentation</a> page</b>\n<h3>Current release features:</h3>\r<ul><li>WPF desktop explorer client</li>\n<li>Visual Studio integrated tool window explorer client (Visual Studio 2010 Professional and above)</li>\n<li>Supported operations: Refresh (isolated storage information), Add Folder, Add Existing Item, Download File, Delete Folder, Delete File</li>\n<li>Explorer supports operations running on multiple remote applications at the same time</li>\n<li>Explorer detects application disconnect (1-2 second delay)</li>\n<li>Explorer confirms operation completed status</li>\n<li>Explorer displays application name, version and device type</li>\n<li>Explorer is visible in the Extension Manager in Visual Studio</li>\n<li>Explorer library available on the .NET tab in the Add Reference dialog</li>\n<li>Explorer supports reconnect after tombstone state restore</li>\n<li>Explorer service running as a windows service</li>\n<li>Service supports multiple explorer clients running at the same time</li>\n<li>Explorer library is crash safe (does not affect phone application)</li>\n<li>Single setup installs desktop client, Visual Studio tool window and explorer library</li>\n<li>Setup supports updates (removes old versions and installs the new version)</li></ul>\n<br /><table><tr><th> Desktop Explorer </th><th> Visual Studio integrated Explorer </th></tr>\n<tr><td> <img src=\"/projects/wp7explorer/4bd33959-2a78-4859-816c-0fb0b0a5b84a\" alt=\"209663\" title=\"209663\" /> </td><td> <img src=\"/projects/wp7explorer/9ebfa878-cdc5-432b-893d-9efd2439cbd7\" alt=\"209664\" title=\"209664\" /> </td></tr></table><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Visual Studio,Explorer,IsolatedStorage,Windows Phone 7,WP7,wp7dev,",
  "LastEdited": "2011-02-20T05:23:44.903-08:00"
}