{
  "ProjectName": "wp7iphone",
  "Title": "iPhone application for Windows Phone 7",
  "Description": "WP7iPhone is a Windows Phone 7 C# Silverlight app that mimics the famous iPhone interface. \n\nIt's completely useless, my main goal here was to teach myself more about Silverlight layout, animations, binding, etc.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><div class=wikidoc><b>Project Description</b>    <br>WP7iPhone is a Windows Phone 7 C# Silverlight app that mimics the famous iPhone interface.     <br>    <br>It's completely useless, my main goal here was to teach myself Silverlight layout, animations, binding, etc.</div>  <div class=wikidoc>   <br><a href=\"http://download.codeplex.com/download?ProjectName=wp7iphone&DownloadId=151299\"><img style=\"background-image:none;border-bottom:0px;border-left:0px;margin:;padding-left:0px;padding-right:0px;display:inline;border-top:0px;border-right:0px;padding-top:0px\" title=Capture border=0 alt=Capture src=\"http://download.codeplex.com/download?ProjectName=wp7iphone&DownloadId=151300\" width=351 height=651></a>    <br><b></b></div>  <div class=wikidoc><b>Current Status</b>    <br>    <br>The basic layout of the iPhone is present. There are two screens of apps which are inspired by the actual apps on my actual iPhone. There is also a nonfunctional placeholder for the search page. You can swipe around to switch between pages and that works nice.    <br>    <br>If you press and hold on the screen, all the icons will go into &quot;wobble mode&quot;. Just like the iPhone this lets you rearrange and delete apps. Press and hold again to return to normal mode. Your icons and their position will be remembered across runs. (but if you close the emulator and restart it, all the customization gets wiped out)    <br>    <br>I don't have an actual Windows Phone, just the emulator. So if you have a phone and want to try this, that would be great. If you want to send me a phone so I can try it, that would be even better!    <br>    <br><b>Problems and Issues</b>    <br>    <br>The way I had to implement &quot;wobble mode&quot; seems like a huge hack. Everything in the Silverlight docs says &quot;don't use Triggers&quot; but I couldn't wrap my mind around the whole VisualStateManager/control template goo. Then I thought I could just change the data template on the fly, but that's broken in SL3. I pounded my head against this for a while and finally gave up and used Triggers. Works great.    <br>    <br>There doesn't seem to be a way for the app to get input from the hardware buttons. That's why you have to hold to exit &quot;wobble mode&quot; instead of pushing the button. It also means there is no double-click to access the multi-tasking dock.</div>  <div></div></div><div class=\"ClearBoth\"></div>",
  "TagList": "Windows Phone 7,",
  "LastEdited": "2010-09-17T15:22:37.963-07:00"
}