{
  "ProjectName": "WPBlogMenu",
  "Title": "Windows Phone Blog Menu",
  "Description": "A Silverlight navigation control that looks like a Windows Phone 7. The live tiles are links to websites. Use this control on your blog or website to show your love for WP7. It is a creative way to link to external sites you are interested in.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><table><tr><td><object data=\"data:application/x-silverlight-2,\" type=\"application/x-silverlight-2\" style=\"height:470px;width:250px;\"><param name=\"source\" value=\"http://scottkdavis.com/ClientBin/WPBlogMenu.xap\"></param><param name=\"windowless\" value=\"true\"></param><param name=\"minRuntimeVersion\" value=\"4.0.50401.0\"></param><param name=\"autoUpgrade\" value=\"true\"></param><p>You need to install Microsoft Silverlight to view this content. <a href=\"http://go.microsoft.com/fwlink/?LinkID=149156&v=4.0.50401.0\" style=\"text-decoration:none;\">Get Silverlight!<br /><img src=\"http://go.microsoft.com/fwlink/?LinkID=108181\" alt=\"Get Microsoft Silverlight\" style=\"border-style:none;\" /></a></p></object><iframe style=\"visibility:hidden;height:0;width:0;border-width:0;\"></iframe></td><td> <b>Windows Phone Blog Menu</b> is a Silverlight navigation control that looks like a Windows Phone 7. The live tiles in the control are links to websites. Use this control on your blog or website to show your love for WP7. It is a creative way to link to external sites to show your interests.  <b>Unfortunately, CodePlex blocks Silverlight access to the Browser DOM</b>, so navigating from the sample control on the left is not enabled.  Visit <a href=\"http://www.ScottKDavis.com\">http://www.ScottKDavis.com</a> to view the control in action.  See below for more information</td></tr></table><br />\n<h1>Features</h1>\r<ul><li>The applications arrow (top right) offers the ability to display full page content in the control beyond just the tiles </li>\n<li>Static tiles are implemented as you see fit, such as images or XAML elements (eg. path objects)</li>\n<li>Two animated live tile controls are included in the project, one that flips and one that doesn&#39;t</li>\n<li>Customize the tiles and behaviors to suit your needs</li>\n<li>If you use this project please consider including a link back to the project website somewhere in your application</li></ul>\n\n<h1>How can I contribute?</h1>\rMany improvements can be made to this control. Here are my top 3 suggestions.\n<ul><li>Create a slide effect to allow more than 8 tiles on the phone</li>\n<li>Twitter and Facebook status integration with live tiles</li>\n<li>Add functionality to the Back, Home, Search hardware buttons</li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-05-30T11:08:22.637-07:00"
}