{
  "ProjectName": "WSSListActivityAgWP",
  "Title": "SharePoint List Activity - Silverlight web part",
  "Description": "WSS v3 web part that uses Silverlight 2.0 to display list activity (new and modified items) in the last two days. Web Part properties (per user) are used to configure Silverlight display options such as showing lists with no activity, opening list links in a new window or the same window, colors for bar graph formatting, URL of the site (relative to current site or server), and site title in web part display options. Multiple web parts can run concurrently on the same page, showing list activity from multiple sites at the same time.\n\nServer context takes security into account, trimming display of item counts (not counting items to which the logged-on user has no access).",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rWSS v3 web part that uses Silverlight 2.0 to display list activity &#40;new and modified items&#41; in the last two days. Web Part properties &#40;per user&#41; are used to configure Silverlight display options such as showing lists with no activity, opening list links in a new window or the same window, colors for bar graph formatting, URL of the site &#40;relative to current site or server&#41;, and site title in web part display options. Multiple web parts can run concurrently on the same page, showing list activity from multiple sites at the same time.<br /><br />Server context takes security into account, trimming display of item counts &#40;not counting items to which the logged-on user has no access&#41;.<br /><br /><img src=\"/projects/WSSListActivityAgWP/24e138c2-4dac-4f64-81c6-d67d34536fba\" alt=\"ListActivityWebPart&#32;1.png\" title=\"ListActivityWebPart&#32;1.png\" /><br />\n<h1>Requirements</h1>\r<h2>Server</h2>\r<ul><li>Windows SharePoint Services v3</li>\n<li>Ability to deploy a solution</li></ul>\n\n<h2>Client</h2>\r<ul><li>Silverlight 2.0 (formerly and still occasionally known as 1.1)</li>\n<li>Internet Explorer <i>or</i> another Silverlight-able browser</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight 2.0,Silverlight,Sharepoint,WSS 3.0,WSS,Web Part,Alicia Project,silverlight webpart,",
  "LastEdited": "2008-02-28T18:24:05.477-08:00"
}