{
  "ProjectName": "XamlCodeSnippets",
  "Title": "XAML Code Snippets addin for Visual Studio 2010",
  "Description": "Provides support for adding XAML code snippets in the Visual Studio 2010 code editor for XAML in WPF and Silverlight projects.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Provides support for adding XAML code snippets in the Visual Studio 2010 code editor for XAML in WPF and Silverlight projects.<br /><br />The addin has been <b>written in Visual Basic 2010</b> and actually targets <b>Visual Studio 2010 RTM</b>. It uses and creates classic .Snippet files for XML syntax. At runtime the XML markup is simply pasted as XAML in the code editor. You use it as follows:<br /><br />1. to insert a code snippet, right click the code editor and select <b>Insert XAML Code Snippet</b> from the context menu:<br /><br /><img src=\"/projects/XamlCodeSnippets/09467f2d-46f6-46ef-8974-05975235922f\" alt=\"XamlSnippets1.jpg\" title=\"XamlSnippets1.jpg\" /><br /><br />2. in the appearing dialog select the folder containing your XML .Snippet files and then select the desired snippet:<br /><br /><img src=\"/projects/XamlCodeSnippets/93e0fa3a-eb64-4106-aa03-b8286f6823af\" alt=\"XamlSnippets2.jpg\" title=\"XamlSnippets2.jpg\" /><br /><br />   Notice that if you pass the mouse over the <b>Code</b> cell, a tooltip will show the full markup:<br /><br /><img src=\"/projects/XamlCodeSnippets/87d8065e-c1cf-481c-838f-5d093022b90b\" alt=\"XamlSnippets3.jpg\" title=\"XamlSnippets3.jpg\" /><br /><br />3. Click <b>Insert Snippet</b>, and your code snippet will be added to your XAML code:<br /><br /><img src=\"/projects/XamlCodeSnippets/331e4fa8-4c8a-4c49-9fc8-6dc0cdb0497e\" alt=\"XamlSnippets4.jpg\" title=\"XamlSnippets4.jpg\" /><br /><br />4. To export some code to a .Snippet file for XML, simply select the code and right click. Then choose the <b>Export selection as XAML Snippet</b> command from the context menu. In the appearing dialog specify the snippet properties and click <b>Export</b>:<br /><br /><img src=\"/projects/XamlCodeSnippets/59dfe1cc-fc16-4467-abc1-15b1907ae809\" alt=\"XamlSnippets5.jpg\" title=\"XamlSnippets5.jpg\" /><br /><br /><b>LIMITATIONS AND FUTURE IMPROVEMENTS</b><br />There are some limitations: for example, the addin creates dialogs for inserting and exporting snippets. This is because the XAML code editor doesn&#39;t actually support code snippets like in VB or C# editors; then, in order to browse for snippets subfolder you need to click the &quot;...&quot; button each time you want to move to a different folder; another limitation is that you need to manually organize snippets in subfolders. Also, there is no support for the Code Snippet Manager tool (and the reason is still that the XAML editor has no native snippets support).<br /><br />Developed by Alessandro Del Sole, Microsoft MVP<br /><br /><b>FEEDBACK</b><br />Please provide your feedback. I&#39;m very interested in understanding if you like using the classic .Snippet file format by storing XAML code in the form of XML.</div><div class=\"ClearBoth\"></div>",
  "TagList": "VS2010,VSX,VB.NET,xaml,",
  "LastEdited": "2011-11-13T08:08:26.423-08:00"
}