{
  "ProjectName": "XtCover",
  "Title": "XtCover",
  "Description": "It stands for eXTreme COVERage, a web based .NET code coverage reporting tool on top of VS CoveragAPIs. It provides the coverage summary in an enhanced way what VS tools does not Provide.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>What is code coverage?</b><br /><br />Code coverage is a measure used in software testing that describes the degree to which the source code of a program has been tested. The analysis finds the following areas<br /><br />\tFinding areas of a program not exercised by a set of test cases<br /><br />\tWhere developers need to create more test cases to increase the coverage<br /><br />Code coverage doesn&#39;t directly help you write better code, but it does help you write better tests, which in turn help you write better code. Code coverage will uncover execution paths that are not being exercised by your tests.<br /><br /><b>Code coverage Instrumentation</b><br /><br />Code coverage is a feature available in Visual Studio Team Edition for developers, testers and in Team suite also. Visual Studio uses block based statement (also known as C1 coverage) and condition coverage methodology. A block is commonly defined as a sequence of instructions that have a single entry point and a single exit point. We can consider an exit point to be a branch instruction, a function call, a return instruction or a throw instruction.<br /><br />To get the coverage of source code, the test assemblies need to be instrumented by having MSTest.exe in place with MSBuild commands or through VSTS instrumentation options. Once the instrumentation is done the coverage file will be available for getting reports out of it. <br /><br />VSTS is capable of opening the coverage file but if you want to open in some other reporting tool, you should convert the coverage file to the intended format of that reporting tool.<br /><br />Ref: <a href=\"https://xtcover.codeplex.com/wikipage?title=http%3a%2f%2fmsdn.microsoft.com%2fen-us%2flibrary%2fms182534%28VS.80%29.aspx&referringTitle=Home\">http&#58;&#47;&#47;msdn.microsoft.com&#47;en-us&#47;library&#47;ms182534&#40;VS.80&#41;.aspx</a><br /><br /><br /><b>XTCover – An Intro</b><br /><br />It stands for eXTreme COVERage, a web based .NET code coverage reporting tool. It provides the coverage summary in an enhanced way by using web technologies such as ASP.NET 3.5, Silverlight 3 to reveal very decent look and feel and user friendly navigation options. The main intention of this tool is that developers can be focused on the code areas where they should give more attention to increase the coverage of the source code.<br /><br />The tool can be integrated with continuous integration process or leverage as a stand-alone coverage reporting tool. Besides that the tool is capable of automating MSTest coverage instrumentation process.See the other Project <a href=\"http://netbuildconfigurator.codeplex.com\">netbuildconfigurator</a> for how to use these details report in ContinousIntegration process.This tool Provides Architects a quick and effective look at the coverage Details.<br /><br />The input of this tool is the Coverage.xml generated from VSTS CodeCoverage or other Sources and Provide meaningful and effective Reporting to analyse the Code Coverage.<br /><br />A new Video is Uploaded now which Demonstrate the Configuration part ,Soon We will upload more Screencasts which talks about the Architecture and Code Walk through.<br /><br /><br /><b>Features of the tool</b><br /><br />1. Capable of MSTest instrumentation and creation of coverage source based on required parameters (VSTS license is required)<br /> <br />2. Developers can choose their specific coverage source for reporting<br /><br />3. Easy navigation to show coverage statistics, aggregates and graphs for module, namespace, class, method and line level <br /><br />4. Tag cloud reports from module or package to class level<br /><br />5. Source code display for respective classes and methods and highlighting  covered / non-covered / partially covered lines of code<br /><br />6. User will be focused to specific line level by selecting method names<br /><br />7. Tool can be integrated with Continuous Integration process or can be used as a stand-alone product<br /><br />XTCover Dashboard Look and Feel :- <br /><img src=\"/projects/XtCover/9d433f3c-31ce-4441-b795-242eecd81446\" alt=\"Xtcover.png\" title=\"Xtcover.png\" /><br /><br /><img src=\"/projects/XtCover/f149de52-9049-4fac-9328-047dedaadc27\" alt=\"XtCoverReport2.png\" title=\"XtCoverReport2.png\" /><br /><br /><img src=\"/projects/XtCover/89d6906f-abd3-40aa-8b3b-3dc0723cc905\" alt=\"XtCoverReport3.png\" title=\"XtCoverReport3.png\" /><br /><br /><img src=\"/projects/XtCover/d606f953-f694-4dd8-aed4-7e92a6599f3b\" alt=\"XtCoverReport4.png\" title=\"XtCoverReport4.png\" /><br /><br /><img src=\"/projects/XtCover/e3953816-ff62-4b3d-93ee-08770d2df933\" alt=\"XtCoverResult.png\" title=\"XtCoverResult.png\" /><br /><br />XTCover features comparison :- see the code section<br /><br />A new Video is now Uploaded to the Site Which Demonstrate Configuration needed for this tool.<br /><br /><b>Next version </b>:- This version which work on VS2k8 does not use the codecoverage api improvements like VS2010.The next version will contain the API improvement.<br />Described here <a href=\"https://xtcover.codeplex.com/wikipage?title=http%3a%2f%2fblogs.msdn.com%2fphuene%2farchive%2f2009%2f12%2f01%2fprogrammatic-coverage-analysis-in-visual-studio-2010.aspx&referringTitle=Home\">http&#58;&#47;&#47;blogs.msdn.com&#47;phuene&#47;archive&#47;2009&#47;12&#47;01&#47;programmatic-coverage-analysis-in-visual-studio-2010.aspx</a><br /><br />Related Articles<br /><br />http://social.msdn.microsoft.com/forums/en-US/tfsbuild/thread/9d7ce662-3539-4dc7-a007-cf57ad2ef859/<br /><br />http://arcware.net/executing-vsts-unit-tests-and-code-coverage-from-the-command-line/<br /><br />*Also see My blog post @<a href=\"http://shreeman.spaces.live.com\">http://shreeman.spaces.live.com</a><br /><br />Please Submit your feedback on this tool.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Code Coverage,VSTS Code coverage,Clover,Ncover,PartCover,VS 2008,VS 2010,Code Coverage Api,Silverlight,instrumentation,Mstest,.NET,ASP.NET,AJAX,C#,LINQ,Visual Studio,",
  "LastEdited": "2010-02-26T08:16:54.303-08:00"
}