{
  "ProjectName": "animationcomponents",
  "Title": "XNA Animation Component Library",
  "Description": "The goal is to make a library of animation components that allows programmers to easily animate their models.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>News 8-31-2012</h2>\r\n<b>I updated the source code to work for XNA 4.0, but due to the uncertain future of XNA, I am going to hold off on updating the rest of this site.</b><br /><br /><b>The source code has been updated to support XNA 4.0, but the binaries have not. Also, you will need to use your own effect instead of the BasicPalleteEffect due to changes in the XNA framework. I will be making a new release soon and updating the tutorial.</b><br /><br /><b>For a quick and easy test of the new code, download the following and compile it after updating to the latest version of XNA. It will demonstrate the completed tutorial:</b><br /><a href=\"http://download-codeplex.sec.s-msft.com/Download?ProjectName=animationcomponents&amp;DownloadId=478827\">http://download-codeplex.sec.s-msft.com/Download?ProjectName=animationcomponents&amp;DownloadId=478827</a><br /><br />The wonderful model used in the tutorials was made by Psionic (<a href=\"http://www.psionic3d.co.uk\">http://www.psionic3d.co.uk</a>) and he was kind enough to let me use it.<br /><br />- <b>Beta release 1.0.2.0 is out.</b><br /><br />- <b>See changelog in release section for changes.</b><br />\n<h2>Tutorials</h2>\r- <b>Tutorials are not updated yet for the new release, so not all sections are guaranteed to work.</b><br />- <b>Click here: <a href=\"https://animationcomponents.codeplex.com/wikipage?title=Tutorial%20Home&referringTitle=Home\">Tutorial Home</a> to visit the tutorial section.</b><br />\n<h2>FAQ</h2>\r<ul><li>How do I use this library? \n<ul><li>A: <i>You can learn how to use the library by taking the tutorial at <a href=\"https://animationcomponents.codeplex.com/wikipage?title=Tutorial%20Home&referringTitle=Home\">Tutorial Home</a></i></li></ul></li>\n<li>What types of animations does the library support?\n<ul><li>A: <i>The library supports skinned and unskinned bone animations, and mesh hierarchy animations.</i></li></ul></li>\n<li>What are the features of the library?</li></ul>\n- Skinned and unskinned animation<br />- Models with multiple meshes<br />- Ability to split up single animations into multiple animations based on xml file configuration<br />- Animations pre-interpolated to 60 frames per second in pipeline<br />- Works on fbx, x, asf/amc, and bvh formats<br />- Custom ASCII .X importer works on some models that XNA .X importer rejects<br />- Works on models with any number of bones (if a mesh has too many bones for the shader, splits the mesh up into multiple meshes)<br />- Animation blending<br />- Allows each bone to be attached to a different animation controller<br />- Allows manual setting of bone transforms<br />- Framework for custom content pipleine animation and model processing<br />- Allows use of custom .fx effects<br />- Has a model viewer that works like directx mesh viewer<br />- Allows objects to be attached to bones\n<ul><li>What file formats and importers does the library support?\n<ul><li>A: <i><a href=\"https://animationcomponents.codeplex.com/wikipage?title=Supported%20File%20Formats&referringTitle=Home\">Supported File Formats</a></i></li></ul></li>\n<li>How do I compile the source for Windows or XBox 360?\n<ul><li>A: <i><a href=\"https://animationcomponents.codeplex.com/wikipage?title=Compilation%20Info&referringTitle=Home\">Compilation Info</a></i></li></ul></li>\n<li>In the ModelAnimator, why do I need to set the World Matrix but not the View and Projection matrices?\n<ul><li>A: <i><a href=\"https://animationcomponents.codeplex.com/wikipage?title=Setting%20View%2fProjection%20Matrices&referringTitle=Home\">Setting View&#47;Projection Matrices</a></i></li></ul></li>\n<li>In the ModelAnimator, where is the code that draws the model?\n<ul><li>A: <i><a href=\"https://animationcomponents.codeplex.com/wikipage?title=Drawing%20Code&referringTitle=Home\">Drawing Code</a></i></li></ul></li></ul>\n\n<h2><a href=\"https://animationcomponents.codeplex.com/wikipage?title=Troubleshooting&referringTitle=Home\">Troubleshooting</a></h2>\r\n<h2>Project Description</h2>\r\nThe goal of this project is to make a library of animation components that allows programmers to easily animate their models.  The XNA framework makes many parts of game development very comfortable, but due to time limitations and inconclusive feedback from the DirectX solution to animation, they have decided to exclude an animation framework in their API.</div><div class=\"ClearBoth\"></div>",
  "TagList": "watch,XNA,engine,skinning,Animation,XA Animation,Animate,Xna Component,XNA - Animation,elapsedtime,.NET XNA,bDownload,",
  "LastEdited": "2012-08-31T13:51:52.77-07:00"
}