{
  "ProjectName": "aspritece",
  "Title": "ASpriteCE",
  "Description": "An ActiveX Control for the Pocket PC which allows the creation of 2D games and animation.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Welcome to the ASpriteCE OPEN SOURCE PROJECT</b><br /><br />ASpriteCE was originally released as a developers add-on tool for eMbedded Visual Basic users. Quickly NSBasic users realized that the same graphics tool worked well within NSBasic. Originally released in October 2001, ASpriteCE was sold for $24.95 as a commercial license allowing H/PC and Pocket PC developers to write graphically rich and fast games using the BASIC language royalty free.  No other add-on existed then or even now to allow for fast graphics manipulation with NSBasic.<br /><br />The original developer-author of ASpriteCE has gratiously opend the door to allow ASpriteCE to be available under the OPEN SOURCE licensing. Andy Beaulieu has setup this CODEPLEX project and welcomes all NSBasic users to participate in the OPEN SOURCE project to help maintain and improve the core ASpriteCE graphics engine. With the existing ASpriteCE engine, you can still create some interesting games and non game graphical applications. You will find some interesting sample files in the complete download file which includes detailed documentation in html and xml file formats. For those interested in seeing the documentations first, can easily download the separate docs.zip file only. I welcome all new and old NS Basic developers interested in adding some unique features to ASpriteCE to discuss the ideas in the discussion section. The <b>original source code was developed using Microsoft eMbedded C++ V3.0.</b> Anyone interested in helping out with modifications and additions should have EVC++ V3.0 running on a Windows XP or older operating system. <br /><br />There is an excellent tutorial written by Andy Beaulieu located on www.devbuzz.com <a href=\"http://www.devbuzz.com/Archived/zinc_evb_aspritece_pg1.aspx\">http://www.devbuzz.com/Archived/zinc_evb_aspritece_pg1.aspx</a><br /><br />To see and download a trial of an excellent game written using ASpriteCE go to <a href=\"https://www.handango.com/AdminProductDetailView.jsp?siteId=1&amp;jid=EE7X13C81DXD8F4EXA4925X21454FF77&amp;productId=51335&amp;platformId=1&amp;productType=2\">https://www.handango.com/AdminProductDetailView.jsp?siteId=1&amp;jid=EE7X13C81DXD8F4EXA4925X21454FF77&amp;productId=51335&amp;platformId=1&amp;productType=2</a> <br /><br /><b>Pocket Circus</b><br /><img src=\"http://www.technobrains.com/images/game3.gif\" /><br /><br /><b>Bob Katayama</b><br /><br /><a href=\"http://www.nsbasic.com/ce\">http://www.nsbasic.com/ce</a><br /><a href=\"http://groups.yahoo.com/group/nsbasic-ce/join\">http://groups.yahoo.com/group/nsbasic-ce/join</a><br /><br /><b>Project Description</b><br />An ActiveX Control for the Pocket PC which allows the creation of 2D games and animation.<br />\n<h1>ASpriteCE Programmer&#39;s Reference  </h1>\r<h2>The Control methods are divided into eight logical sections:  </h2>\rDraw - for initializing the display and drawing backgrounds.  <br />Input - for handling user input via stylus and buttons.  <br />Script - for scripting against ASpriteCE.  <br />Sound - for loading and playing sound effects.  <br />Sprite - for loading and moving sprites, and detecting collisions.  <br />Text - for displaying text.  <br />Tile - for creating scolling, tiled games.  <br />Timer - for creating basic and custom timers.  <br />Utility - various utility functions for memory and math.  <br />\n<h1>Draw Methods and Properties  </h1>\rDrawAutoFlipBackBuffer  <br />DrawBackgroundImage  <br />DrawBackgroundScroll  <br />DrawBackgroundScrollGetOffsets  <br />DrawBackgroundScrollSetOffsets  <br />DrawBackgroundShouldScroll  <br />DrawBackgroundSprite  <br />DrawDisable  <br />DrawFlipBackBuffer  <br />DrawFloodFill  <br />DrawFullScreen  <br />DrawGetDimensions  <br />DrawGetPixel  <br />DrawHwndControl  <br />DrawInit  <br />DrawLine  <br />DrawRectangle  <br />DrawRedrawBackground  <br />DrawSetBackColor  <br />DrawSetDrawColor  <br />DrawSetPixel  <br />DrawSetPixelSprite  <br />DrawSetTransparentColor  <br />\n<h1>Input Methods, Properties and Events  </h1>\rInputFireMouseCollisions  <br />InputKeyUp  <br />InputKeyDown  <br />InputKeyLeft  <br />InputKeyRight  <br />InputKeyA  <br />InputKeyB  <br />InputKeyC  <br />InputKeyStart  <br />InputKeyAux1  <br />InputKeyDirection  <br />InputKeyPressed  <br />InputKeyReleased  <br />InputMouseDown  <br />InputMouseMove  <br />InputMouseUp  <br />\n<h1>Script Methods and Properties  </h1>\rScriptError  <br />ScriptExecute  <br />ScriptMessage  <br />ScriptRaiseMessage  <br />ScriptStop  <br />\n<h1>Sound Methods and Properties  </h1>\rSoundLoad  <br />SoundPlay  <br />SoundPlayLoop  <br />SoundStopLoop  <br />\n<h1>Sprite Methods, Properties and Events  </h1>\rSpriteActive  <br />SpriteAutoDisplay  <br />SpriteCollision  <br />SpriteCollisionAccuracy  <br />SpriteCollisionEdge  <br />SpriteCollisionMouse  <br />SpriteCollisionTile  <br />SpriteCollisionTileEx  <br />SpriteCopy  <br />SpriteCopyFrame  <br />SpriteDefine  <br />SpriteDelete  <br />SpriteDiminishCollisionRect  <br />SpriteDirectionRate  <br />SpriteDisplay  <br />SpriteFrame  <br />SpriteFrameFlip  <br />SpriteFrameMirror  <br />SpriteFrameRate  <br />SpriteGetDirection  <br />SpriteGetFrameRange  <br />SpriteGetPosition  <br />SpriteGetPositionEx  <br />SpriteOnScreen  <br />SpriteSetCollisionSprites  <br />SpriteSetDirection  <br />SpriteSetFrameRange  <br />SpriteSetNextFrame  <br />SpriteSetPosition  <br />SpriteSetPrevFrame  <br />SpriteStretch  <br />SpriteTileCollisionsOn  <br />SpriteZOrder  <br />\n<h1>Text Methods and Properties  </h1>\rTextDisplay  <br />TextDisplaySprite  <br />TextDisplay  <br />TextGetDimensions  <br />TextSetAttributes  <br />\n<h1>Tile Methods and Properties  </h1>\rTileAtPosition  <br />TileAtPositionXY  <br />TileCausesCollision  <br />TileExtendedCollisions  <br />TileSetMap  <br />TileSpriteCanMove  <br />\n<h1>Timer Methods, Properties and Events  </h1>\rTimerCustomFired  <br />TimerDefineCustom  <br />TimerFired  <br />TimerGetFrameRate  <br />TimerGetTickCount  <br />TimerPauseTimer  <br />TimerStartTimer  <br />TimerStopTimer  <br />\n<h1>Utility Methods and Properties  </h1>\rUtilGetAngleBetween  <br />UtilMemoryStatus  <br />UtilRandom  <br />UtilSleep  <br /> <br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2008-09-26T17:02:52.8-07:00"
}