{
  "ProjectName": "crystal",
  "Title": "Crystal",
  "Description": "A Suite of API's, UI's, and Unit Tests geared towards the GData (Google API). Crystal is the alias for the WPF UI wrapping the GoogleLib created by mariocatch. View your Google contacts with this multi-account view of your GMail accounts.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A Suite of API&#39;s, UI&#39;s, and Unit Tests geared towards the GData &#40;Google API&#41;. Crystal is the alias for the WPF UI wrapping the GoogleLib created by mariocatch. View your Google contacts with this multi-account view of your GMail accounts.<br /><br /><br /><b>Purpose</b><br />Use Crystal to view your Google contacts in an easy to use WPF UI. The open source Crystal UI is written on top of an easy to use Google Contact library. The Google Contact library is called GoogleLib, which was written by myself. It is a wrapper on top of Google&#39;s own API called GData. GData is not an intuitive API, and that&#39;s what GoogleLib aims to be.<br /><br />There also exists a Unit Test library written on top of GoogleLib. Use it to verify GoogleLib&#39;s functionality.<br /><br />Crystal and GoogleLib were written as a first step into enabling easy access on top of GData. GData alone is a rather difficult API and GoogleLib makes it much easier to talk to the Contacts plugin. Crystal UI is also a very easy to use UI for viewing your google contacts. If you have an Android phone you&#39;re probably a keen to the contact UI there, as opposed to the clunky gmail website for managing contacts.<br /><br /><b>Screenshots</b><br /><br />Main Menu:<br /><img src=\"/projects/crystal/ae844bca-53fe-42ec-a5df-1d6b97a828cb\" alt=\"CrystalMain.jpg\" title=\"CrystalMain.jpg\" /><br /><br />Account View<br /><img src=\"/projects/crystal/d944588c-f566-47f6-8e46-81fc69266642\" alt=\"CrystalAccountView.jpg\" title=\"CrystalAccountView.jpg\" /><br /><br />About Page:<br /><img src=\"/projects/crystal/2ad4acf9-7389-4daa-9ed4-a87259ad315b\" alt=\"CrystalAbout.jpg\" title=\"CrystalAbout.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "wpf,google,My wife,",
  "LastEdited": "2009-04-10T20:32:12.003-07:00"
}