{
  "ProjectName": "datajugglercontrols",
  "Title": "DataJuggler Controls",
  "Description": "DataJuggler Controls consists of a series of C# projects containing Web Controls, Windows Controls and WPF controls to make data entry forms easier.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><br />By Data Juggler Software www.datajuggler.com .<br /><br />If you like this project, please donate it keeps us going!<br /><br /><a href=\"http://www.pledgie.com/campaigns/24373\"><img style=\"border:none;\" src=\"http://www.pledgie.com/campaigns/24373.png?skin_name=chrome\" alt=\"Donate to Data Juggler\" title=\"Donate to Data Juggler\" /></a><br /><br />Project Description<br />DataJuggler Controls consists of a series of C# projects containing Web Controls, Windows Controls and WPF controls to make data entry forms easier.<br /><br />Update 4.16.2013: Originally only the DataJuggle.WebControls was released, but recently (april 14) the DataJuggler.Win.Controls and DataJuggler.WPF.Controls were added.<br /><br />DataJuggler Controls is a library of controls that make software development faster and easier.<br /><br />Update 4.16.2013: You can view a live copy of the DataJuggler.Web.Controls at:<br /><br />http://www.datajuggler.com/WebControls/WebControlsSample.aspx<br /><br /><br />The controls require a reference to the AjaxControlToolkit, and work best inside an UpdatePanel, but do work outside of an update panel.<br /><br />Here is a list of the controls in this library: (this list if from DataJuggler.Web.Controls, but many of the controls exist in the Windows and WPF controls).<br /><br />LabelTextBoxControl<br /><br />The LabelTextBoxControl consists of a Label and a TextBox and can easily be stacked to build data entry forms.<br /><br />All DataJuggler.Web.Controls may be customized by setting the CssClass, LabelCssClass, and / or TextBoxCssClass properties.<br /><br />There are properties for LabelWidth, TextBoxWidth, TextBoxHeight (Multiline=true).<br /><br />The TextBoxText property gets or sets the value for the text box.<br /><br />There are also two read only properties for IntValue and DoubleValue which return<br /><br />the corresponding value of the Textbox.Text safely parsed as an int or double.<br /><br />One useful method is the SetFocusToTextBox method. <br /><br />LabelCalendarControl<br /><br />The LabelCalendarControl consists of a Label, a TextBox and a Calendar Control and can be used to view and select dates.<br /><br />The &#39;SelectedDate&#39; property gets or sets the value for this control. <br /><br />LabelCheckBoxControl<br /><br />The LabelCheckBoxControl consists of a Label and a CheckBox.<br /><br />You can set CheckBoxPosition=&quot;Left&quot; or CheckBoxPosition=&quot;Right&quot;.<br /><br />The sample project lists that a CheckChangedExample is included, but I forgot to include that in this release, I will update that as soon as I can.<br /><br />LabelComboBoxControl<br /><br />This control consists of a Label and a DropDownList.<br /><br />There are useful methods to load the ComboBox with the choices from an enum by passing in the type of the enum; <br /><br />You can also pass in a List of objects to load the combo box.<br /><br />The sample project has two examples for using the LabelComboBoxControl.<br /><br />LabelLabelControl<br /><br />This control consists of a Label and a ValueLabel.<br /><br />The purpose of this control is if you have a read only field you can display the value in the same manor as the other controls.<br /><br />You can customize the appearance with the CssClass, LabelCssClass<br /><br />and / or ValueLabelCssClass properties. <br /><br />LabelPasswordControl<br /><br />This control displays a Label and a password mode textbox with a strength indicator to display the password strength. <br /><br />LabelTextBoxWaterMarkControl<br /><br />This control displays a multi-line textbox with instructions until you click in the text box or until text is entered. <br /><br />This is useful for a field where the user might not know what to type in, and due to a limited space in the UI you cannot add a description label.<br /><br />*LabelTimeSelectorControl&quot;<br /><br />This control consists of a Label and a Time Selector control that allows you to enter the hours, minutes, and AM or PM.<br /><br />This control uses the MKB Time Selector control and is used to display and select a time.<br /><br />There are two helper method that make dealing with Time values easy.<br /><br />GetTime returns the time value currently selected in the control as a double. AM values are 0 - 11.59; PM Values are 12 - 23.59.<br /><br />SetTime pass in a double and the time is displayed in the time format 08:00 AM, 10:30 PM, etc. <br /><br />MenuControl<br /><br />A simple menu control that lets you set a ButtonClickHandler and allows you to receive notifications on what button was clicked by Button Number, Button Text and you even get a reference to the web button, which gives you access to the page if your button click handler is generic.<br /><br />the example listed in the sample project demonstrates a horizontal and a vertical example of the MenuControl.<br /><br />TipControl<br /><br />The TipControl is a graphical control with properties for TipText, TipTextCssClass, CssClass and others to allow you to easily display helpful information to the users of your site.<br /><br />CollapsiblePanelControl<br /><br />This control is a useful control to expand and collapse your user interfaces so that you can compress more information on your page.<br /><br />You can nest the CollapsiblePanel controls and use an ExpandButtonClickHandler<br />to receive notifications when a CollapsiblePanel control is expanded or collapsed.<br /><br />Set the ExpandedHeight and CollapsedHeights in any WebControl.Unit such as pixels or em;<br /><br />Examples: ExpandedHeight=&quot;8em&quot; or ExpandedHeight=&quot;80px&quot;.<br /><br />You can customize the ExpandedButtonCssClass and CollapsedButtonCssClass to use an alternate button.<br />You can set the ColorTheme property to Blue or Brown for now, more Themes will be created later.<br /><br />One thing to note is Visual Studio does complain about Content not being able to be placed inside of the control, and I have not been able to surpress this warning yet, but I am working on it. The control will still function properly.<br /><br />There are at least a dozen examples on the WebControlsSample page demonstrating using the CollapsiblePanel control.<br /><br />Reference the Assembly DataJuggler.Web.Controls and in any page or control that refernces the assembly add a reference like the following:<br /><br />&lt;%@ Register Assembly=&quot;DataJuggler.Web.Controls&quot; Namespace=&quot;DataJuggler.Web.Controls&quot; TagPrefix=&quot;DataJuggler&quot; %&gt;<br /><br />The style sheet included in the sample project called Controls.css will contain most of the examples, but a few are listed in Site.css if they are specific to the sample page.<br /><br />Please report any feedback, suggestions or problems to support@daily-click.com<br /><br />The sample projects and source code are for Visual Studio 2010 only.<br /><br />All code in the source code and sample projects are written in C#, but you can use the controls with VB.Net; If anyone creates a VB.Net version of the WebControlsSample project send it to me and I will include it with the downloads.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "winforms,ASP.NET,C#,Controls,Windows,WPF,UserControls,Windows Forms,web controls,Server Controls,Windows Controls,web development,User Controls,WPF controls,Web User Controls,Windows UserControls,Web,",
  "LastEdited": "2014-03-04T06:26:20.177-08:00"
}