{
  "ProjectName": "directorycomparer",
  "Title": "Directory Comparer",
  "Description": "Simple application written in C#, using WPF technology, to display differences between two directories, filter file extensions and show statistics.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">It represents my first work with WPF. So, if you find something that it could be improved, that&#39;s because I have to learn more about .NET. After all, Rome wasn&#39;t built in a day. :P<br /><br /><b>Description</b><br /><br />This tool has been written in C# 4.0 and developed using the WPF(Windows Presentation Foundation) technology, available in the Microsoft .NET Framework.<br /><br />It&#39;s a simple tool to compare directories. It allows the user to select different filters and displays changes whether different files are present. Also, it displays useful details, about the number of files and subdirectories found. It consists of two DataGrids, displaying the details of each file found in the directories selected. The DataGrids are displaying the name, the creation and edit date of the file. To improve the feedback of the UI, when the user is using the DataGrids&#39; controls, the virtualization of the columns is marked enabled.<br /><br />Actually, the program lets the user to do a recursive search,through a checkbox, and then comparing also the contents in the subdirectories. It can display, through the GUI, the changes found, changing the color of the rows of the datagrids. To improve the performance and show the contents of the directories in the right way, I used some BackgroundWorkers, different threads to execute the scans, and the Dispatcher, used to show the changes in the UI.<br /><br /><b>Correct execution of the application</b><br /><br />To use this tool properly, even if I&#39;m using a multi-threading architecture to improve the performance, it&#39;s strictly required to select only directories without a huge number of files and subdirectories. For instance, don&#39;t select the directory &quot;C:\\Windows\\System32&quot; :-)<br /><br /><b>Running the application</b><br /><br />To run the application, just download the package and open it on Visual Studio. Then compile the program to get the executable.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2013-05-19T10:55:24.39-07:00"
}