{
  "ProjectName": "DragonBone",
  "Title": "DragonBone Animation",
  "Description": "DragonBone Software allows developers to create 2D skeletal animations that can be exported via XML and added into your project. Empowering the user to quickly and effortlessly create 2D animations for use in the development of a variety of programs.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Overview</h1>\r\nDragonBone Animation allows developers to create 2D skeletal animations. Unlike traditional frame by frame animations, our skeletal animation system uses a invisible skeleton in a similar way to 3D animation. In 3D games the same skeletal animation is used with different skins to create different characters. By using the same idea in 2D it is no longer necessary for the artist to draw separate animations for each character. Instead the artist would create the animation once and assign different textures to it for different characters.<br /><br />DragonBone can greatly increase an artists productivity by making him only have to draw each character once and then separate him into different body parts. The animations created in DragonBone can then take these body parts and arrange them for each frame of the animation.<br /><br />DragonBone exports its animations in an XML format for easy conjunction with any project. Upload the animations, upload the texture skins separately and use the included animation.cs code sheet to easily integrate them together.<br /><b>DragonBone is and always will be free to download and use.</b><br /><br />\n<h2>DragonSwords Studios</h2>\rDragonSwords Studios is a United States based game studios focusing on creating games for the Xbox Live Indie Game Marketplace. We also create tool to help developers design similar games.<br />Find more information at <a href=\"http://www.dragonswordsstudios.wordpress.com\">http://www.dragonswordsstudios.wordpress.com</a>. We are now hiring one artist.<br /><br />Our design tools include:<br />DragonBone Animation<br />Farseer Physics &amp; GLEED2D Link - <a href=\"http://farseergleed2dlink.codeplex.com/\">http://farseergleed2dlink.codeplex.com/</a><br /><br /><br /><br />Notes on DragonBone.<br />For use DragonBone requires the Microsoft .NET Framework 4.0 redistributable. If you want to use or edit the source code, you will also need Microsoft Visual Studios 2010.<br />DragonBone Animation was developed in C# and is made for use in C#. It was predominately developed for use in XNA for creating games on PC, Xbox 360, and Windows Phone 7. DragonBone May also be compatible with other programming languages, though you will have to create your own Animation class to interpret the exported XML files.</div><div class=\"ClearBoth\"></div>",
  "TagList": "animation,skeletal animation,DragonBone,2d animator,",
  "LastEdited": "2011-06-18T06:18:03.28-07:00"
}