{
  "ProjectName": "evolution",
  "Title": "Evolution Game Engine",
  "Description": "XNA Shader 3D Game Engine, it includes physics, Artificial Intelegence, Particle System. Bone Animation Blending, C# Scripting, Billboards, Compressed Content Directory or Virtual File System for Content.\n\nThe project is in an advanced state and require more work to complete.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />XNA Shader 3D Game Engine, it includes physics, Artificial Intelegence, Particle System. Bone Animation Blending, C&#35; Scripting, Billboards, Compressed Content Directory or Virtual File System for Content.<br /><br />The project is in an advanced state and require more work to complete.<br /><br />Features:\n<ul><li>Scene Rendering - Oct Tree for External, Shader Tree, Object List, (Extendable Architecture)</li>\n<li>Shader Based Rendering</li>\n<li>Water (NVidea Water Shader)</li>\n<li>Terrain, Multi Texture Blending Quad based on Height of Terrain (Still need some work though)</li>\n<li>Static Objects, 2D Objects, Animated Objects, Animation Blending, Bone or Key Frame Animation</li>\n<li>Cameras, First Person, Third Person, Arc-Ball, Chase Camera with Spring Physics</li>\n<li>Physics - Drag, Surface Friction, Air Friction, Applied Forces, Traction, Velocity and Gravity</li>\n<li>Light Management System</li>\n<li>Resource management including a Virtual File System</li>\n<li>GUI, with Multiple forms, Widgets and Input system for Overlays and dialogs</li>\n<li>Font Management System</li>\n<li>Batch Rendering of Text to minimize state change on device</li>\n<li>Input management system that Maps Keyboard to Named Input values (Could be scripted as well)</li>\n<li>C# Script Engine </li>\n<li>Quest Management System - Scripted in C#</li>\n<li>Scripting integrated</li></ul>\n<br />.... and more....<br /><br />We require developers to help finish the engine, should you feel up to the task, drop me a mail with a description of your experience and where you can help, following is the areas that need completion: <br />\n<ul><li>Engine:\n<ul><li>Artificial Intelegence (80% Complete)</li>\n<li>Shadows</li></ul></li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "game,watch,XNA,",
  "LastEdited": "2008-04-05T19:31:52.64-07:00"
}