{
  "ProjectName": "fbapp",
  "Title": "FBApp",
  "Description": "A simple facebook app I was busy with over the holidays as an experiment to try out the facebook api. Is currently not complete but I wanted to get some criticism on it for my 1st web app. It is developed using WPF and C#. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nA simple facebook app to display notifications on the desktop as a fun experiment to learn a little more about the facebook api. It is currently incomplete as it was a little rushed and I ran out of free time but I wanted to get some criticism on it for my\r\n 1st web application. It is developed using WPF and C#.&nbsp;</p>\r\n<p><a href=\"http://www.facebook.com/apps/application.php?id=158338277521942\">http://www.facebook.com/apps/application.php?id=158338277521942</a></p>\r\n<p><br>\r\n<strong>Features</strong></p>\r\n<ul>\r\n<li>Live news feed notifications </li><li>Live wall feed notifications </li><li>Update Status </li><li>Access to news feed,wall feed,inbox through GUI on desktop </li></ul>\r\n<p><img src=\"http://img843.imageshack.us/img843/2544/28025682.jpg\" alt=\"GUI\" width=\"300\" height=\"240\"></p>\r\n<p>&nbsp;</p>\r\n<p><img src=\"http://img207.imageshack.us/img207/9946/oldj.jpg\" alt=\"notification1\" width=\"240\" height=\"120\"></p>\r\n<p><img src=\"http://img524.imageshack.us/img524/7752/fbappcopy.jpg\" alt=\"notification2\" width=\"230\" height=\"85\"></p>\r\n<p><strong>Features not yet implemented that I was planning to</strong></p>\r\n<ul>\r\n<li>Login Screen - Currently the login page is sitting in the settings tab and was meant to get moved to a proper screen but just didn't have the time.\r\n</li><li>Ability to comment on feeds </li><li>Ability to send messages from Messages tab </li><li>Ability to browse profile pages by clicking on links </li><li>Like button </li><li>Proper caching of images - Currently all images are cached to the hard drive but they are not updated dynamically so the cache needs to be cleared manually to get updated pictures.\r\n</li><li>Minimise to tray - Ideally I just wanted the application to run in the background but WPF wasn't the best for minimising to the tray so a 3rd Party open source library was used. The tray icon is there but I never got around to making the window hide and\r\n making the menu for the right click event for the&nbsp;tray icon. </li><li>Settings tab </li></ul>\r\n<p><strong>Conclusion</strong></p>\r\n<p>So as you can see there is still a lot I never got around to that could have been added in but in the future I would like to make a more generic notification application for Windows similiar to how Ubuntu has gwibber. Even though this application is incomplete\r\n I plan to use it as a learning curve for my next application but I figured I'd make it open source just as a starting point for myself.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Facebook Graph API,Facebook,notifications tray,WPF,C# 4.0,.NET 4,prototype,",
  "LastEdited": "2011-01-12T11:19:53.82-08:00"
}