{
  "ProjectName": "FlickrMetadataSynchr",
  "Title": "FlickrMetadataSynchr",
  "Description": "FlickrMetadataSynchr is a tool that allows you to synchronize metadata added to images stored on Flickr with the original versions of those images stored locally on your hard drive. If you don't have the original version on your hard drive, the application can download the missing pictures for you. The app can sync the metadata two-way on a picture-by-picture and metadata field-by-field basis.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><a href=\"http://bloggingabout.net/blogs/erwyn/\">Blog of Erwyn van der Meer</a>\n<h2>Project Description</h2>\rFlickrMetadataSynchr is a tool that allows you to synchronize metadata added to images stored on Flickr with the original versions of those images stored locally on your hard drive. If you don&#39;t have the original version on your hard drive, the application can download the missing pictures for you. The app can sync the metadata two-way on a picture-by-picture and metadata field-by-field basis.<br />Relevant metadata on Flickr is: \n<ul><li>Title </li>\n<li>Description </li>\n<li>Tags</li>\n<li>Author </li>\n<li>GPS location info</li>\n<li>Date and time at which the image was taken</li>\n<li>Last updated date and time</li></ul>\nThe synchronization is done two-way. The embedded metadata in XMP, EXIF and IPTC sections in locally stored images can be updated with the metadata of matching pictures on Flickr. And vice versa. See also <a href=\"http://bloggingabout.net/blogs/erwyn/archive/2007/02/01/digital-workflow-for-flickr.aspx\">my blog entry with some background info on the metadata problem</a>.<br /><br />This is a screenshot of the latest version of the app:<br /><img src=\"/projects/FlickrMetadataSynchr/3f233da8-3820-4b3c-b032-451deed0f3b0\" alt=\"FlickrMetadataSynchr-v1.8.2.0.png\" title=\"FlickrMetadataSynchr-v1.8.2.0.png\" />\n<h2>Status</h2>\rThe project is currently at version 1.8.2.0. The application runs on both 32 and 64-bit versions of Windows 7, 8 and 8.1. It requires the Microsoft .NET Framework 4 or higher to be installed, which will automatically be the case on Windows 7 or higher.<br /><br /><a href=\"https://flickrmetadatasynchr.codeplex.com/releases/view/467132\">Download the latest release here</a>. <a href=\"https://flickrmetadatasynchr.codeplex.com/SourceControl/latest\">Source code can be found here</a>. \n<h2>How-to-install the app</h2>\r<ul><li>Make sure you have the .NET Framework 4 or higher installed.</li>\n<li>Download the ZIP file with the application. </li>\n<li>Unzip it to a folder. </li>\n<li>Run the FlickrMetadataSynchr.exe executable.</li></ul>\n<h2>How-to-use</h2>\r<ul><li>If you run the application for the first time on a computer, you first have to authorize the application to access your Flickr pictures on your behalf. Click the &quot;Authorize application button&quot; to start the authorization process. Follow the on-screen instructions.</li>\n<li>After you have authorized the application or have run the application before, you can connect to Flickr to fetch a list of all your photosets. The application automatically tries to connect when it starts. If this fails, for example when your Internet connection is down or if a firewall is blocking the program, you can try to connect again by using the &quot;Connect to Flickr&quot; button.</li>\n<li>When you have successfully connected to Flickr, the application shows your name and Flickr avatar. You can select a photoset that you want to sync from the drop down list. You need to have at least one photoset on Flickr to be able to use the application.</li>\n<li>After you have selected a Flickr photoset, you can select a folder on a local drive by using the &quot;Browse for local folder&quot; button.</li>\n<li>If you like, you can change the synchronization settings. You can choose if subfolders of the local folder should be included and if pictures that are missing in the local folder should be downloaded from Flickr.</li>\n<li>If you are happy with what you have selected, hit the &quot;Sync&quot; button and the synchronization process will start. This process is fully automatic. The app will show you what it is doing in the status area. The status area is the gray area at the bottom of the window. If anything goes wrong during the synchronization, the sync process will stop and the application will show you an error message in the status area.</li>\n<li>The synchronization process can be cancelled at any time by hitting the &quot;Cancel Sync&quot; button.</li>\n<li>If you want to see more detail about what is going on, select the &quot;Show activity log window&quot; option. This will open another window which shows you a log of all activity.</li></ul>\n<br />The application performs the following steps during the synchronization process:\n<ul><li>Download metadata from Flickr pictures in the selected Flickr set.</li>\n<li>Extract metadata from JPEG images in the selected local folder.</li>\n<li>Match pictures into pairs based on Flickr id, date and time taken and/or title and filename.</li>\n<li>Merge the metadata two-way (see details below).</li>\n<li>Optionally download pictures from the selected Flickr set that do not have a matching picture in the local folder.</li></ul>\n<br />The metadata is merged from both sides. Apart from tags, if both sides contain data for a metadata field, the most recently updated side wins for that field. For tag synchronization, you can choose what behavior you want: combine tags (i.e., do not delete tags, just add them), most recently updated side wins (to enable deletion of tags) or leave tags alone. Finally the metadata for the Flickr picture, the local picture or both are updated if the synchronization procedure has determined they should be updated.<br /><br />The application will embed the Flickr id of a matching picture as ImageUniqueID in the XMP and EXIF metadata of a local picture. This makes it possible to match pictures during future sync operations even if the date time taken and/or the title and filename of the picture have changed or are not unique. Usually upload tools set the title on Flickr equal to the filename. If that is the case, it is recommended to run a sync operation immediately after upload, before any metadata changes, because then the pictures can still be matched based on title/filename.<br /><br />The application saves and remembers your Flickr account, the local folder, the selected Flickr set and the synchronization options when you restart the application. If you want the app to forget your Flickr account, e.g., when you want to log into another Flickr account or you are using a shared computer, use the &quot;Forget Me&quot; button.<br /><br />The application has a simulation mode in which no real updates take place. Use this mode first, if you are not sure if the automatic synchronization will do the right thing.<br /><br />The status area shows very limited information during the synchronization process. Full information about what the app is doing and detailed error information if something goes wrong is written to the so called Windows debug output. There are multiple options for viewing this information. It is written to a file called SyncActivity.log in the application directory, it can be viewed in a separate window, and finally it is viewable with the <a href=\"http://www.microsoft.com/technet/sysinternals/utilities/debugview.mspx\">DebugView tool</a>). This is helpful if you want to check the proposed changes in simulation mode before actually applying them.<br /><br />Download of non-JPEG pictures like PNGs and GIFs is supported, but synching metadata only works for JPEG pictures.\n<h2>How-to-remove the app</h2>\r<ul><li>Click the &quot;Forget Me&quot; button in the running application if you are concerned about leaving behind data about your Flickr account.</li>\n<li>Just delete the folder that contains the application.</li></ul>\n<h2>Possible future enhancements</h2>\r<ul><li>Show the user the match that was made by the application to give the user the opportunity to review for any matching errors. </li>\n<li>Let the user deselect matched image pairs that he or she does not want to process. </li>\n<li>Let the user be able to overrule the metadata merge on a picture-by-picture and field-by-field basis.</li></ul>\n<h2>Reuse or contributions</h2>\r<ul><li>Code adapted from Matthijs Dubbeldam&#39;s <a href=\"http://www.codeplex.com/VistaFlickrUploader\">Vista Flickr  Uploader</a></li>\n<li>Code adapted from &quot;TimK&quot;&#39;s <a href=\"http://www.codeproject.com/useritems/WindowSettings.asp\">WindowSettings class on The Code Project</a>. See also <a href=\"http://bloggingabout.net/blogs/erwyn/archive/2007/02/01/remembering-window-positions-in-wpf.aspx\">my blog entry about remembering windows position and state in WPF</a>.</li>\n<li>Code adapted from <a href=\"http://blogs.msdn.com/rwlodarc/archive/2007/07/18/using-wpf-s-inplacebitmapmetadatawriter.aspx\">Robert A. Wlodarczyk&#39;s blog</a>.</li>\n<li>Code contributed by <a href=\"http://www.cip.ifi.lmu.de/~proescho/\">Timo Proescholdt</a>.</li>\n<li>Code adapted from improvement sent in by Luther Miller.</li></ul>\n<h2>Dependencies</h2>\r<ul><li>Flickr account.</li>\n<li>Windows 7, Windows 8 or Windows 8.1 or Windows Server 2008 R2, 2012/2012 R2</li>\n<li>.NET Framework 4 or higher</li>\n<li>FlickrNet as the API to access Flickr (<a href=\"http://www.codeplex.com/FlickrNet\">http://www.codeplex.com/FlickrNet</a>). </li></ul>\n<h2>Development tools</h2>\r<ul><li>Visual Studio 2013 Professional, Premium or Ultimate</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "flickr,Vista,C#,photos,synchronizer,WPF,.net 3.0,C# 2.0,photo,tagging,FlickrNet,XMP,metadata,sync,IPTC,Exif,Wouter,Synchronize,mashup,flicker,",
  "LastEdited": "2014-12-24T04:08:51.98-08:00"
}