{
  "ProjectName": "icarussceneengine",
  "Title": "Icarus Scene Engine 3.1",
  "Description": "Icarus Scene Engine 3.1 is a cross-platform 3D framework, integrating open source APIs into a cohesive all-open-source, all .NET solution.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Icarus Scene Engine 3.1 is a cross-platform 3D framework, integrating open source APIs into a cohesive all-open-source, all .NET solution.<br /><br />Built in C#, CLS-compliant, with a C wrapper for integration with FFMpeg,  FreeType, native .NET file formats for guaranteed cross-platform resource loading, and auto-selection of correct 32/64bit DLLs for FFmpeg, FreeType, OpenAL.<br /><br />Binaries built with ISE run without recompilation across Windows, Linux and Mac OSX, with only Mono/.NET being an installation requirement. Develop your UI once, develop your core app once.<br /><br />Applications built with ISE can be distributed on thumb drives, network drives, ZIP files, without installation requirements (once .NET/Mono is installed).<br /><br />Windows/Mac/Linux builds can mimic the iOS builds, in terms of UI and resolution. Distribute Windows builds of your app to test the iOS version, no struggling with Simulators with sub-par performance or lengthy rebuilds!<br /><br /><a href=\"http://www.youtube.com/user/emacinnes\">See Videos of Icarus Scene Engine Online</a><br />See the main <a href=\"http://icarus.pointscape.com.sg/\">Icarus Scene Engine site</a> for the latest news, forums, technical information, code samples and more!<br /><br /><a href=\"http://www.roverrescuegame.com\">The Agent Saga - Rover Rescue</a>, made with ISE 3.1, out now on the App Store!<br /><br /><br /><br />OpenAL now uses OpenAL-soft.DLL for it&#39;s Windows implementation.<br /><br />Featuring:<br /><br />    Themable User Interface controls, fully animatable. Develop &amp; test the UI on PC, deploy to iOS without changes.<br />    Animatable Lighting, Cameras, Lenses, Scenes.<br />    Multi-threading. Background loading of all resources<br />    3D Models<br />    Terrain from Textures<br />    Binary-compatible across MacOSX, Windows, Linux.<br />    Compile-compatible across iOS/Android.<br />    Scene Management. Scenes within Scenes, Parallel Scenes<br />    Full Animation Track, Time Dilation on any Track<br />    Double/Single floating point accuracy versions.<br />    Visual 3D Positional Audio based on OpenAL<br />    Automatic selection of VBO, Display Lists, Immediate Mode, depending on underlying rendering platform capabilities and/or dynamic nature of rendering.<br />    Open Native .NET file formats for assets (Textures, Geometry, Fonts), uncompressed, compressed and highly compressed<br />    3D model importing from 3DS and OBJ files<br />    Dynamic LOD geometric texturable shapes including: spheres, torus, cylinders, capsules, tubules<br />    Rendering API-agnostic Collision Rays, projection and unprojection<br />    Cross-platform Font consistency.<br />    Decoding/Encoding Video Streams<br />    Native .NET OGG support<br />    Native .NET WAV support<br />    CLS-Compliant for VB and other .NET language use<br /><br /><br />NOTE: Icarus Scene Engine 3.0 is an almost total re-write from Version 2.0. More focussed, more specific in function and goals, much more developer-friendly coding structures and concepts.<br /><br />Previous versions included the Icarus Professional 1.0, with visual content creation capabilities, which is still available in downloads, but discontinued, to be replaced with a separate Icarus Design Studio project currently under development.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Open Source,C#,C,OpenAL,OpenGL,FFMpeg,monoBOTICS,mono,linux,MacOSX,Geometry,Geometry 3D,3D,3DS,OBJ,sockets,Framework,xml,animation,previsualisation,freetype,ode,OpenTK,Tao,",
  "LastEdited": "2013-09-24T23:43:07.953-07:00"
}