{
  "ProjectName": "instigator",
  "Title": "WPF Instigator - Application Launcher",
  "Description": "Instigator is a portable launcher application written in WPF.   It filters short cuts you create to enable quick and easy access to your commonly used applications, files, folders and URL's.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Instigator is a portable launcher application written in WPF.   It filters short cuts you create to enable quick and easy access to your commonly used applications, files, folders and URL&#39;s.<br /><br />Screen Shot:<br /><img src=\"/projects/instigator/863c355a-1098-48bf-9f3b-519390ab646d\" alt=\"screenshot1.png\" title=\"screenshot1.png\" /><br /><br />Similar to other launcher applications, but differs in the fact that it only pulls short-cuts to applications you define.  Little more focused then Windows 7 or Enso which seem to pull a great deal of your hard drive into your launch list.<br /><br /><b>Configuring Instigator</b>\n<ul><li>Build the application</li>\n<li>Copy the contents of the bin file (Sysknowlogy.Instigator.exe, Sysknowlogy.Instigator.exe.config) to where you would like to run the application.</li>\n<li>Edit the config file so Instigator knows where to find your short-cuts.  Remove any DiscoveryPaths that you do not want Instigator to load.</li></ul>\n<br /><b>Using Instigator</b>\n<ul><li>Start the executable, after the splash screen disappears the application is loaded. </li>\n<li>Use Ctl-Win to bring up the search window. Right now this is not configurable, it will be in later releases. </li>\n<li>This should bring up the application with the list of short-cuts that you defined in your discovery paths. </li>\n<li>Begin typing to limit the list of items to launch.  The search uses a contains to filter… as you type it will eliminate your options. </li>\n<li>Once the items fore color you are looking for is highlighted, hit enter.</li></ul>\n<br /><br /><b>Known Issues </b>\n<ul><li>Focus set to the filter textbox sometimes doesn&#39;t get set... especially after trying to launch a short-cut that no longer exists.  To fix it, you will need to click in the filtering textbox with your mouse. </li></ul>\n<br /><b>Reporting errors / problems</b><br />While in the launch filter textbox, type in “report” which will result in a “report a problem or bug” in the drop down.  Select that item and hit enter.  This will launch the default mail client and allow you to mail me a bug.<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-11-06T14:40:31.383-08:00"
}