{
  "ProjectName": "kocontrols",
  "Title": "KOControls - WPF Controls Library",
  "Description": "The project is a WPF MVVM compliant controls library. It currently contains an implementation of Auto complete/Auto suggest TextBox. \r\nIt is developed in C# .Net 4.0 and WPF",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nThe project is a WPF MVVM compliant controls library.</p>\r\n<p>The library is developed in C# .Net 4.0 and WPF and it currently contains an implementation of AutoComplete/AutoSuggest TextBox.</p>\r\n<p><strong>Features <br>\r\n</strong></p>\r\n<ul>\r\n<li>MVVM compliant. The ViewModel is completely functional without user interface;\r\n</li><li>Full control over the visual presentation of the control by utilizing standard WPF styles and templates;\r\n</li><li>Hooks up to any TextBox and provides AutoSuggest, AutoComplete or both functionality;\r\n</li><li>Option allowing submission of &quot;free text&quot; and upon confirmation the &quot;free text&quot; can be converted to a valid value;\r\n</li><li>Supports commands injection in the suggestion&rsquo;s window (this is useful when you want to allow the users to edit or create new suggestions from within the suggestion&rsquo;s control);\r\n</li><li>The control presenting the suggestions can be WPF DataGrid or ListView; </li><li>The control's functionality is controlled through properties of the ViewModel. (Note that the control would work only if its DataContext is of type AutoSuggestViewModel). Amongst other things this will allow you to serialize the control's settings and thus\r\n allow you to provide ways to your users to personalize the control. </li><li>Suggestions filtering algorithm can be injected by the user. This allows third party users to implement an algorithm which fetches the suggested values from a webservice or from a database, to do cleverer filtering overcoming spelling mistakes and auto-correction,\r\n etc. A default implementation of the filtering algorithm which works with a collection of all possible suggestions is provided;\r\n</li><li>Supports walking up and down the suggestions with the arrow keys and that is done without losing TextBox focus!;\r\n</li><li>Supports the following options for &quot;Cancel&quot; and &quot;Select&quot; behavior:\r\n<ol>\r\n<li>Space may act as selection command or exit command. If it acts as a selection command, it should only select an item if it is the last item in the suggestions list and if the option to allow &ldquo;free text&rdquo; values is off.\r\n</li><li>Tab may act as a &ldquo;Select&rdquo; or a &ldquo;Cancel&rdquo; command. Lost focus is also considered Tab in that sense.\r\n</li><li>Enter may act as a &ldquo;Select&rdquo; or a &ldquo;Cancel&rdquo; command. </li><li>The arrow keys may act as a &ldquo;Select&rdquo; command. </li></ol>\r\n</li><li>Supports delay in milliseconds before invoking the filtering algorithm. This is useful if the filtering algorithm is heavy and you do not want to invoke it every time the user types a character but want the user to pause and slow down before you invoke\r\n the algorithm; </li><li>Option which allows or disallows empty values. Also by default, an &quot;empty value&quot; is the &quot;null&quot; value but users may supply a different value to represented the &quot;empty value&quot;;\r\n</li><li>Provides the AutoComplete feature which highlights the completed text after the point where user stopped typing. The features is controlled by an option.\r\n</li></ul>\r\n<p>Checkout the following Codeproject article for more information about the design and how to use the library:\r\n<a rel=\"nofollow\" href=\"http://www.codeproject.com/KB/WPF/AutoSuggest_AutoComplete.aspx\">\r\nhttp://www.codeproject.com/KB/WPF/AutoSuggest_AutoComplete.aspx</a></p>\r\n<p>If you like the KOControls library please consider making a donation to help us improve the existing controls and write new useful controls.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Documentation</strong></p>\r\n<p>A CodeProject article may be found <a title=\"CodeProject article\" href=\"http://www.codeproject.com/KB/WPF/AutoSuggest_AutoComplete.aspx\">\r\nhere</a>.</p>\r\n<p>For more information on how to use the library please download the source code and take a look at the sample project.<br>\r\nThe source code can be found on google code here: <a title=\"KOControls hosting\" href=\"http://code.google.com/p/kocontrols/\">\r\nhttp://code.google.com/p/kocontrols/</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-09-23T06:35:18.35-07:00"
}