{
  "ProjectName": "Magic8BallService",
  "Title": "Magic8Ball WCF Service",
  "Description": "This project demonstrates how to use Windows Communication Foundation (WCF) to\r\nhost a simple service from within a console application and consume that \r\nservice from a simple WPF app using XML/HTTP or BinaryXML/TCP and via an HTML page using JSON/HTTP. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>Welcome to the Magic8Ball WCF Service sample app</h1>\r\n<p>This project demonstrates how to use various Windows Communication Foundation (WCF) features to host a simple service from within a console application and consume that service from a simple WPF app &amp; web page.\r\n<br>\r\n<br>\r\nThe simple Magic8Ball replies to questions with a random response from a pre-defined list of possible responses.<br>\r\n<br>\r\nThe service is hosted by a simple console application to illustrate that apps can host services too! This service is exposed simultaneously using XML/HTTP as well as BinaryXML/TCP. The service will also respond to HTTP-GET's with a service description page\r\n - point your browser at the service's HTTP endpoint for more details.<br>\r\n<br>\r\nThe client app is a simple WPF app that lets you ask questions of the Magic8Ball service and displays the answer provided.<br>\r\n<br>\r\nThis project also shows how to configure services &amp; clients using app.config, significantly reducing the quantity of code required to hook-up a client to a service, whilst greatly increasing post-deployment flexibility. Read Magic8BallApp's app.config for\r\n more details.<br>\r\n<br>\r\nI have used variations of this app for many years to explain and demonstrate key WCF features. I hope you find it useful.<br>\r\n<br>\r\nPlay. Tweak. Modify. Enjoy!</p>\r\n<h1>Release History:</h1>\r\n<pre style=\"font-family:Consolas; background:white; color:black; font-size:16px\">------------------------------------------------------------------------------\r\nRelease&nbsp;1.1&nbsp;(1st&nbsp;December&nbsp;2011)\r\n*&nbsp;Exposed&nbsp;service&nbsp;via&nbsp;new&nbsp;webHttpBinding&nbsp;to&nbsp;support&nbsp;REST&nbsp;&amp;&nbsp;JSON&nbsp;clients.\r\n*&nbsp;Added&nbsp;support&nbsp;for&nbsp;cross-domain&nbsp;requests&nbsp;to&nbsp;support&nbsp;test&nbsp;HTML&nbsp;page.\r\n*&nbsp;Added&nbsp;test&nbsp;HTML&nbsp;page&nbsp;to&nbsp;exercise&nbsp;new&nbsp;webHttpBinding&nbsp;endpoint.\r\n*&nbsp;Several&nbsp;minor&nbsp;improvements&nbsp;to&nbsp;user&nbsp;experience&nbsp;in&nbsp;the&nbsp;client&nbsp;app&nbsp;and&nbsp;server&nbsp;host.\r\n*&nbsp;Removed&nbsp;unnecessary&nbsp;references&nbsp;and&nbsp;using&nbsp;statements.\r\n------------------------------------------------------------------------------\r\nRelease&nbsp;1.0&nbsp;(13th&nbsp;April&nbsp;2011)\r\n*&nbsp;Initial&nbsp;release&nbsp;ported&nbsp;to&nbsp;.NET&nbsp;4.0&nbsp;and&nbsp;cleaned&nbsp;up&nbsp;for&nbsp;public&nbsp;consumption.\r\n------------------------------------------------------------------------------</pre>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "WCF,C#,",
  "LastEdited": "2011-12-02T11:04:05.54-08:00"
}