{
  "ProjectName": "milkify",
  "Title": "Milkify",
  "Description": "Milkify is a desktop client (or widget) for Remember The Milk, implemented in WPF/Silverlight.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>What is Milkify?</h1>\r\n<h2>Since I stopped using Remember The Milk, I also stopped using Milkify, so the project is not maintained anymore. If you want to take ownership of it, please contact me directly.</h2>\r\nMilkify is a desktop client for <a href=\"http://www.rememberthemilk.com\">Remember The Milk</a>, the awesome &quot;to-do list&quot; web application. It allows you to manage your tasks from the desktop, the same way Thwirl or Twitterrific manage your tweets. With handy hotkeys and easy keyboard navigation, you won&#39;t have to wait for a browser to open, or have to switch to the correct tab, making your day more productive!<br /><br />Milkify uses the <a href=\"http://www.codeplex.com/ironcow/\">IronCow</a> API for communicating with Remember The Milk.<br />\n<h1>Where do I get it?</h1>\r\nCheck-out the <a href=\"http://milkify.com/\">official Milkify website</a>, and more specifically the <a href=\"http://milkify.com/download\">download page</a>.<br /><b>Please <a href=\"http://feedback.milkify.com\">leave feedback there</a></b>, instead of the issue tracker here, unless it&#39;s source-code-related, thanks.<br />\n<h1>Want to help?</h1>\r\nMilkify needs testers. Go get the <a href=\"http://milkify.com/download/\">latest release</a> and test it (you will need a Remember the Milk account, though). Please post any bug or concern on the <a href=\"http://feedback.milkify.com\">leave feedback page</a>.<br />\n<h1>Milkify blog</h1>\rYou can get news and information regarding Milkify development by subscribing to the <a href=\"http://ludovic.chabant.com/devblog/category/milkify/\">Milkify category</a> on <a href=\"http://ludovic.chabant.com/devblog/\">my developer&#39;s blog</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "RTM_client,RTM,desktop,",
  "LastEdited": "2012-05-09T09:34:02.24-07:00"
}