{
  "ProjectName": "NLarge",
  "Title": "NLarge",
  "Description": "NLarge is a free little utility for technical presentations.  It magnifies the screen through a smooth animation, and allows you to pan and zoom around the magnified screen.  You can annotate the magnified image using the mouse or a Tablet PC pen.\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>NLarge Project Home Page</b><br /><br />NLarge is a little utility for technical presentations.  It magnifies the screen through a smooth animation, and allows you to pan and zoom around the magnified screen.  You can annotate the magnified image using the mouse or a Tablet PC pen.  You can also annotate with text.<br /><br />NLarge runs from your system tray, and is triggered by a hotkey (Ctrl-1 by default). <br /><br /><b>Compatibility</b><br /><br />Because NLarge is built with the Windows Presentation Foundation, it runs on Windows Vista and Windows Server 2008, and will also work on Windows XP and Server 2003 if you install the <a href=\"http://www.netfx3.com/\">.NET Framework version 3.0</a> (a free download).  <br /><br /><b>Note:</b> New versions of NLarge use transparency effects that are much smoother if you have installed the .NET Framework version 3.5 or 3.0 SP1.  You can <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=333325FD-AE52-4E35-B531-508D977D32A6\">install the 3.5 version of the framework here</a>. <br /><br /><b>My blog</b><br /><br />More info is on <a href=\"http://robburke.net\">my blog</a>.  Please feel free to contact me through the blog for more information.  If you have feature requests, I&#39;d be grateful if you added them to the Issue Tracker here on CodePlex.<br /><br /><b>Download</b><br /><br />You can download the latest version of NLarge through the <a href=\"http://www.codeplex.com/NLarge/Release/ProjectReleases.aspx\">Releases page</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Vista,NLarge,NLarge magnifier,presentations,Screen magnifier,magnifier,visualization,Powerpoint,tech demo,",
  "LastEdited": "2008-04-21T19:28:40.057-07:00"
}