{
  "ProjectName": "present",
  "Title": "Present",
  "Description": "Present is the beginning of a set of MVVM libraries, classes, behaviours anything but a framework :). It's focus will be providing composable sets of functionality that I have not found available elsewhere or have had to adopt a full framework to get the benefits. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Moved to Google Code</h1>\rDue to issues with SVN at CodePlex<br /><a href=\"http://code.google.com/p/present/\">http://code.google.com/p/present/</a><br />\n<h1>Present</h1>\rPresent is the beginnings of a set of MVVM libraries, classes, behaviours anything but a framework :). It&#39;s focus will be providing composable sets of functionality that I have not found available elsewhere or have had to adopt a full framework to get the benefits. The aim is to ensure as few dependencies (external and internal) so that each component can be easily added into a project without having to fully subscribe to the whole.\n<h2>Present.Validation</h2>\rA contributor based validation framework. The initial contributor is an attribute based (DataAnnotations) contributor. Others can easily be built for products like the EntLib Validation or NHibnerate validation.<br />The main benefit is that it recognises broken bindings (where the user has entered an incorrect data type) and conveys that information to the View Model<br /><a href=\"http://adammills.wordpress.com/2010/07/21/mvvm-validation-and-type-checking/\">more info here</a><br /><br /><img src=\"/projects/present/01aafb33-871c-448e-af49-f5766c437bd3\" alt=\"BrokenBinding.png\" title=\"BrokenBinding.png\" /><br />\n<h2>Present.Commands</h2>\rA set of a commands and command decorators that allows the composition of command behaviour through a fluent interface.&lt;br&gt;<br /><b>Some Example Decorators</b>\n<h3>Schedule Decorator</h3>\rSchedules any command to run Every time period.<br />Schedule can be disabled and enabled<br /><img src=\"http://present.googlecode.com/svn/wiki/Images/Commands/ScheduledCommand.png\" /><br />\n<h3>Async Command</h3>\rRuns Actions asynchronously<br /><img src=\"http://present.googlecode.com/svn/wiki/Images/Commands/AsyncCommand.png\" /><br />\n<h2>Present.Dialogs</h2>\r<h3>Coming Soon.</h3>\rA dialog service that abstracts access to PopUp dialogs based on<br /><a href=\"http://gallery.expression.microsoft.com/en-us/PopUpDialog\">http://gallery.expression.microsoft.com/en-us/PopUpDialog</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,MVVM,validation,xaml,",
  "LastEdited": "2010-08-07T07:12:49.6-07:00"
}