{
  "ProjectName": "PrismForXamarinForms",
  "Title": "Prism for Xamarin Forms",
  "Description": "Prism for Xamarin Forms brings the familiar features and concepts of Prism for WPF based applications to the Xamarin Forms world.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Prism for Xamarin Forms brings the familiar features and concepts of Prism for WPF based applications to the Xamarin Forms world.<br /><br />The existing Prism libraries for WPF, Windows Store, and Windows Phone cannot be used in Xamarin Forms due to the incompatibility of the .NET assemblies used in them and those defined by Xamarin Forms. <br /><br />Therefore, I have implemented most of the features from the ground up. These features include:<br /><br />-Unity and MEF<br />-Region Management<br />-Navigation<br /><br />I have reused two of the Prism libraries were compatible with Xamrin Forms:<br /><br />- Microsoft.Practices.Prism.Mvvm (defining BinadableBase and DelegateCommand) and<br />- Microsoft.Practices.Prism.SharedInterfaces <br /><br />I am also implementing a set of services that are implemented for each platform based on a set of shared interfaces. Therefore the consuming modules would not need to include platform-dependent implementations or precompilation directives. These services include (or will include):<br /><br />-LocationService: Providing location information<br />-MapService: TBI<br />-FacebookService: TBI<br />-ContactsService: TBI<br /><br />Finally, I have included an iOS sample that uses the Prism libraries (defined with the Example namespace)<br /><br />The namespaces I have used, are in the form of Futurism.Universal.XXX where Futurism is the name of my registered domain (www.futurismtechnologies.org). Universal is the name I have chosen to represent Prism for Xamarin Forms and XXX can be one of the following (so far):<br /><br />-Foundation: most of features are defined here including Unity, MEF, and Region Manager<br />-Interfaces: the shared interfaces for the services outline above<br />-Services.Mac: iOS implementation of the shared interfaces.<br />-Services.Win: (TBI) Windows implementation of the shared interfaces.<br />-Services.And: (TBI) Android implementation of the shared interfaces.<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Xamarin,Prism,Xamarin Forms,Xamarin Prism,Xamrain MEF,Xamarin Unity,",
  "LastEdited": "2015-04-11T12:21:41.447-07:00"
}