{
  "ProjectName": "razre",
  "Title": "Razre WPF Framework",
  "Description": "Razre is a framework designed to provide a basis for writing a WPF application.  It provides management of Navigation and Theming and also the basis of an implementation of the MVVM UI design pattern, all integrated for a smooth, peformant implementation.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Welcome to the Razre WPF Framework</h1>\r\nRazre is a WPF Application Framework designed to provide tools to help facilitate the development of WPF projects.  This will be an ongoing project as I add more tools to provide an overall application framework.<br /><br />The Razre WPF Framework currently provides the following:\n<ul><li>A DataTemplate based implementation of the Model-View-ViewModel (MVVM) UI design pattern.</li>\n<li>A Navigation system\n<ul><li>Currently provides the concept of a MainRegion with navigation to the ViewModel&#39;s</li>\n<li>Integrates support for dynamically built transition animations</li></ul></li>\n<li>A full layout Theming mechanism\n<ul><li>Through the use of DataTemplate View to ViewModel resolution this system will provide the ability to do 100% full layout theme switching</li>\n<li>Does not rely on DynamicResource ensuring a very performant visual switching mechanism</li></ul></li>\n<li>Utilizes Microsoft&#39;s Composite Application Library (CAL) <a href=\"http://compositewpf.codeplex.com/\">http://compositewpf.codeplex.com/</a> with settings to synchronize the usage of the same CAL objects between your application and the Framework</li></ul>\nThe sample application needs alot of work so please take note.  I will be adding more tools and framework objects in the future including support for my existing SortableCollection at <a href=\"http://sortablecollection.codeplex.com\">http://sortablecollection.codeplex.com</a><br /><br />This framework is in its early stages so please feel free to contact me with any questions or comments and I hope that you find it useful.<br /><br />Please see my blog at <a href=\"http://www.attachedwpf.com\">http://www.attachedwpf.com</a> and thanks again!</div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,MVVM,Navigation,Framework,themes,",
  "LastEdited": "2009-10-02T07:21:08.673-07:00"
}