{
  "ProjectName": "silverlightrpg",
  "Title": "Silverlight MMORPG Game Engine",
  "Description": "Please visit my tech blog for detail: http://www.cnblogs.com/Jax",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Silverlight MMOPRG Game Engine</b><br /><br />    WOW, Silverlight can also be used in MMORPG programming, isn’t it? <br />    If you still don&#39;t believe it, please visit my website <a href=\"http://mmorpg.cloudapp.net/MMORPGSilverlightTestPage.html\">http://mmorpg.cloudapp.net/MMORPGSilverlightTestPage.html</a>, it is a showing RPG game engine written in Silverlight.<br /><br /><img src=\"http://images.cnblogs.com/cnblogs_com/Jax/WindowsLiveWriter/OOMRPGprogramminginSilverlightTutorial6I_9A1/image_thumb.png\" /><br /><br />    What a surprise! But it is true. As you know, game is base on a series of coherent pictures, and Silverlight is just good at animation design, especially in Vector Animations. Sometimes I think that Microsoft introduce Silverlight only to occupy the market in web game’s domain.<br /><br />    Now, I must introduce another product, is old enough in web game(10+ years). Yes, you got it, it is Flash, whose latest version is 10 now. Since Flash is so famous that everybody knows it, why Microsoft still support it with so large resources? From a developer’s point of view, I think Silverlight is an assembly language, different from Flash ActionScript, which is an interpreted language. As we know, assembly language is fast than interpreted language. And also, in Flash, we must define function in different layers to implement new features, the development efficiency is very low. But in Silverlight, because it is an assembly language, so we can use Visual Studio to organize all the code, and use OO during our development, the efficiency is highly improved. Third, Silverlight support Daily Build, Unit Test and other traditional software development process, it give us more tools to control our unpredictable process.<br /><br />    But Silverlight is not perfect, especially its performance. Up to now, the current version of Silverlight is 3, we expected Microsoft can improve the speed in the next release version. And also, some feature in Silverlight is not well supported in different browsers, such as Firefox, but Flash has no difference among all these browsers.<br /><br />    As a .NET developer, I prefer Silverlight, because I can use all my 6 years’ experiences in the Silverlight development. It’s exciting. I can animate my sprite in C#, such as running and attacking, Do you recall the world-famous game Diablo II, War Craft and Baldur&#39;s Gate II.<br /><br /> <br /><img src=\"http://images.cnblogs.com/cnblogs_com/Jax/WindowsLiveWriter/f383718ca96b_FAEA/image_thumb_2.png\" /><br />Picture-1  Baldur&#39;s Gate II<br /><br /> <br /><br />    Follow me, everybody. I will introduce you to a new world full of sword and magic. You will find the powerful of the Silverlight.<br /><br />    Go Go Go, Here we go!<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "game engine,game,Animation,Silverlight,MMORpg,Mirshahreza,",
  "LastEdited": "2011-01-12T21:41:33.477-08:00"
}