{
  "ProjectName": "slimdxcontrol",
  "Title": "SlimDXControl",
  "Description": "SlimDXControl is a WPF control that wraps the complexity of managing a D3DImage for you.  You just have to implement the actual DirectX rendering piece -- no messing about with device management or IsFrontBufferAvailableChanged.\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>Project Description</h1>\r\n<p>SlimDXControl is a WPF control that wraps the complexity of managing a D3DImage for you. You just have to implement the actual DirectX rendering pieces you care about -- no messing about with device management or IsFrontBufferAvailableChanged or window resizing\r\n events. <br>\r\n<br>\r\nD3DImage is a Microsoft-supplied WPF control that allows to embed DirectX/D3D9 graphics into a WPF application. Unfortunately, but necessarily, to use D3DImage you need to write quite a bit of code on the application side that is completely foreign to many\r\n WPF developers. Yes, you can find several good articles on the web on how to use D3DImage – from which I have learned much, thank you! -- but they are largely blogs or sample code snippets. The project is designed to be a standalone control, supported and\r\n maintained, that you can directly use in your code today.</p>\r\n<p>For documentation (usage and examples), go <a href=\"http://slimdxcontrol.codeplex.com/documentation\">\r\nhere</a>.</p>\r\n<p>Two caveats:</p>\r\n<ul>\r\n<li>SlimDXControl uses SlimDX (<a href=\"http://www.slimdx.org\">www.slimdx.org</a>) for all DirectX/D3D code.&#160; Yes, it means you have another package dependency, but many of us find this a small price to pay in order to get a full C# API for DirectX.&#160;\r\n You need to have the SlimDX DLLs available to you, as they are not included in this package.\r\n</li><li>SlimDXControl supports only DirectX/D3D10. It does not support DirectX 9. It also probably doesn't work under Windows XP, either.\r\n</li></ul>\r\n<p>This is an open source project, which means community involvement is critical.&#160; If you find bugs or have suggested improvements, post a note on the Discussions page or email me directly.</p>\r\n<p>See the <a href=\"http://slimdxcontrol.codeplex.com/wikipage?title=History%20and%20Credits\">\r\nHistory and Credits</a> page for more details on the history of this project.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "wpf,D3DImage,SlimDX,",
  "LastEdited": "2011-02-02T10:53:19.783-08:00"
}