{
  "ProjectName": "smartpaginator",
  "Title": "SmartPaginator",
  "Description": "SmartPaginator offers an alternative to the out-of-the-box Microsoft DocumentPaginator. It supports extra features like page headers, page footers and repeating table headers.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />SmartPaginator offers an alternative to the out-of-the-box Microsoft DocumentPaginator. It supports extra features like page headers, page footers and repeating table headers.<br />\n<h1>Introduction</h1>\r\nThis project is still in its very early stages. The solution contains two projects:<br /><br />- <b>SmartPaginator</b>: the class library that contains all the working code.<br />- <b>TestApp</b>: the test application that I use to test the functionality of the paginator.<br />\n<h2>Update (17/Mar/2012)</h2>\r\nThis project is being superseeded by the <a href=\"http://sdf.codeplex.com/\">Smart Document Framework</a> project. Honestly, we think there are enough differences that it is better to treat it as a complete separate document structure to avoid confusion. If, however, you&#39;d like to continue the work on Smart Paginator which just extends the FlowDocument classes, please contact me.<br />\n<h2>Release 0.4</h2>\r\nRelease 0.4 is now available. It adds support for <b>page columns</b> and limited support for <b>figures</b>.  The <a href=\"https://smartpaginator.codeplex.com/documentation?referringTitle=Home\">documentation</a> has been updated appropriately. Please check the information on <a href=\"https://smartpaginator.codeplex.com/wikipage?title=Figures&referringTitle=Home\">figures</a> as these are treated differently in SmartPaginator.<br /><br /><b>If you have any issues paginating a particular document, please send us the source XAML and we&#39;ll make sure to include it in our test suite.</b><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "table,WPF,FlowDocument,footer,DocumentPaginator,repeating,row,header,",
  "LastEdited": "2012-03-16T17:21:33.097-07:00"
}