{
  "ProjectName": "SpellCheckTextbox",
  "Title": "Spell Check Winforms TextBox.",
  "Description": "WinForms TextBox with spell checking.  \r\n\r\nThis WinForms control encapsulates the WPF textbox which has in built spell-checking. Only uses .net framework so you should be able to use this control without installing any extra libraries.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />WinForms TextBox with spell checking.  <br /><br />This WinForms control encapsulates the WPF textbox which has in built spell-checking. Only uses .net framework so you should be able to use this control without installing any extra libraries.<br />\n<h2>Overview </h2>\r\nI currently work on Winforms applications in my job, and I am looking at WPF/Silverlight in my spare time. When I saw the spell checking features in the WPF TextBox I realized that this functionality would come in very useful in our applications. So I decided to try to add this functionality to a TextBox.<br /><br />The way it works is by having a WPF user control that has a WFP textbox filling its own surface. This WPF user control is then embedded into a standard Winforms control, which is what you use in your application. Doing it this way meant that no extra files (dictionaries etc) needed to be included, file sizes are kept low, and installation is very simple.<br />\n<h2>Requirements </h2>\r\nThe control was developed in Visual Studio 2010 and requires nothing except the .net 4.0 framework installed. The compiled DLL is small (approx 15k in size) and you can easily add extra functionality if required. If you need this control for an earlier version of .net you can probably compile the source against the relevant framework<br />\n<h2>Functionality </h2>\r\nNote there is a simple code sample that show the functions below being used. The main new functionality is listed below<br /><br /><b>SpellCheck \t\tbool</b><br /><br />When set to true a red line is put under any mis-spelt words. Right clicking these words brings up a list of possible correct spellings<br /><br /><b>ChangedColor                                Color</b><br /><br />You can set the text background Color to be displayed in a different Color if the user has changed the text in the text box by setting this property. If you do not want this feature set the ChangedColor to be the same as the BackColor.<br /><br /><b>OriginalText                                  string</b><br /><br />This is the original text value. If the text in the textbox is different from this value, then the background color will be displayed in a different color (ChangedColor). Also the TextHasBeenChanged property checks the Text property against this to determine whether the text has been changed.<br /><br /><b>SetValue\t                                    string</b><br /><br />This is used to initialize the textbox. It sets both the Text and OriginalText Property, so that the given text is displayed with the unchanged background color, and the textbox does not think that its value has been changed. <br /><br /><b>TextHasBeenChanged\tbool</b><br /><br />Return true if the text has been changed (OriginalText property != Text Property)<br /><br /><b>AcceptsReturn\t\tbool</b><br /><br />The text box accepts the return key<br /><br /><b>AcceptsTab\t\tbool</b><br /><br />The textbox accepts tab (Pressing tab inserts a tab into the text and does not tab to the next input control)<br /><br /><b>TextType\t\t                 TextTypes</b><br /><br />This can take one of 4 values:<br /><b>TextTypes.String</b> - Any value can be entered<br /><b>TextTypes.Int</b> - Only integer values can be entered<br /><b>TextType.Currency</b> - Currency/floating point numbers may be entered<br /><b>TextType.Name</b> - Any value can be entered, but the 1st letter of each word is capitalized so when entering names/addresses the word are capitalized correctly even if the user has not done it<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "WinForms,spell check,TextBox,UserControls,",
  "LastEdited": "2011-09-18T04:25:17.333-07:00"
}