{
  "ProjectName": "spritetool",
  "Title": "Basic Sprite Sheet Creator",
  "Description": "A basic c# program to create sprite sheets. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A basic c&#35; program to create sprite sheets. <br /><br /><a href=\"http://coderplex.blogspot.com/\">Website</a><br /><br />Seven Part tutorial available on my blog here<br /><a href=\"http://coderplex.blogspot.com/2010/04/basic-sprite-sheet-creator.html\">Original Post</a><br /><a href=\"http://coderplex.blogspot.com/2010/04/2d-animation-part-1-basics.html\">Part 1: The Basics</a><br /><a href=\"http://coderplex.blogspot.com/2010/04/2d-animation-part-2-sprite-manager.html\">Part 2: Sprite Manager</a><br /><a href=\"http://coderplex.blogspot.com/2010/04/2d-animation-part-3-frame-animation.html\">Part 3: Frame Animation</a><br /><a href=\"http://coderplex.blogspot.com/2010/04/2d-animation-part-4-sprite-animation.html\">Part 4: Sprite Animation</a><br /><a href=\"http://coderplex.blogspot.com/2010/04/2d-animation-part-5-multiple-animations.html\">Part 5: Multiple Animations</a><br /><a href=\"http://coderplex.blogspot.com/2010/04/2d-animation-part-6-custom-animations.html\">Part 6: Custom Animations</a><br /><a href=\"http://coderplex.blogspot.com/2010/04/2d-animation-part-7-using-custom.html\">Part 7: Using Custom Animations</a><br /><br />Copy from blog post<br />The next program I would like to share is my sprite sheet creator. Using sprite sheets is, for the most part, pretty tedious especially to the new programmer. First, this sprite sheet creator is only meant for simple sprite sheets such as dice, loading animations or something similar to that. This post will just be an introduction with a brief introduction on how to use the tool with a screenshot, and latter I will explain step-by-step the code in the creator plus code that will take your sprite sheet and allow you to animate it in two different ways.<br /><br />The Sprite Sheet can be separated into 8 different animations, more than that and I suggest using more than one sheet. To add a new animation click the browse button for animation 1, triple dot is browse. This will open the browse for files dialog, navigate to the directory with your images and select all the images that are for this animation so that you add all the images into your first animation. Repeat this until you have all the animations you want completed. Note make sure that your images are all the same size and that the first animation is the longest otherwise it will crash. Again just a basic tool nothing super fancy. After you do that you can opt to have a one pixel border, sometimes this will make the image look nicer. Next click the &quot;Go&quot; button, a save file dialog will appear asking you where to save it, simply browse to the desired directory and select a filename. A progress window will show the current process and status and when it is completed just close the window and you are done.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "c#,xna,spritesheet,sprite,sheet,.net,halfpint1170,2d,animation,winforms,bitmap,saving images,tutorial,example,XNA Sprites,",
  "LastEdited": "2010-04-27T23:58:27.083-07:00"
}