{
  "ProjectName": "spriteatlaspacker",
  "Title": "Sprite Atlas Packer",
  "Description": "SpriteAtlasPacker is based on the excellent SpriteSheetPacker by Nick Gravelyn. I have hacked it up to support animations instead of just fixed frames.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />SpriteAtlasPacker is based on the excellent SpriteSheetPacker by Nick Gravelyn. I have hacked it up to support animations instead of just fixed frames.<br /><br />Sprite Atlas Packer works by taking the input directory and searching it and subdirectories for images. Each directory is considered to be a separate animation (although there are limitations, keep reading). For a directory to be considered an animation, all images within that directory need to be named with increasing integers. Otherwise, each image is treated as a single frame &quot;animation&quot;, and treated accordingly.<br /><br />Example:<br />c:\\project\\assets\\spritesheet\\<br />files: castle.png, grass.png, logo.png<br />subdirectories: fireball, wizard walk, boulders<br /><br />fireball files: 0.png, 1.png, 2.png<br />wizard walk files: 0.png, 1.png, 2.png, 3.png, 4.png<br />boulders: small.png, medium.png, large.png<br /><br />If you point the SpriteAtlasPacker to c:\\project\\assets\\spritesheet\\, it will generate eight animations. Three animations, &quot;castle&quot;, &quot;grass&quot;, and &quot;logo&quot; will have a single frame each. So will each of the boulder animations (currently, they will be named &quot;small&quot;, &quot;medium&quot;, and &quot;large&quot;, but I&#39;ll be adding the &quot;boulder&quot; prefix to them in the next release). The fireball animation will have three frames, and the wizard walk animation will have five frames.<br /><br />There&#39;s the quick and ugly description of what SpriteAtlasPacker does. Check back later for much better documentation and examples.<br /><br />As of now, the app works, passably. I still have a lot to do, but I am currently able to fire animated fireballs with minimal headache in my app. Again, I&#39;ll post some examples soon.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-04-22T00:05:02.78-07:00"
}