{
  "ProjectName": "timelinecontrol",
  "Title": "Timeline Control",
  "Description": "Timeline control fill a missing part in WPF toolbox.\nIt allow you to show visual representation of data on visual timeline such as present in MS Project application.\nTimelineControl is highly customizable using DataTemplate and Style and is 100% C# WPF managed code.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>TimelineControl</b><br />Timeline control fill a missing part in WPF toolbox.<br />It allow you to show visual representation of data on visual timeline such as present in MS Project application.<br />TimelineControl is highly customizable using DataTemplate and Style and is 100&#37; C&#35; WPF managed code.<br /><br /><img src=\"/projects/timelinecontrol/c7c460d8-93e1-49d7-93f4-9cbe40693d05\" alt=\"SmallScreenShot.png\" title=\"SmallScreenShot.png\" /><br /><br /><b>New 1.1.0.0 version release</b><br /><br /><b>About TimelineControl</b><br />TimelineControl was born during my work on a project called D.N.A. which required to present data on visual timeline.<br />I have google for WPF timeline control but with very little results. So I took the little result found and start getting into the subject.<br />The result is this TimelineControl that is 100% WPF managed code control which take advantage of DataTemplate, Style and ItemsPanel.<br />This control is customizable to your needs.<br /><br />I have implemented a GanttItemsPresenter which arrange the items from left (minimum date) to right (maximum date) and top to bottom order is controlled by properties on your data entities.<br /><br />TimelineControl also support connections between items. In my project I use them to present dependencies between tasks.<br /><br />There is complete separation between your data model and the visual model of the TimelineControl.<br /><br />See the test application for more information.<br /><br />Go to <a href=\"https://timelinecontrol.codeplex.com/wikipage?title=Screen%20Shots&referringTitle=Home\">Screen Shots</a> to see the control in action.<br /><br />You can create fully functional WPF gantt application with this control, see the sample application. <br /><br /><b>What&#39;s New?</b><br /><br />The TimelineControl now tracks both Items and Connections collections.<br />When you add or remove any of them the TimelineControl will update as needed.<br /><br /><b>Limitations</b><br /><br />The TimelineRuler control, used to display date and time, is not as good as I want it to be.<br />There are not enough virtualization so very long timeline might be slow. By long I mean 5 years and above. <br /><br /><b>Thanks</b><br />I have used the <a href=\"http://www.codeproject.com/KB/WPF/SpiderControl.aspx\">FrictionScrollViewer</a> in this project. The article and license can be found <a href=\"http://www.codeproject.com/KB/WPF/SpiderControl.aspx\">here</a><br />I have include the <a href=\"http://blogs.windowsclient.net/ricciolocristian/archive/2008/03/22/a-complete-wpf-treelistview-control.aspx\">TreeListView</a> in the library (not used it inside TimelineControl) and also I have used it in the sample application. The article and licence can be found on the <a href=\"http://blogs.windowsclient.net/ricciolocristian/archive/2008/03/22/a-complete-wpf-treelistview-control.aspx\">here</a>.<br /><br /><b>Todo</b><br />\n<ol><li>Add change tracking to individual items</li>\n<li>Make TimelineRulerControl display date and times more clearly</li>\n<li>Make TimelineControl virtualize as much as possible to allow long duration (10Y+) timeline fast.</li></ol>\n<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "timeline,gantt,Scheduling,schedule,wpf,",
  "LastEdited": "2012-02-22T14:32:23.01-08:00"
}