{
  "ProjectName": "wpffx",
  "Title": "Windows Presentation Foundation Pixel Shader Effects Library",
  "Description": "Library with Pixel Shader Effects and Transition Effects for WPF 3.5 SP1 ... ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Library with sample HLSL effects for WPF and Silverlight applications. <br /><br />Initial seed includes: <br />Effects: <br />BandedSwirl, Bloom, BrightExtract, ColorKeyAlpha, ColorTone, ContrastAdjust, DirectionalBlur, Embossed, Gloom, GrowablePoissonDiskEffect, InvertColor, LightStreak, Magnify, Monochrome, Pinch, Pixelate, Ripple, Sharpen, SmoothMagnify, Swirl, Tone, Toon, and ZoomBlur <br /><br />Transition Effects: <br />BandedSwirl, Blings, Blood, CircleReveal, CircleStretch, CircularBlur, CloudReveral, Cloudy, Crumble, Dissolve, DropFade, Fade, LeastBright, LineReveal, MostBright, PixelateIn, PixelateOut, Pixelate, RadialBlur, RadialWiggle, RandomCircleReveal, Ripple, Rotate, Saturate, Shrink, SlideIn, SmoothSwirl, Swirl, Water, Wave. <br /><br />Video demonstrating the effects <a href=\"http://channel9.msdn.com/shows/Continuum/WPFFXDemo/\">http://channel9.msdn.com/shows/Continuum/WPFFXDemo/</a> <br />Tutorial on writing pixel shader effects <a href=\"http://cid-123ec1ed6c72a14a.skydrive.live.com/browse.aspx/Public/HLSL\">http://cid-123ec1ed6c72a14a.skydrive.live.com/browse.aspx/Public/HLSL</a> <br />Blog post announcing the library with useful links <a href=\"http://blogs.msdn.com/jaimer/archive/2008/10/03/announcement-wpf-shader-effects-library-on-codeplex.aspx\">http://blogs.msdn.com/jaimer/archive/2008/10/03/announcement-wpf-shader-effects-library-on-codeplex.aspx</a> <br /><br /><b>Requirements</b>: <br />This requires .NET framework 3.5 SP1  and requires Direct X SDK at compile time.. (to build the PS files). <br />This also uses the  Shader Effects BuildTask and Templates from the WPF futures samples at <a href=\"http://www.codeplex.com/wpf\">http://www.codeplex.com/wpf</a> <br />For silverlight,  Silverlight 3 Preview ( released at MIX09) and the corresponding tools are needed. <br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "watch,WPF,MyList.WPF,effects,*,favorite,DirectX,Silverlight,WPF Effect,",
  "LastEdited": "2009-03-26T11:01:48.793-07:00"
}