{
  "ProjectName": "wpfgooglesearch",
  "Title": "WPF Google Search",
  "Description": "A WPF Google search module that can easily be inserted into any WPF application. Uses Google Suggest and Google Search APIs asynchronously.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A WPF Google search module that can easily be inserted into any WPF application. Uses Google Suggest and Google Search APIs asynchronously.<br /><br /><img src=\"/projects/wpfgooglesearch/834a616c-6757-445a-8605-2175f39ee5d4\" alt=\"Screenshot.png\" title=\"Screenshot.png\" /><br /><br />This project encapsulates various technologies and techniques used to produce a fully-fledged Google search engine in a WPF desktop application.  As well as replicating the look and feel of the Google website, this code leverages both the Google Suggest API, which returns search suggestions in XML format, and the Google Search API, which returns search results in JSON format.  Both APIs take RESTful requests.<br /><br />The code demonstrates the use of XAML styles and control templates to recreate the look and feel of Google, but, under the hood, it uses TPL to perform the searches asynchronously so as not to hinder the user interface.<br /><br />What you have here is a useful Google search module that can easily be inserted into any WPF application that demonstrates proper techniques in order to effect a responsive GUI and handle asynchronous calls to the Web in a robust and efficient fashion.<br /><br />The project uses and adapts some code from the <a href=\"http://wpfactb.codeplex.com\">WPF AutoComplete TextBox Control</a>.<br /><br /><b>Improvements to be made:</b>\n<ul><li>To replace or modify the auto complete functionality to use the <a href=\"http://msdn.microsoft.com/en-us/library/microsoft.teamfoundation.mvvm.autocompletebehavior.aspx\">AutoCompleteBehavior Class</a>.</li>\n<li>To replace the coded <i>RelayCommand&lt;T&gt;</i> class with the Microsoft version of the <a href=\"http://msdn.microsoft.com/en-us/library/microsoft.teamfoundation.mvvm.relaycommand.aspx\">RelayCommand Class</a>.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,xml,WPF,JSON,xaml,Search,Google,asynchronous,TPL,Suggest API,Search API,auto suggest,ControlTemplate,",
  "LastEdited": "2012-12-23T15:53:04.62-08:00"
}