{
  "ProjectName": "WpfSharpMapControls",
  "Title": "WPF SharpMap Controls",
  "Description": "WPF SharpMap Controls is a set of WPF mapping controls, based on the SharpMap 2.0 GIS engine (http://www.codeplex.com/SharpMap). \nWPF SharpMap Controls goal is to provides an easy to use, high performing and comprehensive set of classes, which can be used “out of the box” and add a rich mapping experience to any WPF application. \n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><br /><b>WPF SharpMap Controls</b>, as its name implies, is a set of WPF mapping controls, based on the <a href=\"http://www.codeplex.com/SharpMap\">SharpMap 2.0 GIS engine</a>. <br />The main goal of this project is to provide an easy to use, high performing and comprehensive set of classes, which can be used “out of the box” to add a rich mapping experience to any WPF application. <br /><br />A longer term goal, is to provide an extensible framework for WPF GIS applications, including the ability to create new editors, tools, and visualizes.  The inspiration for the extensibility architecture is the <a href=\"http://msdn2.microsoft.com/en-us/library/bb514646.aspx\">Visual Studio 2008 WPF designer</a> a.k.a “Cider”.<br /><br />WPF ShapMap Controls is written in C# and requires .net framework 3.5. It is released under <a href=\"http://www.codeplex.com/SharpMap/Project/License.aspx\">GNU Lesser General Public License</a>.\n<h2>A word of caution</h2>\rSince this project is highly dependent on <a href=\"http://www.codeplex.com/SharpMap\">SharpMap</a>, I’d like to mention several implications:\n<ol><li><b>Releases schedule is dependent on <a href=\"http://www.codeplex.com/SharpMap\">SharpMap 2.0 GIS engine</a></b>. Except for “dev snapshots” there will be no releases of this project before SharpMap 2.0 Beta 2.0 release.</li>\n<li><b>Interfaces are dependent on SharpMap</b>. Although I make an effort to have relatively orthogonal design and interface separation,  the interfaces of WPF SharpMap Controls will remain pretty unstable due to the possible changes to SharpMap. This is extremely relevant due to the upcoming porting of the geometries to <a href=\"http://www.codeplex.com/GeoAPI\">GeoAPI</a> and <a href=\"http://code.google.com/p/nettopologysuite/\">NTS</a>.</li>\n<li><b><a href=\"http://www.codeplex.com/SharpMap\">SharpMap</a>design decisions and interface definitions have higher priority</b> - at least until this project matures, compatibility with SharpMap will be preferred to interface stability of the WPF Controls. </li></ol>\n<br />Finally, as this project is making its first steps, things aren’t stable in general.<br />Adding to it the fact that <a href=\"http://www.codeplex.com/SharpMap\">SharpMap</a> is still in its deep (and important) refactoring stages, and as I found in SharpMap’s forum – people are still having trouble to build latest commits – the source tree of this project temporarily contains also the SharpMap tree (dated to somewhere around the beta1 release.<br />Of course, once everything get stabilized – <a href=\"http://www.codeplex.com/SharpMap\">SharpMap</a> will be used here as external binary dependency, to avoid duplication and other mess.. <br /><br /><a href=\"https://wpfsharpmapcontrols.codeplex.com/wikipage?title=High%20Level%20Design&referringTitle=Home\">High Level Design</a><br /><br /><br /><br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,SharpMap,GIS,WPF controls,WPF SharpMap Control,",
  "LastEdited": "2008-04-23T21:40:49.95-07:00"
}