{
  "ProjectName": "xamldialects",
  "Title": "XAML Dialect Comparer Tool",
  "Description": "This tool allows for comparison of different XAML dialects and utilized framework namespaces. Want to know if your Silverlight project will translate well to Windows 8 Metro? And whether your Metro assets can be reused in your Windows Phone app? And how about that WPF app?\r\n\r\nThis helpful tool provides some interesting metrics. Note that it only compares types/classes and all their members. It makes no comparison of behavior differences between classes and members of identical names.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nThis tool allows for comparison of different XAML dialects and utilized framework namespaces. Want to know if your Silverlight project will translate well to Windows 8 Metro? And whether your Metro assets can be reused in your Windows Phone app? And how about\r\n that WPF app?<br>\r\n<br>\r\nThis helpful tool provides some interesting metrics. Note that it only compares types/classes and all their members. It makes no comparison of behavior differences between classes and members of identical names.</p>\r\n<h1>Overview</h1>\r\n<p>The idea behind this utility is to compare different XAML &quot;dialects&quot; (WPF, Silverlight, Windows Phone, Metro) or, more accurately, the framework objects used by those dialects.\r\n<br>\r\n<br>\r\nThis first version is a rough draft that needs a lot of cleanup (and as a result has some serious performance issues, especially during first startup).</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Questions? Contact Us!</strong><br>\r\nJust because this tool is free, doesn't mean it's unsupported!&nbsp; If you have questions or need help analyzing your results, please contact\r\n<a href=\"mailto:cReynolds@codemag.com\">Christopher Reynolds </a>or call 832-717-4445 ext 13.</p>\r\n<p><br>\r\n<br>\r\n<img src=\"http://download.codeplex.com/Download?ProjectName=xamldialects&DownloadId=362274\" alt=\"\"></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "xaml,WPF,Silverlight,windows phone,Metro,Compatibility,",
  "LastEdited": "2012-06-29T09:08:55.62-07:00"
}