{
  "ProjectName": "xreactor",
  "Title": "xReactor",
  "Description": "Leverages Reactive Extensions and Linq Expressions to make GUI programming as close to the reactive paradigm as possible. Especially usable for WPF.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>xReactor for .NET</h1>\r\n<b>Note on stability</b><br />First release version of the project is only a few steps ahead as the core concepts are becoming more complete and mature. Changes to the presented functionality are still possible, though. <br /><br /><b>What can it do?</b><br />This library combines Reactive Extensions and Linq Expressions to let you set up relations between properties in a manner as close to the reactive paradigm as possible. Designed with independence of any specific GUI technology on mind, it has a particular strength in WPF applications. It is also easy to plug into your application, no matter what MVVM framework you use.<br /><br />In GUI programming there&#39;s often a need to listen to changes occurring on multiple nested objects. Of course, you could attach PropertyChanged event handlers yourself, but going through the same configuration steps repeatedly is tiresome and error-prone. This little framework is supposed to automatize these tasks.<br /><br />xReactor allows you to write something like:<br /><br /><div style=\"color:Black;background-color:White;\"><pre>\r\nReact.To(() =&gt; AverageYearlyIncome * Years).Set(() =&gt; TotalIncome);\r\n</pre></div><br />The above makes the <i>TotalIncome</i> always be set to the value of expression <i>AverageYearlyIncome * Years</i> and does not require any further set-up or attaching event handlers from you. Every time either <i>AverageYearlyIncome</i> or <i>Years</i> property changes, the entire expression is re-evaluated and the result is assigned to the <i>TotalIncome</i> property. The only requirement is that the class declaring <i>AverageYearlyIncome</i> and <i>Years</i> properties implements the INotifyPropertyChanged interface and raises appropriate notification events. xReactor has tools to take off the burden of repeating the typical INotifyPropertyChanged boilerplate, but more on that later.<br />\n<h2>Quick Overview</h2>\rTo get started with basic features it&#39;s not needed to write any additional code for the sake of setting xReactor up. xReactor is also easily pluggable into existing projects as it does not restrict the structure of the model layer. You can use the <i>React.To(...)</i> syntax with any objects implementing INotifyPropertyChanged, while still sticking to the MVVM framework of your choice.<br /><br />The expression to be put in the <i>React.To(...)</i> method can be quite complex, as pretty many language constructs are supported.<br /><br /><b>Deep notifications</b><br /><div style=\"color:Black;background-color:White;\"><pre>\r\nReact.To(() =&gt; DocumentManager.ActiveDocument.Objects.Count)\n     .Set(count =&gt;Status.Text = <span style=\"color:#A31515;\">&quot;Number of objects is &quot;</span> + count.ToString());\r\n</pre></div><br />which would cause status be set whenever the expression in the <i>React.To(...)</i> method call changes. That is when:\n<ul><li>the number of elements in the Objects collection changes</li>\n<li>when the Objects property is set somewhere to a different collection instance</li>\n<li>when ActiveDocument is changed</li>\n<li>when DocumentManager property is set to another instance</li></ul>\n<br /><b>Math expressions</b><br /><div style=\"color:Black;background-color:White;\"><pre>\r\nReact.To(() =&gt; Math.Cos(Angle) * X + Math.Sin(Angle) * Y).Set(() =&gt; Z);\r\n</pre></div><br /><b>Coalesce / Ternary conditional / Type operators</b><br /><div style=\"color:Black;background-color:White;\"><pre>\r\nReact.To(() =&gt; UserText ?? FallbackText)\n     .Set(() =&gt; DisplayText);\nReact.To(() =&gt; <span style=\"color:Blue;\">string</span>.IsNullOrEmpty(UserText) ? FallbackText : UserText)\n     .Set(() =&gt; DisplayText);\nReact.To(() =&gt; UnknownObject <span style=\"color:Blue;\">is</span> <span style=\"color:Blue;\">string</span>)\n     .Set(value =&gt; DisplayText = (<span style=\"color:Blue;\">string</span>)value);\r\n</pre></div><br /><b>Using Arbitrary Rx Extension Methods</b><br /><div style=\"color:Black;background-color:White;\"><pre>\r\nReact.To(() =&gt; Math.Cos(Angle) * X + Math.Sin(Angle) * Y)\n     .Where(val =&gt; val &gt; 0).Select(val =&gt; val * 2)\n     .Throttle(TimeSpan.FromSeconds(0.5))\n     .Set(() =&gt; Z);\r\n</pre></div><br /><b>Tracking changes on individual collection items</b><br /><div style=\"color:Black;background-color:White;\"><pre>\r\nReact.To(() =&gt; People.TrackItems(person =&gt; person.Age))\n     .Where(people =&gt; people.Any())\n     .Select(people =&gt; people.Average(person =&gt; person.Age))\n     .Set(() =&gt; AverageAge);\r\n</pre></div><br /><i>AverageAge</i> will be kept in sync whenever <i>Age</i> of any person in the collection changes.<br /><br /><b>Automatic PropertyChanged raising</b><br /><div style=\"color:Black;background-color:White;\"><pre>\r\n<span style=\"color:Blue;\">public</span> <span style=\"color:Blue;\">double</span> AverageAge\n{\n    <span style=\"color:Blue;\">get</span>;\n    <span style=\"color:Blue;\">private</span> <span style=\"color:Blue;\">set</span>;\n}\n\nReact.To(() =&gt; People.TrackItems(person =&gt; person.Age))\n     .Where(people =&gt; people.Any())\n     .Select(people =&gt; people.Average(person =&gt; person.Age))\n     .SetAndNotify(() =&gt; AverageAge);\r\n</pre></div><br />The <i>SetAndNotify</i> method can be used to automatically raise property change notifications. Then the property definition is much more concise as it is not required to raise the <i>PropertyChanged</i> event manually from within the property&#39;s setter. <br /><br />This approach seems to have some limitations, though. All changes to the property would have to be applied via the <i>SetAndNotify</i> method not to miss the notifying procedure. That being said, &quot;reactive&quot; properties are usually results of some internal operations on other properties. This way, keeping the setter private prevents external actors from modifying the property from outside.<br /><br /><b>Property&lt;T&gt; class</b><br />The <i>React.To(...)</i> syntax is quite flexible, particularly because it does not require deriving logic objects from a common specialized base class. This renders xReactor very easy to plug in, no matter what MVVM framework in use in a specific project. In fact, xReactor could be used as a glue layer between components written in different MVVM frameworks. However, such a custom specialized base class still ships along with xReactor.<br /><br />Classes deriving from <i>ReactiveBase</i> can facilitate some &#39;bonuses&#39;  out of the box. One of these is the <i>Property&lt;T&gt;</i> wrapper, which raises property changes, supports fluent-style validation and (of course) exposes a value via a standard CLR property:<br /><div style=\"color:Black;background-color:White;\"><pre>\r\n<span style=\"color:Blue;\">private</span> Property&lt;<span style=\"color:Blue;\">int</span>&gt; totalIncomeProperty;\n<span style=\"color:Blue;\">public</span> <span style=\"color:Blue;\">int</span> TotalIncome\n{\n    <span style=\"color:Blue;\">get</span> { <span style=\"color:Blue;\">return</span> totalIncomeProperty.Value; }\n    <span style=\"color:Blue;\">private</span> <span style=\"color:Blue;\">set</span> { totalIncomeProperty.Value = value; }\n}}\r\n</pre></div><br />It is necessary to initialize the <i>Property&lt;T&gt;</i> object before use, typically in constructor of the owner class.<br /><div style=\"color:Black;background-color:White;\"><pre>\r\ntotalIncomeProperty = <span style=\"color:Blue;\">this</span>.Create(() =&gt; TotalIncome, () =&gt; AverageYearlyIncome * Years)\r\n</pre></div><br />An additional advantage of this approach is possibility of ensuring that the value satisfies a set of conditions before it is set, e.g:\n<ul><li>ensure <i>TotalIncome</i> is always non-negative; throw exception otherwise</li></ul>\n<div style=\"color:Black;background-color:White;\"><pre>\r\ntotalIncomeProperty.Require(total =&gt; total &gt;= 0, <span style=\"color:#A31515;\">&quot;Must be non-negative&quot;</span>);\r\n</pre></div><ul><li>ensure <i>TotalIncome</i> is always non-negative; change the value to 0, if it is less</li></ul>\n<div style=\"color:Black;background-color:White;\"><pre>\r\ntotalIncomeProperty.Coerce(total =&gt; Math.Max(0, total), <span style=\"color:#A31515;\">&quot;Must be non-negative&quot;</span>);\r\n</pre></div><br /><b>Full working samples</b><br />These can be found in the latest source code. There are currently 2 simple GUI-based sample apps in the solution:\n<ul><li>xReactor.WpfSample : leverages the <i>ReactiveBase</i> class</li>\n<li>xReactor.Samples.MVVMLight : as the name says, uses MVVMLight Toolkit</li></ul>\n<br /><b>How does it work?</b><br />Implemented mechanisms leverage INotifyPropertyChanged interface and the System.Linq.Expressions. When you provide a reactive expression like this:<br /><div style=\"color:Black;background-color:White;\"><pre>\r\n() =&gt; AverageYearlyIncome * Years\r\n</pre></div><br />xReactor investigates the expression tree in search for properties, on which the entire expression value depends. It finds that these are <i>AverageYearlyIncome </i> and <i>Years</i> properties. If properties found are defined on an instance that implements INotifyPropertyChanged, event handlers are attached to it to listen to changes of  <i>AverageYearlyIncome </i> and <i>Years</i>  properties. Every time such a change occurs, the expression is recalculated and assigned, i.e. to the <i>TotalIncome</i> property. <br /><br /><b>Points of interest and remarks</b><br />xReactor is already capable of handling more sophisticated expressions including method calls, lambdas and collection changes (including deep tracking of individual INPC items in a collection). For complete samples please refer to the latest source code. <br /><br />Currently, the most urgent goals for xReactor are:\n<ul><li>adding a NuGet package</li>\n<li>creating good documentation</li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,WPF,reactive,MVVM,Rx,",
  "LastEdited": "2014-01-19T11:57:26.74-08:00"
}