{
  "ProjectName": "ajaxmin",
  "Title": "Microsoft Ajax Minifier",
  "Description": "The Microsoft Ajax Minifier enables you to improve the performance of your Ajax applications by reducing the size of your Cascading Style Sheet and JavaScript files.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><b>Project Description</b> <br>\r\n</p>\r\n<p>The <strong>Microsoft Ajax Minifier</strong> enables you to improve the performance of your web applications by reducing the size of your Cascading Style Sheet and JavaScript files.\r\n<br>\r\n<br>\r\nMinify <i>both</i> JS and CSS files, and now optionally produce <a href=\"http://ajaxmin.codeplex.com/wikipage?title=SourceMaps\">\r\nSource Maps</a> for JavaScript files. <br>\r\n<br>\r\nUse the <font face=\"Courier New\">-analyze</font> <a href=\"http://ajaxmin.codeplex.com/wikipage?title=Command-Line%20Switches\">\r\noption</a> on the command-line to provide lint-style syntax checking and variable analysis of your code.\r\n<br>\r\n<br>\r\nUse the <font face=\"Courier New\">-pretty</font> <a href=\"http://ajaxmin.codeplex.com/wikipage?title=Command-Line%20Switches\">\r\noption</a> on the command-line to output in a nice, easy-to-read multi-line format (good for\r\n<i>un</i>-minifying minified code). <br>\r\n<br>\r\nThis project is the active source project for the Microsoft Ajax Minifier tool, and contains the latest version of the AjaxMin tool -- both binary drops and the source code, released under the Apache 2.0 Open Source License. External entities may not use the\r\n sources except in compliance with the License agreement, which can be found at <a href=\"http://www.apache.org/licenses/LICENSE-2.0\" target=\"_blank\">\r\nhttp://www.apache.org/licenses/LICENSE-2.0</a>. Should you choose to download the sources and build them yourself, you will need to provide\r\n<em>your own AjaxMin.snk cryptographic key-pair</em> to sign the assemblies or you will get a\r\n<a href=\"http://ajaxmin.codeplex.com/wikipage?title=Build%20Error\">build error</a>.</p>\r\n<p>The Ajax Minifier project does not accept external submissions into the project codebase.\r\n<br>\r\n<br>\r\nJavaScript and CSS files minified with Ajax Minifier <em>should</em> work as-is; you shouldn’t have to do anything special in your code to get good results. If your file doesn’t work after minification, first check to see if your JavaScript code contains\r\n<a href=\"http://ajaxmin.codeplex.com/wikipage?title=Problems%20with%20Evals\"><strong>eval statements</strong></a> that might require you to use a different\r\n<font face=\"Courier New\">–evals</font> <a href=\"http://ajaxmin.codeplex.com/wikipage?title=Command-Line%20Switches\">\r\nswitch</a>. If your file <em>still</em> doesn’t work, please file a report on the “<a href=\"http://ajaxmin.codeplex.com/workitem/list/basic\">Issue Tracker</a>” page so I can get Ajax Minifier fixed.&#160;\r\n<br>\r\n<br>\r\nIf you have any new feature requests, please feel free to bring them up on the &quot;<a href=\"http://ajaxmin.codeplex.com/discussions\">Discussions</a>&quot; page. We cannot guarantee feature requests will make it into the code.\r\n</p>\r\n<p>&#160;</p>\r\n<p>&#160;</p>\r\n<p>There is an official <strong>NuGet</strong> package for the DLL version of Microsoft Ajax Minifier, if you prefer to manage your C# projects in that manner:</p>\r\n<h3 align=\"center\"><a href=\"http://nuget.org/packages/AjaxMin\"><font style=\"font-weight:bold\">http://nuget.org/packages/AjaxMin</font></a></h3>\r\n<p><br>\r\n<br>\r\nAjaxMin was created and is maintained by Ron Logan, with contributions from Eugene Chigirinskiy, Rafael Correa, Kristoffer Henriksson, and Marcin Dobosz.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "AJAX,minification,minifier,ASP.NET,ASP.NET MVC Tools,ASP.NET Tools,Minifier css-jsCMPRS,",
  "LastEdited": "2012-10-23T17:05:47.083-07:00"
}