{
  "ProjectName": "AJAXInterceptor",
  "Title": "AJAXInterceptor: AJAX-enable your web apps without writing a single line of code",
  "Description": "Just by adding this small JavaScript module to the end of your web pages, you get your form's submissions intercepted and, instead of sending request to the server in the usual way, they are done asynchronously and in an AJAX-style smooth way. \n\nAs long as it is a client-side library it will work with any server technology: ASP.NET, PHP, JSP, Classic ASP... and even with local HTM files.\n\nI've included extensibility so that you can add easily your own progress indicators (several included) and show error messages the way you prefer (by default it shows an alert).\n\nIt's transparent to your server code and could be used to add AJAX capabilities to some applications without writting a single line of code. \n\nDocumentation is included.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Just by adding this small JavaScript module to the end of your web pages, you get your form&#39;s submissions intercepted and, instead of sending request to the server in the usual way, they are done asynchronously and in an AJAX-style smooth way. <br /><br />As long as it is a client-side library it will work with any server technology&#58; ASP.NET, PHP, JSP, Classic ASP... and even with local HTM files.<br /><br />I&#39;ve included extensibility so that you can add easily your own progress indicators &#40;several included&#41; and show error messages the way you prefer &#40;by default it shows an alert&#41;.<br /><br />It&#39;s transparent to your server code and could be used to add AJAX capabilities to some applications without writting a single line of code. <br /><br />Documentation is included.<br /><br /><img src=\"/projects/AJAXInterceptor/9951bc03-e9e6-4166-a455-3dcd0262d3ed\" alt=\"AJAXInterceptor_reflection_small.gif\" title=\"AJAXInterceptor_reflection_small.gif\" /><br /><br />Features summary<br /><br />  • No-code AJAXification of web apps<br />  • Supports any server technology, including ASP.NET, JSP, PHP, ASP 3.0...<br />  • In ASP.NET it supports all kinds of postbacks: direct and by code.<br />  • Works in any modern browser that supports AJAX.<br />  • Supports cross-posting of forms, that is, you can send the information to any web page in the same domain. If all your web pages have AJAXInterceptor included (for example, you include it in your master page or template) you can hace<br />  • Respects your custom onsumit event handlers.<br />  • Supports browser history so that your users can hit the previous button and get the last rendered page.<br />  • Two versions of the module:<br />      - AJAXInterceptor.js: full commented one. Useful for debugging purposes.<br />      - AJAXINterceptor_r.js: reduced-size version. It downloads faster as it only is  2.6 kB in size. It&#39;s better to use this on production apps.<br />  • Automatically show/hide custom progress indicators.<br />  • Support for cancelling operations.<br />  • Support for custom message displaying.<br />  • Supports any form in your page<br /><br />Obviously this is not substitute at all of full-fledged APIs like Microsoft&#39;s ASP.NET AJAX, PHPLiveX or AJAX.NET, but will let you add AJAX support to your apps in a few seconds and without writing any code. Just give it a try!<br /><br />In the ZIP you will find teh module, a working sample with ASP.NET and a PDF with the help documentation.<br /><br />This project is just for fun :-)<br /><br />I will be very glad if you drop me a line in case you use AJAXInterceptor in any real-world application or if you enhance it with new features.<br /><br />Visit my .NET blog (Spanish) at <a href=\"http://www.jasoft.org\">http://www.jasoft.org</a> and my e-mail marketing blog (English) at <a href=\"http://www.theemailingexperience.com\">http://www.theemailingexperience.com</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,ASP,ASP.NET,php,javascript,",
  "LastEdited": "2008-01-16T16:19:21.13-08:00"
}