{
  "ProjectName": "autostyleit",
  "Title": "Auto Style It for PowerPoint 2010",
  "Description": "AutoStyle IT is a PowerPoint Addin that duplicates the selected slide x number of times so that each bullet (paragraph) will be highlighted on their own slide.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">By Data Juggler Software www.datajuggler.com .<br /><br />If you like this project, please donate it keeps us going!<br /><br /><a href=\"http://www.pledgie.com/campaigns/24373\"><img style=\"border:none;\" src=\"http://www.pledgie.com/campaigns/24373.png?skin_name=chrome\" alt=\"Donate to Data Juggler\" title=\"Donate to Data Juggler\" /></a><br /><br />Project Description<br />AutoStyle IT is a PowerPoint Addin that duplicates the selected slide x number of times so that each bullet (paragraph) will be highlighted on their own slide.<br /><br />AutoStyle IT is my first PowerPoint Addin.<br /><br />Now that I am making videos for Data Juggler Software, I found myself repeating the same task over and over in PowerPoint.<br /><br />I found it was nice in my videos to highlight one bullet on a slide and darken the other bullets so that I could demonstrate one task or feature.<br /><br />This wasn&#39;t so hard, duplicate the current slide x number of times, then highlight each bullet the desired colors. The problem would occur when I started making edits to a slide, and I would then find myself editing multiple slides and repeating the whole process again.<br /><br />So I decided to create my first PowerPoint Addin.<br /><br />Open the DataJuggler.Office.PowerPoint.AutoStyleIT.sln in either Visual Studio 2010 or Visual Studio 2012.<br /><br />Run the project and this should open PowerPoint 2010 (obviously you must have PowerPoint 2010 installed).<br /><br />Open the Sample PowerPoint presentation &#39;Regionizer.pptx&quot; which is located in the Samples directory of the download.<br /><br />Select the second slide, and click the Auto Style button.<br /><br />This should duplicate the selected slide two times, and highlight one bullet on each slide.<br /><br />I am working on an Installer, but for some reason the User Control installs but the button click doesn&#39;t do anything. I am releasing the code so that I can ask for help in a forum post with the code live.<br /><br />If anyone is real good at making installation programs or VSTO please contact me at support@datajuggler.com<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,PowerPoint,AddIn,VSTO,Office,Microsoft Office,Slide,",
  "LastEdited": "2014-03-04T06:20:31.187-08:00"
}