{
  "ProjectName": "CopyPad",
  "Title": "CopyPad",
  "Description": "As a developer I tend to do a lot of copy and pasting. As such before I know it i have about 20-30 instances of notepad open with copy and past snippets that I have taken during a period of work. \n\nThe problem is that if I want to save any of these it’s a really pain to go through and save half of those instances, catalogue then and then pick them up latter as i need them. Practically when most of them I won’t need again.\n\nSo what i decided to do was to create a little app/widget (note it’s NOT a vista widget) which helped me out. At the same time I decided to try my hand at something new and create it in WPF. \n\nAlso I don’t know about you guys but sometime i just want to check the spelling of something. So I either have to open up word to check or use Google. Each of these options take time if I don’t already have them open. Hence the bottom text box provides spell check.\n\nI have tried to make the experience as rich as i could so have a bit of a play around (i.e. try double clicking on a text box or the expand and collapse mentioned below). \n\nFind the following for basic functionality:\nDrag - You can drag it to any position on the screen by dragging the background. \nCollapse - Wave your mouse over the top left rectangle\nResize - Bottom right hand corner\nExpand from Collapse - wave your mouse over the app\n\nAll notes you make are stored in an XML in \"My Documents\". When you close down the app all notes are saved and when you open the app again it will ask if you want to start a new session or pick up the notes from the last session.\n\nIt’s pretty rough at the moment, but it seems to works well.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />As a developer I tend to do a lot of copy and pasting. As such before I know it i have about 20-30 instances of notepad open with copy and past snippets that I have taken during a period of work. <br /><br />The problem is that if I want to save any of these it&#8217;s a really pain to go through and save half of those instances, catalogue then and then pick them up latter as i need them. Practically when most of them I won&#8217;t need again.<br /><br />So what i decided to do was to create a little app&#47;widget &#40;note it&#8217;s NOT a vista widget&#41; which helped me out. At the same time I decided to try my hand at something new and create it in WPF. <br /><br />Also I don&#8217;t know about you guys but sometime i just want to check the spelling of something. So I either have to open up word to check or use Google. Each of these options take time if I don&#8217;t already have them open. Hence the bottom text box provides spell check.<br /><br />I have tried to make the experience as rich as i could so have a bit of a play around &#40;i.e. try double clicking on a text box or the expand and collapse mentioned below&#41;. <br /><br />Find the following for basic functionality&#58;<br />Drag - You can drag it to any position on the screen by dragging the background. <br />Collapse - Wave your mouse over the top left rectangle<br />Resize - Bottom right hand corner<br />Expand from Collapse - wave your mouse over the app<br /><br />All notes you make are stored in an XML in &#34;My Documents&#34;. When you close down the app all notes are saved and when you open the app again it will ask if you want to start a new session or pick up the notes from the last session.<br /><br />It&#8217;s pretty rough at the moment, but it seems to works well.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,copy,pad,",
  "LastEdited": "2008-05-09T18:25:31.363-07:00"
}