{
  "ProjectName": "Cubed",
  "Title": "Cubed Data Analysis Server",
  "Description": "Cubed provides multi-dimensional (OLAP) style analysis for MySQL, Microsoft SQL Server and Oracle. With Cubed you can connect to any existing data source, and re-structure the data into a cube allowing for fast, efficient viewing of the data by slicing it on its dimensions. In short - you can analyze your data any way you like, fast.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><img src=\"/projects/Cubed/e5cf0689-77c1-4b72-aff7-3bd169bb5c15\" alt=\"Cubed3.gif\" title=\"Cubed3.gif\" /><br /><br /><b>Welcome to Bamboo Software&#39;s Cubed(tm) project</b><br />This is the home page for the open source development of Cubed, a multi-dimensional analysis server built entirely in .NET, but able to run under both .NET on Windows and Mono on Linux - using Microsoft(r) SQL Server(tm), Oracle(r) and MySQL(r) databases.<br /><br /><b>Overview</b><br />The thinking behind this project is to provide a robust, flexible and most importantly - open source - version of an OnLine Analytical Processing System (OLAP). Currently under initial development, there are going to be a total of three distinct components which, added together, will form the basis of the Cubed 2007 initial release.<br /><br /><b>Cubed Server</b><br />The Cubed server is the brains of the Cubed system. It is an XML Web Service, and controls all of the core server functions through SOAP requests. This server provides consolidation, security and analysis functions.<br /><br /><b>Cubed Connect</b><br />Cubed Connect is a .NET data connection library, modelled on a standard .NET connector. It provides a connection object to facilitate connection to a Cubed server, as well as data retrieval and administration functions.<br /><br /><b>Cubed Designer</b><br />The Cubed Designer is a .NET Windows Forms application, built on top of the Cubed Connect library, which allows administrators to design cubes and their connections to underlying databases, publish their cubes, set access rights and create sample analyses and data views. It also serves as a working example of how to use the Cubed Connect library, and the underlying Cubed XML Web Service to manage data analysis through Cubed.<br /><br /><b>Features</b><br />Cubed has a number of new key features which set it apart from previous OLAP databases. Such as:\n<ul><li>Custom External Calculation interface</li>\n<li>Support for VB, C# and C++ .NET formulas for calculated members</li>\n<li>XML based configuration and support</li>\n<li>Easy to use management and design interface</li>\n<li>MDX support as well as Simple Enqlish Query&#39;s</li></ul>\n<br /><b>Contribution</b><br />Cubed is currently being designed and developed through Bamboo Software, an open source software company based in Melbourne, Australia. For the initial release, we are not looking for extended support or development partners. Once the design and beta versions of these three components are ready, however - we are interested in forming separate teams to continue development into the future. <br /><br /><b>Licensing</b><br />Cubed(tm) is released under a &quot;Dual Licensing&quot; model. This is similar to that used by the MySQL(r) Database server. Essentially, this means:\n<ul><li>Anybody can download the source, modify it and re-release it in full under the terms and conditions of the GNU Public License (GPL). However, this is restricted to purely Non-Commercial, Non-Profit situations.</li>\n<li>If the Cubed(tm) software is to be re-sold, or used in a commercial environment in any way which may benefit individuals or corporations in a financial sense, a license must be negotiated with Bamboo Software. For details, contain the project administrator.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "watch,",
  "LastEdited": "2006-08-20T06:03:21.073-07:00"
}