{
  "ProjectName": "CustomCssLink",
  "Title": "Custom CssLink control for the wiki pages of a SharePoint 2010 team site",
  "Description": "Replace the native CssLink by this custom control for removing the OOTB RTE styles in a wiki page of SharePoint 2010 Foundation.\r\nThis custom control wraps the native one in order to remove the link to the OOTB corev4.css that remains in the wiki pages while using an alternate CSS. \r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description<br>\r\n</strong><br>\r\nReplace the native CssLink by this custom control for removing the OOTB RTE styles in a wiki page of SharePoint 2010 team site.<br>\r\nThis custom control wraps the native one in order to remove the link to the OOTB corev4.css that remains in the wiki pages while using an alternate CSS or a defaultUrl.\r\n<br>\r\n<br>\r\nThis is a beta version because for now it is not recommended if you plan to use the SharePoint 2010 themes, and there is maybe a better approach for the code, but if you don't plan to use the themes you could use it as well.<br>\r\nIt could also be a starting point for a team&nbsp;for developing a more complete version.</p>\r\n<p>TODO: (by me or the team that will download the source code)</p>\r\n<ol>\r\n<li>removing the hardcoded reference to the LCID (1033) (very easy) </li><li>letting the reference to the OOTB corev4.css if the defaulturl property is empty or if an Alternate CSS is not set...(easy)\r\n</li><li>when a theme is applied, managing to use the custom corev4.css instead of the OOTB one...(much, much more difficult)\r\n</li></ol>\r\n<p>&nbsp;</p>\r\n<p>For a quick documentation regarding the use of this control you can read this section of one of my posts:</p>\r\n<p><a href=\"http://mosshowto.blogspot.com/2009/12/sharepoint-2010-wiki-styles.html#2.8\" target=\"_blank\">2.8 - Second limitation of the team site wiki page in SharePoint 2010: it is very difficult&nbsp; to remove the OOTB RTE style</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "UCLFinal2017live,",
  "LastEdited": "2011-11-02T10:45:21.643-07:00"
}