{
  "ProjectName": "digiTweet",
  "Title": "digiTweet",
  "Description": "digiTweet is an open source desktop Twitter client for Windows.  DigiTweet provides Twitter functionalities with rich user interface through Windows Presentation Foundation (WPF).",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Welcome to digiTweet - WPF Twitter Client!</h1>\r\ndigiTweet is an open source desktop Twitter client for Windows.  DigiTweet provides Twitter functionalities with rich user interface through Windows Presentation Foundation (WPF). Visit <a href=\"http://www.digitweet.com\">http://www.digitweet.com</a> to download the beta version. Also follow us on Twitter @digi_tweet <a href=\"http://www.twitter.com/digi_tweet\">http://www.twitter.com/digi_tweet</a><br /><br /><img src=\"/projects/digiTweet/df371b3a-77b6-40c6-84d5-8affd397df56\" alt=\"digitweet.jpg\" title=\"digitweet.jpg\" /><br />\n<h2>V1.0 RC Release Features</h2>\r\n1. <b>Enhanced support for Windows 7 RC</b><br />2. <b>Preview Tweet Content</b> -&gt; When a user reviews a tweet that has a URL in it and hovers over the URL portion of the tweet, a mini browser will pop up to show a preview of the destination URL link. (Enable this feature from Options dialog)<br />3. <b>Multi-Tab Search Results</b> -&gt; Store multiple search results in tabs.<br />4. <b>Favourite</b> -&gt; Store individual tweets in a favourite list in the Categories pane.<br />5. <b>Set Twitter API refresh time interval</b><br />6. <b>Improved performance and memory usage</b><br /><br /><br />\n<h2>Beta 2 Release Features</h2>\r\n<b>Search</b><br />Search criteria are important to find the people and information you are looking for, or wishing to subscribe and/or alerted to various search criteria being found. Users can search for fellow twitter users by selecting a find people drop down tab. Users can search for content across all twitter entries by selecting a find content drop down tab. DigiTweet will use the API found at http://search.twitter.com. Users can search for keywords across all twitter entries by selecting flag content drop down tab, and then they will be alerted on updates to that flagged content and will store the last ten entries.<br /><br /><b>Friends List (2 way trust)</b><br />View a list of people in both your follower and following list as Friends list, shows users who you are following and users that are following you. This view is to show a two-way trust between twitter users.<br /><br /><b>Categorize Contacts with Colors &amp; Toast Alerts</b><br />Users can color code the background color and borders of entries by categorizing them. Categories can include distinguishing users by Family, Friends, Work, People you follow, People following you and Friends (2-way subscription). In addition to categorizing contacts with color, users can enable a toast alert to important twitter users they follow. When an update occurs, DigiTweet will update all views and columns, and in addition to this any twitter user you enabled a toast with will cause the Windows System Tray to display an Outlook style alert. This allows you to see alerts while using other applications on your desktop.<br /><br />Follow and Remove Users from the user list.<br /><br /><br />\n<h2>Beta 1 Release Features</h2>\r\n1. <b>Create Tweet</b> -&gt; A user can create a twitter message called a Tweet using <b>DigiTweet</b> twitter client built with Microsoft Windows Presentation Foundation (WPF).  A user is limited to 140 characters per tweet that is displayed through a counter.  Users can insert URL links into their tweet by using a URL shortening tool like <a href=\"http://www.TinyURL.com\">www.TinyURL.com</a>.  Users can insert a picture into their tweet, which will then be uploaded and accessed through a URL on <a href=\"http://www.TwitPic.com\">www.TwitPic.com</a>.<br /><br />2. <b>View a single Tweet</b> -&gt; Once a user hovers over a tweet, several actions will appear depending on the type of tweet they are viewing, for example viewing replies versus direct messages will show different actions.  When one is viewing a reply type tweet, they will see actions such as Reply To, Direct Message, Re-Tweet, Delete your own Tweet, as you cannot Delete other peoples Tweet messages.<br /><br />Direct Message which allows the user to send a direct message to another twitter user.  Delete your tweet, to delete your own tweet.  When one is viewing a direct message tweet, they will see actions such as Direct Message and Delete your Direct Message.<br /><br />3. <b>View All Tweets</b> -&gt; Users can have many views of their Twitter information.  With view All Tweets includes people you are following and your own tweets, but not including direct messages. <br /><br />4. <b>View My Replies</b> -&gt; This view allows a user to view all of their tweets in response to other people’s tweets, and will track their interaction and input with other twitter users.<br /><br />5. <b>Direct Messages</b> -&gt; Users can view all direct messages between themselves and other twitter users who direct messaged them.  Users may direct message other users and delete their own direct messages.<br /><br />6. <b>Profile</b> -&gt; Profile will show a person’s Name, Location, URL, a counter of Following, Followers and Update entries.  The Following list shows you twitter users that you are following.  The Followers list shows you twitter users that are following you.  Update Wire list shows you tweets from all the people that are in your network.  A network is defined by people you are following and your own tweets.<br /><br /><b>Stay tuned for more features to be added shortly.  New features that will come shortly include:  identifying users who you follow and are mutually following you, search functionality, categorize your contacts through colours, toasted alerts in your system tray, URL preview window and more...</b></div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,twitter,Twitter API,",
  "LastEdited": "2009-05-04T23:17:56.69-07:00"
}