{
  "ProjectName": "dslped",
  "Title": "DSLPed",
  "Description": "DSLPed is a framework to design & develop WPF-based projectional editors of custom Domain Specific Lanugages as add-ins into the Visual Studio 2010 designer.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />DSLPed is a framework to design, develop &amp; deploy WPF-based projectional editors of custom Domain Specific Lanugages (DSL) as add-ins into the Visual Studio 2010 designer.<br /><br /><b>What is it actualy good for? ... Projections!</b><br />A Domain Specific Language can be worthwhile if the language allows a solution of a particular problem to be expressed more clearly than an existing complex language would allow. Those languages are designed to solve only a specific problem coming from a limited problem domain. If their grammar is described by the set of XSD rules (<a href=\"http://www.w3schools.com/schema/default.asp\">http://www.w3schools.com/schema/default.asp</a>), their XML (<a href=\"http://www.w3schools.com/xml\">http://www.w3schools.com/xml</a>) instances can be presented in several forms (text-editor, diagram-editor, ...). The presentation forms can be understood as projections, where any change within a projection will affect directly the instance of a language being edited.<br /><br />The aim of this framework is to ease the creation of WPF-based projections and enable their integration to the Visual Studio in a form of common IDE designers.<br /><br /><b>Projectional Editor?</b><br />An editor that can switch among all the projections defined for any part of the given Domain Specific Language.<br />\n<ul><li>User can decide which projection to use for the code manipulation</li>\n<li>All the changes within one projection will be propagated to another one operated over the same piece of code</li></ul>\n<br /><b>Features</b><br />\n<ul><li>Visual Studio 2010 Projectional Designer</li>\n<li>Standalone Desktop Designer</li>\n<li>Custom DSL projections in a form of MEF components extending the mentioned Designers</li></ul>\n<br />Additional information on starting a new project is available here: <a href=\"http://codeplex.codeplex.com/wikipage?title=Start%20a%20Project\">Project Startup Guide</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2013-04-28T16:04:00.967-07:00"
}