{
  "ProjectName": "excelfilecleaner",
  "Title": "Excel File Cleaner",
  "Description": "This tool is designed to reduce the size and speed up Excel 2007/2010 workbooks. It will only work for the new XML File formats (XLSX and XLSM). It cleans the files by reducing the number of styles in use and the number of activated cells. See Microsoft KBs: KB213904 & KB244435.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Excel File Cleaner</b><br />This tool is designed to reduce the size and speed up Excel 2007 and 2010 workbooks. It will only work with the new XML file formats (XLSX and XLSM files). It cleans the files by reducing the number of styles in use and the number of activated cells.<br /><br />See the following Knowledge Base articles for more information:<br />\n<ul><li>(KB213904) <b>You receive a &#39;Too many different cell formats&#39; error message in Excel</b> (  <a href=\"http://support.microsoft.com/kb/213904\">http://support.microsoft.com/kb/213904</a> )</li>\n<li>(KB244435) <b>How to reset the last cell in Excel</b> ( <a href=\"http://support.microsoft.com/kb/244435\">http://support.microsoft.com/kb/244435</a> )</li></ul>\n<br />To use this application, click Options, set your desired settings then click Open and Clean to correct the Excel file (XLSX or XLSM).<br /><br /><b>NOTE:</b> The code provided under this download for cleaning workbook styles is protected by a <a href=\"http://patft1.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&amp;Sect2=HITOFF&amp;d=PALL&amp;p=1&amp;u=%2Fnetahtml%2FPTO%2Fsrchnum.htm&amp;r=1&amp;f=G&amp;l=50&amp;s1=8281236.PN.&amp;OS=PN/8281236&amp;RS=PN/8281236\">patent (USP#8,281,236) awarded to Microsoft</a>. The use of this source code is FREE for non-commercial usage. <i>Put more plainly, you cannot use the source code provided in this project in ANY commercial software product that you plan to <b>sell</b> or <b>license</b></i>. For an additional tool to clean styles from your workbook, please see the following tool provided by <a href=\"http://sergeig888.wordpress.com/2011/03/21/net4-0-version-of-the-xlstylestool-is-now-available/\">Sergei Gundorov</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2013-03-28T15:21:40.897-07:00"
}