{
  "ProjectName": "FileSystemControls",
  "Title": "File System Controls in WPF (Folder Picker and Auto Complete TextBox)",
  "Description": "This project contains WPF controls that are useful for working with the File System. Currently there is only an auto complete path (like address bar of Windows Explorer) control and a folder pick control (folder TreeView). Both can be used to pick a folder or use UNC path",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This project contains WPF controls that are useful for working with the File System. Currently there is only an auto complete path &#40;like address bar of Windows Explorer&#41; control and a folder pick control &#40;folder TreeView&#41;. Both can be used to pick a folder or use UNC path<br /><br /><br /><b>Please have look at the Documentation page and download the small source package to determine more details.</b><br /><br />This package contains a folder picker dialog (aka folder browser, directory picker) out of two separate components that I found on the Internet (see download package for more details). You can use this dialog to select a directory (not open a file) and change the appearance of the skin within some limits:<br />\n<ul><li>The SelectFolderTextBox (text autocomplete) component is fully skinable</li></ul>\n<br />In addition to that we can\n<ul><li>Change background gradient colors of windows</li>\n<li>Change rounding of Window edges</li></ul>\n<br /><img src=\"/projects/FileSystemControls/ce314223-239c-4d95-b7bf-fe005c14a3d1\" alt=\"FolderPickerDialog.PNG\" title=\"FolderPickerDialog.PNG\" /><br /><br /><img src=\"/projects/FileSystemControls/6af79706-d175-4544-9c35-932df465d6c2\" alt=\"RenameDialog.PNG\" title=\"RenameDialog.PNG\" /><br /><br />The dialog support file system drives and UNC path notation in the auto complete textbox.<br /><br />Near future plans:\n<ul><li>I am thinking about replacing the SelectFolderTextBox with the Autocomplete TextBox that originated from Aviad at CodeProject <a href=\"http://www.codeproject.com/KB/WPF/AutoCompletePart2.aspx\">http://www.codeproject.com/KB/WPF/AutoCompletePart2.aspx</a>.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-10-26T11:37:52.783-07:00"
}