{
  "ProjectName": "guia",
  "Title": "Guia - Graphical User Interface Automation",
  "Description": "Guia supports the automation of WPF applications. It allows access to, and remote control of, miscellaneous WPF-components in an easy and comfortable way. It is possible to directly run and test WPF windows and user-controls, without the need for a previously created executable.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Guia - Automate and test your graphical user interface with ease</h1>\rGuia (Graphical User Interface Automation) supports the automation of WPF applications. It is based upon the UI Automation framework of .NET but provides a more user-friendly and for the use in unit-tests optimised interface. The Library allows access to, and remote control of, miscellaneous WPF-components in an easy and comfortable way. A distinctive feature is the possibility to directly run and test WPF windows and user-controls, without the need for a previously created executable application (EXE file). This enables the writing of test cases during development and thus to pursue a test driven approach in a consequent manner.<br />Guia provides support for almost all current WPF-controls (over 24) and is easily extensible. It is compatible with all established unit-test frameworks like MSTest and NUnit and can be used with them.<br />Therefore it can be used very well for automated UI testing.<br />\n<h2>Features</h2>\r<ul><li>Automate complete applications (WPF, WinForm, Java SWT)</li>\n<li>Directly automate WPF Windows and UserControls, without the need of an previously created executable application</li>\n<li>User-friendly and for the use in unit-tests optimized interface</li>\n<li>Supports over 24 controls</li>\n<li>Easily extensible</li>\n<li>Can be used with all established unit-test frameworks (NUNit, MSTest, ...) </li></ul>\n<br />For more detailed information you ought check out some examples in the <a href=\"https://guia.codeplex.com/documentation?referringTitle=Home\">documentation</a> part.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "automation,C#,WPF,UI Testing,UI Automation,Testing,Test ,UI Test,UserControl Testing,WPF UI Testing,Automate UserControl,testing framework,TDD,Test Driven Design,Guia,",
  "LastEdited": "2010-06-30T09:04:41.36-07:00"
}