{
  "ProjectName": "HelloWorld",
  "Title": "HelloWorld",
  "Description": "As a sample center, HelloWorld sketches the skeletons of most Microsoft development techniques. Each sample is elaborately selected, composed, and documented to demonstrate one frequently-asked/tested/used scenario based on my experience as a support engineer. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>The Project was Renamed and Migrated to &quot;All-In-One Code Framework&quot;</h2>\r<h2><a href=\"http://cfx.codeplex.com/\">http://cfx.codeplex.com/</a></h2>\r\n\n<hr />-----------------------------------------------------<br /><b>Welcome to the   HelloWorld   sample center!</b><br /><br />Dear Friends. Have you ever needed a quick understanding of a technique, e.g. ActiveX or VSX, but been daunted by the few or too many samples and documents that are available in the internet? Have you ever downloaded or created a good sample, e.g. a named pipe sample for IPC, but forgotten where the sample was placed after a few days? Have you ever wanted a simple test environment, e.g. a COM object or a DLL, but been tired of frequently creating such projects and naming them as “ClassLibrary1”, &quot;ClassLibrary2”, &quot;ClassLibraryABC”? <br /><br />If your answer is YES to any one of these questions, this <b>HelloWorld</b> sample center may be of assistance to you.<br /><br /><b>HelloWorld</b> sketches the skeletons of most Microsoft development techniques. For example, the sample ATLActiveXDll shows the skeleton of an ATL ActiveX DLL as its name implies. Each sample is elaborately selected, composed, and documented to demonstrate one frequently-asked/tested/used scenario based on my experience as a support engineer. If you are a software developer, you can fill the skeleton with blood, muscle and soul; if you are a software tester or a support engineer like me, you may extend the samples a little to fit your specific test scenario or refer your customer to this sample center if the customer’s question coincides with what I collected.<br /><br /><u><b>The scope of the project</b></u><br /><br />The target of the project is to sketch the skeleton of most Microsoft development techniques using the typical samples that are frequently tested / used / asked. You can imagine each technique as a building. The foundation of the building (the basic things of the tech) is not in scope; the facilities inside the building (the details of the tech) are not in scope; the structure of the building (the skeleton of the tech) is in scope.<br /><br /><u><b>The current stage of the project</b></u><br /><br />Today is February 8th. The project was started thirty days ago. In the rudiment of the project, I selected three techniques (COM, Library, and IPC) and added about thirty samples to exemplify what the project will be for the rest dozens of Microsoft development techniques:<br />\n<ul><li>Samples for ActiveX and COM</li></ul>\n<img src=\"/projects/HelloWorld/738c6deb-6732-4869-99e5-26875b142283\" alt=\"COM&#32;and&#32;ActiveX.png\" title=\"COM&#32;and&#32;ActiveX.png\" />\n<ul><li>Samples for Library</li></ul>\n<img src=\"/projects/HelloWorld/3d19153a-0b53-4aa2-a559-97030b92e97c\" alt=\"Library.png\" title=\"Library.png\" />\n<ul><li>Samples for IPC</li></ul>\n<img src=\"/projects/HelloWorld/ba043568-bba1-4a44-8e4b-7d85e9fbeddb\" alt=\"IPC.png\" title=\"IPC.png\" /><br /><br />The supports from the community will definitely play the most important role in this project. Besides it, I am in a very big team with 50+ engineers supporting in the <a href=\"http://msdn.microsoft.com/en-us/subscriptions/aa974230.aspx\">newsgroups</a> and the <a href=\"http://forums.msdn.microsoft.com/en-us/Forums/\">forums</a>. The team is harbored with many experienced support engineers and covers almost all of the Microsoft development techniques. It is very important for the project to get the team’s support. I am going to lobby for it in the following days.<br /><br /><u><b>Features</b></u><br />\n<ul><li><i><b>All in One</b></i>: All samples for all techniques are in one Visual Studio solution; all source codes, all documents, and all reference materials can be viewed or tested in one instance of Visual Studio.</li>\n<li><i><b>Mutually Dependent and Reused</b></i>: The samples are mutually dependent or related, and some are efficiently reused by other samples to demonstrate the techniques. For example, CppDllExport is a sample C++ DLL that exports the symbols of data, functions and classes. CppImplicitlyLinkDll depends on CppDllExport to demonstrate the implicit link of a DLL; CppDelayloadDll delay-loads the DLL; CppLoadLibrary dynamically loads the DLL; CSPInvokeDll uses CppDllExport to show the use of .NET Platform Invocation Service.</li>\n<li><i><b>Uniform</b></i>:\n<ul><li>All samples follow a uniform naming convention. The convention applies to the project name, variable/method/type name, etc. </li>\n<li>All samples have a uniform coding/commenting/documenting style. For example, each sample has a ReadMe.txt file that documents the sample. The content of ReadMe.txt follows this structure: Use (the purpose of the sample) / Project Relation (the relation between the current sample and the rest) / Build (how to build the sample) / Creation (the detailed steps to create such a sample) / References (the reference materials). </li>\n<li>All samples of the same technique manage to provide a uniform export/output. For example, ATLActiveXDll, ATLActiveXExe, CSDllCOMServer, MFCActiveX, MFCSafeActiveX are COM servers in the different forms, however, they export a uniform set of methods, properties and events.</li></ul></li></ul>\nI highlight the above three features because they are lacked by most sample collections like <a href=\"http://www.codeproject.com\">www.codeproject.com</a>, and <a href=\"http://msdn.microsoft.com/en-us/default.aspx\">MSDN</a>. <br /><br />Apart from the three points, the samples in HelloWorld are expected to be typical, extensible, structured, complete, and easy to understand for those who are new to the technique.<br /><br /><u><b>Feedbacks</b></u><br /><br />I expect to hear your feedbacks, whether good or bad. Please post your ideas in <a href=\"http://www.codeplex.com/HelloWorld/Thread/List.aspx\">Discussions</a> or <a href=\"https://www.codeplex.com/site/users/contact/Jialiang?OriginalUrl=http://www.codeplex.com/site/users/view/Jialiang\">contact me</a> or <a href=\"mailto:hiworldf@microsoft.com\">email to hiworldf</a> directly. Your regards for the project are appreciated.  <br /><br />Thanks!</div><div class=\"ClearBoth\"></div>",
  "TagList": "Samples,HelloWorld,hello world,sample,development,MSDN,ActiveX,COM,Library,IPC,Azure,COM+,Data Access,Diagnostics,Driver,Graphics,GDI,GDI+,DirectX,International,Reporting,security,shell,Threading,WCF,WPF,Windows Media,WMI,smart device,SDK,SQL Server,SQL Server 2005,ATL,Newsgroup,",
  "LastEdited": "2009-03-01T07:17:01.253-08:00"
}