{
  "ProjectName": "htmltopdf",
  "Title": "C# and .NET HTML to PDF Converter | C# Code Sample for ASP.NET MVC",
  "Description": "HTML to PDF Converter for .NET and C# can be used in your ASP.NET MVC applications to convert HTML pages and websites to PDF documents preserving all the styles",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>HTML to PDF C# Sample Application for ASP.NET&nbsp;Description</h1>\r\n<p>Creating PDF documents programmatically in a traditional way by adding text and images at fixed positions in PDF pages is a time consuming and inflexible approach which takes a lot of effort to create a good looking document. The best alternative for this\r\n approach is to design your document as a HTML page and convert that HTML page to a PDF document preserving all the styles and layout from the original HTML page.</p>\r\n<p>You can use the&nbsp;<a href=\"http://www.evopdf.com/\">EVO HTML to PDF Converter Library for .NET</a>&nbsp;to instantly create styled, good looking and complex PDF documents right from existing HTML pages and reports in C# and VB.NET. The converter combines\r\n the powerful printer friendly PDF format with the flexibility of the HTML format into a great tool for creating nicely formatted and easily maintainable PDF reports and documents.</p>\r\n<p>This sample application helps you understand the basic features of the HTML to PDF conversion like setting PDF page size, orientations and margins but also touches advanced topics like triggering modes, partially conversion of HTML pages or repeating HTML\r\n tables headers and footers in PDF pages.</p>\r\n<p>Below is a description of the most important features of the EVO HTML to PDF conversion used in this sample application:</p>\r\n<ul>\r\n<li>The library does not rely on external tools or services and does not require installation or server configuration changes, supporting simple copy deployment.\r\n</li><li>It has been designed and tested to work reliably in multithreaded environments and in high traffic websites.\r\n</li><li>The converter has full support for HTML tags, CSS and JavaScript and for advanced HTML5 features like CSS3, SVG and Web Fonts.\r\n</li><li>The rendering is extremely accurate and the resulted PDF preserves all the graphics, images, texts, fonts and layout of the original HTML document, no matter how complex would be.\r\n</li><li>The converter includes advanced automations for creating table of contents and hierarchical bookmarks based on HTML document structure and for transforming HTML forms into fillable PDF forms.\r\n</li><li>With EVO HTML to PDF Converter not only you can create great new PDF documents but you can also edit, merge, split and fill existing PDF documents. The converter can be bundled with the other PDF tools for .NET in EVO PDF Toolkit to offer you additional\r\n capabilities to view PDF documents or to extract the text and images from existing PDF documents.\r\n</li></ul>\r\n<h1>Building the Sample</h1>\r\n<p>To build the sample for ASP.NET you have to open the appropriate Visual Studio solution and build the solution. All the necessary packages will be automatically downloaded from NuGet. The latest version of the library can be also downloaded from http://www.evopdf.com/download.aspx\r\n page of the website.&nbsp;The demo application contains C# and VB.NET sample code which allows you to convert HTML to PDF, HTML to Image and HTML to SVG.&nbsp;</p>\r\n<h1>C# Code Sample for ASP.NET</h1>\r\n<div>\r\n<div>\r\n<p>The C# sample code below shows how you can convert HTML pages or HTML strings to PDF in just a few lines of code. An instance of the&nbsp;<em>HtmlToPdfConverter</em>&nbsp;class is created and used to convert HTML to PDF. The result of conversion is a&nbsp;<em>byte[]</em>&nbsp;which\r\n is sent as response to browser for downolad.</p>\r\n<pre><code>protected void convertToPdfButton_Click(object sender, EventArgs e)\n{\n    // Create a HTML to PDF converter object with default settings\n    HtmlToPdfConverter htmlToPdfConverter = new HtmlToPdfConverter();\n\n    // Set license key received after purchase to use the converter in licensed mode\n    // Leave it not set to use the converter in demo mode\n    htmlToPdfConverter.LicenseKey = &quot;4W9&#43;bn19bn5ue2B&#43;bn1/YH98YHd3d3c=&quot;;\n\n    // Set HTML Viewer width in pixels which is the equivalent in converter of the browser window width\n    htmlToPdfConverter.HtmlViewerWidth = int.Parse(htmlViewerWidthTextBox.Text);\n\n    // Set HTML viewer height in pixels to convert the top part of a HTML page \n    // Leave it not set to convert the entire HTML\n    if (htmlViewerHeightTextBox.Text.Length &gt; 0)\n        htmlToPdfConverter.HtmlViewerHeight = int.Parse(htmlViewerHeightTextBox.Text);\n\n    // Set PDF page size which can be a predefined size like A4 or a custom size in points \n    // Leave it not set to have a default A4 PDF page\n    htmlToPdfConverter.PdfDocumentOptions.PdfPageSize = SelectedPdfPageSize();\n\n    // Set PDF page orientation to Portrait or Landscape\n    // Leave it not set to have a default Portrait orientation for PDF page\n    htmlToPdfConverter.PdfDocumentOptions.PdfPageOrientation = SelectedPdfPageOrientation();\n\n    // Set the maximum time in seconds to wait for HTML page to be loaded \n    // Leave it not set for a default 60 seconds maximum wait time\n    htmlToPdfConverter.NavigationTimeout = int.Parse(navigationTimeoutTextBox.Text);\n\n    // Set an adddional delay in seconds to wait for JavaScript or AJAX calls after page load completed\n    // Set this property to 0 if you don't need to wait for such asynchcronous operations to finish\n    if (conversionDelayTextBox.Text.Length &gt; 0)\n        htmlToPdfConverter.ConversionDelay = int.Parse(conversionDelayTextBox.Text);\n\n    // The buffer to receive the generated PDF document\n    byte[] outPdfBuffer = null;\n\n    if (convertUrlRadioButton.Checked)\n    {\n        string url = urlTextBox.Text;\n\n        // Convert the HTML page given by an URL to a PDF document in a memory buffer\n        outPdfBuffer = htmlToPdfConverter.ConvertUrl(url);\n    }\n    else\n    {\n        string htmlString = htmlStringTextBox.Text;\n        string baseUrl = baseUrlTextBox.Text;\n\n        // Convert a HTML string with a base URL to a PDF document in a memory buffer\n        outPdfBuffer = htmlToPdfConverter.ConvertHtml(htmlString, baseUrl);\n    }\n\n    // Send the PDF as response to browser\n\n    // Set response content type\n    Response.AddHeader(&quot;Content-Type&quot;, &quot;application/pdf&quot;);\n\n    // Instruct the browser to open the PDF file as an attachment or inline\n    Response.AddHeader(&quot;Content-Disposition&quot;, String.Format(&quot;{0}; filename=Getting_Started.pdf; size={1}&quot;,\n        openInlineCheckBox.Checked ? &quot;inline&quot; : &quot;attachment&quot;, outPdfBuffer.Length.ToString()));\n\n    // Write the PDF document buffer to HTTP response\n    Response.BinaryWrite(outPdfBuffer);\n\n    // End the HTTP response and stop the current page processing\n    Response.End();\n}</code></pre>\r\n</div>\r\n<pre>&nbsp;</pre>\r\n</div>\r\n<h1>Source Code Files</h1>\r\n<ul>\r\n<li><em>Getting_Started.aspx.cs -&nbsp;</em>contains sample code for the basic features of the HTML to PDF conversion like setting PDF page size, orientation, margins, adding headers and footers\r\n</li><li><em>Merge_Multiple_HTML.aspx.cs -&nbsp;</em>contains sample code for adding multiple HTML documents into the same PDF document\r\n</li></ul>\r\n<h1>More Information</h1>\r\n<p>For more information please check the&nbsp;<a href=\"http://www.evopdf.com/html-to-pdf-converter.aspx\">EVO HTML to PDF Converter</a>&nbsp;home page, the&nbsp;<a href=\"http://www.evopdf.com/demo/\">EVO HTML to PDF Converter Online Demo</a>&nbsp;, the\r\n<a href=\"https://html-to-pdf.com/\">HTML to PDF for .NET</a>&nbsp;blog and <a href=\"https://evo-html-to-pdf.com/\">\r\nEVO HTML to PDF for .NET</a>&nbsp;blog. You can also download the&nbsp;<a href=\"https://www.nuget.org/packages/EvoPDF/\">EvoPdf Nuget Package</a>&nbsp;directly.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2016-12-15T00:21:52.047-08:00"
}