{
  "ProjectName": "ImageViewerCL",
  "Title": "ImageViewer Control Library",
  "Description": "A set of user controls that display images in various ways.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A set of user controls that display images in various ways.<br />\n<h1>Welcome to the ImageViewer Control Library project.</h1>\r<h2>Introduction</h2>\rFirst, let me introduce myself. I am bloodsplatter, the founder of the project.<br />At the time of writing I am an 18-year old student from Belgium.<br />I am mostly new to C# and WPF but I have considerable experience in Visual Basic .NET (since VB8).<br />I thought of this project as a fun little thing to do with some of my spare time and to gather and display WPF/C# skills.\n<h2>The project</h2>\rThis project is aimed at making a WPF Control Library that deals with displaying images.<br />Nothing more, nothing less.<br /><br />Right now the project consists of only 1 User Control: the PolaroidImage control.<br />As the name implies this control can display any picture (that can be displayed by WPF&#39;s Image control) as a polaroid image.<br />Because this is the first version the style is very rudimentary.<br />Below the image is a textbox so the users can create a caption.<br /><img src=\"/projects/ImageViewerCL/29059e21-54b5-43ca-a20f-77539161553e\" alt=\"screentje.bmp\" title=\"screentje.bmp\" /><br /><br />The Visual Studio solution contains 2 projects: the ImageViewerCL (CL stands for Control Library) project and the ImageViewer project.<br />The ImageViewer project is a small app that is included so you can easily and rapidly test any changes made to the controls.\n<h2>User submissions</h2>\rYou are free to submit any and all ideas related to the project.<br />Experienced C# and WPF developers are also welcome (I am not an experienced developer).\n<h2>Currently &quot;hiring&quot; :P</h2>\rCurrently we are looking for someone with skills regarding performance in WPF and C# to optimize the code.\n<h2>Misc.</h2>\rI am also always open to learn new and cool stuff. I realise that I do not have some sort of uber experience.<br />So if you think I&#39;m doing something the wrong way and you now a better way, I welcome you to let me now in a constructive and mannered conversation.</div><div class=\"ClearBoth\"></div>",
  "TagList": "xaml,wpf,UserControls,Library,",
  "LastEdited": "2008-05-05T04:55:41.257-07:00"
}