{
  "ProjectName": "InstallKey",
  "Title": "Install Key",
  "Description": "Add License Validation, Product Activation, and Installation Keys to your .Net based application.  Prevent casual copying and keep your customers honest.  Similar to Microsoft style product activation where the product key is validated against an internet server.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Add License Validation, Product Activation, and Installation Keys to your .Net based application.  Prevent casual copying and keep your customers honest.  Similar to Microsoft style product activation where the product key is validated against an internet server.<br /><br /><b>Open Source Features</b> \n<ul><li>Uses 30 character install keys made up of only capital alphanumeric characters. This helps to make keys easy to read and enter.</li>\n<li>Key validation against a central server.  Validating an install key against a server should prove to be harder to bypass.</li>\n<li>Server validation is only required once.  A surety file that is specific to the machine where the installation occurs can be validated again at any time, without another round trip to the license server.</li>\n<li>Unique key usage counting.  Key usage counting is done by comparing a machine name identifiers.</li>\n<li>Can be recompiled with Visual Studio 2008 or later.  Works with Visual Studio 2008, 2010, 2012 or 2013 - C# or VB.Net.  .Net 2.0 or 4.0 or later.</li>\n<li>Database can be any version of SQL Server 2008 R2 or newer. Works with Enterprise, Standard or Express editions.</li></ul>\n<b>Other Available Features</b>\n<ul><li>Data entry key validation.  This helps to catch data entry errors before validating the Install Key against the server and can be used to distinguish between two keys for two different products.</li>\n<li>Supports validation without an internet connection.</li>\n<li>Additional levels of security to control access to key creation and modification.</li>\n<li>A tamper-proof surety file to help deny hackers.</li>\n<li>Additional hardware specific identifiers and hardware specific matching.</li>\n<li>A mechanism to revoke rogue keys.</li>\n<li>Your application specific license properties can be embedded within the tamper-proof surety file.  These properties can be retrieved at any time after validation, even without a connection to the server.</li>\n<li>Create Trial Keys that expire on a specific date.</li>\n<li>Available for Visual Studio 2010, 2012 and 2013 and .Net 4.0 or 4.5.x.  Works with WinForms, WebForms, WPF, Console Apps, ASP.Net MVC2, and more.</li></ul>\n<b>Current Release</b><br /><a href=\"http://lomacons.azurewebsites.net/lomacons/Product/InstallKey\">http://lomacons.azurewebsites.net/lomacons/Product/InstallKey</a><br /><b>Contact</b><br /><a href=\"http://www.lomacons.com\">http://www.lomacons.com</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "licensing,license,installation,installation key,license key,Install Key,library,activation,product activation,software activation,Licenser,software license,Installer,lic,Install,Tom,key,trial,",
  "LastEdited": "2017-06-04T18:43:54.59-07:00"
}