{
  "ProjectName": "ironcow",
  "Title": "IronCow",
  "Description": "IronCow is a .NET API for Remember The Milk, the To-Do list (and much more!) web application. IronCow is designed with WPF and Silverlight applications in mind, making it easy to use data binding and reflection.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>IronCow - .NET API kit for Remember The Milk</h1>\rIronCow is a .NET API that wraps the Remember The Milk (RTM) web services in a way that will hopefully make it easy for you to develop applications that consume RTM data. IronCow has two API layers:\n<ul><li>The higher level layer is an object model that stays in sync with the server data. It is designed with WPF and Silverlight in mind, or any other framework that uses data binding and/or reflection. As such, it depends, at the moment, on the .NET Framework 3.0. The entry point is the Rtm class.</li>\n<li>The lower level layer is a simple wrapper around RTM&#39;s REST requests and responses, similar to the Flickr.Net API. The entry point is the RestClient class, which has one .NET method per REST method from the RTM API.</li></ul>\n\n<h2>Sample Code</h2>\r<ul><li><a href=\"https://ironcow.codeplex.com/wikipage?title=Sample%20Code%20Using%20The%20Rtm%20Class&referringTitle=Home\">Sample Code Using The Rtm Class</a></li>\n<li><a href=\"https://ironcow.codeplex.com/wikipage?title=Sample%20Code%20Using%20The%20RestClient%20Class&referringTitle=Home\">Sample Code Using The RestClient Class</a></li></ul>\n\n<h2>IronCow for Powershell</h2>\rIronCow ships with some Powershell Cmdlets that bring the power of RTM to the command line! Except for being super cool, it also serves as an example application of the IronCow API, so feel free to look at the code and see how it&#39;s done.<br />\n<h2>IronCow blog</h2>\rYou can get news and information regarding IronCow by subscribing to the <a href=\"http://ludovic.chabant.com/devblog/category/ironcow/\">IronCow category</a> on <a href=\"http://ludovic.chabant.com/devblog/\">my developer&#39;s blog</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,.NET 3.0,.NET 3.5,C#,C# 3.0,remember the milk,API,powershell,rtm,rest,RTM_api,gtd,",
  "LastEdited": "2010-09-02T16:20:57.24-07:00"
}