{
  "ProjectName": "jqueryPlugins",
  "Title": "jQuery layout background canvas plugin: gradients, rounded corners without CSS",
  "Description": "jQuery layout and background canvas plugins allow web designers to draw with the canvas API in the background of a div or whatever block style element. The full canvas API power gives the flexibility to draw gradients, rounded corners without CSS trickery.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>jQuery Background Canvas Plugin</b><br />The HTML5 standard introduces the &lt;CANVAS&gt; element, a resolution dependent bitmap canvas on which 2D graphic objects can be rendered. With JavaScript one can draw shapes like circles, rectangles and lines on this element. The jQuery background canvas plugin injects such a canvas element behind a div or whatever block element and provides functions to draw on it. When the background of the div is made transparent, this canvas element can be seen and it will provide the new background for the div.<br /><br /><b>DIV with Rounded Corners and Gradient without CSS</b><br />The major use case for backgriund canvas is to draw a rounded corner border and a gradient in the background of a &lt;DIV&gt; element. <br /><br /><b>Retro Coding and Fallback CSS Layout</b><br />With the jQuery Background Canvas Plugin, CSS does the job it is made for: Layouting of semantic html. Abuse of html (tables) and CSS (rounded corners, gradients) for design purposes is no good. <br /><br />The jQuery Background Canvas Plugin was developed to enhance a search engine friendly and section 508 compliant html and css design. It avoids cluttering the html and css with design elements like layouting tables, css rounded corners techniques, css gradient techniques and so on. This should keep the html code clean, semantic and in a retro style - just as the search engine likes it. This also provides a nice fallback path if JavaScript or CSS is not available.<br />\n<ol><li>Display a great design if CSS and Javascript is available (rounded corners, gradients)</li>\n<li>Display a nice but simple CSS LAyout without trickery when JavaScript is unavailable (semantic html layouting)</li>\n<li>Display retro coded html (perfect for screen readers) if CSS and JavaScripts are unavailable  (semantic html)</li></ol>\n<br /><b><a href=\"http://www.maierhofer.de/en/open-source/jquery-background-canvas-plugin.aspx\">jQuery layout and background canvas plugin Homepage</a></b><br />(This Site is also a demo of the plugin and uses it excessively to do the gradients, tabs and round corners)<br /><br /><b><a href=\"http://www.maierhofer.de/Download/jQuery-background-canvas-api-documentation.pdf\">jQuery layout and background canvas plugin Documentation (PDF)</a></b><br /><br /><b>jQuery layout and background canvas plugin project URLs:</b>\n<ul><li><a href=\"http://www.codeplex.com/jqueryPlugins/\">http://www.codeplex.com/jqueryPlugins/</a></li>\n<li><a href=\"http://www.codeplex.com/jqueryPlugins\">http://www.codeplex.com/jqueryPlugins</a></li>\n<li><a href=\"http://jqueryPlugins.codeplex.com/\">http://jqueryPlugins.codeplex.com/</a></li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "jQuery,jQuery UI,canvas,canvas api,jquery layout,background canvas,jquery plugin,jquery round corner,css,",
  "LastEdited": "2009-08-03T00:45:58.927-07:00"
}