{
  "ProjectName": "mediaowl",
  "Title": "MediaOwl",
  "Description": "MediaOwl is a multimedia search engine. You can search the web, for music (albums, artists, tracks, tags) and movies (movies, series, actors, directors, genres). But above all, it is a Microsoft Silverlight 4 application (C#), that shows how to use Caliburn Micro.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1><span style=\"color:#008000\">MediaOwl v2</span></h1>\r\n<p>&nbsp;</p>\r\n<h2><span style=\"color:#008000\">Introduction</span></h2>\r\n<p>The last months, after winning the extraordinary CM-Contest, I did nearly 90 % of my development work with Caliburn Micro (Just to show how relief this framework is). In this period of time, CM has grown and (thus) changed considerably. As I have never changed\r\n MediaOwl since then, I decided to renew this award-winning Silverlight Application.</p>\r\n<p>My thoughts were, that I wanted to make an (even more) useful application. Thing is: you can hardly do that with a sample application. I had to make a tradeoff, and the result is, that those, who already read the docs and experimented a bit with CM, may\r\n find MediaOwl a useful source for further knowledge or ideas. On the other hand, MediaOwl may not be the best sample to start CM &amp; Silverlight from scratch.</p>\r\n<p>I must admit that the current lack of documentation is frustrating. I&rsquo;m trying to counteract this deficiency, but it may take a while. If you have any questions, please drop me a note in the Discussions or via roland.auer[at]ra-design.at! Every (senseful\r\n and answerable) question answered will be published in the docs, so everyone can help the community!</p>\r\n<p>Same procedure for bugs you find, of course!</p>\r\n<p>&nbsp;</p>\r\n<h2><span style=\"color:#008000\">Project Description</span></h2>\r\n<p>MediaOwl is a multimedia search engine, but above all, it is a Microsoft Silverlight 4 application, that shows how to use\r\n<a href=\"http://caliburnmicro.codeplex.com\">Caliburn Micro</a>. I have to point out that this is a sample application, not a tutorial application. That means you can look at this app and its code and get smart, not that you can read a text, build an app and\r\n get taught (If you'd like that, look at the CM-Docs!).</p>\r\n<p>Btw, you can find a <a title=\"MediaOwl Demo\" href=\"http://www.ra-design.at/silverlight/mediaowl\">\r\ndemo on this page</a>.</p>\r\n<p>You can find some FAQs in the Documentation, but of course you can send me an e-mail with your questions to roland [dot] auer [at] ra-design [dot] at, if questions are not answered.</p>\r\n<p><br>\r\n<span style=\"color:#008000\"><strong>What's the application for?</strong></span></p>\r\n<p>As written above, you can search for several topics in Bing, music and movies. In the music-part you can search for artists, albums, tracks or you sort them out by using the top tags. In the movies-part you can search for titles, which means movies and series,\r\n people, which means actors and directors, or a genre. Finally, there is a test-part, which shows the basic functionality of Caliburn Micro.&nbsp;</p>\r\n<p><br>\r\n<strong><span style=\"color:#008000\">Where's the data from?</span></strong></p>\r\n<p>The general search is powered by the Bing v2 API, the music search is powered by Last.fm, getting the data from their REST-service. The movie search is powered by Netflix, where its OData-Service is used.</p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"color:#008000\"><strong>What about the source?</strong></span></p>\r\n<p>The code is under MIT-License. I have to point out, that if you'd like to build the application, you have to fill in your personal Last.fm-Api-Key first! The key is stored in&nbsp;LastFmDataAccess.resx.</p>\r\n<p><br>\r\n<span style=\"color:#008000\"><strong>Final Question: Why... just why?</strong></span></p>\r\n<p>Basically, I made this application for myself, just to get used to CM, MVVM, REST, OData and several other abbreviations. As sample-apps in CM are rare until now, I thought why not publish it, maybe it is helping someone.</p>\r\n<p>&nbsp;</p>\r\n<p><img src=\"http://download.codeplex.com/download?ProjectName=mediaowl&DownloadId=259156\" alt=\"Screenshot\" width=\"800\" height=\"460\"></p>\r\n<p>Screenshot of MediaOwl</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "CaliburnMicro,Silverlight,silverlight 4,MVVM,Sample app,WPF,",
  "LastEdited": "2011-07-14T05:30:20.78-07:00"
}