{
  "ProjectName": "mvvmref",
  "Title": "M-V-VM Reference Application",
  "Description": "Community created reference application for M-V-VM frameworks to use for demonstration purposes, similar in concept to Pet Shop for web frameworks.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Community created reference application for M-V-VM frameworks to use for demonstration purposes, similar in concept to Pet Shop for web frameworks.<br /><br />This project isn&#39;t going to give <b>any</b> solutions for following the Model-View-ViewModel pattern.  What it is going to do is provide a sample application that does &quot;typical&quot; things that cause problems when following an M-V-VM architecture.  Then, given this reference application and supporting documentation, other implementations can be made using specific M-V-VM libraries.  Those other implementations won&#39;t be part of this project, though we&#39;ll provide links to them.  Instead, they&#39;ll be reference implementations provided by the specific M-V-VM library&#39;s author(s) or interested third parties.  This makes it easier on the library developers, since they don&#39;t have to dream up their own reference implementation sample.  It benefits the users, since they can compare various implementations using &quot;competing&quot; libraries, and they can learn &quot;best practices&quot; of how to use a given library.  Again, if you&#39;re at all familiar, this is &quot;Pet Shop&quot; for WPF and Silverlight.<br /><br /><b>NOTE:</b> We&#39;re in the discussion phase of this project, and there&#39;s not much to see here. The community at large is encouraged to help us during this discussion phase, and if you&#39;re interested in helping when we move on to other phases please contact the project coordinator (<a href=\"https://www.codeplex.com/site/users/contact/wekempf?OriginalUrl=http://www.codeplex.com/mvvmref\">wekempf</a>).<br /><br />Project&#39;s with author&#39;s participating in this effort:<br /><br /><a href=\"http://www.codeplex.com/caliburn\">Caliburn</a> • <a href=\"http://www.codeplex.com/nRoute\">nRoute</a> • <a href=\"http://www.codeplex.com/wpfonyx\">Onyx</a> • <a href=\"http://www.codeplex.com/CompositeWPF\">Prism/Composite WPF</a><br /><br /><i>Do you have a project that might make use of this and want to join the effort? Contact the project coordinator (<a href=\"https://www.codeplex.com/site/users/contact/wekempf?OriginalUrl=http://www.codeplex.com/mvvmref\">wekempf</a>) to be added to this list.</i></div><div class=\"ClearBoth\"></div>",
  "TagList": "MVVM,WPF MVVM,",
  "LastEdited": "2009-04-14T08:36:59.143-07:00"
}