{
  "ProjectName": "NaijaTradStylesNow",
  "Title": "Find Nigerian Traditional Fashion Styles",
  "Description": "NaijaTradStyles is a social network for Nigerians all over the world to promote the Nigerian economy, designs and cultures, fashion designers and individuals. This site allows users to share fashion ideas, activities, events, and interests within their individual networks.  \r\nThe ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">NaijaTradStyles is a social network for Nigerians all over the world to promote the Nigerian economy, designs and cultures, fashion designers and individuals. This site allows users to share fashion ideas, activities, events, and interests within their individual networks.  <br />The site is designed for two main users; the first user is classified as a user while the second user is classified as a designer. The two users need to log-in to have access to the contents of the site. <br />The “user” is a person who logs into the site to access the numerous services provided on the site. These services include:<br />(i)\tFashion Trends<br />(ii)\tview designs, rating and comments on the numerous designs posted by different designers<br />(iii)\tNews<br />(iv)\tFashion tips<br />(v)\tJob search<br />(vi)\tRSS Feed- to get regular updates on new designs posted on the site by their favourite designers<br />(vii)\tadd their own comments and ratings on different designs<br />(viii)\tGet a designer to design outfits for them through the designer chat where a user gets to know about a designer on a personal basis.<br />On the other hand, a designer is a creative and technical professional or individual who designs clothing within a specific theme for a specific purpose and a specific market. In this site a fashion designer creates fabrics, clothing, precious metal jewelry and beads in various, shapes and sizes. The designer also has access to all the services available to a user and other services stated below:<br />(i)\tUploading of Profile and designs which can be shared with users and other designers<br />(ii)\tDesigner Chat group<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-11-21T07:03:54.617-08:00"
}