{
  "ProjectName": "nimbusclient",
  "Title": "Nimbusclient",
  "Description": "Nimbus is a local cloud solution consisting of the Nimbus server and the Nimbus client software. \r\nNimbus can be used in Dropbox style with a local folder.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>Nimbusclient for Nimbus - serve files from local network (Lan) or from synced cloud storage</h1>\r\n<p>Nimbus is a local cloud solution consisting of two components: The Nimbus server and the Nimbus client software. Nimbus can be used in Dropbox style with a local folder. Its content is served as a webpage to the Local area network (LAN). In this use case\r\n internet access is not necessary. Alternatively, when Nimbus server is not started but internet access is available, you can also use a synced cloud storage from the internet to serve content to Nimbus clients.</p>\r\n<p>Additionally when using Nimbus server there is a collective drawingboard and a collective poll app available for all clients in the LAN to collaborate.</p>\r\n<p>Nimbus client can be used as webapp or as native app. A native app is availale for Android and Windows. The native Windows Nimbus client has a built in network discovery function to find the Nimbus server in the LAN.</p>\r\n<p>For further Information about Nimbus see <a href=\"http://nimbus.codeplex.com\">\r\nnimbus.codeplex.com</a>. This page only describes the installation of the Nimbusclient software for windows.</p>\r\n<h2>Installation</h2>\r\n<p>After downloading Nimbusclient, copy the self extracting 7zip archive <a href=\"https://nimbusclient.codeplex.com/downloads/get/1483109\">\r\nnimbusclient_setup.exe</a> to the folder where you want Nimbusclient to be installed. In fact you can copy nimbusclient to any folder you like. A real installation is not necessary. For all functions of Nimbusclient to work correctly choose a folder where you\r\n have write privileges. For example you can choose D:\\nimbusclient_setup.exe for Nimbusclient to be extracted to D:\\nimbusclient. The folder contains the file Nimbusclient.exe to start the Nimbus client on the local machine and several other files and subfolders.</p>\r\n<p><img src=\"/projects/nimbusclient/f9de7f37-1616-4e03-a95e-2a976d66fc5c\" alt=\"\" width=\"92\" height=\"22\"></p>\r\n<p>It is convenient to create a link of Nimbusclient.exe on your desktop or quick-start-bar by dragging the file to your desktop when holding the &quot;ALT&quot;-key.</p>\r\n<p>If you prefer to extract the Nimbus files by yourself from nimbus_setup.exe you can download the 7zip software from\r\n<a href=\"http://www.7-zip.org/\">www.7-zip.org</a>.</p>\r\n<p>To get the latest Nimbusclient updates, Nimbusclient has a built in update function. Nimbusclient checks immediately and at every program start for new updates and downloads them (nimbusclient.7z) to your Download folder. At the next program start you are\r\n asked to install the update.</p>\r\n<h2>Starting Nimbusclient</h2>\r\n<p>After starting Nimbusclient.exe the default Nimbusclient window opens:</p>\r\n<p><img src=\"https://www.codeplex.com/Download?ProjectName=nimbus&DownloadId=1480913\" alt=\"\" width=\"493\"></p>\r\n<p>Here you can see the address of the default Nimbus book from the internet and the corresponding QR-code. Beneath are the files served as pages from the selected Nimbus book as web pages.</p>\r\n<p>With its built in discovery function Nimbusclient recognizes if a nimbus server is present in the LAN and automatically connects.</p>\r\n<p>Further information on how to use Nimbus, Nimbusserver and Nimbusclient is available under\r\n<a href=\"http://nimbus.codeplex.com\">nimbus.codeplex.com</a>.</p>\r\n<h2>Terms and Conditions for Nimbus</h2>\r\n<p>Copyright<br>\r\nAll content and materials originally available in Nimbus (including Nimbusserver and Nimbusclient) are the intellectual property of the autor of Nimbus and are protected by applicable copyright and trademark law. Any inappropriate use, including but not limited\r\n to the reproduction, distribution, display or transmission of any content on this site is strictly prohibited, unless specifically authorized by the autor of Nimbus.\r\n<br>\r\n<br>\r\nUser provided content (external content)<br>\r\nOn content provided by the user of the Nimbus software as Nimbus server administrator, the author of Nimbus has no influence. Therefore the author of Nimbus is not responsible for this external content. For the self created pages (external content) only the\r\n author of these pages or the administartor of the Nimbus server is responsible. <br>\r\n<br>\r\nLimitation of Liability<br>\r\nBy using Nimbus, you understand and agree that all resources Nimbus provides are &quot;as is&quot; and &quot;as available&quot;. Any content downloaded or otherwise obtained through the use of Nimbus is done at your own discretion and risk, and that you are solely responsible\r\n for any damage to your computer or other devices for any loss of data that may result from the download of such content. The author of Nimbus will not be liable for any direct, indirect, incidental, consequential or exemplary loss or damages which may be incurred\r\n by you as a result of using Nimbus.</p>\r\n<h2>Privacy Policy for Nimbus</h2>\r\n<p>When using Nimus the following information is collected:</p>\r\n<ul>\r\n<li>The ipaddress of your device (e.g. smartphone, tablet, pc, ...) in the used network,\r\n</li><li>the data (e.g. answers, words, drawings, ...) you enter into drwaingboard or polls or into forms on the different pages of Nimbus.\r\n</li></ul>\r\n<h2>References: Software components used by Nimbus</h2>\r\n<p>see <a href=\"http://nimbus.codeplex.com\">nimbus.codeplex.com</a></p>\r\n<h2>Author</h2>\r\n<p>Nimbus, Nimbusserver, Nimbusclient <br>\r\nNimbus is still a beta version!<br>\r\nVersion of this documentation 20150910<br>\r\nFirst Version of Nimbus 20150516<br>\r\n(c) M. Neumann<br>\r\nURL: <a href=\"https://nimbus.codeplex.com\">nimbus.codeplex.com</a><br>\r\nRelease notes: <a href=\"http://nimbusclient.codeplex.com/releases\">nimbusclient.codeplex.com/releases</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2015-09-10T05:54:12.153-07:00"
}