{
  "ProjectName": "nimbus",
  "Title": "Nimbus",
  "Description": "Nimbus is a local cloud solution consisting of a server and a client software. Nimbus can be used in Dropbox style with a local Folder to be served via Lan. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>Nimbus - serve files from local network (Lan) or from synced cloud storage</h1>\r\n<p>Nimbus is a local cloud solution consisting of two components: The Nimbus server and the Nimbus client software. Nimbus can be used in Dropbox style with a local folder. Its content is served as a webpage to the Local area network (LAN). In this use case\r\n internet access is not necessary. Alternatively, when Nimbus server is not started but internet access is available, you can also use a synced cloud storage from the internet to serve content to Nimbus clients.</p>\r\n<p>Additionally when using Nimbus server there is a collective drawingboard and a collective poll app available for all clients in the LAN to collaborate.</p>\r\n<p>Nimbus client can be used as webapp or as native app. A native app is availale for Android and Windows. The native Windows Nimbus client has a built in network discovery function to find the Nimbus server in the LAN.</p>\r\n<h2>Installation</h2>\r\n<p>After downloading Nimbus, copy the self extracting 7zip archive <a href=\"https://nimbus.codeplex.com/downloads/get/1480939\">\r\nnimbus_setup.exe</a> to the folder where you want Nimbus to be installed. In fact you can copy nimbus to any folder you like. A real installation is not necessary. For all functions of Nimbus to work correctly choose a folder where you have write privileges.\r\n For example you can choose D:\\nimbus_setup.exe for Nimbus to be extracted to D:\\nimbus.\r\n<br>\r\nThe folder contains the file Nimbus.exe to start the Nimbus server on the local machine and several other files and subfolders.</p>\r\n<p><img src=\"/projects/nimbus/460aff95-6896-47cd-abb1-070ecb78142c\" alt=\"\" width=\"92\" height=\"22\"></p>\r\n<p>It is convenient to create a link of Nimbus.exe on your desktop or quick-start-bar by dragging the file to your desktop when holding the &quot;ALT&quot;-key.</p>\r\n<p>If you prefer to extract the Nimbus files by yourself from nimbus_setup.exe you can download the 7zip software from\r\n<a href=\"http://www.7-zip.org/\">www.7-zip.org</a>.</p>\r\n<p>To get the latest Nimbus updates it is recommended to activate &quot;Check and download updates&quot; in the Nimbus context menu. Nimbus checks immediately and at every program start for new updates and downloads them (nimbus.7z) to your Download folder. At the next\r\n program start you are asked to install the update.</p>\r\n<h2>Starting Nimbus</h2>\r\n<p>After starting Nimbus.exe, first Nimbus displays a welcome messages and the Nimbus symbol appears in the tray:</p>\r\n<p><img src=\"/projects/nimbus/2c1a48ec-4211-4dcd-8064-60e64761e460\" alt=\"\"></p>\r\n<p>Right click the tray symbol to open the Nimbus context menu:</p>\r\n<p><img src=\"/projects/nimbus/d49f2ecd-3731-45d5-8da4-7f91af35219b\" alt=\"\" width=\"223\" height=\"273\"></p>\r\n<p>To use Nimbus server in your local network,you have to add some firewall rules on your machine. The port 80 has to be openend for the clients in the local network. So the clients are able to access Nimbus server. You can add the firewall rule by clicking\r\n the corresponding menu item in the Nimbus context menu (see above). You will need administrator privileges on your local machine to add these rules. If you have installed another firewall software than windows firewall you must open port 80 by yourself. See\r\n the documentation of your fireall software.</p>\r\n<p>At the buttom of this menu you can find the Nimbus server log messages.</p>\r\n<p>The initial setting for Nimbus after installation is not to start Nimbus server. Therefore, if you start the Nimbusclient webapp, the default browser window opens:</p>\r\n<p><img src=\"/projects/nimbus/1932538d-c972-47ea-8997-5b346eaea8d7\" alt=\"\" width=\"493\"></p>\r\n<p>Here you can see the address of the default Nimbus book from the internet and the corresponding QR-code. Since Nimbus server is not started there is no content from the local network available. Beneath are the files served as pages from the selected Nimbus\r\n book as web pages. In this case it is the Nimbus help page called Nimbus.</p>\r\n<h3>Starting the Nimbus server</h3>\r\n<p>To server a Nimbus book in the local network we have to start Nimbus server first. Close the browser window with the Nimbusclient webapp if it is still open and select Nimbusserver from the Nimbus context menu in the tray. Nimbus server is now started. The\r\n corresponding menu item is now checked and there are additional menu items in the context menu of Nimbus:</p>\r\n<p><img src=\"/projects/nimbus/bb17a38b-c557-45d0-9d31-51ff13db703a\" alt=\"\" width=\"312\" height=\"363\"></p>\r\n<p>Here you can see the url of the Nimbus server in your local network and the address of the book serverd by Nimbusserver in the local network. Click Nimbusclient webapp to open the webapp again. Now with content served in the local network:</p>\r\n<p><img src=\"/projects/nimbus/efc13cb7-412e-41c4-8cc3-f1f9e2b564e7\" alt=\"\" width=\"493\"></p>\r\n<p>The QR-code on the right side can be used by clients in the local network to load the Nimbusclient webapp directly from the Nimbusserver and open the book url. If the client device has the Nimbusclient software already installed on its device, the QR-code\r\n on the left side can be used to open the Nimbus book.</p>\r\n<h2>Adding content to Nimbus server</h2>\r\n<p>Content served by Nimbus server is located in the book path which is displayed in the context menu. To open the book path click Open... in the Nimbus tray context menu. Then the Nimbus book folder opens and you can add or remove subfolders to this localtion.\r\n The name of the subfolder is used as the title for the page. If the subfolder contains a html-file named index.htm or index.html or foldername.htm or foldername.html Nimbus recognizes this page as a html page. Otherwise all files in the folder are offered\r\n as downloads by Nimbus.</p>\r\n<p>Nimbus server is equipped with a watchdog. So changes to the selected book folder are also recognized after a few seconds by the Nimbus server web page. The file nimbus.xml in the selected book folder is instantly updated by Nimbus.</p>\r\n<p>If you want to select another location as book folder, click &quot;Change book path&quot; and select another path on your device. If you select a folder which is also synced to a public cloud like Dropbox, you can even access your book with the public Dropbox-address\r\n of the nimbus.xml file which is generated by Nimbus in the selected book folder. If you provide the public Dropbox-address to your clients, they are able to access the book even when Nimbus server is offline.</p>\r\n<h2>Nimbusclient</h2>\r\n<p>Nimbusclient can either be started as webapp using the Nimbusserver url provided in the Nimbusserver context menu or by the webapp QR-Code displayed when opening Nimbusclient webapp from the context menu of Nimbusserver (see above). Alternatively Nimbusclient\r\n can be installed from the app store as native app. Currently Nimbusclient is available for Windows and Android. Nimbusserver already contains the Nimbusclient software for windows. But Nimbusclient can also be installed seperately when Nimbusserver is not\r\n needed on the device:</p>\r\n<ul>\r\n<li>Nimbusclient for Windows: <a href=\"http://nimbusclient.codeplex.com/\">nimbusclient.codeplex.com</a>\r\n</li><li>Nimbusclient for Android: <a href=\"https://play.google.com/store/apps/details?id=mac.nimbus.client\">\r\nPlayStore</a> </li></ul>\r\n<p>The native Windows Nimbus client has a built in network discovery function to find the Nimbus server in the LAN.</p>\r\n<p>When using Nimbus client, first you can decide which book to view by entering the book url</p>\r\n<p><img src=\"/projects/nimbus/c2a71425-cce7-4b3b-9337-695a1c28c322\" alt=\"\" width=\"632\" height=\"171\"></p>\r\n<p>and pressing the &quot;Add / reload book&quot; button or by choosing a previously visited book from the dropdown list. Visited books are stored in the browser cache.</p>\r\n<p>A book consits of one or several pages which are displayed at the bottom of the page:</p>\r\n<p><img src=\"/projects/nimbus/e5bc2e61-fc19-4648-991a-bd618fcc6634\" alt=\"\" width=\"845\" height=\"79\"></p>\r\n<p>In this case there is only one book called Nimbus. Clicking to a page entry opens the page in fullscreen mode if possible in your browser. Pressing the Esc-key will terminate fullscreen mode in most browsers.</p>\r\n<p>The are additional buttons to control Nimbusclient:</p>\r\n<ul>\r\n<li><img src=\"/projects/nimbus/da192b7b-1a75-434a-8436-4e8884d476c6\" alt=\"\"> Toggle fullscreen mode (if available on your device)\r\n</li><li><img src=\"/projects/nimbus/d47a6244-758d-4d2c-aa97-506a0066482b\" alt=\"\"> Go back to Nimbus main page\r\n</li><li><img src=\"/projects/nimbus/30f27914-9439-4432-8f03-c43c3574871c\" alt=\"\"> Drawingboard for collective drawings with all clients\r\n</li><li><img src=\"/projects/nimbus/563604d9-6c5b-4eaa-818e-e4023dba7525\" alt=\"\"> Poll app for collective requests with all clients (only available if started from server device)\r\n</li></ul>\r\n<p>Opening Nimbusclient on the Nimbusserver device, you have addional rights: For example you can start a poll by using the poll app.</p>\r\n<p>The native windows Nimbusclient has a context menu which can be activated by the right mouse button. Here you can change some settings, view the Nimbusclient log messages and exit Nimbusclient. To get the latest Nimbusclient updates it is recommended to\r\n activate &quot;Check and download updates&quot; in the Nimbusclient context menu.</p>\r\n<h3>Collective drawingboard</h3>\r\n<p>Open the drawingboard with the button in the top right corner</p>\r\n<p><img src=\"/projects/nimbus/30f27914-9439-4432-8f03-c43c3574871c\" alt=\"\" width=\"37\" height=\"35\"></p>\r\n<p>You can create drawings with mouse or by touch. When you are connected to a Nimbusserver device the drawings can be shared with all other clients by pressing the share button</p>\r\n<p><img src=\"/projects/nimbus/86e3c482-2c8d-46f2-bf90-8d9d7dd5c8ee\" alt=\"\" width=\"31\" height=\"32\"></p>\r\n<p>or continously sharing can be activated by checking:</p>\r\n<p><img src=\"/projects/nimbus/2179adc3-3562-4889-9236-a931b847088b\" alt=\"\" width=\"130\" height=\"30\"></p>\r\n<h3>Collective poll</h3>\r\n<p>When you open Nimbusclient on the Nimbusserver device, you are able to create a poll to be answered by the Nimbus clients in the local network. To create a poll click the poll button in the top right corner:</p>\r\n<p><img src=\"/projects/nimbus/563604d9-6c5b-4eaa-818e-e4023dba7525\" alt=\"\" width=\"36\" height=\"33\"></p>\r\n<p>Two sample questions are already provided:</p>\r\n<p><img src=\"/projects/nimbus/07be768d-cd73-47aa-b47b-e43824ec38a8\" alt=\"\" width=\"493\"></p>\r\n<p>To change the questions press the &quot;Edit&quot; button.</p>\r\n<p><img src=\"/projects/nimbus/53d2eca4-e4ec-4d8b-8c60-aa3143204158\" alt=\"\" width=\"493\"></p>\r\n<p>You have several options to add or remove questions or answers, change several texts to be displayed or change the question type. A poll question is a question without a correct answer. The response is collected and displayed in the Nimbusclient on the Nimbusserver\r\n device. A &quot;normal&quot; questions has one or multiple (if allowed) answers. This type of question is corrected and the client receives a response immadiately after submitting the answer. The client can see whether his answer was correct or not.</p>\r\n<p>To start the poll press &quot;Poll&quot; button. The clients receive a message and the poll icon is displayed in the top right corner.</p>\r\n<p>After answering the questions the Nimbusclient on the Nimbusserver device receives the responses. The client results can be displayed by pressing the &quot;Results (5)&quot;. The number in brackets indicates the number of client responses already received.</p>\r\n<p>Pressing the &quot;Correct&quot; button marks the correct question (only if not a poll question, see above).</p>\r\n<p>Press the &quot;Stop poll&quot; button to immadiately stop the poll and collect all client responses. The poll is not accessible by the clients anymore.</p>\r\n<h2>Closing Nimbus</h2>\r\n<p>To shut down Nimbus and Nimbusserver click Exit in the Nimbus tray context menu. The settings at the moment of terminating Nimbus are saved for the next Nimbus session.</p>\r\n<h2>Terms and Conditions for Nimbus</h2>\r\n<p>Copyright<br>\r\nAll content and materials originally available in Nimbus (including Nimbusserver and Nimbusclient) are the intellectual property of the autor of Nimbus and are protected by applicable copyright and trademark law. Any inappropriate use, including but not limited\r\n to the reproduction, distribution, display or transmission of any content on this site is strictly prohibited, unless specifically authorized by the autor of Nimbus.\r\n<br>\r\n<br>\r\nUser provided content (external content)<br>\r\nOn content provided by the user of the Nimbus software as Nimbus server administrator, the author of Nimbus has no influence. Therefore the author of Nimbus is not responsible for this external content. For the self created pages (external content) only the\r\n author of these pages or the administartor of the Nimbus server is responsible. <br>\r\n<br>\r\nLimitation of Liability<br>\r\nBy using Nimbus, you understand and agree that all resources Nimbus provides are &quot;as is&quot; and &quot;as available&quot;. Any content downloaded or otherwise obtained through the use of Nimbus is done at your own discretion and risk, and that you are solely responsible\r\n for any damage to your computer or other devices for any loss of data that may result from the download of such content. The author of Nimbus will not be liable for any direct, indirect, incidental, consequential or exemplary loss or damages which may be incurred\r\n by you as a result of using Nimbus.</p>\r\n<h2>Privacy Policy for Nimbus</h2>\r\n<p>When using Nimus the following information is collected:</p>\r\n<ul>\r\n<li>The ipaddress of your device (e.g. smartphone, tablet, pc, ...) in the used network,\r\n</li><li>the data (e.g. answers, words, drawings, ...) you enter into drwaingboard or polls or into forms on the different pages of Nimbus.\r\n</li></ul>\r\n<h2>References: Software components used by Nimbus</h2>\r\n<p>Nibus uses the following sofware components, tools, libraries and nodejs modules to realize its functionality. Licence informations for these components to be considered are available from the corresponding homepage:</p>\r\n<ul>\r\n<li><a href=\"http://www.7-zip.org/\">7zip</a> </li><li><a href=\"https://www.npmjs.com/package/atob\">Atob</a> and <a href=\"https://www.npmjs.com/package/btoa\">\r\nBtoa</a> </li><li><a href=\"https://www.npmjs.com/package/dir_watchdog\">Dir watchdog</a> </li><li><a href=\"http://leimi.github.io/drawingboard.js/\">Drawingboard</a> </li><li><a href=\"http://enigmaprotector.com/en/aboutvb.html\">Enigma virtual box</a> </li><li><a href=\"https://www.npmjs.com/package/express\">Express</a> </li><li><a href=\"http://www.jsqr.de/\">Jsqr</a> </li><li><a href=\"http://jquerymobile.com/\">Jquery mobile</a> </li><li><a href=\"http://knockoutjs.com/\">Knockout</a> </li><li><a href=\"https://nodejs.org/\">Nodejs</a> </li><li><a href=\"http://nwjs.io/\">Nwjs</a> </li><li><a href=\"http://pouchdb.com/\">Pouchdb</a> </li><li><a href=\"https://github.com/sindresorhus/screenfull.js/\">Screenful</a> </li><li><a href=\"http://socket.io/\">Socket.io</a> </li></ul>\r\n<h2>Author</h2>\r\n<p>Nimbus, Nimbusserver, Nimbusclient <br>\r\nNimbus is still a beta version!<br>\r\nVersion of this documentation 20150910<br>\r\nFirst Version of Nimbus 20150516<br>\r\n(c) M. Neumann<br>\r\nURL: <a href=\"https://nimbus.codeplex.com\">nimbus.codeplex.com</a><br>\r\nRelease notes: <a href=\"http://nimbus.codeplex.com/releases\">nimbus.codeplex.com/releases</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2015-09-13T07:12:04.533-07:00"
}