{
  "ProjectName": "PandorasBox",
  "Title": "Pandora's Box",
  "Description": "Pandora's Box is a tool for Ultima Online Gamemasters, primarily  on RunUO-Freeshards. It includes a roof builder, travel manager and a lot of other wizards and functions.\r\n\r\nIt was developed by Arya who released the sourcecode of Version 2 Beta 5. There were some additional changes made by user at runuo.com. This project here is aimed to consolidate the different versions, fix existent bugs or incompatibilities (e.g. with some Vista configurations) and made some extensions. Also it is aimed to refactor the whole sourcecode and advance it to new technologies.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Pandora&#39;s Box is a tool for Ultima Online Gamemasters, primarily  on RunUO-Freeshards. It includes a roof builder, travel manager and a lot of other wizards and functions.<br /><br />It was developed by Arya who released the sourcecode of Version 2 Beta 5. There were some additional changes made by user at runuo.com. This project here is aimed to consolidate the different versions, fix existent bugs or incompatibilities &#40;e.g. with some Vista configurations&#41; and made some extensions. Also it is aimed to refactor the whole sourcecode and advance it to new technologies.<br />\n<h2>Some goals of this project:</h2>\r<ul><li>simple installation and updates with ClickOnce</li>\n<li>WPF interface to support skins and free resizing</li>\n<li>Add-In support</li>\n<li>Multi-Language support with ressource files</li>\n<li>.NET 3.5 Codebase</li>\n<li>closer integration with the runuo server</li>\n<li>support for different spawner systems like ArteGordon&#39;s XML-Spawner via Add-In</li>\n<li>integrated mul viewer similiar to InsideUO to add new statics</li></ul>\n\n<h2>Collaboration</h2>\rIf you are interested in working on this project you can send me a mail. You should have a <b>good understanding of C# and .NET 2.0 / 3.5</b>. Also a <b>designer</b> is needed for some layouts and operations. You should be familiar with the <b>RunUO-Community</b> and requirements of gamemasters in Ultima Online.<br />\n<h2>Beta-Tester</h2>\rCurrently there is no new version of Pandora&#39;s Box available for testing but you can download the last official release by Arya, Pandora&#39;s Box 2 Beta 5, at <a href=\"http://arya.altervista.org/\">http://arya.altervista.org/</a> - <b>no support is given for this original version!</b> Of course you may ask for help at the RunUO-Forums: <a href=\"http://www.runuo.com/community.php\">http://www.runuo.com/community.php</a><br />When there is a new Beta-Version you are heartily invited to participate in testing to find bugs, suggest new features and to optimize the user interface. Also some translators will be necessary at this time.</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,WPF,RunUO,",
  "LastEdited": "2008-09-10T17:36:37.193-07:00"
}