{
  "ProjectName": "Paradox",
  "Title": "Paradox",
  "Description": "Paradox is a classic RPG in the style of the original Final Fantasy games. Built on XNA, it serves both as a fun game itself as well as a good way to learn Game Development with XNA.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><a href=\"https://paradox.codeplex.com/wikipage?title=News%20Feeds&referringTitle=Home\">News Feeds</a><br /><b>Project Home Page</b><br />This is your project&#39;s Wiki-based home page. The content of this page is completely editable by any project developer. Before you get too far along with your project, we encourage you to take some time to update this page with useful information regarding your project.<br />To edit this page, just click the <b>Edit</b> link below. <br />A &quot;Quick Wiki Markup Guide&quot; can be found on the right side of the <b>Edit</b> page for help with formatting the Wiki text. For a more detailed explanation of the Wiki markup, see the <a href=\"http://www.codeplex.com/Wiki/View.aspx?ProjectName=CodePlex&amp;title=CodePlex%20Wiki%20Markup%20Guide\">Wiki Markup Guide</a>.<br /><br /><b>How to use this page</b><br />The Project home page is the place that team members and visitors will go to find out about your project. Here are some ideas about what to put on this page:<br />\n<ul><li>News</li>\n<li>Frequently Asked Questions (FAQ)</li>\n<li>Project information (the text from your project description, for example)</li>\n<li>Project documentation</li>\n<li>Development methodologies</li>\n<li>Release process</li>\n<li>Current issues</li></ul>\n<br /><b>What is a Wiki page?</b><br />If you are active on the Internet, chances are you&#39;ve visited a Wiki page--perhaps even edited one. Simply put, a Wiki is a collection of Web pages that can be edited by anybody with sufficient permission to do so. Wiki pages are easy to edit using a set of simple markup tags that allow you to format text, add images, and create links. A <b>Quick Wiki Markup Guide</b> appears to the right of the <b>Edit</b> page as a reference.</div><div class=\"ClearBoth\"></div>",
  "TagList": "XNA,Paradox,XNAPradox,rpg engine,",
  "LastEdited": "2006-12-07T15:16:02.39-08:00"
}