{
  "ProjectName": "resourceviewer",
  "Title": "Resource Viewer - Visual Studio Extension",
  "Description": "Simply put the “resource viewer extension” enables you to visually view your ResourceDictionary.\r\n\r\nTo open it go to: View – Other Windows – Resource Viewer.\r\n\r\nWhen working with WPF/Silverlight you put your reusable resources in a common ResourceDictionary, those resources might be of type Style, SolidColorBrush, DrawingBrush, BitmapImage and more. The problems starts when you have that ResourceDictionary you have no way to see how your resources look like, making the work process (of both the developer who maintains this dictionary and the one who uses it) clumsy and based on guessing.\r\n\r\nThis extension comes to solve those problems!\r\n\r\nWith the “Resource viewer “ extension you can open any ResourceDictionary and actually see how your resources look like – your icons, brushes, etc. are all being visualized right inside Visual Studio.\r\n\r\nThan when you’ve found the resource you’ve been after you can “inject” it into a file that is opened within Visual Studio.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>Simply put the &ldquo;resource viewer extension&rdquo; enables you to visually view your ResourceDictionary.</p>\r\n<p>To open it go to: View &ndash; Other Windows &ndash; Resource Viewer.</p>\r\n<p>When working with WPF/Silverlight you put your reusable resources in a common ResourceDictionary, those resources might be of type Style, SolidColorBrush, DrawingBrush, BitmapImage and more. The problems starts when you have that ResourceDictionary you have\r\n no way to see how your resources look like, making the work process (of both the developer who maintains this dictionary and the one who uses it) clumsy and based on guessing.</p>\r\n<p>This extension comes to solve those problems!</p>\r\n<p>With the &ldquo;Resource viewer &ldquo; extension you can open any ResourceDictionary and actually see how your resources look like &ndash; your icons, brushes, etc. are all being visualized right inside Visual Studio.</p>\r\n<p>Than when you&rsquo;ve found the resource you&rsquo;ve been after you can &ldquo;inject&rdquo; it into a file that is opened within Visual Studio.</p>\r\n<p style=\"padding-left:90px\"><img src=\"https://shemesh.files.wordpress.com/2012/03/resource-viewer-screenshot1.png\" alt=\"\" width=\"401\" height=\"401\"></p>\r\n<p>Features:</p>\r\n<ul>\r\n<li>A Visual Studio 2010 extension &ndash; meaning it integrates with VS api and behave like any other window (docking, floating etc.)\r\n</li><li>Open any XAML ResourceDictionary file on your computer &ndash; simply browse to it.\r\n</li><li>When you open the viewer it automatically opens the last opened file. </li><li>Most recently used files list. </li><li>Refresh button to reload the opened file. </li><li>The opened file is being watched for changes, if a change is made you&rsquo;ll be notified.\r\n</li><li>Zoom slider and zoom presets. </li><li>Search box. </li><li>Inject the selected item&rsquo;s x:Key into an opened document by double-click on an item or pressing the &ldquo;Inject&rdquo; button.\r\n</li><li>Inject prefix and suffix strings. Those are saved and persisted. </li></ul>\r\n<p><strong>V2.0</strong><span>&nbsp;adds handling for Brushes (DrawingBrush, SolidColorBrush, Gradients, etc.) and a details view.</span></p>\r\n<p>Future plans:</p>\r\n<ul>\r\n<li>Add handling for Merged Dictionaries. </li><li>More&hellip; </li></ul>\r\n<p>&nbsp;</p>\r\n<p>If you are willing to help in any way please drop me a note.</p>\r\n<p><a href=\"https://shemesh.wordpress.com/\">https://shemesh.wordpress.com/</a></p>\r\n<p>the extension is also hosted in the Visual Studio gallery, here:&nbsp;<span><a href=\"http://visualstudiogallery.msdn.microsoft.com/b9c1754f-135d-4d04-a41f-64230848d468\">Resource Viewer</a></span></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,Silverlight,ResourceDictionary,xaml,C#,Visual Studio 2010,VSIX,visual studio addin,tool,",
  "LastEdited": "2012-03-15T00:31:52.21-07:00"
}