{
  "ProjectName": "scl",
  "Title": "Skywave Class Library",
  "Description": "Skywave Class Library will contain multiple projects (one at start) targeting classes, interfaces, controls and ... for different .Net technologies like ASP.Net, WPF, Windows Forms, ... and one Core Project including shared classes.\nIt's my shared library of 10 years development.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Skywave Class Library will contain multiple projects &#40;one at start&#41; targeting classes, interfaces, controls and ... for different .Net technologies like ASP.Net, WPF, Windows Forms, ... and one Core Project including shared classes.<br />It&#39;s my shared library of 10 years development.<br /><br /><br />I will add a few class and controls each week, with a brief instruction and documentation about how to use them.<br />I need serious assistant on documenting this project.<br />Any help for documenting and or extending this class library will be appreciated.<br /><br />I promise some great controls and classes will be introduced in this project that you will love them (OPENSOURCE!), and if you want the same from other 3rd party corporations, you should pay a lot :D<br /><br />Check for new builds, new documentation each week.<br /><br />I need some developers with strong English language skills for documentation, if you are the one, please contact me ;)<br /><br />*NOTE:<br />Some classes, controls are developed for multi-language environments, for example a DateTime picker using typed text.<br />In default, these controls will support two languages: Persian and English but if you wish you can add more :) <br />Those with Persian language support will have default layout of Right-To-Left but if you have some skills you can change them for yourself and use them (and probably provide it to this project for other developers). </div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,Class Library,Helpers,Windows Forms,WPF,LINQ TO SQL,Controls,multilingual,Persian,.NET 4.0,",
  "LastEdited": "2011-01-20T03:05:45.593-08:00"
}