{
  "ProjectName": "sharpvectors",
  "Title": "SharpVectors - SVG# Reloaded",
  "Description": "The Scalable Vector Graphics (SVG) is an XML-based file format for creating graphics on the web, and is supported by most modern browsers.",
  "MovedLink": "https://github.com/ElinamLLC/SharpVectors",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\rThe Scalable Vector Graphics &#40;SVG&#41; is an XML-based file format for creating graphics on the web, and is supported by most modern browsers.<br /><br />The <a href=\"http://en.wikipedia.org/wiki/Scalable_Vector_Graphics\">Scalable Vector Graphics (SVG)</a> is now natively supported in most internet browsers, including the IE 9. With the HTML5, the use of the SVG as graphics format on the web is increasing. <br /><br />For .NET application developers, there is currently no library complete enough to handle SVG files. Even the commercial tools are either not available or not complete enough to handle most uses of the SVG in Windows Presentation Foundation (WPF) applications.<br />The project does not aim to provide a complete implementation of the SVG file format, but will support the features required in an average graphics application.<br /><br />The SVG specifications is available <a href=\"http://www.w3.org/Graphics/SVG/\">here</a>.<br /><br />This project is based on the <a href=\"http://sourceforge.net/projects/svgdomcsharp/\">SharpVectorGraphics (aka SVG#)</a> library. Besides bug fixes and improved feature support, we updated it to .NET 2/.NET 3.5 platform, removing the dependencies on the depreciated script engine libraries and the zip library, SharpZipLib.<br />\n<h2>Features and Uses</h2>\rIn general, the following features are implemented:\n<ul><li>Parsing of the SVG files to create the SVG DOM</li>\n<li>SVG to XAML conversion</li>\n<li>A small runtime library to handle font URI, embedded images and others when using the XAML files directly from disk.</li>\n<li>An optimized XAML output.</li>\n<li>A simple and basic SVG viewer (an advanced viewer is planned).</li>\n<li>Interaction with the conversion process (by a visitor pattern) to allow for custom hyper-link implementations, font substitutions etc.</li></ul>\n<b>NOTE</b>: Only Geometry/Drawing level elements are exported, which will not work with Silverlight. <br />See the <a href=\"https://sharpvectors.codeplex.com/documentation?referringTitle=Home\">Documentation</a> section for more information on the features.<br />\n<h2>Converter Application</h2>\rThere is a converter application. It converts a single SVG file, multiple SVG files and directory of SVG files to XAML.<br /><br /><img src=\"/projects/sharpvectors/66a3e277-9bad-4b2d-b195-22f3811b4c04\" alt=\"SharpVectors.png\" title=\"SharpVectors.png\" /><br />\n<h2>Sample Applications</h2>\rThe library includes a number of sample application for both WPF and GDI+. Here are some of them:<br />\n<h3>WPF Test Application</h3>\rThis is an application for browsing directory (recursively) of SVG files.<br /><br /><img src=\"/projects/sharpvectors/27336673-9e0c-47ab-b00f-f92d128288a6\" alt=\"WpfTestSvgSample.png\" title=\"WpfTestSvgSample.png\" /><br />\n<h3>WPF W3C Test Suite</h3>\rThis is an application for viewing the W3C Test Suite compliant results. It has two panes: top and bottom. The top pane is the generated WPF output, the bottom pane is the W3C expected output image.<br />By the test results, this is the most complete SVG reader for WPF.<br /><br /><img src=\"/projects/sharpvectors/10c37148-ef42-4828-ad32-59c2a7426e23\" alt=\"WpfW3cSvgTestSuite.png\" title=\"WpfW3cSvgTestSuite.png\" /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "SVG,SVG#,WPF,XAML,",
  "LastEdited": "2011-06-13T09:50:49.373-07:00"
}