{
  "ProjectName": "showroom",
  "Title": "Showroom",
  "Description": "Showroom is written in C# to change your desktop's wallpaper. Additionally it can cycle through a folder(s) at an interval and set the wallpaper to a random image found and saved Style/Color are used for desired viewing and are saved or manually inputted by provided editor.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Showroom is an advanced way of changing your desktop&#39;s background.  You can set it once or establish a simple or complex cycle in which the program will randomly choose a picture from a given directory, subdirectories optional.  This cycle can have default style and color or the user can use the provided log editor to ensure the best viewing possible for specific wallpapers.<br /><br /><br />If you remember Windows95/98 you might recall Active Desktop which was a security issue but nifty nonetheless.  Since those days in my experience at least the wallpaper has been non-interactive so to dabble in C# I decided to write something that could do this for you.<br /><br />This program, &#39;Showroom&#39;, allows you to set the wallpaper much like Windows, I did not work to get it to tile/stretch/center correctly on the main tab.  Setting the wallpaper will save the settings, or override previously settings, associated with the specific file.  More below as these settings are used in the cycle.<br /><br />Showroom has a cycle, the whole point to it, which allows you to choose a directory (sub-directories optional) that it randomly chooses a valid picture file (jpg, jpeg, bmp, png) and sets it as the wallpaper.  Included is an editor to create with ease optimal settings for specific wallpapers so that fileA is centered with a neon green background, fileB is tiled, fileC is centered black background, etc. and to set default for files not found in the log.  The editor will delete incomplete text to the end of the file so work at the bottom or just follow the norm.  <br /><br />The cycle can be any of the listed minutes/hours, invalid user input defaults to 15minutes, its defined to limit the fixes for invalid input, can change it in the future I guess.<br />\n<h2>You have to log into windows as an account with administrator powers.</h2>\rIf you try to run it as a guest account or with the kiddie powers only it will not start.<br /><br />Should work fine in Windows2000, XP and Vista.  Feedback is of course welcome at blando.calrissian@gmail.com</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-03-14T00:21:22.633-07:00"
}