{
  "ProjectName": "sourcecontrolmonitor",
  "Title": "MVVM Source Control Monitor",
  "Description": "An exercise in MVVM with Wpf to create a useful and unobtrusive source control notification tool that lives in the system tray, and can also be viewed in a window.\r\n\r\nThis is meant to provide a 'real world' application to provide examples of MVVM implementation without understanding any other frameworks that can blur the lines about what MVVM really is (it's a pattern, folks).\r\n\r\nThe application will use as little 3rd party code as possible (Wpf Toolkit, some other goodies) that are all unrelated to MVVM itself.  The software is meant to be deconstructed and torn apart so that anyone who wants to learn MVVM can get the basic ideas of how to implement it, on its own, without using anyone else's software to do it.\r\n\r\nHopefully, this application will inspire others that are hesitant about MVVM to just dive in and get started.  If not, well...it'll be a useful tool to monitor source control activity, too.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />An exercise in MVVM with Wpf to create a useful and unobtrusive source control notification tool that lives in the system tray, and can also be viewed in a window.<br /><br />This is meant to provide a &#39;real world&#39; application to provide examples of MVVM implementation without understanding any other frameworks that can blur the lines about what MVVM really is &#40;it&#39;s a pattern, folks&#41;.<br /><br />The application will use as little 3rd party code as possible &#40;Wpf Toolkit, some other goodies&#41; that are all unrelated to MVVM itself.  The software is meant to be deconstructed and torn apart so that anyone who wants to learn MVVM can get the basic ideas of how to implement it, on its own, without using anyone else&#39;s software to do it.<br /><br />Hopefully, this application will inspire others that are hesitant about MVVM to just dive in and get started.  If not, well...it&#39;ll be a useful tool to monitor source control activity, too.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF MVVM,WPF,SVN,Source Control,Git,TFS,",
  "LastEdited": "2012-04-13T00:17:15.93-07:00"
}