{
  "ProjectName": "speasybranding",
  "Title": "SPEasyBranding (Hands-Free SharePoint Branding)",
  "Description": "A SharePoint solution that makes Branding SharePoint sites as easy as 1-2-3.  SPEasyBranding provides two features that allow the injection of CSS and JavaScript files into the DOM using either a web part (for updating a single page) or master page delegate.  CSS and JS files are added to the page head always (even when using the single page web part feature).  This way it overrides the built in SharePoint CSS styles.  The solution is compatible with all SharePoint versions since WSS 3.0, including MOSS 2007, Foundation 2010, and SharePoint 2010.  Just enter the URLs of the CSS and JS files in text fields and they are added in the right place.  No need to use SharePoint Designer or Visual Studio.  Just create a CSS or JS file (notepad?), upload to a SharePoint Library, and then add the URL to the custom site settings page or web part property (depending on what feature is activated, and how you are using it).  That's it!",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\r\nA SharePoint solution that makes Branding SharePoint sites as easy as 1-2-3.  SPEasyBranding provides two features that allow the injection of CSS and JavaScript files into the DOM using either a web part &#40;for updating a single page&#41; or master page delegate.  CSS and JS files are added to the page head always &#40;even when using the single page web part feature&#41;.  This way it overrides the built in SharePoint CSS styles.  The solution is compatible with all SharePoint versions since WSS 3.0, including MOSS 2007, Foundation 2010, and SharePoint 2010.  Just enter the URLs of the CSS and JS files in text fields and they are added in the right place.  No need to use SharePoint Designer or Visual Studio.  Just create a CSS or JS file &#40;notepad&#63;&#41;, upload to a SharePoint Library, and then add the URL to the custom site settings page or web part property &#40;depending on what feature is activated, and how you are using it&#41;.  That&#39;s it&#33;<br />\n<h2>Instructions</h2>\r\nDownload the WSP and add the solution to SharePoint.  Compatible with WSS 3.0, SharePoint 2007, Foundation 2010, and SharePoint 2010.  Adds 2 features to your Site when deployed.  The Global Feature adds the specified CSS and JavaScript files to the Master Page&#39;s HEAD section.  CSS and JavaScript files can be entered using a custom settings page found in the Site&#39;s Site Settings page (_layouts/settings.aspx), located in the Site Collection Settings section.  The WebPart Feature adds a web part that can be added to any Web Part page.  The web part properties provides a custom settings section that also allows specific CSS and JavaScript files to be added.<br /><br />File URLs should be entered in the provide text fields (simple but effective).  The URLs should be either relative to the SharePoint root site, or be absolute.  Multiple URLs can be added, include a vert-pipe character to delimit them (|).  URLs are added to the page in the order they are entered in the text fields.<br /><br />Example URLs:\n<ul><li>/_layouts/folder/file.css</li>\n<li>~/_layouts/folder/file.css</li>\n<li>_layouts/folder/file.css</li>\n<li>http://server/_layouts/folder/file.css).  </li></ul>\n<br />Built in Visual Studio 2008 using WSPBuilder, so its forward compatible with current and past SharePoint versions.<br />\n<h2>Examples:</h2>\r\n<img src=\"/projects/speasybranding/aa9ea6a3-3825-4751-81f0-f41325dccee6\" alt=\"SNAG-000557.png\" title=\"SNAG-000557.png\" /><br /><i>Custom Settings Page</i><br /><br /><img src=\"/projects/speasybranding/95ab3b40-a28c-43cd-86f9-c892496b3ce4\" alt=\"SNAG-000558.png\" title=\"SNAG-000558.png\" /><br /><i>Web Part Properties</i><br /><br /><b>A product by Ben Steinhauser, brought to you by B&amp;R Business Solutions.</b></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-02-01T11:55:40.743-08:00"
}