{
  "ProjectName": "spsin",
  "Title": "SP SIN",
  "Description": "SP SIN (from SharePoint Script/Style INjector) solves an age-old problem for developers and administrators; how to add script and style sheet resources to Share",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>SP SIN Overview</h1>\r\n<b>Please Note</b> <a href=\"https://spsin.codeplex.com/releases/view/96351\">SP SIN 1.2</a> now available. Please update. (I recommend a reinstall if you&#39;re not using this in production, but upgradesolution should work)<br /><br /><div class=\"video\" style=\"text-align:Center\"><span class=\"player\"><object height=\"400px\" width=\"600px\"><param name=\"movie\" value=\"http://www.youtube.com/v/waOSARrJ10E\"></param><param name=\"wmode\" value=\"transparent\"></param><embed height=\"400px\" width=\"600px\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" src=\"http://www.youtube.com/v/waOSARrJ10E\" /></object></span><br /><span class=\"external\"><a href=\"http://www.youtube.com/watch?v=waOSARrJ10E\" target=\"_blank\">Launch in another window</a></span></div><br /><br /><br /><b>SP SIN</b> (from <b>S</b>hare<b>P</b>oint <b>S</b>cript/<b>S</b>tyle <b>IN</b>jector) solves an age-old problem for developers and administrators, how to add script and style sheet resources to SharePoint without modifying master pages. <br /><br />This problem is more complex than it seems because SharePoint allows and encourages changes to systems that are in production. How can you ensure that the changes you make work before deploying them to all users? How can you create versions of script and style sheet resources so that you can maintain backwards compatibility with previous solutions?<br /><br /><b>SP SIN</b> solves these problems by allowing site owners, or those granted permissions, to inject script or style sheet resources into pages without touching any of the pages. All of this is accomplished using SharePoint best practices and recommended approaches only. <br /><br />In addition, <b>SP SIN</b> has an innovative plug-in model that allows developers to extend the default functionality to build injection capabilities tailored to specific situations or broad consumption. <br />\n<h2>Functionality</h2>\r<b>SP SIN</b> provides the following features:\n<ul><li>Safely inject scripts or style resources into any SharePoint page, from any external or internal URL</li>\n<li>Filter injection on specific URL patterns so you deploy resources only where you need them</li>\n<li>Show specific resources only to specific people or groups</li>\n<li>Plug-in model based on SharePoint content types allow extensibility beyond out-of-the-box capabilities</li></ul>\n<br />Management of <b>SP SIN</b> is done through SharePoint lists by site administrators, owners, or anyone granted permissions. If you can add items to a SharePoint list, you know all you need to know about managing <b>SP SIN</b>.<br /><br /><b>SP SIN</b> also supports creating configuration packages to make management even easier. For example, you can have packages that deploy the latest jQuery script version to all pages in a site, or that deploy KnockOut, Modernizr, SPServices, and jQuery only to certain pages in certain libraries. <br />\n<h2>How It works</h2>\r<b>SP SIN</b> uses a feature of SharePoint called Delegate Controls, which allow injection of functionality on any out-of-the-box page. The <b>SP SIN</b> delegate control reads configuration from a SharePoint list and determines whether to inject a script for the current page. <br /><br />This configuration list, available from the Site Settings page, uses SharePoint content types to create multiple types of injection capabilities, called resource types. Out-of-the-box, there are two such resource types; script injection, and style sheet injection, optionally filtered by URL.<br /><br />You can also download additional resource types from this page, for example to add Google Analytics tracking to SharePoint.<br /><br />Because SP SIN works using SharePoint technologies and best practices, it is also possible for third-party developers to provide configuration packages that will automatically add script and style sheet setup as part of their solution delivery. Sample packages provided with <b>SP SIN</b> include:\n<ul><li>Latest jQuery script from code.jquery.com CDN on all pages</li>\n<li>jQuery 1.8.2 and SPServices 0.7.2 from cdnjs.com CDN on all pages</li></ul>\n\n<h2>Setup and Installation</h2>\r<i>TIP: Hand these instructions over to your SharePoint administrator if you&#39;ve never deployed a farm solution before.</i><br />To install <b>SP SIN</b>, run the following command in STSADM:<br />c:\\&gt;stsadm -o addsolution -filename <a href=\"https://spsin.codeplex.com/wikipage?title=path%20to%20downloaded%20WSP&referringTitle=Home\">path to downloaded WSP</a>\\spsin.wsp<br /><br />Then, deploy the solution either through STSADM (or PowerShell) or Central Administration. <br /><br />After installation, you can activate <b>SP SIN</b> on any site from Site Settings-&gt;Site Features. Activate the <b>SP SIN</b> Setup feature to set everything up. <br /><br />Please note that <b>SP SIN</b> will install site collection scoped content types, requiring site collection administrator privileges. <br />\n<h2>Using SP SIN</h2>\rYou can set up <b>SP SIN</b> resources from the Site Settings page, either manually through the Manage Resources link or through one of the pre-made configuration packages. <br /><br />To add a configuration package, click the Configuration Packages link on the Site Settings page, find the package you want to install, and click the button for the package you want to install, as shown below.<br /><img src=\"http://spsin.com/wp-content/uploads/2012/09/ConfigPackages.png\" /><br /><br />This will add the required entries in the resources list.<br /><br />You can also manually add, edit, or delete resource entries from the resources list. Follow the link to Manage Resources from the Site Settings page. <br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "SharePoint,SPSIN,",
  "LastEdited": "2012-10-16T02:46:03.287-07:00"
}