{
  "ProjectName": "spuikit",
  "Title": "SharePoint UI Kit",
  "Description": "UI Took kit to help developers for building public facing sites with SharePoint and to reduce task repetition. Includes a complete Visual Studio project with a CSS grid system, SP ready UI widgets, custom master pages and SharePoint custom page layouts and item styles.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>-------------------------------------------------------------------------------------------------------------------------</p>\r\n<p><strong>Important Note</strong></p>\r\n<p>THIS PROJECT IS STILL UNDER DEVELOPMENT</p>\r\n<p>-------------------------------------------------------------------------------------------------------------------------</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Project Description</strong></p>\r\n<p>UI Took kit to help developers for building public facing sites with SharePoint and to reduce task repetition. Includes a complete Visual Studio project with a CSS grid system, SP ready UI widgets, custom master pages and SharePoint custom page layouts and\r\n item styles.<br>\r\n<br>\r\n<br>\r\nThe use of SharePoint for public facing sites is a rapidly growing phenomenon. Specially with the arrival of SharePoint 2010 and it's rich features targeted for web content management companies all around the globe are now using SharePoint for managing there\r\n online public presence.</p>\r\n<p>For developing a custom branding solution, though there are many resources available, there is no solid platform for developers to get started. Complexity of building a properly planned and portable branding solution for SharePoint, has made developers repeating\r\n the same tasks for each and every SP branding project. Additionally there is a big learning curve involved before starting to plan for a public facing site with SharePoint.<br>\r\n<br>\r\nThis is a UI tool kit designed to easily get started on building a public facing site with SharePoint 2010 and to reduce task repetition. It also help developers to easily get over common browser and platform compatibility issues and speed up the process of\r\n developing a custom branding solution for SharePoint 2010. While it serves as a launchpad for building a public facing site it also has many commonly used UI widgets (Dropdown menu, Image Gallery, etc) which can be reused and seamlessly integrated with SharePoint\r\n native functionality.</p>\r\n<p>Unlike a normal UI or CSS framework, this includes a fully loaded Visual Studio project with a CSS grid system, client side SP ready UI widgets and elements such as master pages and SP custom page layouts and item styles.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "SharePoint 2010,SharePoint Dev,Branding,User Interface,UI,Sharepoint,",
  "LastEdited": "2011-07-19T00:40:10.42-07:00"
}