{
  "ProjectName": "SQLSrvAnalysisSrvcs",
  "Title": "Microsoft SQL Server Community Samples: Analysis Services",
  "Description": "This project contains SQL Server Analysis Services samples contributed by Microsoft outside of the regular release cycle, MVPs, and other members of the community.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Microsoft SQL Server Community Samples:  Analysis Services</h1>\rThis project contains SQL Server Analysis Services samples contributed by Microsoft, as well as samples created by MVPs and other members of the community.<br /><br />If you would like to create new Analysis Services samples or make contributions to samples already posted, please contact the Project Admin. <br />\n<h1>Samples on this site:</h1>\rClick the Downloads tab to obtain the source code for the following projects. Click the Documentation tab for a detailed list of the projects, including the version of SQL Server that is required, requirements, and when the project was last updated:<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/57510\">Activity Viewer</a><br />Provides functionality for SSAS similar to the SQL Server stored procedure sp_who and the kill command in Transact-SQL. Displays users, connections, and processes for an instance of Microsoft SQL Server Analysis Services. Use the tool to retrieve a list of these items and, if you want to, to stop a process. <br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/57511\">Aggregation Manager</a><br />Lets you view, design, edit, and add aggregations based on the information collected in the query log.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/57512\">ASCMD Stress testing Scripts</a><br />Enables a database administrator to execute an XMLA script, Multidimensional Expressions (MDX) query, or Data Mining Extensions (DMX) statement against an instance of Microsoft SQL Server Analysis Services, using the ASCMD command-line utility.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/57513\">AS Load Simulation</a><br />Describes how to perform performance analysis on SQL Server 2005, and provides code and scripts for configuring and running load tests.  See <a href=\"http://www.beeii.com/?p=466\">AS Load Sim Project</a> page.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/57514\">AS Query Generator</a><br />Describes how to perform performance analysis on SQL Server 2005, and provides code for configuring and running load tests. See <a href=\"http://www.beeii.com/?p=466\">AS Query Project</a> page.<br /><br /><a href=\"https://sqlsrvanalysissrvcs.codeplex.com/downloads/get/382236\">ASTrace2008</a><br />Creates a utility that runs as a Windows service, connecting to Analysis Services 2008 and 2008 R2 and logging trace events into a SQL Server table using the SQL Server Profiler format.<br /><br /><a href=\"https://sqlsrvanalysissrvcs.codeplex.com/downloads/get/382236\">ASTrace2012</a><br />Creates a utility that runs as a Windows service, connecting to Analysis Services 2012 and logging trace events into a SQL Server table using the SQL Server Profiler format.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/57516\">Analysis Services Upgrade Verification Tool (ASUV)</a><br />Helps you verify that your upgrade from SQL Server 2000 to SQL Server 2005 was successful.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/57517\">Compress Many to Many</a><br />Creates a utility that helps you implements many-to-many compression techniques explained in the Query Performance Optimization Techniques white paper. May be useful in cubes that have many to many relationships, resulting in poor query performance.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/57518\">Create Processing Log</a><br />Provides scripts that create and delete a system-wide processing log file.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/57519\">Load Test Reports</a><br />Provides Reporting Services reports that display the results of the load tests generated by the solutions, AS Load Simulator and AS Query Generator.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/57520\">Monitoring SSAS</a><br />Includes scripts (T-SQL, CMD and XMLA) and Integration Services packages for collecting various kinds of information about an Analysis Services server.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/57522\">RSS Style Sheet</a><br />Contains formatting definitions that can be applied to solutions such as Monitoring SSAS, to dynamically change the color of a counter when the value changes, etc.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/60119\">SSIS Package for Collecting SSAS DMV Data</a><br />Provides scripts for use in an SSIS package that uses DMVs to extract information about an instance of Analysis Services and write the information to a data collection server.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/60120\">SSAS Monitoring Scripts for Management Data Warehouse</a><br />Provides just the scripts from the solution Monitoring SSAS that start and stop collection of data about an Analysis Services server.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/84147\">SSAS Helper</a><br />Provides two code projects, one that creates an SSAS database using an MSBuild task, and one that creates a library with functions to work with AMO objects in Visual Studio 2008.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/downloads/get/163669\">ResMon</a><br />Includes XMLA scripts that create a cube used for storing SSAS monitoring information. You can use the cube for analysis or to build dashboards.  See <a href=\"http://sqlsrvanalysissrvcs.codeplex.com/wikipage?title=ResMon%20Cube%20Documentation&amp;referringTitle=Home\">ResMon Documentation</a> page.<br /><br /><br />\n<h2>Additional related samples:</h2>\r\nThe following samples are not included on the Downloads page but are available on CodePlex and are useful for managing Analysis Services.<br /><br /><a href=\"http://sqlsrvanalysissrvcs.codeplex.com/wikipage?title=Analysis%20Services%20Load%20Balancing&amp;referringTitle=Home\">Analysis Services Load Balancing (ASLB)</a><br /><br />BI System Monitor<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "SQL,MS SQL Server,SQL Server,Analysis Services,Test ,Business Logic,Samples,SSAS,Style,olap,BI,Tools,Monitoring,Performance,",
  "LastEdited": "2013-06-26T22:57:39.003-07:00"
}