{
  "ProjectName": "SwissChessWinPredict",
  "Title": "SWISS CHESS TOURNAMENT WINNER PREDICTION SIMULATOR (SCTWPS)",
  "Description": "*SWISS CHESS TOURNAMENT WINNER PREDICTION SIMULATOR (SCTWPS)*\r\nProgram estimates the probability of a given chess player winning a Swiss-style chess tournament.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Swiss Chess Tournament Winner Simulator</b><br />&#42;SWISS CHESS TOURNAMENT WINNER PREDICTION SIMULATOR &#40;SCTWPS&#41;&#42;<br />Program estimates the probability of a given chess player winning a Swiss-style chess tournament.<br /><br />This program estimates the probability of a given chess player winning a Swiss-style chess tournament using Monte Carlo simulation.  The user should be familiar with statistics such as the mean and standard deviation.<br /><br />The program requires from the user the following inputs: <br />--The mean Elo and the standard deviation of all the chess players in the tournament.<br />--The Player Elo = the Elo of the chosen chess player under consideration to win the tournament.<br />--The total number of chess players in the tournament<br />--The number of games to be played by each player<br />--The number of iterations that the chess simulator will run.<br /><br />The program takes from a few seconds to several hours to run, depending on the parameters chosen (bigger nos. = longer time).  The user can abort the program anytime, by closing the window.  A progress bar shows percent completion.<br /><br />The program outputs its main results to the screen, and optionally more data to a small text file (limited to typically ~130 kb).  The results tell how often the chosen chess player wins first place, and how the other players fare.<br /><br />The program makes no changes to a user&#39;s machine, nevertheless, the user should take care to download this program from a reputable source, such as CodePlex.com and run it through a virus checker and/or in a sandbox environment.</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,console,",
  "LastEdited": "2012-11-15T14:29:40.273-08:00"
}