{
  "ProjectName": "transitionals",
  "Title": "Transitionals",
  "Description": "Transitionals is a framework for building and using WPF transitions which provide an easy way to switch between UI views in a rich and animated way. Think of transitions for applications in the same way you think of transitions for video editing. Wipe, Cut, Dissolve, Star, Blinds and 3D Rotating Cube are all examples of transitions supported by the Transitionals framework.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><i>Please note that Transitionals does not currently have any active contributors. You are still free to download the binaries or source and use it in your own projects; in fact Transitionals is stable and has been used in several commercial software packages. But please be aware there isn&#39;t anyone currently monitoring the discussion groups or resolving issues.</i><br /><br /><i>If you would like to volunteer to be a contributor, please see the notes below.</i><br /><br />\n<h3>1.2 Has Been Released!</h3>\rRead all about it on the <a href=\"http://www.codeplex.com/transitionals/Release/ProjectReleases.aspx\">releases tab</a>.<br />\n<h3>About Transitionals</h3>\rTransitionals is a framework for building and using WPF transitions which provide an easy way to switch between UI views in a rich and animated way. Think of transitions for applications in the same way you think of transitions for video editing. <a href=\"http://en.wikipedia.org/wiki/Wipe_%28transition%29\">Wipe</a>, <a href=\"http://en.wikipedia.org/wiki/Cut_%28film%29\">Cut</a>, <a href=\"http://en.wikipedia.org/wiki/Dissolve_%28film%29\">Dissolve</a>, Star, Blinds and 3D Rotating Cube are all examples of transitions supported by the Transitionals framework.<br /><br />The best way to get started with the Transitionals framework is to download and take a look at the TransitionalsHelp file. You can find it on the <a href=\"http://www.codeplex.com/transitionals/Release/ProjectReleases.aspx\">Releases</a> tab and it includes a pretty comprehensive <i>Getting Started</i> guide. You can also download the binary archive which includes two sample projects. Transitionals is compiled in Visual Studio 2008 against .Net Framework 3.5.<br /><br />Transitionals brings a portion of the <a href=\"http://windowsclient.net/Acropolis\">Microsoft Acropolis</a> research project to the community and continues that development. THANK YOU to the Acropolis team for making this project possible. <br /><br />If you&#39;re curious what it&#39;s been like to bring this code to the public, or if you&#39;d like to read a development log on Transitionals, check out <a href=\"http://blogs.msdn.com/jbienz/archive/tags/Transitionals/default.aspx\">Jared Bienz&#39;s blog</a>.<br />\n<h2>Contributing to Transitionals</h2>\rWe welcome contributions from the community. Here are a few ways you can help:<br />\n<ul><li>Submit bug reports to the <a href=\"http://www.codeplex.com/transitionals/WorkItem/List.aspx\">Issue Tracker</a></li>\n<li>Submit feature requests to the <a href=\"http://www.codeplex.com/transitionals/WorkItem/List.aspx\">Issue Tracker</a></li>\n<li>Volunteer to fix a bug or implement a feature &lt;- Highly recommended :)</li>\n<li>If you would like to submit a bug fix or feature but aren&#39;t an ongoing contributor, please: </li>\n<li>Zip up your code and post them as an attachment to the work item.</li>\n<li>Follow the <a href=\"https://transitionals.codeplex.com/wikipage?title=Assignment%20Agreement%20Instructions&referringTitle=Home\">Assignment Agreement Instructions</a> to become a code contributor (only needs to be done once, not for every submission).</li></ul>\n<br /><b>Please Note:</b> By posting your submission to the Issue Tracker, you agree to do so under the <a href=\"http://www.codeplex.com/Legal/terms.aspx\">CodePlex TOU</a>.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,Animation,Transition,Acropolis,MyList,Transitionals ,Microsoft,MyList.WPF,.NET Samples,Useful,Cool WPF Effects,",
  "LastEdited": "2011-05-25T07:40:49.153-07:00"
}