{
  "ProjectName": "treemaps",
  "Title": "WPF Treemaps & SquarifiedTreeMaps control",
  "Description": "A WPF implementation of a bindable Treemaps control.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rA WPF implementation of a bindable Treemaps control.<br /><br />The algorythmn is inspirated from a <a href=\"http://www.win.tue.nl/~vanwijk/stm.pdf\">document</a> published by Mark Bruls, Kees Huizing and Jarke J. vanWijk.<br /><br />The goal is to display items with size relatives to a numeric value : the weight ( folder size, country sales, etc).<br />Applying this visualization to a disk, for example (folder/ file size) , allow you to see directly where the space is used ( see <a href=\"https://treemaps.codeplex.com/wikipage?title=samples&referringTitle=Home\">samples</a>).<br /><br />The important point is that this controls inherits from ItemsControls and use the ItemsSource property to render the elements. It means that the control is <b>bindable, stylable, templatable</b>...<br /><br />The layout logic is implemented in a <a href=\"https://treemaps.codeplex.com/wikipage?title=Panels&referringTitle=Home\">TreeMapsPanel</a> and a <a href=\"https://treemaps.codeplex.com/wikipage?title=Panels&referringTitle=Home\">SquarifiedTreeMapsPanel</a>. Theses panels can be used independently from the <a href=\"https://treemaps.codeplex.com/wikipage?title=TreeMaps&referringTitle=Home\">TreeMaps</a> control.<br /><br />Some <a href=\"https://treemaps.codeplex.com/wikipage?title=samples&referringTitle=Home\">samples</a> are available in the release.<br />\n<h1>TODO</h1>\r\n<ul><li>Currently the TreeMaps control have a property that indicate the datasource property to bind the Weight from the datasource. This is not a good solution because it means that all the data must have the same property. It would be better to indicates this binding in the datatemplate... But at this point i didn&#39;t find the solution. When I create my own class that inherit from HierarchicalDataTemplate, i can&#39;t use my own property in Xaml ( got an Error 69 when compiling )</li></ul>\n<br /><b>Your feedback is wellcome...</b><br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,WPF,xaml,UI Controls,control,GUI,Data Visualization,Avalon,treemap,squarified,treemaps,Controls,WPF Controls,",
  "LastEdited": "2007-11-10T07:33:13.51-08:00"
}