{
  "ProjectName": "ultrardc",
  "Title": "UltraRDC",
  "Description": "For those of you like me that spend much of your day with multiple remote desktop windows open to various machines, I've developed a Visual Studio-style tabbed interface for RDC, complete with dockable and autohidable favorites and history panels.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>This project is no longer maintained, please go to <a href=\"https://github.com/lstratman/EasyConnect\">my GitHub</a> for the new version of this project, which aims for a minimalist, Chrome-like UI</h2>\r\n<br /><img src=\"/projects/ultrardc/dd87ca0c-dfae-40ba-9679-f13f7bbab363\" alt=\"screenshot1.jpg\" title=\"screenshot1.jpg\" /> <img src=\"/projects/ultrardc/7d7c36ef-ead5-41a6-9414-64525276e94a\" alt=\"screenshot2.jpg\" title=\"screenshot2.jpg\" /> <img src=\"/projects/ultrardc/9348ff7d-cb43-4945-92fe-c128d942896b\" alt=\"screenshot3.jpg\" title=\"screenshot3.jpg\" /> <img src=\"/projects/ultrardc/acaf3463-fce1-4dc7-8b62-015cd482a33f\" alt=\"screenshot4.jpg\" title=\"screenshot4.jpg\" /><br /><br />If you&#39;re like me, you spend a lot of your day with a multitude of terminal services windows open to the machines that you&#39;re setting up, fixing, etc.  There are a few apps out there geared towards managing these windows and connections but, at least to me, they tried to do too much.  I really needed something to just display my windows in a tabbed interface and, other than that, stay out of my way.  With the help of Weifen Luo&#39;s excellent <a href=\"http://sourceforge.net/projects/dockpanelsuite/\">DockPanel Suite</a>, I was able to apply a Visual Studio look and feel to this program, with tabs for each terminal services window and an auto-hiding pane for favorites and history.  Windows 7 features including support for tabbed thumbnails, Aero peek, and jump lists are also supported.<br /><br />If there&#39;s a particular feature that you&#39;d like to see, don&#39;t hesitate to let me know.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-03-14T12:30:18.473-07:00"
}