{
  "ProjectName": "wpfpaint",
  "Title": "WPF Graphic Editor Sample",
  "Description": "Sample WPF app you can use as template for vector graphic editor. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>WPF Graphic Editor Sample</h1>\r<b>EN</b><br />It`s a sample WPF app you can use as template for vector graphic editor.<br /><img src=\"http://download-codeplex.sec.s-msft.com/Download?ProjectName=wpfpaint&amp;DownloadId=1004774\" />\n<hr />\n<b>RU</b><br />Это приложение выполнялось как тестовое задание на одну должность.  Не стоит рассматривать его как пособие по использованию техник WPF, это мое первое WPF-приложение. На него было потрачено 60 часов разработки, включая 8 часов на превоначальное изучение WPF.<br /><br />Текст задания был следующим:<br /><b>C# &amp; WPF Test Task Hard</b>\n<ol><li>С помощью библиотеки WPF 4.0 и выше сделать графический векторный редактор.</li>\n<li>Приложение должно представлять собой единственное окно, на котором в левой части расположены инструменты для создания, удаления, настройки примитивов, а в правой — рабочая область.</li>\n<li>Редактор работает с примитивами: прямоугольник и линия с изломами</li>\n<li>Пользователь может создавать и удалять примитивы, перемещать их по рабочей области.</li>\n<li>Для прямоугольника разрешается изменять размеры и угол поворота.</li>\n<li>Разрешить настройку заливки прямоугольника: сплошной или 2-х цветной градиентной.</li>\n<li>Для линии — перемещать концы и изломы. Двойной щелчок по линии создает излом, перемещение излома на соседний излом удаляет его. </li>\n<li>Для линии настраивается ширина и цвет.</li>\n<li>Разрешить выделение нескольких примитивов с помощью прямоугольника выделения, появляющемся при нажатии Shift, клике и перемещении мыши.</li>\n<li>Если выделены несколько объектов, то инструменты для настройки примитивов следует заблокировать.</li>\n<li>Перемещение одного из выделенных объектов приводит к перемещению остальных.</li>\n<li>Разрешить перемещать рабочую область при клике по свободному месту и перемещении мыши.</li>\n<li>Сохранение рабочей области в файл и загрузка из файла.</li></ol>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,Vector,Graphic Editor,graphic,",
  "LastEdited": "2014-12-16T18:48:39.283-08:00"
}