{
  "ProjectName": "wpfservicehost",
  "Title": "WPF ServiceHost Templates",
  "Description": "This project includes two Visual Studio 2008 templates to kick-start hosting WCF services in a WPF application, in addition to webcasts describing how to use them.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This project includes two Visual Studio 2008 templates to kick-start hosting WCF services in a WPF application, in addition to webcasts describing how to use them.<br /><br /><b>WPF ServiceHost Application Template</b><br />This Visual Studio 2008 template creates a new solution with two projects: a sample WPF client configured to host a sample WCF service, and a Console client to test calling the WPF-hosted service. The accompanying webcast walks you through the installation and explains the features provided by the generated solution. <br />\n<ul><li>Download the code here: <a href=\"http://wpfservicehost.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=28386#DownloadId=70750\">WPF ServiceHost Application Template</a></li>\n<li>Download the supporting video here: <a href=\"http://wcfguidanceforwpf.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=28192#DownloadId=70912\">Hosting Services in WPF Clients</a></li></ul>\n<br /><b>WPF Publish and Subscribe Application Template</b><br />This Visual Studio 2008 template creates a new solution with a WCF application service that publishes events to a WPF client application that subscribes to those events. The WPF client also hosts a WCF subscriber service. The accompanying webcast walks you through the installation and explains the features provided by the generated solution. <br />\n<ul><li>Download the code here: <a href=\"http://wpfservicehost.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=28503#DownloadId=71054\">WPF Publish and Subscribe Application Template</a></li>\n<li>Download the supporting video here: <a href=\"http://wpfservicehost.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=28503#DownloadId=71274\">WPF Publish and Subscribe Application Template</a></li></ul>\n<br /><b>Related Projects</b><br />You can also go to the CodePlex site <a href=\"http://wcfguidanceforwpf.codeplex.com\">http://wcfguidanceforwpf.codeplex.com</a> to find a related whitepaper, code samples and a mini webcast series providing WCF guidance to WPF developers.<br /><br /><b>Contact Info</b><br />Please try to use the discussion board for this project for any project-related questions and feedback. If you have a question not project-related you can email me, Michele Leroux Bustamante, at <a href=\"mailto:mlb@dasblonde.net\">mlb@dasblonde.net</a><br /><br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-08-11T14:01:24.26-07:00"
}