{
  "ProjectName": "wpfsheet",
  "Title": "WPF modular spreadsheet",
  "Description": "The WPF modular spreadsheet is cloning the core features of Excel spreadsheet in WPF, with several extensions added (docking, functions add-in, table search)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>WPF modular spreadsheet</strong><br>\r\n<br>\r\nWPF modular spreadsheet is a WPF clone of the core features of Excel spreadsheet. It does not have Macros, Solver, and its graph capabilities are disabled yet, although existing in the code.<br>\r\nThe WPF modular spreadsheet has been made more extensible than its original cloned software in several ways:<br>\r\n<br>\r\n1. New spreadsheet functions can be added from external assemblies using the <a href=\"/wikipage?title=AddInFunctions&referringTitle=Home\">\r\nAddInFunctions</a> class attribute.<br>\r\n<br>\r\n2. A docking space has been added in the spreadsheet, so that graphs or any other module view can easily be pinned, reduced, restored and arranged in the document.<br>\r\n<br>\r\n3. It is possible to register, login and logout to access to server-based services (those services are not yet provided in the source code).<br>\r\n<br>\r\n4. A &ldquo;table-based&rdquo; search is made possible in the spreadsheet; tables created in the spreadsheets are dynamically transformed into objects structures that are passed to any modules implementing the IDataModule interface, so that it can fetch data\r\n on a server etc. <br>\r\n<br>\r\nBecause all the spreadhsheet is based on WPF, all sheet objects (Cells, Rows, Colums, Tables etc&hellip;) implement INotifyPropertyChanged, and it is easy to build new graphs dynamically refreshed when the spreadsheet values are updated.\r\n<br>\r\n<br>\r\nAll the source code is open, but it is yet using Devxpress Docking framework, the best on the market. It would be interesting to replace it using AvalonDock in a fork (https://avalondock.codeplex.com/)</p>\r\n<p><img src=\"http://www.klowdi.com/SpreadsheetFront.jpg\" alt=\"Spreadsheet customization features\" width=\"600\" height=\"316\"></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-01-22T03:18:39.487-08:00"
}