{
  "ProjectName": "wpfterminal",
  "Title": "WPF Terminal",
  "Description": "WPF Terminal is a simple terminal-like console. It features command parsing and interactive prompt.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>WPF Terminal</h1>\rA simple terminal-like textbox.<br />\n<h2>Features</h2>\r&gt; Users can only write after the prompt.<br />&gt; Built-in command completion by pressing TAB key, just register your commands.<br />&gt; Pressing Enter key validates the input.<br />&gt; Everything is event-based, so you can interface it easily without changing the code.<br />&gt; Command and arguments are parsed. Arguments can be simple words (anything but a whitespace character) or quoted arguments in order to include spaces.<br />&gt; <b>NEW</b> : Abort request event is raised when the user enters CTRL+C<br />\n<h2>Basic mechanisms</h2>\rActually what I did was to define a lastPromptIndex integer, and everytime a user presses the ENTER key and a new prompt appears, this value is updated.<br />After that, it&#39;s simple, you just need to process any text input before the textbox validates the input. If the textbox caret was located before your lastPromptIndex, you need to raise an error (usually a beep sound) and you must invalidate the text input, so nothing is written in the textbox. I also automatically set the caret position to the end of the textbox, so the user can immediatly input some text.<br />\n<h2>Call to developers</h2>\rI do not have much time for this project, and only update it when I need a special feature in my other projects that use this terminal. As a result, do not hesitate to tell me your feature suggestions, and also to share your modifications !<br />\n<h2>Screenshot</h2>\rNote that I applied a gray background and a white foreground to the textbox. It can be done easily since it is just a normal textbox.<br /><br /><img src=\"/projects/wpfterminal/ed3edb07-a84a-4065-850f-5593041fc657\" alt=\"terminal.jpg\" title=\"terminal.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "wpf,terminal,textbox,console,",
  "LastEdited": "2010-10-29T07:18:19.5-07:00"
}