{
  "ProjectName": "XamlHelpmeet",
  "Title": "Xaml Helpmeet",
  "Description": "Xaml Helpmeet is a Visual Studio 2012 extension with powerful tools to help developers write Xaml code.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project News <img src=\"/projects/XamlHelpmeet/5fa9c988-e238-4a78-9279-03f9899ad9d4\" alt=\"New\" title=\"New\" /></h2>\r\nIt has been a while since the last time I updated this project, but I have time now to renew my efforts with it, and hope to finish the beta phase of the project soon. There will be at least one more beta version. Version 0.8 will address several major issues, and include several large changes in the operation of the extension.<br /><br />Now is the time, if you have suggestions for the final project, to make them known. I am not planning on adding any new features, but if the suggestion includes an improvement of process or work flow for any of the existing features, your suggestions will be considered, and appreciated.<br /><br />I also plan to merge the 2013 version into this project as well as any newer versions, so that all can be maintained in the same place.<br /><br />Keep an eye out here for the next beta release, and download it when it is available. I think you will be pleased.<br />\n<h2>Project Description</h2>\r\n<i>Xaml Helpmeet</i> (XHM) is an extension to Visual Studio 2012 designed to help developers create and edit xaml documents. I derived the code by translating <a href=\"http://karlshifflett.wordpress.com/xaml-power-toys/\">XAML Power Toys 2010</a> by Karl Shifflett, originally written in VB, into C#. I did this by hand in order to learn how to write Visual Studio extensions, but also that I might have something I could  maintain and upgrade easily going forward. Mr. Shifflett graciously granted permission for this project, asking only that the name given to my version not be derived from the original name. By giving this branch a new and distinct name, Mr. Shifflett will  be able to continue support for his product without his being confused with this.<br /><br />The first version of <i>Xaml Helpmeet</i> will mostly look and function the same as its predecessor. If you have used it previously, you will see little difference between the two, except that the former has been released only for Visual Studio 2008 and 2010. XHM is designed for VS 2012. At this point the main differences (other than the coding language) are limited changing in some of the logic of the program. Some of the classes have been refactored significantly to reduce some redundant code, and a change  has been made in the packaging, using a VSIX package instead of a Windows Installer package.<br /><br />In future versions I plan to redesign some of the processes to make it a little easier to use. For example where possible I want to turn some processes into wizards in order to allow users to back up to a previous point in a process rather than force users to start a process over to correct a mistake. It would also be nice to provide automatic selection of xaml text, where now it is necessary to select a section of xaml for some of the processes.<br /><br />The first alpha version makes a good start toward releasing a relatively bug free version of the package, but we need your help. There are surely bugs in the software that I will fail to find on my own. We need alpha testers willing to install the package and put it through the paces. And then be sure to report your findings. The issue tracker is the best place to report problems. The discussions forum is the best way to get help. Please give it a whirl and let us know what you find.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Xaml,Visual Studio 2012,C#,WPF,Silverlight,Extension,",
  "LastEdited": "2014-10-01T04:35:03.923-07:00"
}