{
  "ProjectName": "MetroOAuth",
  "Title": "Metro oAuth Utils",
  "Description": "A bunch of libraries that enable functionality in various OAuth secured services (using a common framework) with compatibility for both Win8 Metro/WinRT & WP7.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A bunch of libraries that enable functionality in various OAuth secured services &#40;using a common framework&#41; with compatibility for both Win8 Metro&#47;WinRT &#38; WP7.<br /><br /><br /><b>The Difference</b><br /><br />The biggest difference between this project and others is that the oAuth libraries were built from scratch to be used with Win8 Metro/WinRT and also utilizes the Async CTP to bring compatibility of this code to Windows Phone. It uses specific features of WinRT like the WebAuthenticationBroker to simplify the process of authenticating the user (and simplifying both the libraries&#39; code and your code). <br /><br />Where functionality doesn&#39;t exist in Windows Phone we have created (such as the WebAuthenticationBroker), we created a custom component that instantiates in the exact same manner as the WebAuthenticationBroker (this makes the code in say the Dropbox client library identical in both codebases without the need to resort to use &quot;#if WINDOWS_PHONE&quot;).<br /><br />We use helper classes to do things like Http calls (since the objects are very different in the 2 environments).<br /><br />Our oAuth framework can be used to quickly build up a quick client library for many, many oAuth 1.0 and 2.0 backed services.<br /><br /><b>The Client Libraries</b><br />At this point we have 2 very stable libraries: Dropbox, and EventBrite (currently needs a Win8 project setup). We also have numerous libraries in various states: Twitter (Auth&#39;s and has only a couple methods defined), Yahoo (not working.. HELP US!), Google (barely started unsure of state)<br /><br /><b>CAVEATS FOR WINDOWS PHONE</b><br />You must get the Async CTP3 installed and working in your WP7 dev environment or this won&#39;t work. Not sure if compiled versions of the library would be helpful or not as to create clean code you really need the &quot;async&quot; and &quot;await&quot; keywords.<br /><br /><b>Source ??!!??</b><br />The library structure for this project is a little in disarray (hence the release as archive files of the source code). I do have a public repo for this that if you prefer to get the entire mess (including the Metro/WinRT stuff). You can (temporarily get that stuff here -- <a href=\"https://bitbucket.org/DevTheo/metrodropbox\">https://bitbucket.org/DevTheo/metrodropbox</a> (This repo will probably be going away as I near completion of my Dropbox client.. I haven&#39;t fully decided.. but rest assured I will have the full source cleaned up and here before I do that).</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-07-18T10:43:18.427-07:00"
}