{
  "ProjectName": "shopping",
  "Title": "WINRT \\ Metro Store \\ open marketing solution",
  "Description": "This project is aimed at creating a public shopping cart, that is available to all windows 8 users free. products are screened added by administrators",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nThis project is aimed at creating a public shopping cart, that is available to all windows 8 users for free. Products are screened and added by administrators.<br>\r\n<br>\r\n<strong>User Case</strong><br>\r\nThe user downloads the application from the relevant source, logs in using their live ID.<br>\r\nThe user is presented with a GroupedItemsPage that displays categories for the stores that subscribe to the service.<br>\r\nThe user is able to brows the products available by type<br>\r\nThe user is able to search the products<br>\r\nThe user is able to rate the products<br>\r\nThe user is able to comment on products (after review from administrators)<br>\r\nThe user is able to &ldquo;price watch a product&rdquo;<br>\r\nThe user is presented with &ldquo;bargains&rdquo;<br>\r\nThe user usage data is monitored<br>\r\n<br>\r\n<strong>Administrator Case</strong><br>\r\nThe administrator is able to add a source from an existing shopping cart.(starting with presta shop)<br>\r\nThe administrator is able to choose from products that are store specific<br>\r\nThe administrator has the ability to allow or disallow products.<br>\r\nThe administrator has the ability to allow updates to the server<br>\r\nThe administrator has the ability to add comments or remove comments<br>\r\nThe administrator has the ability to set ranks on the products<br>\r\nThe master administrator has final say on lower administrators <br>\r\nThe administrator can view hot products<br>\r\nThe administrator can set hot products<br>\r\n<br>\r\n<strong>Server Case</strong><br>\r\nThe server will have a list of websites it will pull information from every hour.<br>\r\nThe server will add new products to the database.<br>\r\nThe server will send the approved products upon request to client applications<br>\r\nThe server will have a website that is controlled by both retailers and administrators.<br>\r\nThe server will have application licence built in to prevent DOS attacks.<br>\r\nThe server sends the following information to clients in one transaction soap.<br>\r\nFull list of products:<br>\r\n- item name<br>\r\n- item Classification<br>\r\n- item Cost<br>\r\n- item Rank<br>\r\n- item Details<br>\r\n- item availability<br>\r\n- item availability location<br>\r\n- item estimated shipping cost<br>\r\n- item last updated<br>\r\n- item popularity<br>\r\n- item added on<br>\r\n- item picture url (to be downloaded by client and cached)<br>\r\n- item comment<br>\r\n<br>\r\nThe server accepts the following DATA from client<br>\r\n- item viewed<br>\r\n- item viewed time<br>\r\n- application uptime<br>\r\n- item rank<br>\r\n- item comment<br>\r\n- item error<br>\r\n- item order clicked<br>\r\n- item order clicked time<br>\r\n<br>\r\nI would like to use Microsoft SQL but pricing is to high so mysql will be used. On a linux box, using MONO webservices.\r\n<br>\r\n<br>\r\nClass diagrams and model are under development.<br>\r\nPlease join the discussion tab to give suggestion's and comments. all further information will be hosted there.<br>\r\nThank you Moshe Kaufman <br>\r\nMSCE MCSA MCDBA CCSE CCSA CCA<br>\r\nshopping@on---.org (look at my username)<br>\r\nLooking for a Metro App Developer ? contact me for your app</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-08-25T23:41:53.95-07:00"
}