{
  "ProjectName": "3DMoleculeViewer",
  "Title": "3D Molecule Viewer",
  "Description": "3D Molecule Viewer is a stand-alone, demo version of the C-ME application that InterKnowlogy built for the Scripps Research Institute (TSRI).  It is a WPF application built in C#.  Affectionately called \"The Cancer App\", the full version of this application (a WPF front-end for SharePoint) is running in production and installed all over the world.  As the brain-child of Dr. Peter Kuhn of TSRI, C-ME is just a step in realizing his dream/mission of \"getting his arms around\" cancer to turn it into a managed disease.  \n\nThis stand-alone, source code version of the application does not have the SharePoint dependency and allows you to open sample 3D Protein Database Format (PDB) files directly....spin them in 3D, zoom in on them, display them from different views, etc.  This means you can get the application running quickly and stare at the code.  Just a heads up: although WPF makes 3D dramatically easier, it still is not for the faint of heart.  There is a lot of Trigonometry and Calculus in the code.  And it's really well written - which means its object oriented and consequently abstracted.  \n\nThe problem that C-ME solved (what Dr. Peter Kuhn did not have) was a way to view cancer and SARS molecules in 3D (and 2D) and attach research directly to the 3D (and 2D) surface of the molecules.  Research takes many forms: Office documents, like Word, PDFs, URLs to content all over the world, pictures, and even SharePoint discussions.  Upon \"pinning\" research to the exact spot on the 3D (or 2D) surface of the molecule the research is actually persisted into SharePoint with the 5 coordinates of 3D.  This Rich Client WPF application consumes SharePoint Web Services to pull that off.  This \"new\" application development paradigm solves an interesting problems like a highly graphical and usable 3D client for the desktop and the broad reach of a browser based application (SharePoint) to house the research and handle the collaboration and workflow.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2><b>What is 3D Molecule Viewer?</b> </h2>\r3D Molecule Viewer is a stand-alone, demo version of the C-ME application that InterKnowlogy built for the Scripps Research Institute &#40;TSRI&#41;.  It is a WPF application built in C&#35;.  Affectionately called &#34;The Cancer App&#34;, the full version of this application &#40;a WPF front-end for SharePoint&#41; is running in production and installed all over the world.  As the brain-child of Dr. Peter Kuhn of TSRI, C-ME is just a step in realizing his dream&#47;mission of &#34;getting his arms around&#34; cancer to turn it into a managed disease.  <br /><br />This stand-alone, source code version of the application does not have the SharePoint dependency and allows you to open sample 3D Protein Database Format &#40;PDB&#41; files directly....spin them in 3D, zoom in on them, display them from different views, etc.  This means you can get the application running quickly and stare at the code.  Just a heads up&#58; although WPF makes 3D dramatically easier, it still is not for the faint of heart.  There is a lot of Trigonometry and Calculus in the code.  And it&#39;s really well written - which means its object oriented and consequently abstracted.  <br /><br />The problem that C-ME solved &#40;what Dr. Peter Kuhn did not have&#41; was a way to view cancer and SARS molecules in 3D &#40;and 2D&#41; and attach research directly to the 3D &#40;and 2D&#41; surface of the molecules.  Research takes many forms&#58; Office documents, like Word, PDFs, URLs to content all over the world, pictures, and even SharePoint discussions.  Upon &#34;pinning&#34; research to the exact spot on the 3D &#40;or 2D&#41; surface of the molecule the research is actually persisted into SharePoint with the 5 coordinates of 3D.  This Rich Client WPF application consumes SharePoint Web Services to pull that off.  This &#34;new&#34; application development paradigm solves an interesting problems like a highly graphical and usable 3D client for the desktop and the broad reach of a browser based application &#40;SharePoint&#41; to house the research and handle the collaboration and workflow.<br /><br /><img src=\"/projects/3DMoleculeViewer/1790c614-2a96-415c-92e7-277c6b21feed\" alt=\"CME.jpg\" title=\"CME.jpg\" /><br />\n<h2><b>Quick Links</b> </h2>\r\n<a href=\"http://www.interknowlogy.com/lab/Pages/Network.aspx\">Install 3D Molecule Viewer</a><br /><br />Check out the <a href=\"http://www.microsoft.com/business/success/ViewStory.aspx?StoryID=981c8512-593a-f69e-d5fa-376692313500&amp;AssetID=d4c51354-2d36-dc2c-629b-541d827796c6\">Silverlight app with Technical Case Study and Video</a> on Microsoft.com!<br /><br />Read <a href=\"http://www.interknowlogy.com/lab/3Dcollaborator/Pages/C-ME.aspx\">About C-ME</a> on the InterKnowlogy Site.<br /><br /><a href=\"http://www.interknowlogy.com/Downloads/Scripps/InterKnowlogy%20Scripps%20Research%20Story%20SHORT%20Version.wmv\">Watch &quot;The Cancer Video&quot; (63mbs)</a> - highlighted in the Worldwide Launch of Windows Vista. <br /><br />Check out the <a href=\"http://channel9.msdn.com/ShowPost.aspx?PostID=213957#213957\">Channel 9 Interview</a> with Tim Huckaby of InterKnowlogy &amp; Dr. Peter Kuhn of the Scripps Research Institute.<br /><br />Read the <a href=\"http://www.microsoft.com/business/peopleready/business/operations/casestudy/scripps.mspx\">Business Case Study</a> on Microsoft.com.<br /><br />Read the <a href=\"http://www.plosone.org/doi/pone.0001621\">White Paper</a> on the PLoS One Site.<br /><br />3D Molecule Viewer and C-ME were developed for <a href=\"http://kuhn.scripps.edu\">The Scripps Research Institute</a> by InterKnowlogy. For more information on the project and to see other samples of their work, you can visit <a href=\"http://www.InterKnowlogy.com\">their website.</a><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,WPF 3D,viewer,molecule,SharePoint 2007,Samples,C#,health,Open Source,Vista,chemistry,",
  "LastEdited": "2008-03-24T19:01:57.083-07:00"
}