{
  "ProjectName": "ACLDiff",
  "Title": "ACLDiff",
  "Description": "*English*\r\nACLDiff is a differential access control list (ACL) reporting tool.\r\nIt is designed to show meaningfull ACL changes through a directory tree\r\n(hiarchical report) or between two similar directory trees (comparative report). This tool can be used in console or interactive mode.\r\n\r\n*Français*\r\nACLDiff est un outil d'affichage de rapports différentiels de listes de\r\ncontrôle d'accès (ACL). Il est conçu pour afficher des changements \r\nsignificatifs à travers une structure de répertoires (rapport hiérarchique)\r\nou entre deux structures de répertoires similaires (rapport comparatif). Cet outil peut être utilisé en mode console ou en mode interactif.\r\n\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />&#42;English&#42;<br />ACLDiff is a differential access control list &#40;ACL&#41; reporting tool.<br />It is designed to show meaningfull ACL changes through a directory tree<br />&#40;hiarchical report&#41; or between two similar directory trees &#40;comparative report&#41;. This tool can be used in console or interactive mode.<br /><br />&#42;Fran&#231;ais&#42;<br />ACLDiff est un outil d&#39;affichage de rapports diff&#233;rentiels de listes de<br />contr&#244;le d&#39;acc&#232;s &#40;ACL&#41;. Il est con&#231;u pour afficher des changements <br />significatifs &#224; travers une structure de r&#233;pertoires &#40;rapport hi&#233;rarchique&#41;<br />ou entre deux structures de r&#233;pertoires similaires &#40;rapport comparatif&#41;. Cet outil peut &#234;tre utilis&#233; en mode console ou en mode interactif.<br /><br /><br /><br /><b>ACLDiff in interactive mode</b><br /><br /><img src=\"/projects/ACLDiff/18b338b4-86d9-4f9e-b152-9d446a30894b\" alt=\"Ecran1en.jpg\" title=\"Ecran1en.jpg\" /><br /><br /><img src=\"/projects/ACLDiff/35821ede-dc98-4119-944d-8dda7ff72e34\" alt=\"Ecran1fr.jpg\" title=\"Ecran1fr.jpg\" /><br /><br /><br />ACL Diff was first made about 5 years ago, for a an IT project i&#39;ve been involved in. A part of the project was to settle shared folder for multiple work teams with relatively complex NTFS security issues. At the time, our network administrators didn&#39;t have any really usable security reporting tools so I work on this little vb.Net solution i&#39;ve almost forgotten since. Lately, I came accross a security problem cause by differences between directory structures replicated on multiple sites. It seems that things havent evolved much for our admins and our little utility helped quickly find the ACL differences between servers. I&#39;ve just recompiled it with VB .Net 2010 and Voila... Still working nice... I&#39;ve decided to post it here. If it&#39;s helping us, maybe it could help others. Codeplex did&#39;nt exists five years ago (or I did&#39;nt know about it ?). <br /><br />En passant, l&#39;outil est aussi fonctionnel en fran&#231;ais...<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "ACL,NTFS,Security,reporting,command line,",
  "LastEdited": "2012-05-06T18:05:23.05-07:00"
}