{
  "ProjectName": "aip",
  "Title": "Auto-Input Protection (AIP) for ASP.NET",
  "Description": "AIP is an extensible ASP.NET web control that provides CAPTCHA protection for your blogs, forums, wikis and websites, greatly reducing the likelihood of unwanted form submission from automated spam and hacks.  The control has design-time and templating support for Visual Studio.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><a href=\"#Overview\">Overview</a> | <a href=\"#Examples\">Examples</a> | <a href=\"#Features\">Features</a> | <a href=\"#require\">Requirements</a> | <a href=\"#project\">Project</a> | <a href=\"#usage\">Usage</a> | <a href=\"#appearance\">Appearance</a> | <a href=\"#config\">Configuration</a> | <a href=\"#spam\">About Spam</a> | <a href=\"#resources\">External Resources</a> | <a href=\"#help\">Help and Feedback</a><br /><br /><a href=\"https://aip.codeplex.com/wikipage?title=Wikimap&referringTitle=Home\">&#60;Wikimap&#62;</a><br /><br /><a href=\"https://aip.codeplex.com/wikipage?title=RTW1&referringTitle=Home\">Latest Release Notes for 1.0 RTW</a> | <a href=\"https://aip.codeplex.com/wikipage?title=LatestReleaseNotes&referringTitle=Home\">Latest Release Notes for 2.0 Beta</a><br /><br />Auto-Input Protection is a highly extensible ASP.NET web control that provides CAPTCHA protection for your blogs, forums, wikis and websites, greatly reducing the likelihood of unwanted form submission from automated spam and hacks.<br /><br /><b>Getting Started:</b> Minimal Configuration <i>(NO AUDIO)</i><br /><div class=\"video\" style=\"text-align:Left\"><span class=\"player\"><object type=\"application/x-mplayer2\" height=\"285px\" width=\"320px\" classid=\"CLSID:22D6F312-B0F6-11D0-94AB-0080C74C7E95\" codebase=\"http://activex.microsoft.com/activex/controls/mplayer/en/nsmp2inf.cab#Version=5,1,52,701\"><param name=\"fileName\" value=\"http://davesexton.com/Videos/AIP/AIP-GettingStarted.wmv\"></param><param name=\"autostart\" value=\"false\"></param><embed type=\"application/x-mplayer2\" height=\"285px\" width=\"320px\" src=\"http://davesexton.com/Videos/AIP/AIP-GettingStarted.wmv\" pluginspage=\"http://www.microsoft.com/windows/windowsmedia/download/default.asp\" autoplay=\"false\" autostart=\"false\" /></object></span><br /><span class=\"external\"><a href=\"http://davesexton.com/Videos/AIP/AIP-GettingStarted.wmv\" target=\"_blank\">Launch in another window</a></span></div>\n<h3><a name=\"Overview\"></a>Overview</h3>\rYou can easily add the AIP web control to existing ASP.NET 2.0 and 3.5 websites and use it with minimal configuration.  Check out the video for an example.<br /><br /><b>AIP 2.0 Beta works with Visual Studio 2005, 2008, and Visual Web Developer Express</b>.  The AIP web control provides design-time support in Visual Studio 2005 and 2008.  The installer automatically adds the control to the toolbox and merges the AIP documentation into Visual Studio&#39;s help.<br /><br /><b>AIP works with minimal configuration</b>.  Only an HTTP request handler must be added to your web.config file and you&#39;ll be able to use the control on all of your web pages that require protection.<br /><br /><b>AIP uses a custom validator&#39;s server-side event to test user input</b> so that if user validation fails, <span class=\"codeInline\">Page.IsValid</span> will be false automatically.<br /><br /><b>AIP is fully extensible</b>.  You can define a custom layout template for the control and configure built-in text, image and filter providers to produce random CAPTCHAs in various formats.  You can also create custom providers that generate randomized text, images and filters.<br />\n<h3><a name=\"Examples\"></a>Examples</h3>\rThe following example uses the AIP web control with its default template and the default text and image providers (basic English and line noise, respectively).<br /><br /><a name=\"Figure1\"></a><img src=\"/projects/aip/edcb9cfa-029d-4c15-9e9c-8f766bf693ef\" alt=\"Example-Default.jpg\" title=\"Example-Default.jpg\" /><br /><br />The next example uses a custom data-bound template and various built-in providers.<br /><br /><a name=\"Figure2\"></a><img src=\"/projects/aip/f351bd8f-abe7-4c6a-b359-3f2760b35cc0\" alt=\"Example-Blog.jpg\" title=\"Example-Blog.jpg\" /><br /><br />The final example illustrates a random CAPTCHA that has been generated using built-in text and filter providers, and a custom image provider.  (Note that a randomized cross hatch filter provider is now built-in as of 2.0 Beta.)<br /><br /><a name=\"Figure3\"></a><img src=\"/projects/aip/8795bfd2-27c9-4362-be39-ef6308e9cf99\" alt=\"Example-CrossHatch2.jpg\" title=\"Example-CrossHatch2.jpg\" /><br />\n<h3><a name=\"Features\"></a>Features</h3>\rThe AIP Web Control\n<ul><li>works out-of-the-box with minimal configuration; only the Http Handler must be configured.</li>\n<li>2.0 Beta can be configured to use the ASP.NET cache or session state (useful for web farms).  The web control also works with view state disabled.</li>\n<li>can be used on web form and user control designers in Visual Studio.</li>\n<li>can be edited in template-mode with two placeholder controls; one that provides the location of the CAPTCHA image and another provides the validation textbox.  Literal content and server controls are supported in the template for complete control over its appearance.\n<ul><li><b>Note:</b> 2.0 Beta no longer requires placeholder controls in custom templates.  Instead, you must add an Image control with an ID of <b>Image</b> and a CustomValidator control with an ID of <b>Validator</b>.</li></ul></li>\n<li>uses ASP.NET validation controls.  Check <span class=\"codeInline\">Page.IsValid</span> upon post-back to determine whether validation succeeded.\n<ul><li>You can specify custom error messages for a validation summary.  2.0 Beta also provides properties to set in-line error messages.</li>\n<li>The control in 2.0 Beta exposes a <span class=\"codeInline\">ValidationGroup</span> property that will automatically set the <span class=\"codeInline\">ValidationGroup</span> properties of the validator controls.</li></ul></li></ul>\nThe CAPTCHA text\n<ul><li>can be generated with a custom algorithm.</li>\n<li>can be random, basic English words from the Ogden dictionary, which is built-in to the AIP library.</li>\n<li>can be characters chosen at random from a configurable character set that includes any combination of upper-case and lower-case letters, the number zero, positive digits and pre-defined symbols.\n<ul><li>The default list of characters that are excluded can be modified.</li></ul></li>\n<li>can be case-sensitive for validation.</li>\n<li>has a random length that is configurable with maximum and minimum values.</li>\n<li>has a customizable appearance, providing control over the list of sampled colors and fonts, the size range of characters, and provider-specific attributes that are all configured in the web.config file.</li></ul>\nThe AIP library\n<ul><li>produces random output that can easily be configured to vary greatly in appearance between sites.</li>\n<li>is extensible, using custom ASP.NET 2.0 providers to generate the CAPTCHA text and image, and to apply graphical filters.</li>\n<li>has a text provider that chooses words from the Ogden dictionary.</li>\n<li>has a text provider that chooses random characters.</li>\n<li>has a base bitmap provider that creates a bitmap with text rendered in evenly spaced vertical partitions.</li>\n<li>has a bitmap provider that renders line-noise with vertically-partitioned text.</li>\n<li>has a bitmap provider that renders 1 of 5 random background images with vertically-partitioned text.</li>\n<li>has a filter provider that can render randomized translucent bars, vertically or horizontally, as an overlay.</li></ul>\n<h3><a name=\"require\"></a>Requirements</h3>\rAIP only requires ASP.NET 2.0.<br /><br />Install the Microsoft .NET Framework 2.0, 3.0 or 3.5 to use AIP in your web sites.<br />\n<h3><a name=\"project\"></a>Project</h3>\rThe AIP project was written, and will continue to be written, exclusively in C#.<br /><br />AIP 2.0 Beta was built with C# 3.0 and Visual Studio 2008, but the compiled assembly targets the Microsoft .NET Framework 2.0.<br /><br /><b>Plans</b>\n<ul><li>Globalization</li>\n<li>Community participation in the development of new image filters for CAPTCHA algorithms</li></ul>\n<b>Team</b><br />If you&#39;d like to become a team member, please contact <a href=\"http://davesexton.com/Contact\">Dave Sexton</a>.  As indicated above, anyone that can implement image filters in C# for different/better CAPTCHA algorithms would make a great addition to the team.  Please mention some of your qualifications and your motivation for becoming a team member in your email.<br />\n<h3><a name=\"usage\"></a>Usage</h3>\rAdd the AIP web control to your web forms and an image containing random text will be generated automatically, unique to each request.  Users must enter the text that they see into a textbox before submitting the form.  If a user enters invalid text then <span class=\"codeInline\">Page.IsValid</span> will be false on post-back.  You can use <span class=\"codeInline\">ValidationSummary</span> controls to display errors or set in-line error message properties on the AIP web control.<br /><br />For more information please refer to the <a href=\"https://aip.codeplex.com/wikipage?title=HowDoI&referringTitle=Home\">How Do I</a> wiki.<br />\n<h3><a name=\"appearance\"></a>Appearance</h3>\rThe appearance of the AIP web control may be customized in a designer, declaratively in the HTML page or programmatically in code-behind (or code-beside).<br /><br /><b>2.0 Beta</b><br />The AIP web control is a templated control that supports complete customization of its output.  All that is required is an Image control with an ID of <b>Image</b> and a CustomValidator control with an ID of <b>Validator</b>.<br /><br /><b>1.0 RTW</b><br />The AIP web control is a templated control that supports complete customization of its output using an AIP image placeholder control and an AIP textbox placeholder control, which are used to indicate where the image and textbox controls should be placed, respectively, within your custom HTML template.<br />\n<h3><a name=\"config\"></a>Configuration</h3>\rAIP is configured in your website&#39;s web.config file using ASP.NET 2.0 providers.  One provider generates the text, one renders the image and any number of filter providers may be configured to help randomize the output.  AIP has a basic English text provider and a line-noise bitmap provider configured by default, which makes the web control usable out-of-the-box.  You can create your own text, image and filter provider implementations if you have your own CAPTCHA algorithms that you&#39;d like to use, or just configure the existing filters to customize the default output.<br /><br /><b>Example 1</b><br />This example illustrates the minimum required configuration to use the AIP web control.  Add the <span class=\"codeInline\">httpHandlers</span> registration to your <i>web.config</i> file exactly as it appears here: <br /><br /><pre>\n&lt;configuration&gt;\n  &lt;system.web&gt;\n    &lt;httpHandlers&gt;\n      &lt;add verb=&quot;GET&quot; path=&quot;AIP.ashx&quot;\n               type=&quot;DaveSexton.Web.Controls.AutoInputProtectionRequestHandler, DaveSexton.AutoInputProtection&quot; /&gt;\n    &lt;/httpHandlers&gt;\n  &lt;/system.web&gt;\n&lt;/configuration&gt;\n</pre><br /><b>Note:</b> An <b>AIP.ashx</b> file <i>does not exist</i>.  ASP.NET routes requests to the AIP request handler automatically.<br /><br /><b>Example 2</b><br /><i>Note that this example only applies to AIP 1.0.  Refer to the 2.0 Beta documentation for 2.0 examples.</i><br /><br />Here is an example configuration section for AIP that uses a text provider to generate random characters, the resource-based bitmap provider, the translucent bar overlay filter provider, and also adds a custom filter provider named, <i>crosshatch</i>: <br /><br /><pre>\n&lt;configuration&gt;\n  &lt;configSections&gt;\n    &lt;sectionGroup name=&quot;dsweb&quot;&gt;\n      &lt;section name=&quot;autoInputProtection&quot;\n               type=&quot;DaveSexton.Web.Controls.Configuration.AutoInputProtectionSection, DaveSexton.AutoInputProtection&quot; /&gt;\n    &lt;/sectionGroup&gt;\n  &lt;/configSections&gt;\n  &lt;dsweb&gt;\n    &lt;autoInputProtection defaultTextProvider=&quot;randomtext&quot; defaultBitmapProvider=&quot;resource&quot;&gt;\n      &lt;textProviders&gt;\n        &lt;add name=&quot;randomtext&quot;\n             type=&quot;DaveSexton.Web.Controls.RandomCharactersAutoInputProtectionTextProvider, DaveSexton.AutoInputProtection&quot;\n             colors=&quot;Red,Green,Blue,Brown&quot; fonts=&quot;Times New Roman,Arial,Lucida Sans&quot;\n             minimumFontSize=&quot;20&quot; maximumFontSize=&quot;35&quot; /&gt;\n      &lt;/textProviders&gt;\n      &lt;bitmapProviders&gt;\n        &lt;add name=&quot;resource&quot; \n             type=&quot;DaveSexton.Web.Controls.ResourceAutoInputProtectionBitmapProvider, DaveSexton.AutoInputProtection&quot;\n             minimumCharacterRotationDegrees=&quot;-15&quot; maximumCharacterRotationDegrees=&quot;15&quot; /&gt;\n      &lt;/bitmapProviders&gt;\n      &lt;filters&gt;\n        &lt;add name=&quot;horizontalbars&quot; \n             type=&quot;DaveSexton.Web.Controls.TranslucentBarsOverlayAutoInputProtectionFilterProvider, DaveSexton.AutoInputProtection&quot;\n             colors=&quot;Orange,Yellow,Fuchsia&quot; /&gt;\n        &lt;add name=&quot;crosshatch&quot;\n             type=&quot;CrossHatchAutoInputProtectionFilterProvider&quot; /&gt;\n      &lt;/filters&gt;\n    &lt;/autoInputProtection&gt;\n  &lt;/dsweb&gt;\n  &lt;system.web&gt;\n    &lt;httpHandlers&gt;\n      &lt;add path=&quot;AIP.ashx&quot; verb=&quot;GET&quot;\n           type=&quot;DaveSexton.Web.Controls.AutoInputProtectionRequestHandler, DaveSexton.AutoInputProtection&quot; /&gt;\n    &lt;/httpHandlers&gt;\n  &lt;/system.web&gt;\n&lt;/configuration&gt;\n</pre><br /><a name=\"Figure1\"></a><img src=\"/projects/aip/fcf73406-1e83-47ec-ab67-4bd58ec1677e\" alt=\"Example-CrossHatch1.jpg\" title=\"Example-CrossHatch1.jpg\" /> <img src=\"/projects/aip/fd6dc49e-b060-4aae-9e19-a0acdff50ca4\" alt=\"Example-CrossHatch3.jpg\" title=\"Example-CrossHatch3.jpg\" /> <img src=\"/projects/aip/5f1c79bc-bb2d-4aa3-a87a-572b84a65dcd\" alt=\"Example-CrossHatch4.jpg\" title=\"Example-CrossHatch4.jpg\" /><br /><b>Figure 1: Rendered Examples</b><br /><br />For information on the <span class=\"codeInline\">CrossHatchAutoInputProtectionFilterProvider</span> class, see <a href=\"https://aip.codeplex.com/wikipage?title=HowDoI&referringTitle=Home&ANCHOR#createfilterprovider\">How Do I create a custom AIP filter provider&#63;</a>.<br /><br /><b>Note:</b> As of 2.0 Beta, <span class=\"codeInline\">CrossHatchAutoInputProtectionFilterProvider</span> is built-in to the AIP library.  The new implementation also provides randomization and extra options.<br /><br />For information about the <span class=\"codeInline\">dsweb</span> configuration section, see <a href=\"https://aip.codeplex.com/wikipage?title=HowDoI&referringTitle=Home&ANCHOR#configure\">How Do I configure my ASP.NET 2.0 website to use AIP&#63;</a>.<br /><br /><b>Note:</b> As of 2.0 Beta, the <span class=\"codeInline\">&lt;dsweb&gt;</span> section group is no longer used.  Instead, the <span class=\"codeInline\">&lt;autoInputProtection/&gt;</span> section is used by itself.<br />\n<h3><a name=\"spam\"></a>About Spam</h3>\rSpam is a problem.  Not only is it annoying but it&#39;s also immoral, and sometimes illegal.  Spammers attempt to make money at your expense or decrease the value of the services that your website provides.  The latter case is not usually classified as spam, however, but is actually some form of hacking instead; AIP will help you to protect your web forms against both types of automated attacks, regardless of the attacker&#39;s intention.<br /><br /><b>The Link Attack</b><br />A spammer will look for unprotected blogs, forums and wikis that allow links to be posted.  The spammer will do what it takes to get their links visible on your web pages.  When a link to a spammer&#39;s site appears in your website, and your site is indexed by some search engine such as Google, the mere presence of the spammer&#39;s link may increase the score of the their website in the search engine.  A higher score increases the chances that their site will appear closer to the top in search results.  Higher score/rank can mean increased sales and profit from embedded ads in the spammer&#39;s site simply because they are increasing their site&#39;s visibility on the net.  You suffer, your blog/forum/wiki/website users suffer and Joe Spammer makes some loot.<br /><br /><b>The Automated Attack</b><br />Spammers, just like legitimate businesses with morals, find ways to automate processes using computers.  One such way is automated blog spamming, for example.  A computer program searches the more well-known blog sites, and personal blogs that use commercial software, to find anonymous comment forms where they can post their site&#39;s links, automatically.<br /><br /><b>Protection from Automated Spammers</b><br />There are ways that you can protect your sites and blogs from these types of spam attacks.  CAPTCHA is only one of those ways, and it isn&#39;t always the most appropriate either.  One problem with CAPTCHA, for example, is that it&#39;s not accessibility-friendly.<br /><br /><b>How does an image with text help?</b><br />CAPTCHA renders text in an image because computers have a much harder time parsing image-based text than people do.  A user can <i>easily</i> duplicate the text that they see while computers cannot.  This allows websites to distinguish between legitimate users and automated spamming software.<br /><br /><b>A Spammers Response to CAPTCHA</b><br />One line-of-attack that automated spammers use against CAPTCHA is optical character recognition (OCR).  OCR is software that can read text from an image.  Examples of OCR can be found in programs such as Adobe Acrobat and Microsoft Office OneNote, which allows you to search for text in embedded images.<br /><br />You can defend against spammer&#39;s OCR by making it harder for computers to distinguish between the outline of characters and the image&#39;s background, or clutter-content; as long as a human can <i>easily</i> distinguish between the validation text and the rest of the image, you have yourself a CAPTCHA solution.<br /><br />Examples of CAPTCHA can be found on many websites that provide public web forms for site membership or simple data entry, such as right here on CodePlex when you register a new project!<br />\n<h3><a name=\"resources\"></a>External Resources</h3>\rHere is a list of resources that you can use to start researching about spam and methods for protection like CAPTCHA.<br /><br />Spam in blogs. (2007, March 13). In Wikipedia, The Free Encyclopedia. Retrieved 10:09, March 22, 2007<br /><a href=\"http://en.wikipedia.org/w/index.php?title=Spam_in_blogs&amp;oldid=114772085\">http://en.wikipedia.org/w/index.php?title=Spam_in_blogs&amp;oldid=114772085</a><br /><br />CAPTCHA. (2007, March 18). In Wikipedia, The Free Encyclopedia. Retrieved 10:09, March 22, 2007<br /><a href=\"http://en.wikipedia.org/w/index.php?title=CAPTCHA&amp;oldid=116053310\">http://en.wikipedia.org/w/index.php?title=CAPTCHA&amp;oldid=116053310</a><br /><br />Optical character recognition. (2007, March 18). In Wikipedia, The Free Encyclopedia. Retrieved 11:28, March 22, 2007<br /><a href=\"http://en.wikipedia.org/w/index.php?title=Optical_character_recognition&amp;oldid=116115377\">http://en.wikipedia.org/w/index.php?title=Optical_character_recognition&amp;oldid=116115377</a><br />\n<h3><a name=\"help\"></a>Help and Feedback</h3>\rAIP 2.0 Beta provides a standalone compiled help file and the installer integrates documentation into Visual Studio 2005 and 2008 automatically.  Refer to the <a href=\"https://aip.codeplex.com/wikipage?title=LatestReleaseNotes&referringTitle=Home\">Latest Release Notes</a> for more information.<br /><br />For help performing some of the more common tasks associated with AIP, see the <a href=\"https://aip.codeplex.com/wikipage?title=HowDoI&referringTitle=Home\">How Do I</a> wiki.<br /><br />For information about AIP text, bitmap and filter providers, see <a href=\"https://aip.codeplex.com/wikipage?title=AIPProviders&referringTitle=Home\">AIP Providers</a>.<br /><br />For questions and concerns that aren&#39;t addressed by the wikis you may use the <b>Discussions</b> area and bugs may be reported in the <b>Issue Tracker</b>.  If you prefer to submit your questions or comments to the team then please contact, <a href=\"http://davesexton.com/Contact\">Dave Sexton</a>; however, if you are asking a question then please check the wikis and <b>Discussions</b> for answers first!</div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,ASP.NET,security,visual studio 2005,.NET 2.0,ASP.NET 2.0,Web control,Input,CAPTCHA,Visual Studio 2008,",
  "LastEdited": "2008-04-04T09:14:08.437-07:00"
}