{
  "ProjectName": "airo",
  "Title": "AIRO - Interoperable Experiment Automation Package",
  "Description": "The main goal of this project is to provide engineers and scientists flexible and extendable framework for building test, measurement and control applications. This framework is compatible with IVI-COM drivers and extends IVI Instrument Classes with custom .NET (and COM) interfaces for such devices as: step motors, different positioning devices, magnet power supplies, lock-in amplifiers etc.\nWe  maintain IVI Foundation's aim: \"simplify upgrading or replacing components in complex test systems intended to be used over a long period of time.\"\nThe project also contains IVI-COM drivers we developed for some devices.\nTo access these libraries application developer can use both COM and .NET.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The main goal of this project is to provide engineers and scientists flexible and extendable framework for building test, measurement and control applications. This framework is compatible with IVI-COM drivers and extends IVI Instrument Classes with custom .NET &#40;and COM&#41; interfaces for such devices as&#58; step motors, different positioning devices, magnet power supplies, lock-in amplifiers etc.<br />We  maintain IVI Foundation&#39;s aim&#58; &#34;simplify upgrading or replacing components in complex test systems intended to be used over a long period of time.&#34;<br />The project also contains IVI-COM drivers we developed for some devices.<br />To access these libraries application developer can use both COM and .NET.<br /><br /><b>Getting started with experiment automation</b><br />You can find some initial information about experiment automation in AntonF&#39;s blog: <a href=\"http://labsw.blogspot.com/\">http://labsw.blogspot.com/</a><br /><br /><br /><b>**Delete the following note before publishing **</b><br /><br />This project is currently in setup mode and only available to project coordinators and developers. Once you have finished setting up your project you can publish it to make it available to all CodePlex visitors.<br /><br />There are three requirements before you publish:<br /><br />- Edit this page to provide information about your project<br />- Upload the initial source code for your project<br />- Add your project license<br /><br />Additional information on starting a new project is available here: <a href=\"http://www.codeplex.com/Wiki/View.aspx?ProjectName=CodePlex&amp;title=CodePlex%20Project%20Startup%20Guide\">Project Startup Guide</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Experiment,Automation,measurements,ivi,Data Acquisition,",
  "LastEdited": "2008-07-26T04:29:14.643-07:00"
}