{
  "ProjectName": "ajaxmapdataconnector",
  "Title": "AJAX Map DataConnector",
  "Description": "AJAX Map DataConnector is an Open Source + Open Data project focused on connecting the power of Bing Maps AJAX Control, Version 7.0 to the spatial query capabilities of SQL Server 2008. The examples provided here represent a starting point, showing some ways to harness SQL Server",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">The DataConnector project was designed and implemented by OnTerra Systems. A commercial and supported version of DataConnector called GeoSavvy is available here. <a href=\"http://www.onterrasystems.com/data-visualization-geosavvy/\">http://www.onterrasystems.com/data-visualization-geosavvy/</a> <br /><br /><b>Project Description</b><br /><br /><b>AJAX Map DataConnector</b> is a CodePlex project focused on connecting the power of Bing Maps and SQL Server 2008 (and can also be easily used with SQL Azure). This allows organizations and developers to rapidly create web mapping applications that contain rich geospatial data visualization features. <br /><br />AJAX Map DataConnector provides the technology and integration components with full access to code and sample data to create Bing Maps AJAX v7 applications with spatial data stored in SQL spatial data types. This includes creating map based displays, performing spatial queries (e.g. bounding box, radius etc) and displaying  points, lines and polygons and generating/displaying tile representations of the spatial data.<br /><br /><b>Figure 1</b> – Thematic raster tile display<br /><img src=\"http://download.codeplex.com/Download?ProjectName=ajaxmapdataconnector&amp;DownloadId=356843\" /><br /><br />DataConnector consists of a ASP.NET MVP project, GeoJSON transport and sample SQL spatial DB.<br /><br />If you would prefer Silverlight/WCF, try the Silverlight DataConnector <a href=\"http://dataconnector.codeplex.com\">http://dataconnector.codeplex.com</a><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Bing Maps,Ajax,",
  "LastEdited": "2012-05-14T16:07:26.793-07:00"
}