{
  "ProjectName": "AjaxToolkitExt",
  "Title": "DaniKenan's AJAX Control Toolkit Extensions",
  "Description": "Extensions to the AJAX Control Toolkit.\n\nThe project includes a set of extenders, controls and samples that complement the AJAX Control Toolkit.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Extensions to the AJAX Control Toolkit.<br /><br />The project includes a set of extenders, controls and samples that complement the AJAX Control Toolkit.<br /><br /><b>Current Status</b><br />Released Version 1.0 of the the toolkit with a new AnimatedModalPopupExtender. <br />About to complete the AjaxUploadProgressControl.  Expect it soon.<br />Started to design the LightBoxControl.<br /><br /><b>Released</b>\n<ul><li><b>AnimatedModalPopupExtender</b> which inherits the standard ModalPopupExtender and allows attaching arbitrary animation to any of the ModalPopupExtender events: Showing, Shown, Hiding and Hidden.</li></ul>\n<br /><b>Pending</b>\n<ul><li><b>AjaxUploadProgressControl</b> - a control that can be dropped on any form with a file upload to present progress and status report when the form is submitted.</li></ul>\n<br /><b>Future Plans</b>\n<ul><li><b>LightBoxControl</b> - a control based on the AnimatedModalPopupExtender which implements the server and client interface and all the cool features (animations and styles) required to easily present various content in a LightBox.</li>\n<li><b>MultiFileUploadControl</b> - Manage a collection of files to be uploaded. Allows uploading more then a single file from a single control. Supports skinning and integrates with the AjaxUploadProgressControl.</li>\n<li><b>AttachmentsUploadControl</b> - Mimic the &#39;Add Attachment&#39; behavior of popular web email clients such as gmail. Files are uploaded immediately when they are selected and not when the form is submitted. An intuitive UI is presented to allow managing the attachments.</li></ul>\n<br /><a href=\"https://ajaxtoolkitext.codeplex.com/wikipage?title=Code%20Samples&referringTitle=Home\">Code Samples</a><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "AJAX,AJAX Control Toolkit,Atlas Toolkit,ASP.NET Ajax,ASP.NET 2.0,ASP.NET 3.5,javascript,JSON,",
  "LastEdited": "2008-02-19T11:09:37.65-08:00"
}