{
  "ProjectName": "AjaxControls",
  "Title": "GSAjaxControls",
  "Description": "General & Specialized AJAX Controls built on top of the AJAX Control Toolkit and ASP.Net AJAX 1.0",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Welcome to the Ajax Controls project: General &#38; Specialized AJAX Controls built on top of the AJAX Control Toolkit and ASP.Net AJAX 1.0<br /><br />The project is made up of Control Extenders and stand-alone ScriptControls:<br />\n<ul><li><b>CheckBoxToggle:</b> Check all or None of the extended Checkboxes on a page (or toggle them)</li>\n<li><b>DelayedImageLoader:</b> Throw any image you like into the page, then query a web service to get the URL for the image you&#39;d like to replace it with (comes in handy when waiting for maps to generate)</li>\n<li><b>KeepFocus:</b> Keep a control in focus across post-backs (asyncronous or otherwise). This comes in handy for me when I&#39;ve got a dropdown that posts back and I want to continue scrolling through it with arrow keys.</li>\n<li><b>OneClickButton:</b> Eliminate multiple clicks of a button on web forms. Works with validators, too.</li>\n<li><b>ScriptInjector:</b> This ScriptControl will insert a piece of javascript into a page and run it. This is handy when you&#39;re using an update panel and would like a piece of code to be run in the page after doing something on the server.</li>\n<li><b>Shim:</b> This is an all-purpose IFrame shim. It will sit right below anything you want (using the setable z-Index), which will keep draggable items from being covered by dropdown lists.</li>\n<li><b>TextLengthLimit:</b> Makes MaxLength work on a TextBox in MultiLine mode. You can also display the number of characters remaining in another control, div, span, etc.</li>\n<li><b>DirtyPanel (in development):</b> Asks a user if they want to navigate off the page if any of the values have been changed in fields in the panel when they try to navigate away without saving.</li>\n<li><b>RollOverImage &amp; RollOverImageButton (in development):</b> ScriptControls that handle all of the dirty work of implementing a roll-over image, including pre-caching the roll-over images to eliminate extra calls to the server.</li></ul>\nFeel free to drop suggestions for new extenders in the Discussions section.<br /><br />Enjoy!<br /><br /><br /><b>Initial Release - 1/24/07:</b> <br /> <a href=\"https://ajaxcontrols.codeplex.com/releases/view/1680\">70124 Production</a><br /><br /><b>Finally A New Release! - 12/19/07:</b> <br /> <a href=\"https://ajaxcontrols.codeplex.com/releases/view/8722\">1.12.19.2007</a><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,ASP.NET,AJAX.net,Controls,javascript,UI Controls,ASP.NET 2.0,AJAX Control Toolkit,Web UI,Ajax Extenders,webcontrols,Ajax Extensions,Future Use,Shim,portfolio site,",
  "LastEdited": "2008-01-28T04:45:10.89-08:00"
}