{
  "ProjectName": "ajaxdialogcontrols",
  "Title": "Ajax Dialog Control Library",
  "Description": "An Ajax dialog library and framework based on the AjaxControlToolkit designed to allow you to create robust Ajax dialogs quickly and effeciently with best practices.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\rAn Ajax dialog library and framework based on the AjaxControlToolkit designed to allow you to create robust Ajax dialogs quickly and effeciently with best practices. The base dialog control wraps the ModalPopupExtender from the AjaxControlToolkit and exposes all of its functionality while adding some of its own. <br /><br />The dialogs maintain their styling in a seperate CSS file (that can easily be customized) and use unobtrusive JavaScript to maintain clean markup in the browser. All dialogs expose several pertinant client-side events including Showing, Shown, Hidding, Hidden, Updating, Updated, &amp; Repositioning.<br /><br />Here is an example screenshot of the Flexible Dialog:<br /><br /><img src=\"https://lh3.googleusercontent.com/-T4R60Ah3mI4/ToeyjJ1T35I/AAAAAAAACb8/dNCkMfZ43Cc/s288/flexible-dialog.png\" />\n<h2>Available Dialogs</h2>\r<b>Dialog Control</b><br /> <br />The Dialog Control can be used for sending messages to the user and it serves as the base control for all the other dialogs in the Ajax Dialog Control Library. At this time it is the base control for the Templated Dialog, IFrame Dialog, and Flexible Dialog. Dialogs created in the future will also inherit from this control. <br /><br />More Info: <a href=\"https://ajaxdialogcontrols.codeplex.com/wikipage?title=Dialog%20Control%20%28Base%20Dialog%20Control%29&referringTitle=Home\">Dialog Control &#40;Base Dialog Control&#41;</a><br /><br /><b>Flexible Dialog</b><br /><br />The Flexible Dialog allows you to create a dialog containing multiple interconnected views which are lazy loaded with their scripts (optional) to provide a very interactive user experience. To demonstrate the capabilities of the FlexibleDialog control, a set of forms including help, login, register, and reset password, have been implemented and connected together within one FlexibleDialog control. See the sample application in the download tab for this demonstration.<br /><br />More Info: <a href=\"https://ajaxdialogcontrols.codeplex.com/wikipage?title=Flexible%20Dialog&referringTitle=Home\">Flexible Dialog</a><br /><br /><b>Templated Dialog</b><br /><br />The Templated Dialog control builds on the functionality of the Dialog Control by providing a template for adding HTML and control markup declaratively for rendering in the dialog body. This allows you to create a customized  dialog quickly without the need to subclass the Dialog Control.<br /><br />More Info: <a href=\"https://ajaxdialogcontrols.codeplex.com/wikipage?title=Templated%20Dialog&referringTitle=Home\">Templated Dialog</a><br /><br /><b>IFrame Dialog</b><br /><br />The IFrame Control builds on the functionality of the Dialog Control by rendering an IFrame in the body of the dialog from which to load the body content. The IFrame border is completely hidden, so content loaded from other pages, and even from other websites, display as if they are part of the dialog and the page containing it. Like the Templated Dialog, this dialog also allows you to create a customized dialog quickly without the need to subclass the Dialog Control.<br /><br />More Info: <a href=\"https://ajaxdialogcontrols.codeplex.com/wikipage?title=IFrame%20Dialog&referringTitle=Home\">IFrame Dialog</a>\n<h2>Requirments</h2>\r<b>Runtime Requirments</b>\n<ul><li>.NET 4.0 Framework</li>\n<li>jQuery 1.6.2 or greater</li>\n<li>AjaxControlToolkit 4.1.50508 or greater</li></ul>\n<b>Development Requirements</b>\n<ul><li>All above requirments</li>\n<li>Visual Studio 2010</li>\n<li>Ajax Minifier</li></ul>\n<h2>Future Dialogs &amp; New Features</h2>\rIn the works are a Search Dialog and Login Dialog. If you think of something useful, let me know and I may actually develop for you (and everyone else&#39;s benefit). <br /><br />Thanks,<br />Bill Davidsen<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "AJAX Control Toolkit,Ajax,dialog,Popup,winforms,ASP.NET,webcontrols,Modal Dialogs,modalPopup,.NET 4.0,",
  "LastEdited": "2011-12-22T19:24:44.453-08:00"
}