{
  "ProjectName": "ajaxmvc",
  "Title": "AJAX MVC",
  "Description": "Abstraction library which enables the authoring of Ajax ScriptControl objects which can be consumed by both WebForms and MVC applications.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Abstraction library which enables the authoring of Ajax ScriptControl objects which can be consumed by both WebForms and MVC applications.<br />\n<h2>Remarks</h2>\rThis project was created to fill a temporary need for an Ajax framework for ASP.NET Server Control authoring for the ASP.NET MVC Framework. However the hope is now that the efforts on this project will result in a future tool for ASP.NET Ajax developers.<br /><br />My reason for creating the Ajax abstraction layer was so I could author a server control library for ExtJs that was likely to be compatible with the final release of the MVC framework. In the absence of any direction from Microsoft, I started this project betting on System.Web.UI.ScriptControl to be the means of providing Ajax capabilities to MVC. It has since been confirmed (<a href=\"http://www.codeplex.com/ajaxmvc/Thread/View.aspx?ThreadId=30210\">http://www.codeplex.com/ajaxmvc/Thread/View.aspx?ThreadId=30210</a> that this is indeed the direction the MVC team is going. <br /><br />ASP.NET Ajax server controls are authored by inheriting from the System.Web.UI.ScriptControl class which is dependent upon the System.Web.UI.ScriptManager control which is in turn dependent upon the Web Forms application module. This dependency chain is not compatible with the ASP.NET MVC framework which does not require an html form element with the runat attribute set to &quot;server&quot;. <br /><br />The AJAX MVC project provides an abstraction layer between System.Web.UI.ScriptControl and System.Web.UI.ScriptManager which enables the authoring of server controls which can be used for both the Web Forms model as well as the MVC model. <br /><br />The aim of this project is to make developers more productive by allowing them to author server controls which encapsulate their favorite javascript framework that do not require a version for both application models.<br />\n<h2>Sample Projects</h2>\rIncluded in the source control are 3 sample projects following is a description of each.<br /><br /><b>ExtJsControlLibrary</b><br />This project is an example of how to use the AjaxAbstractions library to author a server control library for your favorite javascript library. <br /><br />As I develop this control library, my intent is to mirror the ExtJs as closely as possible. If you would like to know more about a specific control, visit the ExtJs documentation to find out more about it. <br /><br />ExtJs API Documentation <a href=\"http://www.extjs.com/deploy/dev/docs/\">http://www.extjs.com/deploy/dev/docs/</a><br />ExtJs Product Home Page <a href=\"http://www.extjs.com/products/extjs/\">http://www.extjs.com/products/extjs/</a><br /><br /><b>MvcApp</b><br />This is a demo application which shows how to use the concrete implementation from ExtJsControlLibrary with the ASP.NET MVC framework. You must have the ASP.NET MVC bits in order to load this project, currently the project references the latest release, Preview 2. You can find the project page and download the bits here <a href=\"http://www.asp.net/mvc\">http://www.asp.net/mvc</a><br /><br /><b>WebFormApp</b><br />This is a demo application which shows how to use the concrete implementation from ExtJsControlLibrary within the WebForms framework. The default.aspx page in this application uses the ExtJsScriptManager, but ExtJsScriptManager can be swapped out for the built-in ASP.NET ScriptManager server control.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,MVC,ASP.NET,Server Controls,ExtJs,javascript,aspnetmvc,",
  "LastEdited": "2008-09-15T08:43:53.07-07:00"
}