{
  "ProjectName": "ajaxcontrol",
  "Title": "AJAX Control Framework",
  "Description": "Do PageMethods and the UpdatePanel make you feel dirty? Think building AJAX enabled ASP.NET applications should WAY easier than it is? Wish ASP.NET AJAX wasn't so bloated? You don't have to settle or compromise. Come see the light with the AJAX Control Framework.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><br />Check out the <a href=\"https://ajaxcontrol.codeplex.com/wikipage?title=Feature%20List&referringTitle=Home\">Feature List</a> and the <a href=\"https://ajaxcontrol.codeplex.com/documentation?referringTitle=Home\">Documentation</a> to get a sense of what you can do with the framework.<br /><br /><br /><br /><b>More documentation and samples are on their way. In the meantime, checkout the Bing Maps sample project to see how how the framework can be used.</b><br /><br /><br /><br />Dear ASP.NET developer,<br /><br />The AJAX Control Framework is a personal project of mine that I&#39;ve been getting ready for release for the past 2 years. I&#39;ve re-written the whole thing twice now and I think it&#39;s now in the best shape of it&#39;s life and worthy of the community. <br /><br />Overall, its a framework that helps ASP.NET WebForms developers build component based web applications. (Well duh! That&#39;s the whole point of ASP.NET!) With the release of the incredibly bloated and over architected ASP.NET AJAX, developers were <i>kind of</i> given the ability to easily create ajaxified controls. With the ASP.NET AJAX library came the very powerful Update Panel which DRAMATICALLY speeds up the development of AJAX enabled components. But, just like every extender in the AJAX Control Toolkit, the Update Panel consists of 1000s of lines of Javascript and C# code to give you an over complicated and inefficient rapid application development experience. Sure, its easy to whip up AJAX enabled web apps super quick. But at what price? There&#39;s almost ALWAYS some give and take when your aim is rapid development (most often the take is &quot;efficiency and cleanliness&quot;). That bugged me so much. SO MUCH that it drove me to spend an immense portion of my free time over the last 2 years in developing an efficient, rapid development ASP.NET AJAX equivalent that <i>doesn&#39;t</i> compromise efficiency, simplicity, or extensibility. I&#39;m VERY confident in saying that with the AJAX Control Framework I&#39;ve created an implementation that 1-UP&#39;s the ASP.NET AJAX framework in almost every way. My initial, and sloppy, profiling results of the AJAX Control Framework showed that its components perform over <b>50%</b> better than the ASP.NET AJAX framework&#39;s equivalent components. Best of all, it is extensible, very clear, and now open to the community to have its way with it.<br /><br /><b>So here&#39;s what it&#39;s all about:</b> The AJAX Control Framework consists of a client-server communication <i>strategy</i> that takes advantage of the Callback feature of ASP.NET WebForms. What you get with this strategy is a hyper efficient AJAX protocol for your ASP.NET WebForms web applications. Also, having the protocol abstracted into a strategy (the design pattern) like it is, AJAX functionality can be <i>attached</i> to <i>any</i> UI element that derives from System.Web.UI.Control. Just imagine that for a moment. <i>Attach</i> rather than <i>extend</i> AJAX functionality. You could take a custom control you built a few years back that you use in all your projects and in just minutes <i>attach</i> the streamlined AJAX capabilities of the AJAX Control Framework to it without having to restructure your class hierarchy. And trust me, it only takes a minute or two to fully enable AJAX on any control. Ponder this as well: you can <i>attach</i> AJAX capabilities to <i>any</i> control...like a DropDownList or a Label. Setting up Callbacks in ASP.NET is a pain in the butt. Forget about doing it that way. <br /><br />Read through the <a href=\"https://ajaxcontrol.codeplex.com/wikipage?title=Feature%20List&referringTitle=Home\">Feature List</a> for more details on what you can do with our framework.<br /><br />Your best bet is to just download the latest release and read through the source code. Do yourself a favor and read through the source code. There&#39;s alot of good stuff in there and I guarantee you&#39;ll learn A TON. <br /><br /><b>Please, let me know what you like. If something flat out sucks, shove it back in my face.</b> <br /><br /><b>If you notice anything acting funny or something that is obviously a bug, just send me a message, make a comment, or create an issue in the Issue Tracker and I&#39;ll get right on it. I&#39;ve developed the entire thing against real client projects so it&#39;s tested fairly thoroughly.</b><br /><br /><br />- &quot;Peanutbutter&quot; Lou</div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,Custom Controls,WebForms,Framework,",
  "LastEdited": "2010-06-02T16:00:18.337-07:00"
}