{
  "ProjectName": "AppCan",
  "Title": "AppCan (includes Prism + more) = Better apps/compositing (WPF)",
  "Description": "AppCan enhances Prism, better compositing,  i.e. Document management , Menu/toolbar merging, local region managers, standardized regions, view model extension. ",
  "MovedLink": "https://github.com/davesspacebar/AppCan",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nAppCan enhances Prism by offering&nbsp;a thin&nbsp;application framework and compositing capability around what prism provides.&nbsp; i.e. Document management (i.e. Models/Containers), Menu/toolbar merging, local region managers, standardized regions, view\r\n model extensions and more.&nbsp; Prism standards use a single unity container meaning all interfaces must be unique in a global container.&nbsp; AppCan supports multiple containers (contexts) so generic interfaces can be used.&nbsp;&nbsp; Prism standards use\r\n a single global region manager, requiring region names to be unique.&nbsp; AppCan supports local region managers so region names can be re-used allowing for better decoupling and abstraction.&nbsp; And much&nbsp;more...</p>\r\n<p><img src=\"/projects/AppCan/f73e76e6-a355-4247-8705-5a9aa17ce9a6\" alt=\"Application Conceptual Model\" width=\"1152\" height=\"683\" style=\"vertical-align:top\"></p>\r\n<p><strong>Intended Audience</strong></p>\r\n<p>Software Developers building WPF applications.&nbsp; AppCan adds additional patterns and practices to Prism to offer a more complete compositing/application framework experience.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Other projects includes</strong></p>\r\n<p>Current version of AppCan&nbsp;includes Prism 4.1, and Log4Net</p>\r\n<p>&nbsp;</p>\r\n<p><a title=\"Download Release\" href=\"http://appcan.codeplex.com/releases/view/103608\">Libraries can be downloaded from here</a></p>\r\n<p><a href=\"/wikipage?title=Learn%20about%20AppCan%20classes%2ffunctionality&referringTitle=Home\">Learn about AppCan classes/functionality</a></p>\r\n<p><br>\r\n<strong>Goals:</strong></p>\r\n<ul>\r\n<li><strong>&nbsp;</strong>More complete compositing/application framework, providing good base functionalities for standard application implementations\r\n</li><li>&nbsp;Support better decoupling between classes i.e. views, viewmodels, etc. (i.e. not requiring specific interfaces/types to be known for all classes/view models used)\r\n</li><li>&nbsp;Support better/easier compositing of modules, classes, views, etc. </li><li>&nbsp;Provide better encapsulation by localizing regions and services/classes to avoid single global repositories\r\n</li><li>Keep in mind garbage collections to try to reduce the need for garbage collections during runtime<br>\r\n<br>\r\n</li></ul>\r\n<p>&nbsp;</p>\r\n<p><br>\r\nAppCan allows developers to put the pieces of Prism together more cleanly/and easily. It allows for logically associating ViewContainers, Views and View models.<br>\r\n<br>\r\nAppCan enhances prism by supporting Contexts that wrap together Windows, their views, their region managers and their view models, along with any other classes you might need.<br>\r\n<br>\r\nAppCan reduces the need for specific dependencies/types, allowing modules and code to register requests for generic Views, ViewContainer and ViewModel interfaces without needing to know specific types from other modules. By separating Views and View Models\r\n into their own contexts the specific types no longer matter and generic interfaces can be used for the View and the View model.<br>\r\nAppCan solves the problem of supporting locally scoped region managers, by implementing a pattern/framework to support it.<br>\r\n<br>\r\nAppCan allows for easily enhancing/replacing windows, views, viewmodels, etc. Allowing for extending/enhancing existing windows/views more easily.<br>\r\n<br>\r\nAppCan view model extensions allow adding objects to be referenced by the existing view model so you can add functionality to views without needing to rewrite the existing view model class, just extend it by adding your own extension object you can bind to\r\n from the view.<br>\r\n<br>\r\nAppCan allows you to Merge menu's from modules into your main shell!<br>\r\n<br>\r\nModel support: You&rsquo;ve heard MVVM but implementations for Model&rsquo;s has been mostly left to be individually recreated for every application. AppCan supports a simple framework to build upon.<br>\r\n<br>\r\n<br>\r\nIncluded in the current version is:<br>\r\nAppCan <br>\r\nPrism 4.1<br>\r\nLog4net<br>\r\n<br>\r\n<br>\r\n<a href=\"/wikipage?title=Learn%20about%20AppCan%20classes%2ffunctionality&referringTitle=Home\">Learn about AppCan classes/functionality</a><br>\r\n<br>\r\n</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,WPF,UI,Prism,MVVM,UnityContainer,AppCan,Composite,Container,log4net,Composite UI,Framework,.NET,.NET 4.0,Application,Unity,Model,View,View Model,",
  "LastEdited": "2013-06-04T19:49:09.023-07:00"
}