{
  "ProjectName": "applistcontrol",
  "Title": "Coding4Fun Apps List Control",
  "Description": "Don't miss any opportunity to market your Windows Phone apps!  Each one of your apps can serve as an ad for your other apps.    Learn how to add a listing of everything you have published in Marketplace to each of your apps.  Even better, it will always be up to date!",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Don&#39;t miss any opportunity to market your Windows Phone apps&#33;  Each one of your apps can serve as an ad for your other apps.    Learn how to add a listing of everything you have published in Marketplace to each of your apps.  Even better, it will always be up to date&#33;<br /><br /><b>Nuget</b><br />Make it easier on yourself!  Always be up-to-date by getting this package through the Nuget Package Manager.<br /><a href=\"https://www.nuget.org/packages/ArianKulp.WindowsPhone.MyAppsList/\"><img style=\"border:none;\" src=\"https://www.nuget.org/Content/Logos/nugetlogo.png\" /></a><br /><br /><b>Screenshot</b><br /><img src=\"http://files.channel9.msdn.com/wlwimages/1932b237046e4743a4e79e6800c0220f/MyAppsList_thumb3.png\" /><br /><br /><b>Introduction</b><br />I&#39;ve written a number of Windows Phone apps, and each time I&#39;ve wanted to let people know about my other apps.  While I could mention the other apps somewhere, I wouldn&#39;t want to update all of my apps each time I release a new one.  It finally occurred to me that I could use the listing of apps directly from Marketplace instead.  This provides me with an easy-to-parse XML feed (Atom) of my apps with all of the info that I need.  Armed with that, it wasn&#39;t too much work to create a user control to let me drop in the list of apps anytime I need it.<br /><br />This code doesn&#39;t require a physical phone, but it isn&#39;t very useful if you don&#39;t have a Marketplace account!  Ideally, you should have several published apps under your account for this to make much sense.  Once you have it in place though, all of your apps will always show your complete list without any special updates.<br /><br />If you don&#39;t have the software installed, go to create.msdn.com, then click Download the free tools to download the Windows Phone Developer Tools (or use the direct download link provided above this Introduction section). This code is written for the Windows Phone Developer Tools 7.1 (Mango).  It’s is a mostly online install, and it’s pretty big so expect it to take some time. Even if you don’t have any development tools, this will give you Visual Studio Express, Blend, and XNA Game Studio. If you have the full-version tools already, it will add new templates.<br /><br />This project accompanies an article on Coding4Fun&#39;s blog: <a href=\"http://channel9.msdn.com/coding4fun/articles/Let-your-apps-sell-themselves\">Let your apps sell themselves!</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "c4f,Coding4Fun,Phone,Windows Phone 7,Advertising,User Controls,",
  "LastEdited": "2014-02-01T22:58:44.023-08:00"
}