{
  "ProjectName": "ariciepkp",
  "Title": "Aricie - PortalKeeper",
  "Description": "Aricie - PortalKeeper is a DotNetNuke module with a sequential Rule Engine embedded in a Firewall, Bots, Web Services, Http handlers and control adapters.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Portal Keeper is a DNN module to build <b>agents</b>, with a sequential <b>rule engine</b> embedded in several server components, covering many aspects of a complex web application project.<br />\n<h5><i>Need help with configuration, a custom rule, a dedicated agent or a new action provider? Want to share some feedback or contribute some improvements?</i></h5>\r<h5><i>Please let <a href=\"http://www.aricie.com\">us</a> know and get the project going !</i></h5>\r\n<h2>What&#39;s up with PortalKeeper</h2>\r<h4>06/22/2016 Release: <a href=\"http://ariciepkp.codeplex.com/releases/view/624803\">Version 4.3.3</a> with new <u>Sql Job Bot</u>, fixes and service agents improvements</h4>\r<h4>06/04/2016 AI with PKP was demonstrated in a <a href=\"http://dnn-connect.org/events/2016/sessions/moduleId/736/conferenceId/2/sessionId/68/controller/Session/action/View\">DNN Connect session</a>, the video is available on <a href=\"http://channel9.msdn.com/Events/Microsoft-Spain-Events/DNN-Connect/Artificial-Intelligence-in-DNN\">MS Channel 9</a></h4>\r<h5>04/12/2016 Release: <a href=\"https://ariciepkp.codeplex.com/releases/view/620875\">Version 4.3.2</a> with new <u>AI services (vol. 2)</u>, Markdown parser, asset manager editor adapter and serialization enhancements</h5>\r<h5>01/27/2016 Release: <a href=\"https://ariciepkp.codeplex.com/releases/view/619571\">Version 4.3.1</a> with new <u>AI services</u>, referrer spammer firewall rule, string processing and serialization enhancements</h5>\r<h5>10/15/2015 Release: <a href=\"https://ariciepkp.codeplex.com/releases/view/617926\">Version 4.3.0</a> with new <u>Application life cycle</u> engine, critical changes logging and <u>recycle free development environment</u></h5>\r<h5>10/08/2015 Release: <a href=\"https://ariciepkp.codeplex.com/releases/view/617815\">Version 4.2.3</a> with a dynamic Keepalive.aspx adapter and usability improvements </h5>\r<h5>09/16/2015 Release: <a href=\"https://ariciepkp.codeplex.com/releases/view/617424\">Version 4.2.2</a> with Custom <u>Dynamic Types</u>, Spreadsheet <u>Restful CRUD service</u>, spreadsheet structured queries, partial xml signature.</h5>\r<h5>09/11/2015 Release: <a href=\"https://ariciepkp.codeplex.com/releases/view/617329\">Version 4.2.1</a> with <u>Streaming Proxy</u>, Response bandwidth Throttling, dynamic string transformations and regular expressions callbacks.</h5>\r<h5>08/26/2015 Release: <a href=\"https://ariciepkp.codeplex.com/releases/view/617000\">Version 4.2.0</a> with <u>Web API Rest services</u> and <u>Virtual Custom Errors handler</u> reintroduced.</h5>\r<h5>08/19/2015 News - <u>Joe Brinkman</u> and <u>Will Strohl</u> introduce <b>Aricie.PortalKeeper</b> during the <a href=\"https://youtu.be/xadBtuJYNwg\">August, 2015 DNNHangout</a>.</h5>\r<h5>12/07/2014 Tutorials - An introduction <a href=\"https://www.youtube.com/playlist?list=PL53OdxVme3uj5Zp28G_1VE5w4brZYMzY2\">video tutorial</a> to the module through example: activation the Recaptcha Adapter and creation of an agent from scratch.</h5>\r\n<h2>What&#39;s inside Portal Keeper</h2>\r\n<img src=\"/projects/ariciepkp/5aba4af2-e3df-4193-85e5-10491e0b7e91\" alt=\"DNN.png\" title=\"DNN.png\" /><br /><br />Portal Keeper can be installed as a regular extension to a <a href=\"http://www.dnnsoftware.com/\">DNN</a> web application.<br />It runs 6 flavors of the same application engine, that make up the sections of the main configuration form.<br />\n<h2>Application firewall</h2>\r\nThis firewall takes the form of a <i>hybrid Http Module</i> where you can attach your rule condition evaluation and actions execution to the inner events of the Asp.Net and Page life cycles.<br /><br />Default rules include:<br />\n<ul><li><b>Filter Html Response</b> : Change the response text before it is streamed to the client. A rich combination of global and local string transformations, html xpath queries,  token replace and <a href=\"https://en.wikipedia.org/wiki/Markdown\">Markdown</a> syntax parsing are demonstrated by default.</li>\n<li><b>Cache Http Output</b> : Use a set of strategies to trigger and finely control ASP.Net response caching with great performance gains.</li>\n<li><b>Create Content Delivery Network</b>: Dedicate one of your portal alias to serving stylesheets, scripts, images, and other resources, with or without an worldwide 3rd party CDN service. Intercept your Html output to set the corresponding Urls, and optimize CDN responses.</li>\n<li><b>Protect from DDoS attacks</b> : Monitor incoming Http calls with rate caps in order to filter out rogue requests.</li>\n<li><b>Protect from Bandwidth overuse with Throttler</b> : Monitor bandwidth usage and put a bandwidth cap on heavy users.</li>\n<li><b>Control Critical Accounts access</b>: Define a restricted perimeter for administrator logins based on IPs, aliases, countries etc.</li>\n<li><b>Block Referrer spammers</b>: compare the current request&#39;s referrer Host to a list of (8000+) spammer domains, and terminate the request if matched</li>\n<li>Detect and/or prevent <b>simultaneous connections</b> from the same user accounts</li>\n<li><b>Mobile devices redirection</b>: That rule illustrate setting up a custom condition from accessing a global Dnn and Http context and evaluating custom regular expressions against it.</li>\n<li><b>Super User backdoor</b> : Set up an easy autologin secret url under restricted client source conditions</li>\n<li><b>Geographically limited registration</b> : Adjust your registering settings according to the detected client country.</li>\n<li><b>Warn IE 6 users</b> :  Display a page or module message according to custom conditions. </li>\n<li><b>Display custom information</b> on demand, such as the server name in a web farm scenario, with a dedicated query string parameter.</li>\n<li><b>Streaming Proxy filter</b> associated to the powerful proxy handler, that uses a Pipe stream to relay external Requests efficiently, bypassing same-origin policy issues when CORS headers are not available. That rule additionally filters html, js, css content to proxify inner links, but also processes Kml and Kmz files to proxify external resources and set visibility of inner geographic entities to true.</li>\n<li><b>Clear cache on demand</b> by providing the key to be cleared as a request parameter</li></ul>\nThe FIrewall also contains custom components such as a Ban List with quick connection shut down action, which is leveraged by the DDoS Rule.<br /><br />\n<h2>Web bots farm</h2>\r\nIn that component, the engine takes the form of a farm of scheduled bots embedded within the native DNN task scheduler.<br />An instance of each bot can additionally be proposed for customization to regular DNN registered account.<br /><br />Sample Bots include:<br />\n<ul><li><b>Keep Alive Pings</b> - Performs Http Requests to a series of Urls to keep the target websites up and monitor response times, and sends alert emails in case of unavailability.</li>\n<li><b>Sql Job</b> - runs a stored procedure, converts, filters the results, and emails the portal admin with the resulting list of recently active users, injected into the message with loop tokens</li>\n<li><b>Real Estate Monitoring</b> - Harvests classifieds, and updates a Google spreadsheets document with targeted results. </li>\n<li><b>Search Result Scraper</b>: Define a series a web searches to monitor, together with paging settings, scrap data from result pages through dedicated xpath queries and sub queries, dive deeper with detail http sub requests, perform custom processing in IronPython, and keep track of the resulting data in a dedicated Google spreadsheet with a custom identifying key.</li>\n<li><b>Google nearby places</b> - Monitors custom Google queries and send alerts when new results are available. That bot also illustrates maintaining a pool of available open proxies to be used for subsequent Http requests.</li>\n<li><b>Bitcoin trading</b> bots (soon) - those bots connect to Bitcoin exchange APIs and issue orders based on custom trading strategies. </li>\n<li><b>Reddit Commands</b> bot (soon) - This bot will connect to the Reddit API as a dedicated user, and monitor messages, posts or subreddits, scanning for custom commands, answering and performing actions accordingly. The goal is that each user bot can embed a personal instance of several of the famous bots operating on the platform.  </li></ul>\n\n<h2>Rest Services</h2>\r\nThat component let you define Rest Web services with an engine associated to each method. <br />An earlier version was developed using the OpenRasta framework. The new version provide hooks to the web API framework and corresponding DNN Service Framework.<br />The engine allows for dynamic routes, controllers, actions, parameters, and attributes. Routes are also automatically discovered.<br /><br />A collection of <a href=\"https://www.getpostman.com\">Postman</a> requests is also available <a href=\"https://www.getpostman.com/collections/e380c6c4df7092d47be5\">for download</a> to help testing the default services.<br /><br />Sample Services include:<br />\n<ul><li><b>Crypto Service</b> - A service tied to hosted encryption parameters to perform on demand encryption, decryption, XML full or partial signature and Signature verification. it illustrates the use of custom parameters, custom routes, and custom attributes.</li></ul>\n\n<ul><li><b>Spreadsheet Service</b> - A service wrapping Google spreadsheet services, providing a custom entity Restful CRUD with automatic column conversion. This service can serve as a template to build CRUD services.</li></ul>\n\n<ul><li><b>DNN Utilities</b> - Controllers to expose DNN features and model to the client side, with a sample user current controller.</li></ul>\n\n<ul><li><b>API</b> - Services to configure the platform&#39;s agents and settings.</li></ul>\n\n<ul><li><b>Artificial Intelligence</b> - Collection of AI services exposing various domain engines with processing and configurable strategies</li></ul>\nList of AI controllers:\n<ul><li><b>Problem solving</b>: graph search and tree search with Uninformed and informed strategies (Breadth first, iterative depth first, recursive A star, greedy best first, hill climbing, simulated annealing etc.)</li>\n<li><b>Constraint satisfaction problems</b>: static or dynamic definition, Improved backtracking with AC3, Minimum Remaining value with Degrees heuristic and Least constraining Value heuristic, Min conflicts strategy etc. </li>\n<li><b>Propositional logic</b>: Knowledge bases and inference procedures (Resolution, DPLL, Walksat etc.)</li>\n<li><b>First Order Logic</b>: Knowledge bases and inference procedures (Model elimination, Otter etc.)</li>\n<li><b>Probabilistic programming</b>: Static and dynamic Bayesian networks, hidden markov models, exact and approximate inference: rejection sampling, Likelihood weighting, Gibbs sampling, Forward backward, Fixed lag smoothing, particle filtering etc.</li>\n<li><b>Game of GO</b>: service to generate a training data set from a set of professional go records leveraging <a href=\"https://www.gnu.org/software/gnugo/\">GnuGo</a> and <a href=\"https://gotraxx.codeplex.com\">Gotraxx</a>, together with a sample data set of 1500 game records. Convoluted neural network with training configuration, together with a sample trained model, and methods to run the model to play or to generate influence maps. </li></ul>\nAI controllers include:\n<ul><li>Demos with default entities that can be edited online (propositional and first order logic knowledge bases, Bayesian networks, hidden Markov models).</li>\n<li>Multiple inference strategies, which can be passed as web service parameters to the demos, and support the coursework.</li>\n<li>Open actions, where the demo entities are replaced by dedicated parameters passed over Http by the web services client. those should ease integrating AI components in your own applications.</li></ul>\n<br />\n<h2>HttpHandlers</h2>\r\nHttpHandlers are the most general and flexible components to respond to HttpRequests. <br />Dynamic Handlers based on the core engine let you define template based pages, streaming services, or any kind of hosted web server component.<br /><br />Samples Handlers include:<br />\n<ul><li><b>KML WMS Service</b> - A fully functional tiled WMS service leveraging the SharpMap GIS components suite, and serving layers of Google format KML files from DNN file system.</li></ul>\n\n<ul><li><b>Private Torrent tracker</b> - A standalone torrent tracker supporting announce and scrap torrent client requests, built with the Monotorrent library.</li>\n<li><b>Streaming Proxy</b>: Efficient buffered multipurpose Http Proxy, Associated to a dedicated firewall rule it can process streamed content to proxify inner urls for instance.</li></ul>\n\n<h2>Control Adapters</h2>\r\nControl Adapters let you target kinds of ASP.Net controls and pages, by type or by path and extend or override their behavior, globally to the application, or filtered according to your needs, on specific extension points made of their life cycle and their child controls&#39; life cycle events.<br /><br />Samples Adapters include:<br />\n<ul><li><b>ReCaptcha Adapter</b> - An adapter that overrides the default DNN Captcha, known for a vulnerability, and replaces it with Google ReCaptcha.</li></ul>\n\n<ul><li><b>Event Viewer page Size adapter</b> - A simple yet convenient adapter to the event viewer admin DNN module, that saves the results page size in the user personnalization profile, to override the default 10 items result.</li></ul>\n\n<ul><li><b>Asset manager file editor</b> - In order to simplify editing Skin source files online, a control adapter was introduced to add a file editor to the asset manager, by hijacking the existing module creator&#39;s source editor with color syntax. </li></ul>\n\n<ul><li><b>UrlControl Adapter</b> - An adapter that enhances the original DNN file selector with an image picker from a 3rd party library.</li></ul>\n\n<ul><li><b>Keep alive adapter</b> - An adapter that enhances the original DNN Keepalive.aspx page, responsible for swallowing restart requests to keep the user experience fast. It preloads user control types and dnn pages lazy loaded properties to accelerate first visits loading times. </li></ul>\n\n<ul><li>Several simple adapters demonstrating customization of the rich text editor, skin objects the main Default.aspx page, or the auto login checkbox.</li></ul>\n\n<h2>Application life cycle agent</h2>\r\nSimilar to firewall, the application engine taps into application life cycle instead of ASP.Net request life cycle.<br /><br />Default rules include:<br />\n<ul><li><b>Application Start and End sequences</b> : Tap into the init and end sequence to add your own processing and logging actions.</li>\n<li><b>Optimized translator environment</b> : Removes critical change monitoring from all or specific localization folders to allow for smoother online translation sessions.</li>\n<li><b>Optimized developer environment</b> : Brings Edit&amp;Continue capabilities to a range of development scenarios.</li>\n<li><b>Critical changes sequence</b> : Generally difficult to analyze recycling cycle, logs information useful to document possible issues.</li></ul>\nThe Application engine also contains custom components such as:<br />\n<ul><li>A UI for easy access to compression parameters</li>\n<li>A virtual custom errors handlers, to deal with exceptions status codes, with flexible capabilities.</li></ul>\n\n<h2>Provider based</h2>\r\nCondition and Action types are made from easy to implement providers. <br />Look at the included sample providers to create your own types of conditions and actions together with a dedicated UI for custom properties.<br />Included are the following providers:<br />\n<ul><li><b>Condition providers</b>:\n<ul><li>Sub Conditions</li>\n<li>Dynamic expression</li>\n<li>Client Source (Firewall only)</li>\n<li>DNN Page (Firewall only)</li>\n<li>Portal Alias (Firewall only)</li>\n<li>Membership (Firewall only)</li>\n<li>Request caps (Firewall only)</li></ul></li>\n<li><b>Action providers</b>:\n<ul><li>Log Event</li>\n<li>Send Email</li>\n<li>Web Action</li>\n<li>Define Variables</li>\n<li>Multiple Actions</li>\n<li>Loop/While Actions</li>\n<li>Object Actions</li>\n<li>String Filter</li>\n<li>File Read/ File Write Actions</li>\n<li>File Manager</li>\n<li>Serialize/Deserialize Actions</li>\n<li>Run SQL</li>\n<li>Run Program</li>\n<li>Load/Save User Identity/Personnalization Profile</li>\n<li>Read/Write Google spreadsheets</li>\n<li>Run Python</li>\n<li>Auto Login (Firewall only)</li>\n<li>Log Off (Firewall only)</li>\n<li>Redirect (Firewall only)</li>\n<li>Customize Environment (Firewall only)</li>\n<li>Display Message (Firewall only)</li></ul></li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "DotNetNuke,DNN,Firewall,Control Adapters,Bots,HttpHandlers,HttpModules,Web API,OpenRasta,Bitcoin,Reddit,ReCaptcha,DDOS,Agents,Automate,Web Services,Rest,SharpMap,WMS,Torrent,GData,vb.net,",
  "LastEdited": "2016-10-03T00:30:46.41-07:00"
}