{
  "ProjectName": "asebackgroundmusic",
  "Title": "Airplay SDK BackgroundMusic Crossplatform Extension",
  "Description": "Background Music provides access to the device's music library through the Music Picker interface is available, plus playback controls for the currently playing music and the ability to query track and player status. Outside of iOS it use s3eAudio to play background music.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Extends s3eBackgroundMusic.<br /><br />Background Music provides access to the device&#39;s music library through the Music Picker interface, plus playback controls for the currently playing music and the ability to query track and player status. <br /><br />This extension is currently only supported on the iPhone platform and on devices running OS version 3.0 or newer. It accesses and plays media items from the iPod library through the Media Player Framework &gt; Music Player Controller interface. Support for other platforms is planned for a future release. <br />Use s3eBackgroundMusicPickMusicItems to launch the Music Picker interface. This is a variation of the regular iPod interface which allows the user to select tracks to queue up for playback while the application is running. The application blocks and waits for the Music Picker to be closed before continuing. No additional handling of the user input is required; on closing the music picker, the selected tracks will be played in the order chosen. The playback of these tracks can then be controlled using the music playback controls below. <br /><br />Note that on iPhone the Music Picker is displayed full-screen while on iPad it is displayed using a &quot;popover&quot; dialog. This is due to the iPad only supporting the picker at standard iPhone resolution. On iPad, as on iPhone and despite the main application screen still being visiable, the application is blocked for the duration of the display of the picker. Touching the screen outside of the picker will dismiss it an cancel any tracks selected. <br /><br />The iPhone supports music playback through the iPod music player (controlling the built-in iPod application) and application music player (play music locally within application). Currently Airplay supports only the first of these options, meaning that changing the playback state, queuing up tracks, etc. will affect the global iPod state when the application is exited. Further Music Picker functionality may be added in a future version of Airplay. <br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-10-14T03:20:13.027-07:00"
}