{
  "ProjectName": "AspNetAjaxControls",
  "Title": "ASP.NET AJAX Controls & Extenders",
  "Description": "A free ASP.NET AJAX control library that has also been submitted to be included within the AJAX Control Toolkit.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A free ASP.NET AJAX control library that has also been submitted to be included within the AJAX Control Toolkit.\n<h2>Current Controls</h2>\rThe following is a list of the controls currently available.  Some of the controls depend on the AJAX Control Toolkit for ASP.NET 3.5 (<a href=\"http://www.codeplex.com/AtlasControlToolkit/Release/ProjectReleases.aspx?ReleaseId=11121\">Version 3.0.20229</a>).<br />\n<h3>Prompt Control</h3>\rThe prompt control builds upon the ASP.NET AJAX framework and derives from the “ScriptControl” server-side class and the “Sys.UI.Control” client-side class.  The prompt control also utilizes extender controls with client-side behaviors.  The prompt control replaces the traditional JavaScript alerts() and confirm() dialogs and mimics the functionality typically exposed in a Windows Form MessageBox.<br /><br />For a complete tutorial on the prompt control visit my blog @ <a href=\"http://www.afteredge.com/blog/post/Prompt-Control-for-ASPNET-AJAX.aspx\">http://www.afteredge.com/blog/post/Prompt-Control-for-ASPNET-AJAX.aspx</a>.<br />\n<h3>UpdatePanel Extender</h3>\rThe UpdatePanelExtender control builds upon the ASP.NET AJAX framework and derives from the &quot;ExtenderControl&quot; server-side class and the &quot;Sys.UI.Behavior&quot; client-side class.  The control includes an easy to use client-side API to trigger UpdatePanel postsbacks from JavaScript and also includes client and server side events to wire-up event handlers during the UpdatePanel postback lifecycle.<br /><br />For a complete tutorial on the UpdatePanelExtender control visit my blog @ <a href=\"http://www.afteredge.com/blog/post/UpdatePanel-Extender-for-ASPNET-AJAX.aspx\">http://www.afteredge.com/blog/post/UpdatePanel-Extender-for-ASPNET-AJAX.aspx</a>.<br /><br />More controls are come.  Feel free to contact me with any questions.<br /><br /><b>Blog:</b> <a href=\"http://www.afteredge.com/blog\">Wallace&#39;s Blog</a> <br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "AJAX,",
  "LastEdited": "2010-09-01T06:58:32.767-07:00"
}