{
  "ProjectName": "ASPNETRSSToolkit",
  "Title": "ASP.NET RSS Toolkit",
  "Description": "ASP.Net RSS Toolkit gives ASP.Net applications the ability to consume and publish to RSS feeds.\r\n\r\n",
  "MovedLink": "https://github.com/IDisposable/ASPNetRSSToolkit",
  "HomeWiki": "<div class=\"wikidoc\"><h2>ASP.Net RSS Toolkit gives ASP.Net applications the ability to consume and publish to RSS feeds.<br /><br /></h2>\r<h2>Features include:</h2>\r<ul><li><span class=\"codeInline\">RssDataSource</span> control to consume feeds in ASP.NET applications\n<ul><li>Works with ASP.NET data bound controls</li>\n<li>Implements schema to generate columns at design time</li>\n<li>Supports auto-generation of columns at runtime (via <span class=\"codeInline\">ICustomTypeDescriptor</span> implementation)</li></ul></li>\n<li>Caching of downloaded feeds both in-memory and on-disk (persisted across process restarts)</li>\n<li>Generation of strongly typed classes for feeds (including strongly typed channel, items, image, handler) based on a feed URL (the toolkit recognizes RSS, Atom and RDF feeds) or a file containing a sample feed. Allows programmatically download (and creation) of feeds using strongly-typed classes.</li></ul>\n<h2>The toolkit includes:</h2>\r<ul><li>Consuming feeds, using:\n<ul><li>Stand-alone command line feed compiler that generates VB.Net or C# code files.</li>\n<li>Build provider for .rssdl file (containing the list of feed URI(s) [including local files])</li>\n<li>Build provider for .rss file (containing feed XML in RSS/Atom/RDF or OPML format)</li></ul></li>\n<li>Support for generation of feeds in ASP.NET application including:\n<ul><li>RSS HTTP handler (strongly typed HTTP handlers are generated automatically by the build providers) to generate the feed.</li>\n<li>RSS Hyper Link control (that can point to RSS HTTP handler) to create RSS links</li>\n<li>Optional secure encoding of user name into query string to allow generation of personalized feeds</li></ul></li>\n<li>Set of classes for programmatic consumption  and generation of RSS feed in a late-bound way, without using strongly types generated classes</li></ul>\n<h2>How-to(s):</h2>\r<ul><li>Consuming feeds: <a href=\"https://aspnetrsstoolkit.codeplex.com/wikipage?title=Consuming%20Feeds&referringTitle=Home\">Consuming Feeds</a></li>\n<li>Producing feeds: <a href=\"https://aspnetrsstoolkit.codeplex.com/wikipage?title=Producing%20Feeds&referringTitle=Home\">Producing Feeds</a></li>\n<li>Feed aggregation: <a href=\"https://aspnetrsstoolkit.codeplex.com/wikipage?title=OPML%20Support&referringTitle=Home\">OPML Support</a></li>\n<li>Feed caching: <a href=\"https://aspnetrsstoolkit.codeplex.com/wikipage?title=Feed%20Cache&referringTitle=Home\">Feed Cache</a></li></ul>\n<h2>Packaging</h2>\rThe toolkit is packaged as an assembly (DLL) that can be either placed in GAC or in ‘bin’ directory of a web site application.  It is also usable from client (including WinForms) applications.<br />RSS Toolkit works in Medium Trust (RssToolkit.dll Assembly either in GAC or in ‘bin’) with the following caveats:\n<ul><li>If the ASP.NET application consumes RSS feeds, the trust level must be configured to allow outbound HTTP requests.</li>\n<li>To take advantage of disk caching, there must be a directory (configurable via AppSettings[&quot;rssTempDir&quot;]) where the trust level policy would allow write access.  However, disk caching is optional.</li></ul>\n<h2>History</h2>\r<ul><li>6/15/2007 New Release (version 2.0.0.0)\n<ul><li>Huge revamp of the project by Piyush Shah <a href=\"http://blogs.msdn.com/shahpiyush/default.aspx\">http://blogs.msdn.com/shahpiyush/default.aspx</a> to support strong-type feed generation. Added support for Atom, RDF. Added OPML aggregation, and schema validation of OMPL sub-feeds. Added ability to serve out feeds as RSS, Atom, RDF or OPML. Now supports qualified namespaces and enclosures. Download manager now can cache to application relative paths  (like the App_Data directory of a web site) to aid in medium trust deployments. Added unit tests via Visual Studio Team Foundation test framework.</li></ul></li>\n<li>3/26/2006 Update (version 1.0.0.1)\n<ul><li>Added MaxItems property to RssDataSource to limit the number of items returned.</li>\n<li>Added automatic generation of &lt;link&gt; tags from RssHyperLink control, to light up the RSS toolbar icon in IE7. For more information please see http://blogs.msdn.com/rssteam/articles/PublishersGuide.aspx</li>\n<li>Added protected Context property (of type HttpContext) to RssHttpHandlerBase class, to allow access to the HTTP request while generating a feed.</li>\n<li>Added generation of LoadChannel(string url) method in RssCodeGenerator so that one strongly typed channel class can be used to consume different channels.</li>\n<li>Fixed problem expanding app relative (~/…) links containing query string when generating RSS feeds.</li></ul></li></ul>\n<h2>Origins</h2>\rThe ASP.NET RSS Toolkit was conceived and created by Dmitry Robsman <a href=\"http://blogs.msdn.com/dmitryr/\">http://blogs.msdn.com/dmitryr/</a> and posted here by permission. Original blog postings:<br />Release 1.0.0.0 <a href=\"http://blogs.msdn.com/dmitryr/archive/2006/02/21/536552.aspx\">http://blogs.msdn.com/dmitryr/archive/2006/02/21/536552.aspx</a><br />Release 1.0.0.1 <a href=\"http://blogs.msdn.com/dmitryr/archive/2006/03/26/561200.aspx\">http://blogs.msdn.com/dmitryr/archive/2006/03/26/561200.aspx</a><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "RSS,ASP.NET,C#,Controls,DAL,Toolkit,Library,Atom,ASP.NET 2.0,widgets,HsLovesIt,RSS toolkit,myfav,ASP.NET RSS,asp.net rss toolkit,HTTP,webcontrol,webcontrols,§ 97.211 ,website,rdf,OPML,BuildProvider,DataSource,sdk,RSSToolKit,respont.ContentType,",
  "LastEdited": "2007-06-15T20:29:18.45-07:00"
}