{
  "ProjectName": "AspNetAjaxPrompt",
  "Title": "Prompt Control for ASP.NET AJAX",
  "Description": "In this control, I set out to breathe new life into the types of alerts, dialogs and prompts that are available to ASP.NET developers.  In ASP.NET web development we are typically limited to what the browser can support.  I am sure that most of us are very familiar with the JavaScript alert() and confirm() dialogs.  They are limited, not customizable, and do not support any rich HTML content. \n\nThe AJAX Control Toolkit introduced a few extender controls such as the “ModalDialog” Extender and the “ConfirmButton” extender.  These solved a few of our common issues, but they were still leaving me wanting for more.  I’ve taken what I’ve learned from using the above techniques and encapsulated them into one very extensible and easy to use prompt control for ASP.NET AJAX. \n\nThe prompt control builds upon the ASP.NET AJAX framework and derives from the “ScriptControl” server-side class and the “Sys.UI.Control” client-side class.  The prompt control also utilizes extender controls with client-side behaviors. \n\nThe Microsoft team did a great job developing the “UpdatePanel” and thought I would borrow a few ideas from this control.  Within the UpdatePanel a developer can setup triggers that would automatically cause an async-postbacks to occur.  With these triggers a ControlID and event were required.  I took a similar approach with the prompt control but instead of tying into server-side events I am tying into client-side events. \n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />In this control, I set out to breathe new life into the types of alerts, dialogs and prompts that are available to ASP.NET developers.  In ASP.NET web development we are typically limited to what the browser can support.  I am sure that most of us are very familiar with the JavaScript alert&#40;&#41; and confirm&#40;&#41; dialogs.  They are limited, not customizable, and do not support any rich HTML content. <br /><br />The AJAX Control Toolkit introduced a few extender controls such as the &#8220;ModalDialog&#8221; Extender and the &#8220;ConfirmButton&#8221; extender.  These solved a few of our common issues, but they were still leaving me wanting for more.  I&#8217;ve taken what I&#8217;ve learned from using the above techniques and encapsulated them into one very extensible and easy to use prompt control for ASP.NET AJAX. <br /><br />The prompt control builds upon the ASP.NET AJAX framework and derives from the &#8220;ScriptControl&#8221; server-side class and the &#8220;Sys.UI.Control&#8221; client-side class.  The prompt control also utilizes extender controls with client-side behaviors. <br /><br />The Microsoft team did a great job developing the &#8220;UpdatePanel&#8221; and thought I would borrow a few ideas from this control.  Within the UpdatePanel a developer can setup triggers that would automatically cause an async-postbacks to occur.  With these triggers a ControlID and event were required.  I took a similar approach with the prompt control but instead of tying into server-side events I am tying into client-side events. <br /><br /><br /><b>Full Control Library has moved to a new project @ <a href=\"http://www.codeplex.com/AspNetAjaxControls\">http://www.codeplex.com/AspNetAjaxControls</a></b><br /><br />All releases require the AJAX Control Toolkit (<a href=\"http://www.codeplex.com/AtlasControlToolkit/Release/ProjectReleases.aspx?ReleaseId=11121\">Version 3.0.20229</a>).<br /><br />For a tutorial on how to use the prompt control, please visit my blog @ <a href=\"http://www.afteredge.com/blog/post/Prompt-Control-for-ASPNET-AJAX.aspx\">http://www.afteredge.com/blog/post/Prompt-Control-for-ASPNET-AJAX.aspx</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax Extenders,ASP.NET 3.5,ASP.NET Ajax,AJAX Control Toolkit,Ajax,Controls,",
  "LastEdited": "2010-09-01T06:59:32.61-07:00"
}