{
  "ProjectName": "AspxChat",
  "Title": "AspxChat - generic MsAjax-based chatting control for ASP.Net 2",
  "Description": "A set of simple web controls, which allow developers to incorporate a real-time chatting functionality into ASP.Net 2.0 applications.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">AspxChat enables developers to incorporate chatting functionality into ASP.Net 2.0 web-applications.<br />\n<h2>Features:</h2>\r\n<ul><li>Uses standard ASP.Net 2.0 <b>Membership</b> functionality to manage users, which allows a seamless integration into existing applications that use Membership without a single line of code</li>\n<li>Utilizes <b>Microsoft AJAX Extensions</b> to present a user interface in asynchronous fashion, that is: without continuous page refreshes</li>\n<li>Provide a simple administrative interface for users in <b>Administrator</b> role</li>\n<li>Provide a generic voting functionality with a Yes/Now poll</li>\n<li>Uses <b>implicit localization</b> feature of ASP.Net 2.0 to present a user interface in different languages (English, Ukrainian and Russian localization included)</li>\n<li>Uses ASP.Net 2.0 <i>Themes</i> feature to fine tune user interface</li>\n<li>Provide a default page with a standard ASP.Net 2.0 <b>Login</b> control to enable using AspxChat as a stand-alone application</li>\n<li>AspxChat is configurable with a standard <b>web.config</b> file (presently only 2 parameters can be customized: history depth and default name for non-authenticated users)</li></ul>\n\n<h2>Limitations:</h2>\r(an outline for further improvements):\n<ul><li>Chat content is refreshed in a non-incremental manner, that is: every time the control is refreshed, aLL chat content (up to the history depth) is transfered through the network.</li>\n<li>Chat data is stored in-memory</li>\n<li>Web controls of AspxChat does not presently use templates to customize a layout of a web controls</li>\n<li>A text box with a current message is not presently emptied after submitting a message.</li></ul>\n\n<h2>Screen shots:</h2>\r\n<img src=\"/projects/AspxChat/3046bd5f-3d6b-4e2a-b5f4-b5b2b2f53298\" alt=\"200707161936-aspxchat-user_poll.jpg\" title=\"200707161936-aspxchat-user_poll.jpg\" /><br /><u>Fig. 1. Logged in user.</u><br /><br />The screen shot above shows a logged in user. There are some messages in the history, one of which the user has entered prior logging in. The list of active users is displayed at right. The question of the poll is displayed at the bottom.<br /><br /><img src=\"/projects/AspxChat/ed802db9-1615-4e6f-a2de-cef928b492ca\" alt=\"200707161943-aspxchat-admin-poll.jpg\" title=\"200707161943-aspxchat-admin-poll.jpg\" /><br /><u>Fig. 2. A logged in user, belonging to <b>Administrator</b> role</u></div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,Chat,ASP.NET 2.0,Membership,",
  "LastEdited": "2007-07-16T09:55:54.21-07:00"
}