{
  "ProjectName": "associatedlistbox",
  "Title": "Associated List Box Control",
  "Description": "A server side control combining list boxes and buttons to move items between lists. This has custom list boxes developed from a user control in ASP.Net website.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nIn ASP.Net, we often need list boxes with a provision to move items between the lists using buttons. We normally end up developing custom controls for this purpose, with its UI elements also handcrafted through custom code in a class. The other approach people\r\n take is to drop list boxes (HTML or ASP.Net Controls) and use jQuery / javascript to move items between the lists. This approach may sound really simple. But, the downside, is when you have to get the selected items on a post back, especially, to retain the\r\n selection on the selection of some other server control, which would initiate a post back. You can also go in for a completely HTML and JavaScript based control, but the drawback is that, once you want to add more than one instance of the control on a page,\r\n you will start facing a whole set of issues with the IDs and events of the control.These are the scenarios which necessitate the presence of a pre-built custom control, which can be simply dragged and dropped onto the UI and use it like other controls, namely\r\n textbox, gridview and so on, byt simply setting some properties and invoking some methods on it. At the same time, any customization required to the control's UI should not involve code and there should be a clear separation between UI and code behind logic\r\n of the control. This control is exactly meant for these purposes. It gives you a strong named assembly (so that you can deploy it in GAC, as well), which can be directly consumed in an ASP.Net project or even in a Share Point project which involves UI (Visual\r\n Web parts and so on). The control can be customized to expose more properties and methods as required. Once the assembly is added to the project, register it in the page using the Register tag and start using it like any other control. I have also provided\r\n a sample ASP.Net web site, whether I have demonstrated the use of the control. Since it is a server control (using Server list boxes and buttons), there will be screen flicker, while posting back. Hence in my web site, I have used it within Update Panel to\r\n avoid the flicker. Hope it is useful.</p>\r\n<p>The following screen shot shows the appearance of the control on a page. Don't worry..;), you can definitely change the UI and styles of the control without much effort.</p>\r\n<p><img src=\"http://download-codeplex.sec.s-msft.com/Download/SourceControlFileDownload.ashx?ProjectName=associatedlistbox&changeSetId=e4b94a73417f442f839c8a651706c529ee095aab&itemId=AssociatedListBox.png\" alt=\"\" width=\"500\" height=\"123\"></p>\r\n<p>Also check out my other Code Plex projects below.</p>\r\n<p><a href=\"https://termsetexporterclient.codeplex.com/\" target=\"_blank\">https://termsetexporterclient.codeplex.com/</a></p>\r\n<p><a href=\"https://invalidspsiteusers.codeplex.com/\" target=\"_blank\">https://invalidspsiteusers.codeplex.com/</a></p>\r\n<p><a href=\"https://masterpagesetter.codeplex.com/\" target=\"_blank\">https://masterpagesetter.codeplex.com/</a></p>\r\n<p><a href=\"https://sp2013masterpagesetterapp.codeplex.com/\" target=\"_blank\">https://sp2013masterpagesetterapp.codeplex.com/</a></p>\r\n<p>Also check out my Office Store App below.</p>\r\n<p><a title=\"Term Set Exporter Office Store App\" href=\"https://store.office.com/term-set-exporter-app-WA104137032.aspx?assetid=WA104137032\" target=\"_blank\">https://store.office.com/term-set-exporter-app-WA104137032.aspx?assetid=WA104137032</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2015-02-18T22:54:16.033-08:00"
}