{
  "ProjectName": "AutoTagging",
  "Title": "Location-based Auto-tagging for SharePoint 2010",
  "Description": "Organize SharePoint 2010 Team Sites and improve putability and hence findability by centrally controlling how content is automatically tagged.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Organize your SharePoint 2010 Team Sites and improve putability and hence findability by centrally controlling&nbsp;how content is automatically tagged (incl. SiteCollection provisioning tool)</strong></p>\r\n<p>Chances are you&nbsp;found this project&nbsp;because you are about to change from a SharePoint environment with just a few site collections to one with many; and that for good reason.</p>\r\n<ul>\r\n<li><strong>IT Governance:</strong> Business requires you to be able to restore a site collection within reasonable time i.e. your site collection should not be any larger than 100 GB\r\n</li></ul>\r\n<ul>\r\n<li><strong>Scalability:</strong> So far you used a single, meaningful managed path e.g. &quot;/marketing/&quot; so you ended up with one site collection per department and now you're looking in a more scalable approach e.g. because the number of sites within a site\r\n collection is rapidly growing </li></ul>\r\n<ul>\r\n<li><strong>Security:</strong> Too many SharePoint groups were created and the day somebody will make an error and allow the wrong people to see the wrong content is not far away anymore e.g. for each of the 400 sites in the site collection you've created three\r\n SharePoints (Owner, Member, Visitor), adding up to 1.200 groups right no </li></ul>\r\n<ul>\r\n<li><strong>Navigation:</strong> The current solution you offer your end users to quickly switch between all the (team and project) sites they are subscribed to needs urgent improvement e.g. users don't appreciate the long list of favorites they saved in Internet\r\n Explorer, especially since naming conventions between sites seem to differ, which adds to the confusion\r\n</li></ul>\r\n<div>If you're impatient and want to skip immediately to a more detailed product description then have a look at the\r\n<em><a title=\"Auto-Tagger and automated Site Collection provisioning for SharePoint 2010 manual\" href=\"http://www.sharepointconsultant.ch/wp-content/uploads/2012/10/Manual-for-Location-based-Auto-tagging-Extension-for-SharePoint-2010.pdf\" target=\"_blank\">user\r\n manual</a>.</em></div>\r\n<div>&nbsp;</div>\r\n<div>A solution can be found when we start approaching the whole thing top-down instead of bottom-up. The latter approach often leads to a &quot;fewer site collections / many sites&quot; environment that sooner or later will run into a brick wall. That it will run into\r\n a brick wall is not a risk as chances of it happening are 100%. Users will start using SharePoint and hence data volume will grow and hence SharePoint's site collection capacity limits (<a href=\"http://technet.microsoft.com/en-us/library/cc262787.aspx#SiteCollection\">http://technet.microsoft.com/en-us/library/cc262787.aspx#SiteCollection</a>)\r\n are never far away. It's bottom up because it looks at the problem of allocating SharePoint sites to end-users from an IT perspective. The top-down approach would be to try and be as flexible as possible and simply offer each (project) team its own site collection\r\n whilst making sure its name nor its location is in anyway meaningful e.g. &quot;/sites/0001&quot; instead of &quot;/marketing/print-media-team/project-site-2012/meeting-workspace&quot;. For all that information can be &quot;stamped&quot; onto the content using metadata.</div>\r\n<div>The power of metadata has been recognized over and over again. Often in combination with the increased findability of your (enterprise) content but on other occasions also with\r\n<strong>record management</strong>,<strong> compliance</strong> and <strong>information life cycle management</strong>. Whilst some metadata is auto-generated and managed by SharePoint, some isn't. If you think of metdata like &quot;Author: John Doe&quot; or &quot;Last modified\r\n date: 01.01.2011&quot; then it's obvious that SharePoint can manage such fields without your help. But other metadata probably has to be applied\r\n<strong>manually </strong>to content by people the moment they save it.</div>\r\n<p>The challenge of the &quot;AS-IS&quot; situation today as described in the preceding paragraph is in the eight-letter word\r\n<strong>manually</strong>. An interesting observation is that people tend to have no problem whatsoever with searching for the right location to save a piece content. However, such a location, often being a deeply nested folder on a shared network drive, comes\r\n with a number of challenges:</p>\r\n<ul>\r\n<li>There is the the risk it's not found by others </li><li>It's one-dimensional i.e. &quot;Product ABC&quot; or &quot;Project XYZ&quot; but sometimes it's about &quot;Product ABC&quot; in the context of &quot;Project XYZ&quot;\r\n</li><li>Its structure is often very local to a department, project, team etc. instead of centrally managed\r\n</li></ul>\r\n<p>The solution for this challenge most probably is a composite one. Some metadata probably is very team specific and can be managed at that level. For example by using SharePoint's location based metadata settings for folders in a document library. However,\r\n other metadata is considered to be relevant for all and may be distributed in the form of content types by SharePoint's content type hub. Still, this solution is yet not 100% waterproof and neither is it satisfying. Clearly with collaborative sites you need\r\n an approach where you <strong>combine the act of provisioning a new SharePoint site or site collection with &quot;enforcing&quot; a minimal set of metadata</strong>. But automated inheritance of SharePoint's managed metadata from a site collection to a site to library\r\n or list down to list items isn't possible out of the box. Finally, with the Location-based Auto-tagging Extension for SharePoint 2010 you can now do exactly just that. Let's briefly sum up the most important and tangible benefits of the<strong> Location-based\r\n Auto-Tagging extension for SharePoint 2010</strong>: <strong>Location-based</strong></p>\r\n<ul>\r\n<li>Users rather save a document in a meaningful location than tag it properly using a centrally managed taxonomy. Now with the Location-based Auto-tagging Extension for SharePoint 2010 you can take (part of) that burden off your users shoulders. You can ensure\r\n that (part of) your company's <strong>centrally managed taxonomy is automatically passed on to site collections, sites and libraries and lists as soon as they're being provisioned</strong>. So if you create a site collection for Project XYZ you can now rest\r\n assured that all content items in that site collection are being tagged as &quot;Project: Project XYZ&quot;. And if &quot;Project XYZ&quot; is executed as a project for Customer ABC you add additional location-based metadata fields e.g. &quot;Customer: ABC&quot; and &quot;Project Type: Customer\r\n Project&quot;. </li></ul>\r\n<p><strong>Auto-Tagging</strong></p>\r\n<ul>\r\n<li>Auto-tagging means that the Location-based Auto-tagging Extension for SharePoint 2010<strong> automatically adds pre-defined metadata</strong> i.e. SharePoint Taxonomy Fields with pre-set values to your content items. Properly tagged content can now be\r\n found much easier as you can leverage existing SharePoint 2010 Server functionality e.g. Metadata based Search Refinement.\r\n</li></ul>\r\n<p><strong>Cross-Site Collection Data Aggregation</strong></p>\r\n<ul>\r\n<li>Now finally with content that is properly tagged with metadata that is centrally managed you can<strong> start aggregating data across site collections</strong>. For example, you can roll-up content by using an optimized search results web part that searches\r\n for Announcements in alle project workspaces for customer projects. Not only would that be a really convincing enhancement to your intranet portal. It could also be the basis for creating\r\n<strong>rich dashboard applications</strong>. </li></ul>\r\n<p style=\"padding-left:30px\">&nbsp; <em>An example of a webpart that does just this will be added&nbsp;begin 2013 to the wiki-page of this project</em>&nbsp;</p>\r\n<p><strong>Central site collection navigation and provisioning</strong></p>\r\n<ul>\r\n<li>At the heart of the Location-based Auto-tagging Extension for SharePoint 2010 you'll find a administration list that allows you to\r\n<strong>centrally provision (and manage) workspaces i.e. site collections</strong>. It's here where you define metadata for the workspace that is then inherited by all its sites and subsequent libraries and lists. You can easily query this list (remotely) to\r\n provide a <strong>custom global workspace directory</strong>. Again, this would be a great enhance for your intranet portal e.g. All Marketing Workspaces.\r\n</li></ul>\r\n<p>The software comes as a single Windows SharePoint Solution Package (.WSP) together with a simple PowerShell Script to install it. As it is a Farm-Solution it is important that installation is conducted by your SharePoint Farm Administator. Since a SharePoint\r\n environment can be highly sensitive, proper testing is essential. Please also take notice of the following statements:</p>\r\n<ul>\r\n<li>This software doesn't not include any third party software </li><li>Neither does it include any propietary software </li><li>Upon removal of the software you can continue using the workspaces created with it\r\n</li></ul>\r\n<p>A user manual is available online here: <a title=\"User Manual for Location-based Auto-tagging Extension for SharePoint 2010\" href=\"http://www.sharepointconsultant.ch/wp-content/uploads/2012/10/Manual-for-Location-based-Auto-tagging-Extension-for-SharePoint-2010.pdf\" target=\"_blank\">\r\nuser manual</a>.</p>\r\n<p><span style=\"color:#000000\"><span style=\"widows:2; text-transform:none; background-color:#ffffff; text-indent:0px; letter-spacing:normal; display:inline!important; font:13px/19px 'Helvetica Neue',Helvetica,Arial,sans-serif; white-space:normal; orphans:2; float:none; word-spacing:0px\">If\r\n you want to show your appreciation and support future development then you can donate here:<span>&nbsp;</span></span><a title=\"Donate\" href=\"http://www.sharepointconsultant.ch/donate/\" style=\"widows:2; text-transform:none; background-color:#ffffff; text-indent:0px; letter-spacing:normal; font:13px/19px 'Helvetica Neue',Helvetica,Arial,sans-serif; white-space:normal; orphans:2; color:#4c81bb; word-spacing:0px; text-decoration:underline\">http://www.sharepointconsultant.ch/donate/</a></span></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "SharePoint 2010,Taxonomy,Tagging,Provisioning,Governance,Putability,Findability,SP2010,",
  "LastEdited": "2012-12-22T10:07:28.783-08:00"
}