{
  "ProjectName": "batterysaver",
  "Title": "BatterySaver",
  "Description": "BatterySaver is a simple application, in C#, that allows laptop users to perform actions based on battery notification events (AC<=>DC).\n\nBatterySaver allows you to control devices, services and processes to reduce battery consumption.  This is especially useful for netbooks.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1><b>Project Description</b></h1>\rBatterySaver is a simple application, in C&#35;, that allows laptop users to perform actions based on battery notification events &#40;AC&#60;&#61;&#62;DC&#41;.<br /><br />BatterySaver allows you to control devices, services and processes to reduce battery consumption.  This is especially useful for netbooks.<br />\n<h1><b>Overview</b></h1>\rThe goal of BatterySaver is to provide a service that can respond to power change notifications by performing any of a set of configurable actions.  BatterySaver is designed to be modular, so additional actions can easily be added. <i>Currently there is no official support for <b>plugins</b>, but it is in the pipeline</i><br />\n<h2>Releases</h2>\r<table><tr><th>Release</th><th>Details</th><th>Status</th></tr>\n<tr><td>Current</td><td><a href=\"https://batterysaver.codeplex.com/releases/view/42803\">Version 1.0</a></td><td>Beta</td></tr></table><br />\n<h2><b>User Interface</b></h2>\rAs of  <a href=\"https://batterysaver.codeplex.com/releases/view/42803\">Version 1.0</a> a GUI is available to configure the actions.<br /><img src=\"/projects/batterysaver/0faaa01e-be6f-42c7-9cc7-b3e3b260f3f4\" alt=\"bs_options.png\" title=\"bs_options.png\" /><br /><br /><img src=\"/projects/batterysaver/107dad77-82ac-4d67-adac-5fe9135d7fab\" alt=\"balloon_tooltip.png\" title=\"balloon_tooltip.png\" /><br /><br /><img src=\"/projects/batterysaver/90213ef9-31f3-4129-a52c-8fcf8f6f866b\" alt=\"context_menu.png\" title=\"context_menu.png\" /><br />\n<h2><b>Actions</b></h2>\rSo what can you do when responding power events out-of-the-box?  You can:\n<ul><li>Start and stop processes;</li>\n<li>Start and stop services; and </li>\n<li>Enable and disable devices</li></ul>\n<br />There is support for profiles (as of <a href=\"https://batterysaver.codeplex.com/releases/view/42500\">Version 0.3</a>) that allows for different configurations.  For instance, you may have an &quot;Airplane Mode&quot; which will disable your wireless adapter, turn off all of the firewall, windows update, anti-virus software services and kill any extraneous &quot;internet&quot; applications, like online storage services.<br />\n<h1><b>Background</b></h1>\rI created this application in response to a lack of any similar application on the market.  I needed something to help preserve the battery life on my netbook when on a long plane ride.  Since, on a plane ride, you can make a lot of assumptions as to the services available (such as no internet), you can disable a lot of unnecessary processes, services and devices.<br /><br />I searched for a solution, but came up empty.  There are a lot of applications to show you how much battery life you have remaining (as if the built-in indicator is insufficient).  I&#39;m sure there are vendor-specific applications that can execute scripts during power transitions, but they are likely limited in scope to cater to less saavy users.<br /><br />Lastly, if nobody finds this useful, so be it :)  I find it useful and figured I would share it with the community.<br />\n<h1>Feedback</h1>\rWe&#39;re looking for feedback!  Please head over to <a href=\"http://batterysaver.uservoice.com\">http://batterysaver.uservoice.com</a> and submit, or vote for, features; anything is welcome.  If your feature is unique and is incorporated, you will be given credit in the application.<br />\n<h1>Contributions</h1>\rAll contributions are welcome.  Just create a fork and submit a pull request.  Any fork that addresses an issue in the Issue Tracker has a high likelihood of being accepted.</div><div class=\"ClearBoth\"></div>",
  "TagList": "battery,power,c#,laptop,netbook,conservation,",
  "LastEdited": "2010-04-07T05:01:01.223-07:00"
}