{
  "ProjectName": "BizTalkControlCenter",
  "Title": "BizTalk Control Center (BCC) - 3.2",
  "Description": "BizTalk Control Center (BCC) is a remote BizTalk monitoring and management application. BCC can be used to deploy, monitor and administer BizTalk Artifacts. There have been 3 major releases since April 2011. I am looking forward to make another release during the fall of 2011. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>BizTalk Control Center (BCC) </h1>\rBizTalk Control Center &#40;BCC&#41; is a remote BizTalk monitoring and management application. BCC can be used to deploy, monitor and administer BizTalk Artifacts. There have been 3 major releases since April 2011. I am looking forward to make another release during the fall of 2011. <br />\n<h1>BizTalk Control Center (BCC) Monitoring System</h1>\r<table><tr><th> BizTalk Control Center (BCC) Agent Monitoring System </th></tr>\n<tr><td> <img src=\"/projects/BizTalkControlCenter/e99cb9e7-1b92-4dd2-bfde-902f13f9ac2c\" alt=\"BCC_MonitoringSystem_Small.jpg\" title=\"BCC_MonitoringSystem_Small.jpg\" /></td></tr></table>\n<h1>Top five reasons to use BizTalk Control Center (BCC)</h1>\r<ul><li>BizTalk artifacts can be monitored, administered and managed remotely.</li>\n<li>Tracking system enabled the admin to keep track of changes to BizTalk artifacts.</li>\n<li>Easily manage BizTalk artifact deployment and use the verification system to check successful deployment.</li>\n<li>SSO module helps the BizTalk admin to edit/create SSO settings on the fly and enables to keep all the configuration information at a central location.</li>\n<li>Create new hosts and host instances with ease. (Server Admin permissions must be provided)</li>\n<li>Bonus : You dont have to pay a dime.</li></ul>\n\n<h1>Where do I start?</h1>\r<ol><li><b>Binaries</b> - Download the *.zip file which contains the Binaries and SQL scripts</li>\n<li><b>Source Code</b> - The source code is located at GitHub.com <a href=\"https://github.com/navkar/BizTalkControlCenter\">https://github.com/navkar/BizTalkControlCenter</a></li>\n<li><b>Installation Guide</b> - Download the installation guide which contains the step-by-step procedure to install BCC.</li>\n<li><b>User Guide</b> - Download the user guide which lists the various modules and its use.</li></ol>\n\n<h1>Related projects of interest</h1>\r<ul><li>Personal Task Tracker (PTT) - <a href=\"http://tasktracker.codeplex.com/\">http://tasktracker.codeplex.com/</a></li>\n<li>BizTalk Auditing Framework - <a href=\"http://biaf.codeplex.com/\">http://biaf.codeplex.com/</a></li></ul>\n\n<h1>Source Code</h1>\rThe source code has been moved to GitHub.com at <a href=\"https://github.com/navkar/BizTalkControlCenter\">https://github.com/navkar/BizTalkControlCenter</a><br />\n<h1>Developers/Contributors</h1>\r<h2>Naveen Karamchetti</h2>\rNaveen has done his Masters (M.S.) in Computer science, has started his career programming the mainframes and now has more than a decade of programming, development and design experience. Naveen has a sharp eye and keen observation skills. Naveen has worked for several companies and strived hard to build large scale business applications and bringing better solutions to the table. Quite recently Naveen has built a fairly complex integration platform for large bank based out of San Francisco. His hobbies include training, mentoring and research. Naveen spends his free time visiting National Parks nationwide.<br />\n<h2>Kutub Shikora</h2>\rKutub has done his Masters degree in Engineering from Indian Institute of Technology, Delhi (IIT). Kutub is passionate about technologies related to web, database and mobile devices. Kutub has worked on web based applications in capacities ranging from a developer to architect for various clients including Fortune 100 companies in Banking, Retail, Pharmaceutical, Education, Aviation, and Utilities domains. Kutub has an eye for details and curiosity to learn different things. Kutub is interested in creating a platform to provide all the available free services over the internet as a platform for Small Businesses. When not working, Kutub spends time with his family. He likes to travel, watch movies and just started exploring Rubik&#39;s cube. <br /><br />Keywords : BizTalk monitoring, remote, admin, tool, web based interface, BizTalk Server 2006 2006 R2 2009 2010 Orchestrations, Send ports, receive locations pipeline, schema</div><div class=\"ClearBoth\"></div>",
  "TagList": "BizTalk Tools,BizTalk,Biztalk monitoring,BizTalk 2009,BizTalk documenter,biztalk 2010,BizTalk Deployment,ENT SSO,BizTalk Server 2013,2013 R2,Azure,BizTalk Azure,",
  "LastEdited": "2014-09-01T13:39:08.283-07:00"
}