{
  "ProjectName": "BotTorrent",
  "Title": "BotTorrent",
  "Description": "BotTorrent - a lightweight C# BitTorrent Client using the Monotorrent bittorrent engine and the smartirc4net IRC library.\n\nThis BitTorrent client has unique features are not found in any other  clients:\n\n     -Native windows service\nNo third party application is needed to get it to run as a service. It just installs as a service and loads its configuration from an easy to use XML Configuration file. There is no GUI whatsoever. \n     -RSS downloader\nConfigure as many RSS feeds as you wish within the configuration file. The bot will automatically download torrents, and can match desired torrents using regex expressions.\n     -IRC Bot\nThe service sends a bot to configured irc server. From the irc channel, commands can be issued to download and start torrents, show statistics, perform bandwidth speed tests etc etc. If it is impossible to configure port forwarding for your home internet connection and therefore stopping you from using a web interface, the irc bot is a great alternative method to administer your torrents remotely!\n\nThe IRC bot feature is also perfect for people that are in release groups. Control all the members in your release group from one central point. Recruit people to donate bandwidth helping you to release your files. Install the service on your friends and families' PC's to help the BitTorrent network!\n\nThe IRC bot gives you the potential to control thousands of BitTorrent clients from one central location. Thanks to the Event driven irc engine SmartIrc4Net, it is easy to code additional irc bot functions......\n\n\nPlanned future features.........\nBuild upon existing irc bot commands.\nHttp interface so I can learn about webservices :)\nPlugin system?\nEmail notifications\nGUI frontend, using IP.\n\n\n\n\n\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />BotTorrent - a lightweight C&#35; BitTorrent Client using the Monotorrent bittorrent engine and the smartirc4net IRC library.<br /><br />This BitTorrent client has unique features are not found in any other  clients&#58;<br /><br />     -Native windows service<br />No third party application is needed to get it to run as a service. It just installs as a service and loads its configuration from an easy to use XML Configuration file. There is no GUI whatsoever. <br />     -RSS downloader<br />Configure as many RSS feeds as you wish within the configuration file. The bot will automatically download torrents, and can match desired torrents using regex expressions.<br />     -IRC Bot<br />The service sends a bot to configured irc server. From the irc channel, commands can be issued to download and start torrents, show statistics, perform bandwidth speed tests etc etc. If it is impossible to configure port forwarding for your home internet connection and therefore stopping you from using a web interface, the irc bot is a great alternative method to administer your torrents remotely&#33;<br /><br />The IRC bot feature is also perfect for people that are in release groups. Control all the members in your release group from one central point. Recruit people to donate bandwidth helping you to release your files. Install the service on your friends and families&#39; PC&#39;s to help the BitTorrent network&#33;<br /><br />The IRC bot gives you the potential to control thousands of BitTorrent clients from one central location. Thanks to the Event driven irc engine SmartIrc4Net, it is easy to code additional irc bot functions......<br /><br /><br />Planned future features.........<br />Build upon existing irc bot commands.<br />Http interface so I can learn about webservices &#58;&#41;<br />Plugin system&#63;<br />Email notifications<br />GUI frontend, using IP.<br /><br /><br /><br /><br /><br /><br /><br /><br />I am coding this all on my own and would love some help so I can learn C#. Please let me know if you wish to help or if you have any good ideas.</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,mono,irc,bot,BitTorrent,Torrent,BotTorrent,",
  "LastEdited": "2007-09-08T13:30:31.32-07:00"
}