{
  "ProjectName": "C4FDevKit",
  "Title": "C4F Developer Kit",
  "Description": "The C4F Developer Kit is a collection of components, controls and samples in both Visual Basic and Visual C#.  The features of the kit include a single installation file that provides users easy access off the Windows Start Menu to the documentation, sample executables and source code; a toolbox entry within Visual Studio for all components and controls for easy drag 'n drop experience.\n\nThe Coding4Fun Developer Kit provides the following additional features:\n- all components and controls source code are provided in both Visual Basic and Visual C#\n- QuickStart documenation is provided\n- sample projects are provided with their source code (in Visual Basic and Visual C#) plus executable\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><img src=\"/projects/C4FDevKit/46fd8385-7d00-4b97-af5b-1c8abfe60c0b\" alt=\"c4fdevkit_subheader.jpg\" title=\"c4fdevkit_subheader.jpg\" /><br /><b>C4F Developer Kit</b> project was created to demonstrate the power and ease of creating fun, cool applications with the new <b><a href=\"http://www.microsoft.com/express\">Visual Studio 2008 Express Editions</a></b>.  The kit features include drag ‘n drop controls and components, SmartTags, Visual Basic and Visual C# source code for all tools and samples as well as complete QuickStarts and APIs documentation.  For more information on this project, visit the <b><a href=\"http://go.microsoft.com/?linkid=7653522\">C4F Developer Kit</a></b> home page on the Visual Studio 2008 Express Web site.  Addtionally, we&#39;ve created the <b><a href=\"http://go.microsoft.com/?linkid=7653521\">C4F Vista P2P Toolkit</a></b> for adding peer-to-peer functionality to WinForm and WPF applications.<br />\n<h2>Communication</h2>\r<ul><li>Bluetooth – implements 3 profiles: Serial Port, File Transfer and Object Push;  plus provides Device Discovery and Service Discovery features of Bluetooth </li>\n<li>Messaging – this collection provides developers an easy to use set of tools and easy to follow documentation to create applications that use SMTP and POP3 features for emailing</li></ul>\n<img src=\"/projects/C4FDevKit/dd0807bc-848d-49b2-9063-f109992e1378\" alt=\"Email.jpg\" title=\"Email.jpg\" />\n<h2>Windows Vista APIs</h2>\r<ul><li>Windows Vista Contacts – abstraction of the Windows Contacts API allowing developers to use Windows Vista’s Contacts data store plus support for importing and exporting vCards, searching for contacts and many more features</li>\n<li>Windows Vista Calendar - the Calendar controls and sample application shows examples of interacting with and manipulating Windows&#174; Vista Calendar through an easy-to-use interface</li>\n<li>Preview Handler – allows developers to resolve predefined file types such as Microsoft Word , Visual Basic and Visual C# source files, images and many others in their own applications; create your own Windows Explorer with simple drag ‘n drop controls</li></ul>\n<img src=\"/projects/C4FDevKit/7c27b7c2-65d9-45cc-af7b-c5e86fe74b0f\" alt=\"Calendar.jpg\" title=\"Calendar.jpg\" />\n<h2>Utilities</h2>\r<ul><li>Telephony - the Telephony API provides methods which enable applications to make and receive telephone calls, send and receive digits using DTMF, and record and play back calls</li>\n<li>Power Management – gain access in a simple way to cool Windows Vista Power Management features like rebooting, hibernating and locking a computer; get battery status on a laptop too </li>\n<li>Windows Desktop Search – provides developers an easy way to create applications that use the built-in features of Windows Search; includes built-in quick search types for common file types like Microsoft Word, Microsoft Excel and images plus many more</li>\n<li>Windows Vista Picture Acquisition – exposes simple to use series of methods and properties to acquire pictures and videos from common devices like digital cameras</li></ul>\n<img src=\"/projects/C4FDevKit/f634e75a-f768-4f92-912f-12ce81502f45\" alt=\"TAPI.jpg\" title=\"TAPI.jpg\" />\n<h2>Web Services</h2>\r<ul><li>Yahoo Traffic </li>\n<li>Flickr </li>\n<li>MySpace </li>\n<li>Amazon.com </li>\n<li>Craig&#39;s List </li>\n<li>Delicious </li>\n<li>Digg </li>\n<li>YouTube</li></ul>\n<img src=\"/projects/C4FDevKit/1f087b09-4997-4543-be11-a0aa8e61a453\" alt=\"WebServices.jpg\" title=\"WebServices.jpg\" />\n<h2>C4F Dashboard</h2>\r<img src=\"/projects/C4FDevKit/b5a90642-718b-4efd-81b8-7457d9cdd004\" alt=\"C4FDashboard.jpg\" title=\"C4FDashboard.jpg\" /><br /><br /><b>NOTE:</b> The C4F Developer Kit has been tested against the RTM version of <a href=\"http://www.microsoft.com/express\">Visual Studio 2008 Express Editions</a> and on Windows Vista.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Vista,bluetooth,Controls,API,Library,Contacts,Coding4Fun,Samples,devtools,sdk,Coding4Fun Developer,Developer Kit,coding examples,code samples,express-editions,lakewoodfan,code4fun,43534,install,C4F Developer Kit,.NET Samples,vista contacts,",
  "LastEdited": "2007-11-19T07:44:29.917-08:00"
}