{
  "ProjectName": "cafechess",
  "Title": "Chess Control Library",
  "Description": "Chess Control and Parsers\nHandles pgn files, FEN position strings and my own compact huffman position data.\nAdded something I call DFEN which stands for Diagram FEN for persisting arrows etc displayed on the board. Support for Winboard / UCI engines; moved from sourceforge\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Chess Control and Parsers<br />Handles pgn files, FEN position strings and my own compact huffman position data.<br />Added something I call DFEN which stands for Diagram FEN for persisting arrows etc displayed on the board. Support for Winboard &#47; UCI engines&#59; moved from sourceforge<br /><br /><br />I&#39;ve decided to renew my interest in the Chess board control I originally started a few years ago. A developer in Germany saw the original (very weak) article on the Code Project, contacted me and thus we produced <a href=\"http://www.chesspositiontrainer.com\">http://www.chesspositiontrainer.com</a>. We have since become very good friends.<br /><br />The code distributed here is slightly newer than what is present in the last version of ChessPositionTrainer. The main area&#39;s I&#39;d like to finish up are full suport of UCI engines which is partially implemented. Winboard engine support currently exists.<br /><br />Two demo projects are included:<br />1) Cafechess.ChessImageEditor - allows you to design chess board diagrams that can be copied into memory or saved to disk based.<br />2) Cafechess Demo Application - not too pretty, but demonstartes most of the features of the control.<br /><br />There are a lot of features in the control including: Edit postion control, Drawing arrows, circles, and X&#39;s, standard move validation, change board colors, and more....<br /><br />Press the following Keys:<br />&#39;Alt + F9&#39; turns on major piece square highlights when a major piece is dropped on a square.<br />&#39;Alt + F10&#39; turns on attack square highlighting and locks it for the current side to move.<br />&#39;Alt + F11&#39; turns on attack square highlighting for the side not to move.<br />&#39;Alt + F12&#39; turns on square control highlighting for the side not to move (doesn&#39;t yet handle doubled rooks or bishops).<br />&#39;Ctrl + a&#39; click left mouse button on start sqare drag to destination square release button and an arrow is drawn on top layer.<br />&#39;Ctrl + c&#39; click left mouse button on a square and a circle is drawn on top layer.<br />&#39;Ctrl + x&#39; click left mouse button on a square and a X is drawn on top layer.<br />&#39;Ctrl <u> Alt </u> &#39; any a,c,x produces that mark on the middle layer (between board and pieces)<br />&#39;Ctrl <u> C&#39; key in Cafechess.ChessImageEditor will copy the current image into memory for use later by &#39;Ctrl </u> V&#39; key for pasting the image into programs like Word, Email or Paint.<br /><br />Cheers,<br /><br />Gregory A. Prentice</div><div class=\"ClearBoth\"></div>",
  "TagList": "Chess,PGN,Bitboard,",
  "LastEdited": "2009-01-03T13:05:28.077-08:00"
}