{
  "ProjectName": "CallBackWebcontrols",
  "Title": "CallBack WebControls",
  "Description": "The Callback is among the novelties of the ASP. Net 2.0.\nshows the power of callback combined with javascript methods can make the Asp.net application more lighter. \nupdate a specific control in the page and not the entire page without using AJAX",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The Callback is among the novelties of the ASP. Net 2.0.<br />shows the power of callback combined with javascript methods can make the Asp.net application more lighter. <br />update a specific control in the page and not the entire page without using AJAX<br /><br /><b>Complete Article @ CodeProject</b>: <a href=\"http://www.codeproject.com/KB/webforms/CallBackWebControls.aspx\">http://www.codeproject.com/KB/webforms/CallBackWebControls.aspx</a><br />\n<h1>Introduction</h1>\rIn this article, I present another aspect of communication in the Asp. Net 2.0, named &quot;CallBack” and how it can be used for a web application asp.net soft light and especially preformative.<br /><br />For this I created a set of &quot;WebControls&quot; based on the &quot;CallBack&quot; not on &quot;PostBack&quot; but that works exactly like the standard controls of Asp.net 2.0<br /><br />I will first start by explaining important concepts for understanding the article and finally I&#39;ll show you an example in practice<br /><br /><br />\n<h1>CallBack ? </h1>\r\nThe Callback is among the novelties of the ASP. Net 2.0, it can communicate with the server without posting the whole page ..<br /><br />The difference between Callback and postback is that in the PostBack whenever you click a button, all the HTML of the page and its controls is regenerated (Render).<br />By cons in the callback is not the case and it is very important! Why regenerate all the HTML page? Is it important to do? when I just want to add a row in my GridView (for example).<br /><br />So for a web application slightly, the &quot;Render&quot; of a control should be targeted and not overall ..<br /><br />I mean no need to generate all the html code of the page and its controls.<br /><br />You can use &quot;Ajax control&quot; but I do not know the code generated behind, so I can control what happens in my application.<br /><br />\n<h1>Sample</h1>\rIn this Demo there is 4 controls in the page, each of them update another Asp.net standard control:<br /><br /><img src=\"/projects/CallBackWebcontrols/700ce45b-4449-4f25-b630-210c5e137e49\" alt=\"sample.jpg\" title=\"sample.jpg\" /><br />\n<ul><li> <b>AEDropDownList changes the backcolor  of the Asp.net button</b></li>\n<li> <b>The AEbutton (Check/Incheck) the Asp.net Checkbox</b></li>\n<li> <b>The AEChechbox makes the Asp.net Textbox Readonly</b></li>\n<li> <b>The AETextbox changes the Text of the Asp.net button</b></li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,ASP.NET,C#,Controls,javascript,Visual Studio,webcontrols,callback,",
  "LastEdited": "2010-01-12T04:17:44.203-08:00"
}