{
  "ProjectName": "ccgtoolkit",
  "Title": "CCG Toolkit",
  "Description": "A suite of applications (web and client based) including a database used in to create/view/modify decks and rulings with the Yu-Gi-Oh! trading card game. Data is structured to be expandable into other collectible card games (CCGs).\n\nUses SQL 2005, WinForms, ASP.Net AJAX, WPF.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A suite of applications &#40;web and client based&#41; including a database used in to create&#47;view&#47;modify decks and rulings with the Yu-Gi-Oh&#33; trading card game. Data is structured to be expandable into other collectible card games &#40;CCGs&#41;.<br /><br />Uses SQL 2005, WinForms, ASP.Net AJAX, WPF.<br /><br /><b>Note</b><br />If you&#39;re looking to simply run the program, download the binaries, found at <a href=\"http://ccgtoolkit.codeplex.com/releases/view/52394\">here</a>, which is built using the WIX installer platform. <br /><br />It is highly recommended that you go to the Releases section instead of using the standard download link, since there are multiple files needed to compile and run this project.<br /><br />Note: I&#39;m still working on getting a one of the larger files (the master SQL Database) trimmed to fit within upload guidelines. I&#39;ll keep you posted.<br />Note: Deck Studio source is now available.<br /><br /><b>History</b><br />Here&#39;s the back story surrounding the CCG Toolkit:<br /><br />About 2004, I became involved with a team developing a suite of applications to assist players and judges with the Yu-Gi-Oh trading card game. Over time these tools became known as the Netrep website, RONIN rulings tool, and Deck Studio deck creation/analysis program. They were written using the .Net Framework in its various formats (ASP.Net / AJAX, WinForms, WPF for managing the database). While I was the original author of only the Deck Studio application, I eventually took control of the entire &quot;suite&quot; and rewrote some of the components and restructured the database to be expandable to other collectible card games (CCGs.)<br /><br />The tools were quite successful. It is regrettable that I had to stop the projects, but fortunately one group of folks have continued to keep the Netrep website running, and I have received inquires about how the application is structured by those looking to implement features in their own applications. I have had my own thoughts about pulling this code out again to update for a new CCG (Legend of the Five Rings) but the time is unavailable for me currently.<br /><br />Some of this code spans 5 years of working on the CCG Toolkit project and can be quite messy at times. I was in the process of upgrading things and starting fresh in most areas, but it just never quite happened. So be prepared for a few weird things out there and if you&#39;re in a bind, shoot me the code snippet and I&#39;ll see if I can make heads or tails of it for you since the documentation is quite sparse in most places.<br /><br />With that said, I tip my hat to you and wish you the best of luck. Hopefully this code will give you a good springboard for your own application, or provide a helpful reference in structuring your own applications.</div><div class=\"ClearBoth\"></div>",
  "TagList": "CCG,winforms,WPF,Ajax,SQL Server 2005,Database,Organizer,search engine,",
  "LastEdited": "2010-11-11T06:36:52.357-08:00"
}