{
  "ProjectName": "cfcontrols",
  "Title": "OpenNETCF WinForms Controls",
  "Description": "OpenNETCF Calendar Controls provide a Month View, Week View and Agenda View similar to what is used in the Pocket Outlook Calendar application. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Calendar Controls</h1>\r\nMost .NET Compact Framework compatible calendar controls aren&#39;t very feature rich. OpenNETCF Calendar Controls provide a Month View, Week View and Agenda View similar to what is used in the Pocket Outlook Calendar application. <br /><br />With the OpenNETCF Calendar Controls you can integrate calendaring functionality right within your application. The controls are completely customizable using the Visual Studio designer and you can also customize the painting through special events while the controls are being rendered.<br /><br /><img src=\"/projects/cfcontrols/b6206b8e-ccc3-4cb0-a7f7-1b47c4fa2006\" alt=\"calendar.gif\" title=\"calendar.gif\" /><br />\n<h1>PopupMenu Control</h1>\r\nPopup Menu Control brings the possibility for Windows Mobile and Windows CE developers to create a custom and professionally looking Context Menus in their applications within the Visual Studio 2005 environment. Since the Popup Menu Control is built on a top of the native menu implementation, it provides a great visual performance for a custom menus created by developers. <br /><br />Along with the built-in icon style for the menus, the Popup Menu Control allows the creation of owner-drawn menus that could be defined by developers themselves, providing an unparallel flexibility and control all within the Visual Studio 2005 design time environment. <br /><br />The following are some examples uses of the control:<br /><br /><img src=\"/projects/cfcontrols/213036bd-394b-4694-a97d-c1a5a8073e1a\" alt=\"popupmenu.gif\" title=\"popupmenu.gif\" /><br /><br />The following is an example of creating a gradient style context menu:<br /><br /><img src=\"/projects/cfcontrols/4b39b2fa-8a74-4834-b722-2754e715af13\" alt=\"popupmenugradient.png\" title=\"popupmenugradient.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-08-26T06:16:35.783-07:00"
}