{
  "ProjectName": "CheckBoxValidator",
  "Title": "ASP.NET CheckBox Validation Control for .NET v2.0 & .NET v3.5",
  "Description": "An actual ASP.NET checkbox validator you can throw in your toolbox.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Sadly Microsoft has never included a validation control the CheckBox control. Yet, why would they? A checkbox is to select an option and in a sense it is always optional. I see no fault in this logic.<br /><br />However, there is a comment element found in web applications which require you to check a box to indicate that you agree to certain terms and services. I am sure over 80% of web developers have had to do this at some point in time and if you haven&#39;t, you will eventually.<br /><br />Yet again Microsoft is not at fault even though it is a commonly used method. Why? Easy, it is a design choice and there are many other options for achieving this.<br /><br />Even still, it is a design choice that many might not have full say over or do not have a compelling enough reason to sway others away from this choice. So we are forced to spend too much time coming up with or finding a solution. Luckily you will find many. However none that I have come across offer a solution you can actually throw in your toolbox with the rest of the validators.<br /><br />That is where this control steps in to fill that void while at the same time allowing you to make any modifications to it by providing the source code. Hopefully this will have saved many developers time wasted on something so trivial.<br /><br />It would be nice if a control such as this came with Visual Studio out of the box. However until it happens if it does at all you can now use this validator which works just like the rest of them.<br /><br /><br />Gregory Kornblum - <a href=\"http://www.tensailabs.com/\">Tensai Labs</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "checkbox,validator,validation,ASP.NET,control,toolbox,server control,RETURN 2010,",
  "LastEdited": "2008-11-30T14:17:38.203-08:00"
}