{
  "ProjectName": "cheescloth",
  "Title": "Cheescloth Security Monitor",
  "Description": "Cheescloth is a security script that is used to monitor and block email being brute force sent to your mail server by zombie machines in control by spammers and",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>Cheescloth is a security script that is used to monitor and block email being brute force sent to your mail server by zombie machines in control by spammers and hackers. It also will catch and block hackers trying to hack your server via SSH connections.<br>\r\n<br>\r\nThis project first started out as a simply script. It then grew into what it is now. I wrote it because I was tired of having my log files fill up with brute force zombie mailers sending requests for sendmail to deliver email to users who did not exists. I\r\n was also tired of the ssh hacking attempts trying to hack user accounts. Most of these are from people's personal computers who are infected with a Trojan that are under the control of a remote spammer or hacker.<br>\r\n<br>\r\nIf you think about it...<br>\r\n<br>\r\n- Server resources are wasted with all these request. This is also a security hazard as this method of brute force mailing can be used to compile a list of which users do exist on your server so that they can be spammed or hacked in the future.\r\n<br>\r\n<br>\r\n- Cheescloth will help protect the server by adding these brute force mailers,ssh hacking attempts,RBL rejection,and FQDN rejections and add them to your iptables firewall rules dropping the packets even before they get to call sendmail 100 zillion times. This\r\n will not allow any packets to be sent to your server from a flagged ip for the next 4 hours if you are running the default version of cheesecloth.\r\n<br>\r\n<br>\r\n- Cheescloth protects from TOR NETWORK connections. When ip addresses are rotated every hour cheescloth will download a new ip list from the TOR NETWORK and add them to your firewall as well. You can easily comment out this if you would like to turn it off.\r\n<br>\r\n<br>\r\n- Cheescloth is developed under the slackware linux distribution. It should run under all flavors of linux and unix. Most of utils you need to have installed come installed as default on the majority of all unix distributions.\r\n<br>\r\n<br>\r\n- Cheescloth monitors what email address are being spam to so to help system admins know what user name NOT to assign. It will also allow you to narrow in what ip's should probably be banned permanently in your firewall if you are being attacked.\r\n<br>\r\n<br>\r\n- Don't have your log files fill up and your system resources wasted by the same annoying spammer over and over even if they are being rejected by your favorite RBL.\r\n<br>\r\n<br>\r\nIf you change it to work with a different distro of linux and or a different smtp program, or firewall, please email us a copy,.</p>\r\n<p>&nbsp;</p>\r\n<p>Here is a screen shot of the stats pages.</p>\r\n<p>&nbsp;</p>\r\n<p><img src=\"http://www.lewisindustriesinc.com/c1.jpg\" alt=\"First page of stats\" width=\"839\" height=\"694\"></p>\r\n<p><img src=\" http://www.lewisindustriesinc.com/c2.jpg\" alt=\"Page 2 of stats\" width=\"839\" height=\"710\"><br>\r\n<br>\r\n<img src=\" http://www.lewisindustriesinc.com/count3.jpg\" alt=\"Page 3 of stats\" width=\"839\" height=\"697\"><br>\r\n</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "hacking,security,spam,firewall,hacker detection,postfix,sendmail,iptables,",
  "LastEdited": "2014-02-11T09:46:01.567-08:00"
}