{
  "ProjectName": "circleanimation",
  "Title": "Silverlight Circle Animation",
  "Description": "Circle Animation is a Silverlight control that allows you to animate objects over a curve.  Using the built-in designer, all you have to do is drag your start and end points on the screen and set your angle, and your controls will be moving along curves!",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Circle Animation is a Silverlight control that allows you to animate objects over a curve.  Using the built-in designer, all you have to do is drag your start and end points on the screen and set your angle, and your controls will be moving along curves&#33;<br /><br />The idea is that if you want a UIElement to be animated over a curve from point A to B, all you have to do is define an angle that carves the arc of the path between the two.  In other words, visualize a circle that both points lay on, and an angle to define how sharp the arc is.  For example, if you want to go from point A to B, over a curve that would be from the &quot;top&quot; of a circle to the &quot;bottom,&quot; the angle would be 180 degrees.  <br /><br />All you have to do is dump a CircleAnimation user control into your Silverlight app, and wire it up to a UIElement to animate.  CircleAnimation also ships with a &quot;run-time&quot; designer that allows you to put the control in &quot;Design&quot; mode.  In Design mode, just click on a UIElement that&#39;s a child of a canvas, drag around the start and end points, and set the angle.  You can then watch what your animation will do!<br /><br />Best of all, CircleAnimation generates the XAML you need to place back in your user control: no guesswork needed to animate over a curve!<br /><br />Read my <a href=\"http://chrisdomino.com/blog/post/Silverlight-Circle-Animation-Animate-Any-UIElement-Over-A-NOT-Bezier-Curve\">blog</a> for all the details, updates, etc.<br /><br />Here&#39;s what it looks like:<br /><br /><img src=\"/projects/circleanimation/7d8b4837-b002-40f3-89ea-67155c687876\" alt=\"CircleAnimation.jpg\" title=\"CircleAnimation.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Silverlight 2,Animation,Circle,Curve,",
  "LastEdited": "2009-06-08T09:42:55.903-07:00"
}