{
  "ProjectName": "classifiedcabinet",
  "Title": "Silverlight Classified Cabinet",
  "Description": "The Silverlight Classified Cabinet is a component that makes it easier to show classified items in a nice way. With the power of Silverlight, it lets users zoom and drag the items, categorize them into shelves and see detailed view. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>The Silverlight Classified Cabinet is a component that makes it easier to show classified items in a nice way. With the power of Silverlight, it lets users zoom and drag the items, categorize them into shelves, filter and see detailed view. It can be used\r\n in wide range of scenarios like product showcasing, bookshelf, etc. The idea for this control grew out of the widely popular\r\n<a href=\"http://www.silverlightshow.net/books.aspx\" target=\"_blank\">SilverlightShow bookshelf</a> which turns out to attract people attention quite a lot. With this component we converted the bookshelf to a more generic control that you can use in your application.</p>\r\n<p><a title=\"View Demo\" href=\"http://bookshelf.silverlight.bg/\" target=\"_blank\"><img title=\"Bookshelf\" src=\"http://download.codeplex.com/download?ProjectName=classifiedcabinet&DownloadId=211468\" border=\"0\" alt=\"Bookshelf\" width=\"946\" height=\"561\" style=\"padding-left:0px; padding-right:0px; display:inline; padding-top:0px; border-width:0px\"></a>\r\n<br>\r\n<br>\r\nSee a <a title=\"Bookshelf Demo\" href=\"http://bookshelf.silverlight.bg/\" target=\"_blank\">\r\ndemo</a> of how this controls looks like and behaves.</p>\r\n<h2>What's new</h2>\r\n<ul>\r\n<li>The ClassifiedCabinet project is now available on <a title=\"NuGet\" href=\"http://nuget.org/List/Packages/ClassifiedCabinet\" target=\"_blank\">\r\nNuget</a>! This makes adding a reference to the assembly as simple as typing &quot;<em>Install-Package ClassifiedCabinet</em>&quot;.\r\n</li><li>You can now use the new <strong>item template</strong> for Visual Studio. To start using the control you can just select Add -&gt; New Item and choose the new template &quot;CompletIT ClassifiedCabinet User Control&quot; which will add to your project a fully set\r\n ClassifiedCabinet control that you could just adapt to your needs. </li></ul>\r\n<h2>How can I use this control?</h2>\r\n<p>To help you start using this control we have prepared a number of articles published on SilverlightShow.</p>\r\n<ul>\r\n<li><a title=\"ClassifiedCabinet – A Quick Start\" href=\"http://www.silverlightshow.net/items/ClassifiedCabinet-A-Quick-Start.aspx\" target=\"_blank\">ClassifiedCabinet &ndash; A Quick Start</a>\r\n</li></ul>\r\n<p><em>More articles to come in the following weeks.</em></p>\r\n<h2>Samples</h2>\r\n<p>We have prepared a sample project to demo how to use the control in your application. Along with it, we also included a sample admin application that lets you manage the items in your cabinet. We plan to extend these samples in the coming weeks to show you\r\n different scenarios where you may find this component useful.</p>\r\n<ul>\r\n<li>Bookshelf &ndash; See <a title=\"Bookshelf Demo\" href=\"http://bookshelf.silverlight.bg/\" target=\"_blank\">\r\ndemo</a>, <a href=\"http://classifiedcabinet.codeplex.com/releases/view/61623#DownloadId=211506\" target=\"_blank\">\r\ndownload source</a> &ndash; includes Silverlight application for the client, Silverlight application for managing books and Web application with an OData service to serve the bookshelf.\r\n</li></ul>\r\n<h2>Feedback</h2>\r\n<p>Any&nbsp;feedback&nbsp;you can&nbsp;give us&nbsp;is more than welcome.&nbsp;We want to know what you&rsquo;d like to see improved, where do you use our control (yes, we will feature your project if you send us a link), how can we help you integrate this\r\n component in your applications, etc.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Controls,",
  "LastEdited": "2011-04-11T06:57:38.04-07:00"
}