{
  "ProjectName": "CloudStorageAPI",
  "Title": "CloudStorage.API",
  "Description": "An API to connect to Cloud Storage and enable persistence ignorance and testability in Your Cloud Applications.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />An API to connect to Cloud Storage and enable persistence ignorance and testability in Your Cloud Applications.<br /><br />For a review of the different parts of this API please look at the <b><a href=\"https://cloudstorageapi.codeplex.com/wikipage?title=API%20Overview&referringTitle=Home\">API Overview</a></b> page.<br /><br />See also this blog post for a written intro to this project: <a href=\"http://blog.noop.se/archive/2009/08/15/introducing-the-cloud-storage-api.aspx\">Introducing the Cloud Storage API</a>.<br />\n<h2>Project rationale</h2>\r\nDo You want:\n<ul><li>Application stability in the face of changing Cloud Storage implementations?</li>\n<li>Persistence ignorance with the freedom to store your data in &#39;any&#39; Cloud (Storage)?</li>\n<li>Testability that enables you to mock out the real data store?</li></ul>\n<br />Then this project is for You! ;~)<br />\n<h2>Beautiful idea</h2>\r\nMicrosoft has published a <a href=\"http://msdn.microsoft.com/en-us/library/dd135716.aspx\">StorageClient Sample</a> that &quot;provides Microsoft .NET wrapper classes for REST API operations for the Blob, Queue, and Table services&quot;. Rather than coding projects against this sample which will certainly be replaced with a real framework product from Microsoft and rather than us coding our own Storage Client framework which Microsoft or someone else will do for us, we decided to create an API that will enable us to select and re-select Storage Client implementations at any time. And suddenly it occurred to us that we would love to be able to store our data in &quot;any Storage Cloud&quot;. From this our first version of a Cloud Storage API was sprung.<br /><br />So why not share this project and make it available to any one? Said and done! Here is the project and the <a href=\"http://cloudstorageapi.codeplex.com/license\">license</a> is <a href=\"http://opensource.org/licenses/ms-pl.html\">Ms-PL</a>. This means you can copy away, rebrand and republish, but not claim by changing it&#39;s license.<br /><br />Se also: <a href=\"https://cloudstorageapi.codeplex.com/wikipage?title=Disclaimer&referringTitle=Home\">Project Ambitions</a><br />\n<h2>Implementations</h2>\r\nThere currently exits one (partial) implementation of this API on the <a href=\"http://azure.com\">Windows Azure Storage Cloud</a>. This project is coded, released and maintained in a separate project: <a href=\"http://azurecontrib.codeplex.com\">Azure Contrib</a><br />\n<h2>Help Wanted!</h2>\r\nDo you know a Storage Cloud? Would you like to review this API for implementation on another Cloud Store? Would you like to implement it for some other type of store? Would you like to have your project referenced from this project as a contributing/associated project? Would you like to help out? If so: Please contact the project coordinators!</div><div class=\"ClearBoth\"></div>",
  "TagList": "Cloud Computing,Cloud Storage,persistence,API,Cloud,Cloud Messaging,Blob Storage,Entity,Message Queue,Table Storage,Inversion of Control,persistence ignoranc,dependency injection,Azure,Azure Storage,azure platform,",
  "LastEdited": "2011-10-12T00:16:22.353-07:00"
}