{
  "ProjectName": "cm12secsitescript",
  "Title": "Scripted Deployment of a System Center 2012 Configuration Manager Secondary Site",
  "Description": "In System Center 2012 Configuration Manager, you can no longer deploy a secondary site server using Setup (wizard or scripted).  Instead, you must use the Configuration Manager console to create a new secondary site.  This is less than ideal if you want to deploy several secondary sites or want to automate the process for any other reason.\r\n\r\nThis project provides a script that will allow you to install a new System Center 2012 Configuration Manager secondary site server without using the Configuration Manager console.  The script essentially performs the same actions as the Configuration Manager console, writing changes to the site control information through WMI.\r\n\r\nThe initial script is provided in VBScript, but I know one of our Configuration Manager MVP's has been working on a PowerShell version that I hope we'll be able to get added in the near future.  The initial script is very basic, but should provide enough information to get you started and start some ideas flowing.  I've already listed several ToDo's in the header of the script, but if you have other ideas, please let me know through the discussion.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />In System Center 2012 Configuration Manager, you can no longer deploy a secondary site server using Setup &#40;wizard or scripted&#41;.  Instead, you must use the Configuration Manager console to create a new secondary site.  This is less than ideal if you want to deploy several secondary sites or want to automate the process for any other reason.<br /><br />This project provides a script that will allow you to install a new System Center 2012 Configuration Manager secondary site server without using the Configuration Manager console.  The script essentially performs the same actions as the Configuration Manager console, writing changes to the site control information through WMI.<br /><br />The initial script is provided in VBScript, but I know one of our Configuration Manager MVP&#39;s has been working on a PowerShell version that I hope we&#39;ll be able to get added in the near future.  The initial script is very basic, but should provide enough information to get you started and start some ideas flowing.  I&#39;ve already listed several ToDo&#39;s in the header of the script, but if you have other ideas, please let me know through the discussion.<br /><br /><b>Disclaimer:</b><br /><i>Everything provided as part of this project is provided for informational purposes only.  Microsoft and the project&#39;s contributor(s) make no warranties, express or implied.</i><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Configuration,Manager,2012,System Center,ConfigMgr,secondary site,script,deployment,",
  "LastEdited": "2012-05-20T08:39:28.607-07:00"
}