{
  "ProjectName": "CML",
  "Title": "C.M.L - Central league Manager Lfs",
  "Description": "CML is a plugin based system for Live for Speed game. It offers easy way for controlling leagues, races and game extensions (like warm-up, pit-stop handling, safety car etc.)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>C.M.L</b><br /><br />At first sorry for my English…<br />This project provides (or should provide) a basic functionality above InSim protocol.  When I did ma last project EGT RA <a href=\"http://www.lfsforum.net/showthread.php?t=54092\">http://www.lfsforum.net/showthread.php?t=54092</a> <br />I realize, that a lot of other programmers spend a lot of time with mapping names,  players id, connections id, to drivers, cars, state, using controls etc. So I decide to write one common plugin base object oriented wrapper around this, which offers this functionality. It should cover this basic functionality which has to be done (always).<br />So here is it. (Ehmm there is 10% from goal, but it is useful now … I hope. Or I hope there will be some people, which will disagree with me and found my mistakes in code and design :) )<br /><br />So what it offers now:<br />There is one basic unit. It is a car (InsimCar). It holds driver(s) (inSimDriver). It works in two modes.<br />-\tSimple: one driver per one car.<br />-\tExtended: more drivers per one car with restriction, only one driver from crew can drive a car<br /><br />Controls factory: It creates controls (Labels, Buttons, Edits) for driver or for all drivers. You are free for mapping connections id, buttons id to click events. You simply ask control factory for a button for concrete insimDriver , connect to event Click and . use it.<br />Plugin functionality  - it scans all dlls in specified directory and chek if any contains classes with plugin attribute<br />Example SayHallo plugin<br />First step for real – Rallycros plugin (with system of heat and groups, Final B and A) etc.<br /><br />What will be done:<br />A lot...<br />-\tFrom last project EGT_RA I will re-implement   system of warm-up laps (real warm-up lap = driver finish first lap, return back to start position (position is checked and driver is navigated by some cross on his initial position))<br />-\tSafety car support<br />-\tWeight balance per race (as is e.g. in WTCC cups)<br />-\tChecking the restriction for balancing the car classes (TBO, GTR 1, 2, etc.)<br />-\tPitstop handling (checking if the pitstop was done during pitstop window (e.g. between laps 5 to 30). Pitstop semaphore, when driver leave the pit-lane , penalization – start from pit lane.<br />-\tWeb support – next big task for managing the leagues and users. (crating leagues, solving protest, online result, separated practice, qualify, race in more days = all this will use the plugin base system).<br />So as you can see there is a lot of work. I do it for my pleasure. And I work on it in my free time. So I don’t want promise any concrete date of final release, but I am working on it.<br />It us under GNU General Public License. It is free for noncommercial purpose.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-05-24T00:27:01.09-07:00"
}