{
  "ProjectName": "componentgo",
  "Title": "Calendar & scheduler from ComponentGo WinForms/ASP.NET",
  "Description": "Several sample applications presenting various forms of calendars for WF and ASP.NET. Controls are intended for organization and time management and resource managements. Useful in payroll, hotel’s management, PIM, the team/project management, doctor/patient time plan, etc.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Several sample applications presenting various forms of calendars for WF and ASP.NET. Controls are intended for organization and time management and resource managements. Useful in payroll, hotel&#8217;s management, PIM, the team&#47;project management, doctor&#47;patient time plan, etc.<br /><br />\n<h1>The WebSchedulerGo control</h1>\rWebScheduler is a unique tool for displaying schedules for multiple resources via the Net. It was designed to be compatible with multiple browsers (not IE only!). Full support for edit-in-place and drag&amp;drop make pages based on this component easy to use an AJAX (callbacks) speed up all operations and reduce flicker. Use of JavaScript minimizes size of HTML transferred. A control can be used in many areas: hierarchical project planning, management of resources and time, hotel room booking, employee scheduling, team management, doctor/patient time plan, etc. Tasks can be presented and managed as parts of a Gantt chart. A capability to define view and contents of a calendar in detail was combined with ease of programming and usage of ASP.NET 2.0 in the latest Microsoft Visual Studio 2005/2008. This will make using a calendar easier.\n<h2>Features</h2>\rIE, Netscape, Firefox, Opera - HTML+JavaScript - Minimum HTML size - Simple programming - JavaScript object - AJAX callbacks - Context Menus - Multilingual - Resource manager - Full control over color from a Visual Designer and Auto format - Smart tags (Action list) - Defining tooltips - Customizable time resolution- Planning of tasks for a long time - Collapsing or hiding a free-time periods - Edit text item and resource (Edit In Place) - Customizable hours - Reading from and saving to ADO.NET - CLS Compliant &amp; Code Analysis -Drag &amp; Drop functionality - Extended elements display - Overlapping items - Resources tree - Caption and date navigator - Client and Server events - Linked items - Regions &amp; Layers\n<h2>Screenshot</h2>\r<img src=\"/projects/componentgo/90e0683e-2692-4e89-a3c5-4540f4292ce3\" alt=\"WebScheduler.jpg\" title=\"WebScheduler.jpg\" />\n<h2>Requirments</h2>\rThe project contains all files you need to start demo. The demo version control are protected just by “demo” link in the header of the scheduler control. Look <a href=\"http://www.componentgo.com/aspsch\">here</a> for retail, non-protected version of library.<br />Please contact the <a href=\"mailto:go@componentgo.com\">Ernest Boron</a> if you want to contribute to this project.\n<h2>Documentation</h2>\rOnline <a href=\"http://www.componentgo.com/godoc/Ns.aspx?name=ComponentGo.Web.Schedulers&amp;p=web\">reference here</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "calendar,calendaring,schedule,scheduling,date,month,year,week,hour,.NET,component,C#,vb,vbasic,visual,royalty-free,appointment,appointments,meeting,meetings,planning,remind,reminder,organize,organizer,asp,calendario,ASP.NET,visualc,ie,",
  "LastEdited": "2009-09-11T14:37:42.183-07:00"
}