{
  "ProjectName": "ControlPropertyGenerator",
  "Title": "Control Property Generator",
  "Description": "Control Property Generator is a  tool  which would generate all /selected properties of all /selected controls on a web page in one go.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br /><br />Control Property Generator tool  would generate all /selected properties of all /selected controls on a web page in one go. It will also generate the .cs file template for the page control objects which can be used in the Code First automation framework ( https://codeduicodefirst.codeplex.com).<br /><br />The main features are:\n<ol><li>Provides output in an easy readable excel format, showing the control identification, its type and all its properties separated by Key:Value pairs.</li>\n<li>           Generates the .cs file template for the all page control objects.</li>\n<li>Customizable to the type of control for which property needs to be generated (ex. HtmlButton, HtmlTable, HtmlEdit etc.)</li>\n<li>Customizable for type of properties to be generated (ex. Id,InnerText,Title,Name,ClassName etc.)</li>\n<li>Provides an option to generate ALL properties of ALL controls if no filter is provided.</li>\n<li>In case of an error reads the TRX file and provides with the error message.\t</li></ol>\n<br /><br /><br />App config Key description :<br />\n<ol><li>“Path” – The path where the excel with all control properties will be created.</li>\n<li>&quot;MSTEST&quot; – The version of MStest.exe to be used (for VS 2013 installation this has to be 12.0 and for VS 2012 it should be 11.0).</li>\n<li>&quot;ControlList&quot; – The type of controls separated by comma (ex. HtmlButton,HtmlHyperlink,HtmlCheckBox).</li>\n<li>&quot;PropertyList&quot; - The  type of properties to be generated separated by comma (ex. Id,InnerText,Title,Name,ClassName).</li></ol>\n<br /><br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "coded ui automation,code first,control properties,property generator,",
  "LastEdited": "2014-01-02T02:13:03.097-08:00"
}