{
  "ProjectName": "countwidget",
  "Title": "Count Widget",
  "Description": "CountWidget is a series of C# projects built to demonstrate RAD Studio Code Generation Toolkit to create 100% stored procedure driven data tiers for SQL Server.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><br />By Data Juggler Software www.datajuggler.com .<br /><br />If you like this project, please donate it keeps us going!<br /><br /><a href=\"http://www.pledgie.com/campaigns/24373\"><img style=\"border:none;\" src=\"http://www.pledgie.com/campaigns/24373.png?skin_name=chrome\" alt=\"Donate to Data Juggler\" title=\"Donate to Data Juggler\" /></a><br /><br />Count Widget for Asp.Net Developers<br /><br />Project Description<br />CountWidget is a series of C# projects built to demonstrate RAD Studio Code Generation Toolkit to create 100% stored procedure driven data tiers for SQL Server.<br /><br />Count Widget User’s Guide<br /><br />Please visit the Count Widget web site located at www.countwidget.com to see Count Widget in action.<br /><br />Introducing Count Widget<br /><br />Count Widget is a series of sample projects to demonstrate my open source project RAD Studio Code Generation Toolkit, available for download at:<br /><br />http://radstudio.codeplex.com<br /><br />RAD Studio is the ultimate C# class object creator, data tier creator and stored procedure generator.<br /><br />License Information<br /><br />Count Widget Control<br /><br />The Count Widget Control is an Asp.Net User Control:<br /><br />An example of the BlackGold Theme:<br /><br />Count Widget for Asp.Net Developers<br /><br />An example of the PowderBlue Theme:<br /><br />An example of a PowderBlue theme<br /><br /><br />You are free to use the Count Widget Control in any type of project and we hope you like it and tell your friends about it. <br /><br />There are two options for using the Count Widget Control:<br /><br />1. You may host 1 copy of the SQL Server database ‘WidgetData’, the CountWidgetWeb and the CountWidgetWebService projects.<br /><br />2. Or use the CountWidgetControl and visit www.countwidget.com to manage your account and use the CountWidgetWebService hosted by Data juggler. *<br /><br />There are transaction limits on your account, which are explained on the next page.<br /><br />Image Rights<br /><br />You may use the images in the CountWidgetWeb project on the CountWidgetWeb project only. I have purchased the rights to use these images, but I do not have permission to grant you the right to use these images as they are not mine. Please respect these images.<br /><br /><br />Self-Hosting Database and Widget Data Service<br /><br />You are free to use the WidgetData Database, the Widget Data Web Services and the Count Widget Control, and use your own copy of the Count Widget Web project to modify the sites, pages and widgets.<br /><br />If you use Count Widget we ask * for you to give us credit by either placing a link on your web site to http://www.datajuggler.com or http://www.countwidget.com or by listing Data Juggler and / or Count Widget in your product documentation.<br /><br />If this is not possible, a kind word on CodePlex, Facebook or somewhere else on the web is appreciated.<br /><br />Data Juggler Hosted Database and Widget Data Service<br /><br />If you use Data Juggler’s hosted web service, the following table lists the transaction limits and pricing for each tier.<br /><br />Transaction Limits &amp; Pricing<br /><br />Membership Tier Transactions per Month* Price<br />Limited 1,000 Free<br />Standard 10,000 $10 Year<br />Pro 100,000 $10 Month<br />Enterprise 1,000,000 $50 Month<br /><br /><br /><br />Transaction limits are cumulative for all sites, pages and widgets.<br /><br />Download Contents<br /><br />Count Widget Control<br /><br />An Asp.Net User Control that makes it easy to count pages &amp; widgets; <br />A widget can be anything from a button click, a download, voting polls, goals and even detailed site analytics.<br /><br />More information about using the Count Widget Control is shown later in this document.<br /><br />WidgetData Database<br /><br />This is a SQL Server database that can be attached (SQL Server 2012 only) or the Data\\Database\\Scripts folder contains all of the tables, views and stored procedures used in the WidgetData database.<br /><br />The original release of Count Widget 0.8.0 does not include the WidgetData database, 0.8.1 will be released this afternoon (4.14.2013). <br /><br />Count Widget Web<br /><br />Count Widget Web is a Visual Studio 2010 or Visual Studio 2012 project that demonstrates the full CRUD (Create, Read, Update, and Delete) methods using RAD Studio Code Generation Toolkit. <br /><br />In addition to this open source project, Count Widget Web is also live at www.countwidget.com and you can use this along with the Count Widget Web Service in real world applications.<br /><br />Widget Data Service<br /><br />Widget Data Service is a Windows Application that hosts three web services:<br /><br />Count Widget Service<br /><br />Count Widget Service makes it easy to count pages and widgets.<br />When you join Count Widget you are given a CompanyID and a License Key.<br />After sign up or log in click the Editors tab to manager Sites, Pages and Widgets. <br /><br />Storage Widget Service<br /><br />The web service is working, but the methods are not fully implemented yet.<br /><br />Storage Widget Service is a web service allows you to create virtual web databases and recordsets (virtual tables) and store data for web sites and mobile applications.<br /><br />OutBox Widget Service<br /><br />This is also in development, but I have a working copy I am porting from another site to be more generic. OutBox Widget Service makes it easy to send email by making a web service call and passing in an OutBox item.<br /><br />In addition to RAD Studio, and this project, there are two other Code Plex projects included in the Complete Solution:<br /><br />DataJuggler.Core.UltimateHelper - http://ultimatehelper.codeplex.com<br /><br />This project is a collection of helper classes and I invite developers to submit their favorite helper classes to be included in this evolving project.<br /><br />DataJuggler.Web.Controls - http://datajugglercontrols.codeplex.com<br /><br />This is a collection of web controls that are useful for building web projects. <br /><br />Update 4.14.2013: Data Juggler Controls also includes Data Juggler Win Controls and Data Juggler WPF Controls.<br /><br />System Requirements:<br /><br />The Count Widget Control, Count Widget Web and Widget Data Service require Visual Studio 2010 or Visual Studio 2012; I cannot think of anything that would prevent the Count Widget control from running on earlier versions of Visual Studio, but I have been on Visual Studio 2010 for a few years and now VS 2012.<br /><br />You can also call the Widget Data Service without using the control, for example in Windows applications or web services.<br /><br /> <br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,Stored Procedures,Web Services,Counter,User Controls,Data Tiers,Code Generators,Web Service,Data,Data Grid,Web User Controls,Counters,Asp.Net,Web Reports,Data Tier,",
  "LastEdited": "2014-03-04T06:23:52.88-08:00"
}