{
  "ProjectName": "crmexternalview",
  "Title": "Microsoft Dynamics CRM External View",
  "Description": "CRM External View enables more robust control over exposing Microsoft CRM data (in a form of views) for external parties. The solution uses web service as the integration layer to CRM. Supports paging and simple authentication.\n\nSupports CRM Online.\n\nFeedback are welcome. :-)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />CRM External View enables more robust control over exposing Microsoft CRM data &#40;in a form of views&#41; for external parties. The solution uses web service as the integration layer to CRM. Supports paging and simple authentication.<br /><br />Supports CRM Online.<br /><br />Feedback are welcome. &#58;-&#41;<br /><br /><b>New Features in v1.2 release</b>\n<ul><li>Password protected views. No more using Web Data Access role from v1.</li>\n<li>Filtering capabilities</li>\n<li>Caching for performance boost</li>\n<li>Updated the default no of records retrieved from 5000 to 2500</li>\n<li>Quick how-to screencast <a href=\"http://vimeo.com/10416992\">http://vimeo.com/10416992</a></li></ul>\n<br /><b>Features</b>\n<ul><li>Enable selected CRM views accessible externally</li>\n<li>Allows you to configure different name for the External View, therefore you don&#39;t have to expose the internal CRM View Name</li>\n<li>Transparent paging functionality (no more paging cookie stuff!)</li>\n<li>Uses WCF service for reliability. Exposes 2 operations: GetViewData and GetPagedViewData</li>\n<li>Support for CRM Online (On Premise and IFD coming!)</li>\n<li>Simple authentication</li>\n<li>Logging functionality for failed authentication, invalid views, etc (default logging to EventLog). Using log4net</li>\n<li>Easy installation (really!)</li></ul>\n<br /><b>Solution Overview</b><br />The solution comprises of 2 parts: the administration area for managing which views got exposed externally and the web service which is the integration layer.<br />The administration area is hosted within CRM Online. You can view it from Settings - External Views.<br /> <br />If you open that External View record, you will find there are 2 fields. View Name and Unique Name.<br />View Name is basically the name of the CRM view you want to expose externally, where as the Unique Name is more like an alias for that View Name.<br />So, when the view data is requested through the web service, you should pass in the Unique Name as the parameter, not the View Name.<br /> <br />You can create as much External View records as you want, but you need to make sure that the Unique Name is unique for all these records.<br /> <br />Then, there is the web service that retrieves the views data depending on the user roles. A user need to have a Web Data Access role in order to access these view data. There are 2 web service operations supported: GetViewData and GetPagedViewData. The latter one is used to retrieve a large number of records in a paged manner, where as the first one only retrieved the first 2500 records for that particular view.<br /><br /><img src=\"/projects/crmexternalview/611c3f29-4fe3-477f-af11-36ae57baf230\" alt=\"Solution&#32;Architecture&#32;Diagram\" title=\"Solution&#32;Architecture&#32;Diagram\" /><br /><br /><b>Installation</b>\n<ul><li>Download the customization.zip, import and publish it to your CRM server</li>\n<li>Download the setup.zip. Extract and run the setup.exe under the Administrator context</li>\n<li>Browse to the External View installation URL in your browser. By default it is http://localhost/ExternalView</li>\n<li>Since it only supports CRM Online at the moment, you will need to enter the Live ID, Password, and Organization name to connect to your CRM Online instance.</li></ul>\n  Click the validate button to verify this information are correct and save these information in configuration file\n<ul><li>That&#39;s it! Now, you can try connecting to the web service.</li></ul>\n<br /><b>Limitation</b>\n<ul><li>Only supports CRM Online. Future release will support On Premise and IFD.</li>\n<li>Unable to restrict sensitive fields like &quot;accountid&quot; from the view result. This functionality will be provided in the upcoming releases.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "mscrm,crm 4.0,wcf,mscrm online,external view,Microsoft CRM,",
  "LastEdited": "2010-03-26T13:50:49.473-07:00"
}