{
  "ProjectName": "crmjavascriptaudit",
  "Title": "Microsoft Dynamics CRM Javascript Audit",
  "Description": "CRM Javascript Audit enables the auditing functionality for client side Javascript customization. Traditionally you will have to store the Javascripts in source control, but this could be a tedious process as more customizations made.\n\nSupports MSCRM v4 On Premise deployment.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />CRM Javascript Audit enables the auditing functionality for client side Javascript customization. Traditionally you will have to store the Javascripts in source control, but this could be a tedious process as more customizations made.<br /><br />Supports MSCRM v4 On Premise deployment.<br /><br /><b>Solution Overview</b><br />CRM Javascript Audit solution is implemented as a plugin which monitors the Publish event. It captures the Pre and Post-Publish customization files, compare the Javascript code on both Form level and Field level, and finally write the changes back to a custom entity called Javascript Audit Log in CRM. The changes are written as Notes (annotation).<br /><br /><b>How to install</b>\n<ul><li>Download both customization and plugin files from the release tab</li>\n<li>Extract the Plugin Files.zip into a directory</li>\n<li>Import the customization into your CRM and don&#39;t forget to publish it</li>\n<li>Open up the Plugin Registration tool and browse to your CRM organization</li>\n<li>Select Import / Export | Import Solution XML</li>\n<li>Browse to the ImportPlugin.xml in the extracted directory of Plugin Files.zip</li>\n<li>Check the &#39;Ignore Id&#39;s in ImportXml&#39;</li>\n<li>Select all items to import and click &#39;Import Selected Items&#39;</li></ul>\n<br />Note: it is recommended to run the plugin as a specific user. This user need to have full access to the Javascript Audit Log entity and Annotation entity.<br /><br /><b>Features</b>\n<ul><li>Logs all Javascript changes in both Form level and Field level (including Mobile forms)</li>\n<li>Ability to choose which entities to monitor through Plugin level configuration</li></ul>\n<br /><b>Limitation</b>\n<ul><li>Does not monitor the PublishAll event for performance reason</li>\n<li>Only runs on Microsoft CRM 4.0 On Premise</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "CRM,CRM 4.0,mscrm,xRM,Audit,Microsoft CRM,",
  "LastEdited": "2010-06-19T00:38:44.67-07:00"
}