{
  "ProjectName": "Crossfader",
  "Title": "Crossfader",
  "Description": "The crossfader project on codeplex is to give those interested in the developement and extending of Crossfader a place online todo that. The project will provide the the source for the universal tile control as well as other tools and controls for working with the CF APIs",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description </h1>\r\nCrossfader was a demo application built for the 2008 Bill Gates Keynote at Teched showing how a social networking site could be built in Silverlight.  Much of the intial round of best practices for Silverlight application developement was extrapolated from the experience from building this massive demo site.  4 teams across 3 companies and two countries helped put this demo system together.  Out of this effort a number of useful things came out of the project that we are going to release as per review.  The first one will be a new media element class primarily to deal with problems in Silverlight and doing composite WPF/Silverlight developement with the default media element in both environements.  The Crossfader media element includes ability to run in Silverlight and WPF, the ability to que plays and supports the idea of media channels in the same element with much of the Same API&#39;s as the regular media element and wraps the differences between WPF and Silverlight.<br />\n<h2>Current Build Changes Release Notes</h2>\rCrossfader Library .002a<br /><br />MediaElement Control - <br />The Crossfader MediaElement replaces the existing Silverlight MediaElement and the WPF MediaElement with a new control that supports channels and quing that especially in a sound effects and application development in WPF/Windows 7 and Silverlight can be a problem when there are several sound effects you need to play. See Simon uses this control to solve sound effect issues: <a href=\"http://www.hackingsilverlight.net/Simon.html\">http://www.hackingsilverlight.net/Simon.html</a><br /><br />AnimatingCloudPanel Control - <br />A layout control that is used to layout controls in sort of a 3d carosel sort of thing.  the control is design to show only a few items at a time and based on the layout it will animation from one position to another including the transforms, opacity and other aspects, it will set zindex as well.  to use the panel you must use the Content Control that is provided as a wrapper to provide the structure/API for the host panel to manipulate the content.<br />\n<h2>Upcoming changes</h2>\r\nMediaElement - <br />more complete audio and video support, zindex controls and the rest of the media element properties supported.<br /><br />MediaPlayer - <br />Crossfader MediaPlayer control that wraps the mediaelement in a stylable player with buttons, scrub bar and other standard visual controls.<br /><br />MediaPlayerBarControl - <br />A mediaplayer specialized control that add&#39;s timers, crossfade effects etc.  designed to be used as a timeline element control for media content.<br /><br />MediaFXPlayer - <br />Based on the Crossfader &#39;Uber&#39; tile control supporting audio, video and image support and a fully functioning media library stype of control allowing mix and mashing of sound and video and image assets along with bound details about the content, play list support and more.<br />\n<h2>History Notes</h2>\r\n<ul><li>site history</li></ul>\nCrossfader originated as a PC and partner evangelist initiative to digital content creatives with the goal of increasing relevance of the PC in a segment that has historically been dominated by Apple.  In keeping consistent with a creative&#39;s eye for design and cool UX, we used Silverlight (Alpha 1.1) as our technology hub, created &quot;studio&quot; spaces for each member to host their content, and created an environment where social networking would be done through creative&#39;s work...members could connect and link up with other members based on their creative work and the tools/processes used its&#39; creation.  Since we were utilizing the platform API very early in its&#39; product cycle, our site presented a compelling RIA model for other web 2.0 designers and developers to consider.  Our hope was to demo some of the key aspects of this technology to the community and to Microsoft Partners.  We were thrilled to be selected to be demoed during billg&#39;s final keynote address at TechEd 2008, and eventually launched the intial beta of the site in November that same year.  Since this was built on a 1.1 alpha the beta site was for demo purposes and not ment to go live.<br />\n<ul><li>demo history</li></ul>\n<br />demo pictures: <a href=\"http://www.facebook.com/album.php?aid=38501&amp;id=721326429&amp;l=1b34871558\">http://www.facebook.com/album.php?aid=38501&amp;id=721326429&amp;l=1b34871558</a><br /><br />Sumo&#39;s doing the demo part of billg&#39;s presentation: <a href=\"http://msstudios.vo.llnwd.net/o21/presspass/zune/Silverlight_2_Zune.wmv\">http://msstudios.vo.llnwd.net/o21/presspass/zune/Silverlight_2_Zune.wmv</a><br />\n<ul><li>codeplex history</li></ul>\n<br />- added the mediaelement to Silverlight Simon to fix game sound issues and demo the mediaelement control<br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-07-20T09:07:41.013-07:00"
}