{
  "ProjectName": "crudwork",
  "Title": "crudwork library",
  "Description": "crudwork is a collection of reuseable components for .NET applications.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />crudwork is a collection of reuseable components for .NET applications.<br /><br />If you searched for StpLibrary and landed here, you&#39;re in the right place.  crudwork was originally started out as a personal library to reduce duplicated codes and efforts.  The solution was renamed from StpLibrary to crudwork on April 2010.  All things are the same in most manner.  (<a href=\"http://crudwork.codeplex.com/Thread/View.aspx?ThreadId=209050\">Click here for migrating info...</a>)<br /><br />Here are a few words to describe the features worth mentioning.  There are a lot of <b>Quick Samples</b> inside...<br /><br />\n<h1>Write multi-threaded application as easy as 1-2-3</h1>\r\n<ul><li>With crudwork.MultiThreading, one can write an application to run multi-threads with just a few lines of code.  All of the crud work are already built so the developer can focus on the main business logic. (<a href=\"http://crudwork.codeplex.com/Thread/View.aspx?ThreadId=209969\">more...</a>)</li></ul>\n<br />\n<h1>Processing database tables and data files</h1>\r\ncrudwork offers classes for processing data from most relational databases and common data files.<br />\n<ul><li>DataFactory - to execute SQL query against common relational databases such as SQL and Oracle.</li>\n<li>DataSetQuery - to execute simple SQL query against a DataSet object</li>\n<li>ImportManager - to import and export common data files, such as Excel, Access, DBF, CSV, tab-delimited, flat or fixed-length file. (<a href=\"http://crudwork.codeplex.com/Thread/View.aspx?ThreadId=210446\">more...</a>)</li></ul>\n<br />\n<h1>Data warehouse</h1>\r\n<ul><li>Includes parsers to parse telephone / address / city state zip, plus more...</li>\n<li>String matching algorithms such as soundex, fuzzy-logic match</li></ul>\n<br />\n<h1>Light-weight dynamic runtime library</h1>\r\n<ul><li>crudwork has several methods to dynamically invoke methods and properties.</li></ul>\n<br />\n<h1>Windows Controls</h1>\r\n<ul><li>pivot table editor - pivot a table, allow user to make massive changes in the pivotal view, and save changes back to database.</li>\n<li>SQLite query analyzer - to run SQL query against a SQLite database file.</li>\n<li>qapp - stands for <b>Query Analyzer Plus Plus</b>.  Works just as the SQLite Query Analyzer; but, works with all databases plus can use database macros, such as pivot/dupi/dupe/dupo. (<i>New on 2.2.0.4</i> <a href=\"http://crudwork.codeplex.com/Thread/View.aspx?ThreadId=210344\">more...</a>)</li>\n<li>step-by-step wizard controls - convert multi-step procedures into easy-to-use wizard control.</li>\n<li>object viewer - allow user to view and change any object via XML Editor and/or PropertyGrid. (<i>New on 2.2.0.3</i> <a href=\"http://crudwork.codeplex.com/Thread/View.aspx?ThreadId=208937\">more...</a>])</li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "SQLite,data warehouse,Multi-threaded,concurrency,dynamic language,windows controls,import tools,fuzzy-logic match,soundex,address parser,name parser,data access layer,oledb,Oracle,SQL server,deduplication,BackgroundWorker,Serialization,Disposing object,",
  "LastEdited": "2010-04-27T06:58:25.427-07:00"
}