{
  "ProjectName": "csharpsoftphonevoip",
  "Title": "How to build a VoIP softphone in C#",
  "Description": "It presents how to develop a fully-functional VoIP softphone in C# in the most simplest way - including SIP registration, call esablishment and call controlling",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>About the project</h1>\r\n<b>This project demonstrates how to develop a fully-functional softphone in C# in the most simplest way - by using  the previously written components of Ozeki VoIP SIP SDK. This example also explains how to register the SIP accounts, how to make and receive calls and what you should do for controlling the call.</b><br />\n<h1>Background</h1>\r\nA softphone is a software program for making telephone calls over the Internet using a general purpose computer, rather than using dedicated hardware.<br /><br />Ozeki VoIP SIP SDK provides a first-rate technology for softphone development. Instead of wasting time for long development process on your own, you can take advantage on this decent software development kit. You will see how easy it is to create a softphone when you use Ozeki VoIP SIP SDK. Using this SDK does not require professional programming skills. A basic programming knowledge is enough, since Ozeki VoIP SIP SDK provides the base for the VoIP solution you are working on. Integrating it to your own program will provide instant VoIP ability.<br />\n<h2>Useful links:</h2>\r<ul><li><a href=\"http://voip-sip-sdk.com/p_333-voip-sdk-softphone-development-voip.html\">http://voip-sip-sdk.com/p_333-voip-sdk-softphone-development-voip.html</a></li>\n<li><a href=\"http://voip-sip-sdk.com/p_221-customize-the-features-and-gui-of-your-softphone-voip.html\">http://voip-sip-sdk.com/p_221-customize-the-features-and-gui-of-your-softphone-voip.html</a></li>\n<li><a href=\"http://www.ozekiphone.com/voip-make-3d-video-calls-with-ozeki-xd-phone-softphone-1024.html\">http://www.ozekiphone.com/voip-make-3d-video-calls-with-ozeki-xd-phone-softphone-1024.html</a></li></ul>\nGood luck</div><div class=\"ClearBoth\"></div>",
  "TagList": "c#,softphone,ozeki,c sharp,voip,sip,sdk,desktop development,",
  "LastEdited": "2014-03-07T01:49:20.937-08:00"
}