{
  "ProjectName": "cssfriendly",
  "Title": "CSS Friendly Control Adapters",
  "Description": "The CSS Friendly Control Adapters kit (for ASP.Net 2.0) provides pre-built control adapters that you can easily use to generate CSS-friendly markup from some of the more commonly used ASP.NET controls.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\rThe CSS Friendly Control Adapters kit &#40;for ASP.Net 2.0&#41; provides pre-built control adapters that you can easily use to generate CSS-friendly markup from some of the more commonly used ASP.NET controls.<br />\n<h2>News</h2>\r\n<b>A new version of these adapters is in development!</b> Head over to <a href=\"http://code.google.com/p/aspnetcontroladapters\">http://code.google.com/p/aspnetcontroladapters</a> for more information and to preview what&#39;s been done so far.<br />\n<h2>Goals</h2>\rThe goal of the CSS Friendly project is to transform as many of the traditional ASP.Net web controls to provide CSS-friendly, browser-compatible markup. The project will be released as a single DLL which can be referenced in any web project for simple distribution.<br />\n<h2>Implementation</h2>\rUsers are expected to be familiar with referencing and using third-party assemblies into their existing ASP.Net projects.<br /><br />1. Downloading the current release. There are two ways you can do this:\n<ul><li>Go to the <a href=\"http://www.codeplex.com/cssfriendly/Release/ProjectReleases.aspx\">Releases tab</a>. You should see three prominent links to files. The <b>zip</b> file contains the source code, the <b>CSSFriendly.dll</b> file contains the compiled source code, and the the <b>CSSFriendlyAdapters.browser</b> file is a configuration file. You only need the <b>dll</b> and <b>browser</b> files.</li>\n<li>Go to the <a href=\"http://www.codeplex.com/cssfriendly/SourceControl/ListDownloadableCommits.aspx\">Source Code tab</a>. Download the latest change set (source code) by clicking the Download tab. This will include the source code, a test/sample web site, and the <b>CSSFriendlyAdapters.browser</b> configuration file. Open the source code project in Visual Studio, compile it to produce <b>CSSFriendly.dll</b> file. Note that the latest change set has many features and bug fixes over the latest release, but is not as well tested in production environments.</li></ul>\n<br />2. Add a reference to CSSFriendly.dll. This is typically done by right-clicking your web project, choosing the Add References command, browsing for the CSSFriendly.dll file, and clicking OK.<br /><br />3. Add the CSSFriendlyAdapters.browser file to the App<i>Browsers folder in the root of your web project. If the App</i>Browsers folder doesn&#39;t exist, create it.<br /><br />Note: You can delete lines from the configuration file if you do not want to use the modified adapters for certain controls.<br />\n<h2>How to join</h2>\r\nGenerally, the easiest way to help out:<br />\n<ul><li>Download the latest source code.</li>\n<li>Make local changes.</li>\n<li>Send us a copy of the file(s) and change(s) made, along with an explanation (i.e. a &quot;patch&quot;).</li>\n<li>We&#39;ll review the changes and integrate them with CodePlex.</li></ul>\n<br />Once we&#39;re comfortable working together and we get to see the type and quality of the work you do, we&#39;ll make you a developer so you can check-in changes to CodePlex directly.<br />\n<h2>Frequently Asked Questions</h2>\r\n<ul><li><b>Is this the official release of the CSS Friendly Control Adapters?</b> Kind of. Originally, it wasn&#39;t, but when Microsoft handed the keys to the community, it became the official release. Still, more information can be found on <a href=\"http://www.asp.net/cssadapters\">Microsoft&#39;s ASP.Net web site</a>.</li>\n<li><b>I had a look at the source code and I noticed that is only embedding three CSS files for three controls: Menu, DetailsView and TreeView. Why are the others missing</b> The original (uncompiled) distribution includes a number of CSS files, . but most of the code therein is non-functional. If you place your custom CSS files in your web project (typically under the App_Themes folder) things will work fine with the pre-compiled distribution.</li></ul>\n\n<h2>Feedback</h2>\r\nGetting feedback is important to us. You can provide feedback at the following web sites:<br />\n<ul><li>Comments and Questions: <a href=\"http://forums.asp.net/1018/ShowForum.aspx\">http://forums.asp.net/1018/ShowForum.aspx</a></li>\n<li>Suggestions: <a href=\"http://www.codeplex.com/cssfriendly/Thread/View.aspx?ThreadId=8165\">http://www.codeplex.com/cssfriendly/Thread/View.aspx?ThreadId=8165</a></li>\n<li>*Report an issue: <a href=\"http://www.codeplex.com/cssfriendly/WorkItem/List.aspx\">http://www.codeplex.com/cssfriendly/WorkItem/List.aspx</a></li></ul>\n   <br />*Only report issues at CodePlex which are clearly an issue with this project. If you are unsure, post on the Comments and Questions forum.<br />\n<h2>History</h2>\r\nIt all started in late 2006 when Microsoft released the original <a href=\"http://www.asp.net/CSSAdapters\">CSS Friendly Control Adapters</a> source code. It worked, but implementing it in a web site required either using a separate Visual Studio project template or manually injecting code files into an existing project. Considering the original project was released at least in some degree as a tutorial, this is not surprising.<br /><br />Frustrated by the extra steps taken to incorporate these controls into a web project, an independent developer, <a href=\"http://www.sidesofmarch.com\">Brian DeMarzo</a>, repackaged the code so that it compiled into a single DLL, making it easy to include its functionality into any web project.<br /><br />On March 7, 2007, <a href=\"http://forums.asp.net/thread/1609640.aspx\">Microsoft approved the idea of directly letting the community decide on and implement changes to the ASP.NET 2.0 CSS Friendly Control Adapters</a>, undoubtedly thanks to the efforts of the original developer of the CSS adapters, <a href=\"http://www.groovybits.com\">Russ Helfand</a>. This CodePlex project became the source for all future releases of the CSS Friendly Control Adapters.<br /><br />In October, 2008, development began on a bottom-to-top rewrite of the adapters. Current documentation and source code for the new version is available at <a href=\"http://code.google.com/p/aspnetcontroladapters\">http://code.google.com/p/aspnetcontroladapters</a></div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,ASP.NET,C#,watch,Controls,favorites,javascript,css,favorite,ASP.NET 2.0,cool,Accessibility,asp.net controls,webcontrols,control adapters,MyList,css Adapters,Css Friendly,Adapters,Css Friendly Control,CSSAdapter,Control Adapter,cssfriendly,CSS Control Adapters,myFavoriteProjects,",
  "LastEdited": "2008-10-27T08:58:53.997-07:00"
}