{
  "ProjectName": "custompeoplepicker",
  "Title": "Custom People Picker",
  "Description": "The custom control which inherits the property of the \"People Picker\" control to display the items from the list.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><em><strong>Project Description</strong></em><br>\r\n<br>\r\n<em>This Custom control will allow you to choose the list and the fields inside the list to display in the people picker dialog. It inherits the default &quot;People Picker&quot; control and inherits all the properties of the control and also include some custom properties\r\n like</em></p>\r\n<p><em>1. CPPListName - To map the list where the records are to be fetched.</em></p>\r\n<p><em>2.&nbsp;CPPDescriptionField - To map the field which is used to store in the place of &quot;Description&quot; of the &quot;Picker Entity&quot; type, which is useful in the server side coding.</em></p>\r\n<p><em>3.&nbsp;CPPDisplayField - To map the field which is used for display in the textbox with underlined and this value is stored in the &quot;Display Text&quot; property of the &quot;PickerEntity&quot; type.</em></p>\r\n<p><em>4.&nbsp;CPPDialogTitle - This is to set the title of the &quot;Picker Dialog&quot;</em></p>\r\n<p><em>5.&nbsp;CPPDialogDesc - This is to set the description of the &quot;Picker Dialog&quot;.</em></p>\r\n<p><em><strong>Features</strong></em></p>\r\n<p><em>1. Automatically the ID of the list item is stored as a key.</em></p>\r\n<p><em>2. The data can be retrieve and inserted as like that of the normal people picker</em></p>\r\n<p><em>3. Will not impact the load of the server since LINQ was used to query the listitems.</em></p>\r\n<p><strong><em>Steps for installation</em></strong></p>\r\n<p><em>1. Add the dll to the GAC</em></p>\r\n<p><em>2. Copy and paste the dll in the particular web application virtual directory\\bin folder.</em></p>\r\n<p><em>3. Add the control in the web application web.config as a safe control</em></p>\r\n<p><em>4. Recycle the particular web application application pool</em></p>\r\n<p><em>5. Reset the iis.</em></p>\r\n<p><em>After following the above mentioned steps you can start using the controls like the other asp and SharePoint controls.</em></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "peoplepicker,peopleeditor,SharePoint picker,Custom Picker,",
  "LastEdited": "2012-09-13T05:00:56.987-07:00"
}