{
  "ProjectName": "customspwebpartzone",
  "Title": "How to implement your own custom web part zone in SharePoint?",
  "Description": "Have you ever wondered whether it is possible to implement your own custom web part zone that gives you full ability to control how the web parts in a web part zone are added to a page?\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><p><strong>Project Description</strong><br>Have you ever wondered whether it is possible to implement your own custom web part zone that gives you full ability to control how the web parts in a web part zone are added to a page?<br><br><br>By default, MOSS 2007 as well as SharePoint 2010 render the web parts in a table.<br>As most of us know, HTML tables are meant to be used for displaying tabulated data but not for controlling layout of a page. Tables were created to provide structure to data.<br><br>Even though SharePoint 2010 moved away from the table approach to the div approach, few areas remain untransitioned, the &quot;Web Part Zone&quot; being one of them.<br><br>Its often an painespecially for developers/designers to get the exact output to match that of the markup provided by a 3rd party company / designer (Yes it is quite often the case that SharePoint developers need to output HTML that need to match the markup provided by the client) and some times requires lot of effort to tweak their CSS/HTML Markup and also to ensure that the page out put is XHTML complaint especially in MOSS 2007.<br><br>Typical output from an OOB SharePoint Web Part Zone looks like the below:<br><br><img src=\"http://1.bp.blogspot.com/_YkUZobVQyLs/TJvQkMm3AHI/AAAAAAAAFJ0/ikFmZ2eKJjM/s1600/Traditional+Output.png\" alt=\"OOB SP Web Part Zone Output\" width=626 height=699><br><br>As you can see in the above screenshot, SharePoint renders web parts in a table.<br><br><img src=\"http://1.bp.blogspot.com/_YkUZobVQyLs/TJvR64k4nII/AAAAAAAAFJ8/q9pUDhFLx40/s1600/Custom+Web+Part+Zone+Output.png\" alt=\"Custom Web Part Zone Output\" width=1006 height=194><br><br>As you can see in the above screen shot, the custom web part zone allows you to control the way the web parts are rendered on the page. The above screenshot demonstrates a web part zone with a Content Editor Web Part and a Page Viewer Web Part.</p>\n<p>In this sample code, I have just added web parts one after the other.<br>You might want to add each web part in a new panel, apply css to them / seperate them with a &lt;hr&gt; / whatever you want to do<br><br>If you want to be able to add user controls to the page, you will need a text field/column in the SharePoint Page that will be used to define the user controls to be added to this page.<br><br>If there are multiple user controls that are required to be added to the page, seperate them with a &quot;;&quot;<br>To use this web part zone in a page layout, register the control by adding te below line to the page layout<br><br>&lt;%@ Register TagPrefix=&quot;Custom&quot; TagName=&quot;WebPartZone&quot; Src=&quot;~/_controltemplates/CustomWebPartZone/CustomWebPartZone.ascx&quot; %&gt;<br><br>Add the control to the page layout at the desired location<br><br>&lt;div id=&quot;divCustomWPZone&quot;&gt; <br>&nbsp;&nbsp;&nbsp; &lt;Custom:WebPartZone runat=&quot;server&quot; id=&quot;zoneCustom&quot; DisplayTitle=&quot;Custom Zone&quot; LoadWebPartZone=&quot;true&quot;/&gt; <br>&lt;/div&gt; <br><br>If you want be to able to load user controls as well, just use the FieldName=&quot;Name of the page field that contains the user control(s) to add to the page&quot;<br><br>Credits go to Tim Nugiel from MSNGN</p></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-09-23T21:08:49.437-07:00"
}