{
  "ProjectName": "dbe",
  "Title": "Word Content Control Toolkit",
  "Description": "The Word Content Control Toolkit was designed to make mapping Content Controls to Custom XML as simple as a drag and drop. \n\nThis is a standalone tool (not a Word addin!) that opens any Word OpenXML document and lists all of the content controls. Then you just pick which Cus",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b><i>100,000 total downloads and counting, thank you for your support!</i></b><br />\n<h1>Word Content Control Toolkit</h1>\rThis toolkit makes binding content controls to XML data in your Word document as easy as a drag and drop.<br /><br /><b>Details</b>\n<ul><li>This is a stand-alone, light-weight tool that opens any Word Open XML document (eg .docx) and lists all of the content controls inside of it. </li>\n<li>The XML parts are also displayed, and a mapping between the content controls and the XML nodes can be accomplished by simply selecting the node and dropping it on the content control you wish to map to.</li>\n<li>The editor allows you to also edit/add/remove Custom XML parts and manipulate content control properties.</li>\n<li>The tool does not require Word to be installed because it operates directly on the new Open XML file formats by reading and writing to them using the System.IO.Packaging library available in .NET. \n<ul><li>The code to do this is included in the releases and can be used as a handy resource on how to perform complex manipulations of the format.</li></ul></li></ul>\n<b>Learning More</b>\n<ul><li>If you want to learn more about this tool as well as Open XML development, watch this Channel9 interview with the author: <a href=\"http://channel9.msdn.com/blogs/rory/matthew-scott-application-development-using-the-open-xml-file-formats\">Matthew Scott: Application Development using the Open XML File Formats</a></li></ul>\n<b>Tutorials</b>\n<ul><li><a href=\"http://blogs.msdn.com/acoat/archive/2007/03/01/linking-word-2007-content-controls-to-custom-xml.aspx\">Andrew Coates</a> has posted a great tutorial using the Content Control Toolkit to bind a document to XML from scratch. View this tutorial <a href=\"http://blogs.msdn.com/acoat/archive/2007/03/01/linking-word-2007-content-controls-to-custom-xml.aspx\">here</a></li>\n<li>Writing macro code to validate your content controls? <a href=\"/projects/dbe/30b6e20b-3206-4e28-bb5c-0877296a17ae\">Download this tutorial</a> to learn how to use the lesser known, yet powerful schema validation feature of content controls that comes with it&#39;s very own UI!</li></ul>\n<b>The toolkit in action</b><br /><br /><img src=\"/projects/dbe/8e06a1b8-fac3-4390-bc66-959ac6d93d9d\" alt=\"bind.png\" title=\"bind.png\" /><br /><br />--Matt Scott</div><div class=\"ClearBoth\"></div>",
  "TagList": "xml,Office,Word,Semilavorati,Word 2007,Content Controls,openxml,control,Open XML,Office Open XML,",
  "LastEdited": "2015-09-04T01:23:11.89-07:00"
}