{
  "ProjectName": "DBProBridge",
  "Title": "DBPro Bridge",
  "Description": "DBPro Bridge is an emerging open source Visual Studio add-in that enables access to the Database Professional project for developers without a DB Professional license. DBPro Bridge facilitates better collaboration between a DBA, who is using Team System Edition for DBPro, and developers without a Team System for DBPro license that need to edit and create new files in sync with the DBA.\n\nDBPro Bridge enables the developer to create a \"mirror\" of an existing DB Professional project file and make it available via source control.  Visual Studio developer’s project files are kept in sync with the DBA’s version and vice versa, making it a free alternative to Team System Edition for DBPro.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\r\nDBPro Bridge is an emerging open source Visual Studio add-in that enables access to the Database Professional project for developers without a DB Professional license. DBPro Bridge facilitates better collaboration between a DBA, who is using Team System Edition for DBPro, and developers without a Team System for DBPro license that need to edit and create new files in sync with the DBA.<br /><br />DBPro Bridge enables the developer to create a &#34;mirror&#34; of an existing DB Professional project file and make it available via source control.  Visual Studio developer&#8217;s project files are kept in sync with the DBA&#8217;s version and vice versa, making it a free alternative to Team System Edition for DBPro.<br /><br /><b>Getting Started: Click here for <a href=\"https://dbprobridge.codeplex.com/wikipage?title=User%20Manual&referringTitle=Home\">User Manual</a></b><br />\n<h1>DBPro Bridge aims to:</h1>\r\n<ul><li>Enable access to the Database Professional project for a regular developer without a DB Professional license.   (This doesn&#39;t include any extra features that DB Pro is providing, but grants access to the files for Visual Studio developers.)</li>\n<li>Enable editing of a DBPro project file with the editor of your choice. There is a limitation in Visual Studio how you can open and pass parameters to the non-built in editor. </li>\n<li>Synchronise DBA and Visual Studio developer edits.  As a developer creates, updates or deletes files from the mirror of the dbproj file, DBPro Bridge will synchronise changes with a DBA&#39;s dbproj file.  This also occurs for changes made by a DBA, which can be synchronized to the project &quot;mirror&quot; (i.e. .csproj file) project. </li>\n<li>As amount of files in the db project may become particularly large, in order to mitigate conflicts, DBPro Bridge enables getting the latest of only dbproj or the &quot;mirror&quot; project.  Currently, Visual Studio does not enable simple non-recursive &quot;get latest&quot; on the project file only. (This is subject to review pending the release of VS2008.)</li></ul>\n\n<h1>Technical Requirements: </h1>\rIn order to run DBPro Bridge you need to have a Microsoft Visual Studio 2005 Team Foundation Server and Visual Studio 2005.<br />\n<h1>Contributing to DBPro Bridge:</h1>\rFeel free to contribute by:<br />\n<ul><li>Blogging about DBPro Bridge</li>\n<li>Ask and answer questions on the discussion forum</li>\n<li>Submit issues or feature suggestions</li>\n<li>Fix bugs or check in new features</li></ul>\n\n<h1>Background:</h1>\rDBPro Bridge was developed by Stan Dvoychenko, .Net architect at DeCare Systems Ireland,   while working on a Insurance Claims application for a large US insurer.   DBPro Bridge is currently is use by team members within this project.</div><div class=\"ClearBoth\"></div>",
  "TagList": "addin,Database,dba,DBPro,DB Professional,vs addin,",
  "LastEdited": "2007-10-26T01:46:37.42-07:00"
}