{
  "ProjectName": "DDRCP",
  "Title": "Database Disaster Recovery Control Panel",
  "Description": "Application to manage one or many SQL Servers, disaster recovery. It was designed to give the database administrator a central management point for database disaster recovery management.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Application to manage one or many SQL Servers, disaster recovery. It was designed to give the database administrator a central management point for database disaster recovery management.<br />\n<h1>Technical Points</h1>\rThe Application was written in C# with a SQL Database for configuration data. Current release requires the Microsoft .NET Framework 3.5, with the SQL Server 2008 SMO Libraries. The configuration database can be located on SQL 2005 and greater.<br /><br /><b>Mirrored databases</b><br />If the database is mirrored, the application will manage the mirror, scripts can be added to the application that once failed over will execute on the mirror as part of the post failover phase. These scripts can be used to fix users, change database configurations etc.<br /><br /><b>Non-Mirrored databases</b><br />If the database is not mirrored, the application will directly execute the post failover phase on the mirrored database and can be used to execute scripts to recover log shipping or configure replication.<br />\n<h1>Community</h1>\rThis application was written to solve a problem, which it does for me. While writing this app, I kept it in the back of my mind that I would share it for other DBA’s. I use this app in production, but I have not finished some of the items such as the user interface to insert / update configuration records. Most of the focus that went into this app revolved around database mirroring, threading and reliability. The application is functional with non mirrored DR technologies as long as it can be managed with TSQL. <br /><br />I would like to see the interface updated, I am a DBA; so functional is all I know… But most of all, I would like to make this a community effort to see how useful this application can become for everyone.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-03-26T10:28:47.37-07:00"
}