{
  "ProjectName": "DeltaGrid",
  "Title": "Delta grid",
  "Description": "Proyecto DeltaGrid version BETA para el control de catalogos de una forma sencilla y facil de usar.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Proyecto DeltaGrid version BETA para el control de catalogos de una forma sencilla y facil de usar.<br /><br /><br />El DeltaGrid es el componente perfecto para reducir el tiempo de desarrollo de sus proyectos asp.net, ya que automaticamente permite mostrar y editar los registros de una tabla, es decir, con una simple configuraci&#243;n, se puede tener una pagina web que controle un catalogo de forma facil.<br /><br />&#191;No le ha ocurrido que una vez publicada la pagina web el cliente le solicita agregar/modificar una nueva columna o algun cambio en el formato?, bueno pues DeltaGrid es la soluci&#243;n, ya que le permite manejar campos din&#225;micos, estos campos se agregan OnLine, es decir, no tiene que recompilar su proyecto web ni dejar temporalmente fuera de linea su sitio web.<br /><br /><b>El DeltaGrid es gratis, puedes descargarlo y probarlo de forma gratuita, indica los bugs encontrados.</b><br /><br /><b>Dudas y comentarios al correo cerinogomez@yahoo.com.mx o en el apartado de Discussions y Issues</b><br />=================================================================<br /><br />DeltaGrid is the component that help you to reduce the time of system developing, because with one line of code, DeltaGrid shows the catalogo with the comun operations: Insert,Update,Delete,Get, Get All,<br /><br />DeltaGrid permit add new fields to the entity, this fields is adds in dynamic form from you website, without to modify code, store procedure and table.<br /><br />DeltaGrid permit, in line, configured the type of editor for the column of the entity, also, configured the type of type column that you  want show in the GridView, and  more that you mind can produce.<br /><br /><b>This component is free, you can use in your web project, only i want that you upload the bugs found.</b><br /><br /><br /><b>All comments and doubts, send me a mail to cerinogomez@yahoo.com.mx or in tab Discussions and Issues in this web page</b></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-07-16T11:29:43.747-07:00"
}