{
  "ProjectName": "dept",
  "Title": "DSL Editor PowerToy",
  "Description": "This powertoy, specifically for DSL's (Domain Specific Languages), provides the ability to expose multiple views of a domain each with their own windows forms-based control editor. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Welcome </h1>\rThis is the home of the <b>DSL Editor ‘PowerToy’</b> project - a DSL enhancement PowerToy for displaying multiple customized views of a domain specific languages (DSL&#39;s).\n<h2>Quick links</h2>\r<table><tr><td> <b>Current Release:</b> </td><td> <a href=\"https://dept.codeplex.com/releases/view/2089\">M1 Released</a> </td></tr>\n<tr><td> </td><td> <b>Documentation</b></td></tr>\n<tr><td> </td><td> <a href=\"https://dept.codeplex.com/wikipage?title=ReleaseM1&referringTitle=Home\">What is this release&#63;</a></td></tr>\n<tr><td> </td><td> <a href=\"https://dept.codeplex.com/wikipage?title=ReleaseM1_Use&referringTitle=Home\">How to install and use it&#63;</a> </td></tr>\n<tr><td> </td><td> <a href=\"https://dept.codeplex.com/wikipage?title=ReleaseM1_Customize&referringTitle=Home\">How to customize it&#63;</a> </td></tr>\n<tr><td> <b>Next Release:</b> </td><td> <a href=\"https://dept.codeplex.com/wikipage?title=ReleaseM2&referringTitle=Home\">What is the next release&#63;</a> </td></tr>\n<tr><td> <a href=\"https://dept.codeplex.com/wikipage?title=Milestones&referringTitle=Home\">All Releases</a> </td><td> </td></tr></table>\n<h1>What is it?</h1>\rThis PowerToy aims to provide a new capability that will provide an enhanced user experience for displaying and interacting with different aspects of a domain model in multiple dedicated &#39;editors&#39;.<br /><br />The PowerToy will provide your DSL with a new tool-window containing one or more editors that manage configurable &#39;views&#39; of domain classes, and their relationships. The PowerToy displays these various views by hosting windows controls that display the view, and manage the users interaction with them.<br /><br />For example, the following screenshot displays one such editor (bottom-half of the screen) specific for manipulating &#39;Data Contracts&#39; of an existing example DSL used for authoring Web Services.<br /><br />[image:DataContractEditor(Small).jpg]<br /><br />You can also see a similar example of an editor specific for &#39;Service Operations&#39; of the same DSL <a href=\"http://blogs.msdn.com/photos/jezzsa/images/1324294/original.aspx\">here</a>. <br />Another example of an alternative implementation used for Data Contracts in another DSL <a href=\"http://www.edwardbakker.nl/PermaLink,guid,11ab1f38-75aa-4ce2-8fc7-ff950b745aa9.aspx\">here</a>.\n<h1>The Basic Idea</h1>\rThe PowerToy will be available for download (also in source form), and will be installed by a DSL developer on their development machine.  The DSL author will, within their existing DSL solution, add and configure one or more custom editors to display some aspect of the domain model of their DSL. At runtime these editors will be displayed to the user of their DSL.<br /><br />The PowerToy will provide (as one choice of editor) a tree-grid-like control that displays a hierarchy of domain models elements and their child relationships. This control then allows the user to interact with and manipulate the domain classes and their properties.<br /><br />Please check our example <a href=\"https://dept.codeplex.com/wikipage?title=User%20Scenario&referringTitle=Home\">User Scenario</a> for more details for one requirement for this kind of editor, and what drove the existing implementation for it.<br />\n<h1>Benefits</h1>\rThe benefits of the PowerToy include:\n<ul><li>Provides a means to view/edit relationships and domain classes that have no visible representation on the diagram</li>\n<li>Reduces shape clutter on the diagram surface</li>\n<li>Provides a hierarchical view of (possibly hidden) child relationships </li>\n<li>Provides a better UX (keyboard navigation) for editing multiple properties of domain classes as part of hierarchical relationships, bulk editing.</li>\n<li>Also improves visibility of key properties and enables better comparisons of related instances alongside each other.</li>\n<li>Allows aspect focused editors (one editor per aspect) </li>\n<li>Each aspect or &#39;view&#39; on the domain model would have a separate editor.</li>\n<li>Can replace the grpahical designer of the DSL, with forms based editors where a box-line user interface is not optimal for the domain.</li></ul>\n<h2>Increased Usability!</h2>\rIn essence, this power toy primarily provides a better User Experience (UX) for the DSL user by exposing relationships potentially with no visibility on the diagram (i.e. in shapes or connectors), reducing shape clutter, and giving the user the ability to rapidly configuration the exposed domain classes and properties in the editor. <br /><br /><b><u>Essentially this PowerToy provides the ability to expose hierarchical &#39;views&#39; of the underlying domain model, that can be displayed using any windows control or other display technology</u></b><br />\n<h1>The Approach</h1>\rWe are providing a staged approach to completing the implementation this PowerToy. At each stage (milestone) will deliver working code that adds a new capability to a DSL. <br />Each release is designed to build upon the previous release and enhance it with a new capability and infrastructure to support that capability. <br />The intention is to provide a DSL developer, using the PowerToy, deliverables that can be taken and customized to solve incremental problems that the PowerToy encounters in its development, that are expected to encounter anyone implementing this type of functionality.<br /><br />Please see the <a href=\"https://dept.codeplex.com/wikipage?title=Milestones&referringTitle=Home\">Milestones</a> page of this project to see what releases we have and what they will deliver.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Visual Studio,Software Factory,Software Factories,DSL,Domain Modeling,PowerToy,Design time,DSL editor,object editor,class editor,domain specific lang,Interesting,rad,",
  "LastEdited": "2007-07-28T10:40:35.733-07:00"
}