{
  "ProjectName": "devMobile",
  "Title": "devMobile.NET Library for Windows Phone 7.1",
  "Description": "devMobile.NET Library intends to offer a set of commons and not so commons controls for developing Windows Phone 7.5 applications. It offers classic controls like both pie and column charts for simple scenarios as well as other not so classic controls like SignalAccuracy control for displaying, for instance, the GPS accuracy like WP7 built-in GPRS/3G signal coverage indicator does. It also provide a tag cloud control for displaying item in the way common web based tag clouds usually offer.\r\n\r\nFinally it also provides some class extensions for GeoCoordinates and Maths.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\n<br>\r\ndevMobile.NET Library provides a set of Controls specifically designed for Windows Phone 7.5 platform. This library is a result of a common requirement controls I have been needing for my WP7 apps.</p>\r\n<p>It is in Alpha phase although some of the controls are already running in real WP7 apps. The list of controls are:</p>\r\n<ul>\r\n<li>Simple and basic PieChartControl and ColumnChartControl </li><li>SignalAccuracyControl and SignalAccuraryRoundControl </li><li>CloudItemContainer Control. </li></ul>\r\n<p>Besides of those controls, it also provides some extensions classes like:</p>\r\n<ul>\r\n<li>Extension class for randoms Colors. </li><li>Extension class over GeoCoordinate class for calculating the distance between two coordinates using Haversine formula.\r\n</li><li>Basic math extension class mainly used by Haversine formula. </li></ul>\r\n<p><strong>Roadmap</strong><br>\r\nThe content you are currently viewing is under construction. I will try to offer this library via Nuget and provide a wide variety of samples and documentation. So far, you may download the latest code I will be uploading frequently.</p>\r\n<p>&nbsp;</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-05-31T04:21:39.08-07:00"
}