{
  "ProjectName": "DigitalFrame",
  "Title": "DigitalFrame",
  "Description": "A WPF Application written using the Prism framework which can be used for a Laptop -> Digital Picture Frame conversion project.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A WPF Application written using the Prism framework which can be used for a Laptop -&#62; Digital Picture Frame conversion project.<br /><br />I had a spare laptop available and wanted to re-purpose it into a digital picture frame.  While looking around I found a lot of applications that I could use to show images, however most were for Linux distributions and I wanted this to be a windows implementation.  Regardless, all of the applications I found didn&#39;t have the functionality I was looking for.<br /><br />I was interested in Prism, so I went about creating a digital picture frame using WPF and Prism.  DigitalFrame is the result.<br /><br />I do imagine a few more Modules that I could add, including a Calendar Module, maybe a Twitter module.<br /><br />I wrote about the process of creating the digital picture frame here:  <a href=\"http://blog.themancinis.com/2009/07/laptop-digital-picture-frame.html\">http://blog.themancinis.com/2009/07/laptop-digital-picture-frame.html</a><br /><br /><b>Important</b><br />The images used within the weather module are currently VERY UGLY.  In my own implementation, I am using the images from http://wruc.codeplex.com.  The images contained within http://wruc.codeplex.com are Microsoft copyright.  I kept the names identical, so if you want to have your weather module show more attractive images, copy the images from http://wruc.codeplex.com over my UGLY images.<br /> <br /><a href=\"http://picasaweb.google.com\"><img style=\"border:none;\" src=\"http://lh3.ggpht.com/_euFKhL_RTi8/SkmGilbbc1I/AAAAAAAAAW0/qACPuqnj7dA/s800/DigitalFrame%20Screenshot.jpg\" alt=\"Screenshot\" title=\"Screenshot\" /></a><br /><br />Images contained within above screen shot are copyright Microsoft.</div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,Prism,Photo Viewer,Weather,",
  "LastEdited": "2009-07-08T20:22:36.857-07:00"
}