{
  "ProjectName": "dIRca",
  "Title": "dIRca WP7 IRC Client",
  "Description": "IRC client with possible SL/WPF ports. Utilizes native tcp sockets until the communication layer from MS solidifies. Basically put, this project would not exist without the work of some wp7 hackers. Pip pip old boys.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description:</b><br />IRC client with possible SL&#47;WPF ports. Utilizes native tcp sockets until the communication layer from MS solidifies. Basically put, this project would not exist without the work of some wp7 hackers. Pip pip old boys.<br />\n<h1>Welcome to IRC, circa 1994 for your Windows Phone 7 device!</h1>\r\n(Updated 10/25/2013)\n<h3>New new new direction == abandonment issues</h3>\r2 years is a long time to not say a word but in case there was any other indication, this specific project is abandoned.<br /><br />I started another project, heavily coupled to IrcDotNet, leveraging SQL CE as the message store and an attempt at cloning the Messaging Hub as close as possible. The bulk of the commits were in 2011 and subsequently <b>that</b> project broke me as well. It honestly should&#39;ve been open sourced much sooner.<br /><br />The TL;DR version is the socket support required to keep IRC connections open just isn&#39;t there on Windows Phone 7 or Windows Phone 8. Your only options are a BNC of some nature and I most definitely don&#39;t have an infrastructure to support that for more than just myself. Choosing an ancient protocol like IRC on Windows Phone was a terrible first project idea that will likely never pan out.<br /><br />The project is hosted on Github here: <a href=\"https://github.com/w0rd-driven/derpirc\">https://github.com/w0rd-driven/derpirc</a>.<br />There are currently no releases to make deployment easy, sorry about that. I should be able to fix that within a few days if I&#39;m lucky...<br /><br />For previous updates, see: <a href=\"https://dirca.codeplex.com/wikipage?title=Update%20Log&referringTitle=Home\">Update Log</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "WP7,irc client,IRC,",
  "LastEdited": "2013-10-24T22:30:26.367-07:00"
}