{
  "ProjectName": "dnntestimonials",
  "Title": "DNN Testimonials",
  "Description": "DNN Testimonials was created to help sites display, collect and manage testimonials while providing the admin complete control of the process, layout & look",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The DNN Testimonials Module is an open source contribution to the DNN Community for DNN 7+* (<i>This was built against DNN 7.0.4 and is known to work with that version forward, but there have been reports that it doesn&#39;t work with 7.0.0. That&#39;s currently being looked at</i>). The DNN Testimonials Module was created to not only help DNN websites to display testimonials, but also to collect and gather testimonials as well, while providing the module administrator the ability to control the whole process. <br /><br />The Goals of this Module are:<br /><br />1) Allow DNN Websites the ability to display customer testimonials on their website<br /><br />2) Allow DNN Websites the ability to collect testimonials from visitors directly on the site<br /><br />3) Allow DNN Website Admins the ability to moderate testimonials<br /><br />4) Leverage the DNN Permissions system to determine who can View, Create, and/or Edit testimonials<br /><br />5) Leverage the DNNWebAPI features<br /><br />6) Allow DNN Websites to easily template the look and feel of the displayed testimonials to seamlessly integrate with their current skins.<br /><br />Currently, <b>features Include</b> the ability to Import and Export Module Content; Upgrade Support; and Integrated Search capabilities (user testimonials will be included in the DNN Search Results)<br /><br /> Please make sure to review the documentation page for up to date information on how to use the module correctly. <br /><br />Also, please log issues on the Issues page and questions on the discussions page. I can&#39;t respond to Reviews, so I can&#39;t provide the answers to all users, which would be most helpful for the community. <br /><br />THANKS!!! <br /> <br /><br />There are many useful features that can be added to the module to help fill a greater number of use cases and those features will be on the roadmap as well as new features determined by users as they are made clear.<br /><br />I welcome the community feedback and hope this module can prove to be useful for the community. <br /><br />Cheers!<br /><br />Briana Finney<br /><br /><a href=\"http://www.imaginationapplications.com\">http://www.imaginationapplications.com</a>  <br />  (formerly Virtual-Essentials.com)<br /><br /><br />Thanks again!<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "DotNetNuke,Modules,Testimonials,DNN Community,dotnetnuke modules,dnn modules,dnn testimonials,testimonial module,",
  "LastEdited": "2016-07-13T07:00:36.45-07:00"
}