{
  "ProjectName": "DocToolTipLib",
  "Title": "DocToolTip Library",
  "Description": "DocToolTip library allows creating screenshots of winform forms with the name and type of component controls.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rDocToolTip library allows creating screenshots of winform forms with the name and type of component controls. \n<h1>Motivation</h1>\rThis library-tool was thought for creating paper-documentation in a handover. It can look useless, because any programmer can understand the GUI component structure using VS designer or other designers that allow navigating between GUI components pretty well. But I think that it can provide a quick view of the window-components, so, we don’t need to navigate between the controls to see which control is used.\n<h1>Features</h1>\r<ul><li>Move the tool tips </li>\n<li>Show/Hide tool tips</li>\n<li>Change tool tips properties \n<ul><li>BackColor </li>\n<li>Font </li>\n<li>ForeColor </li>\n<li>Opacity </li>\n<li>Caption, it can show name or type control or a custom text </li>\n<li>Padding </li>\n<li>Relative position of the tooltip from the associated control </li>\n<li>Visibility</li></ul></li></ul>\n<h1>Screenshots</h1>\r<table><tr><th>A winform form</th><th>Doc Tooltip Manager</th></tr>\n<tr><td><img src=\"/projects/DocToolTipLib/15f33c7a-a5c3-4009-9a87-74e7a9a05e35\" alt=\"ScreenShot1.jpg\" title=\"ScreenShot1.jpg\" /></td><td><img src=\"/projects/DocToolTipLib/308f4974-e986-4ff9-b614-478cfe15e83c\" alt=\"DocToolTipManager.jpg\" title=\"DocToolTipManager.jpg\" /></td></tr></table><br />\n<h1>How does it work?</h1>\rThis tool works when our target application is running. A control can subscribe to this tool the following way:<br /><div style=\"color:Black;background-color:White;\"><pre>\r\n      <span style=\"color:Blue;\">if</span> (!DvesignMode)\n      {\n        DocToolTipHelper.Instance.AddControl(<span style=\"color:Blue;\">this</span>);\n      }\r\n</pre></div> <br />In runtime, a icon is visible in sys-tray that allows showing the Doc ToolTip Manager,<br /> <br />The menu entry &quot;List Controls&quot; contains an entry by each control subscribed. When a menu of a control is clicked, the doc tooltip are created and shown over the winform control.<br /> \n<h1>Doc ToolTip Manager</h1>\rThis window can be accessed by double clicking on the icon in the systray. It allows to show the doc tooltips for any control that is subscribed to this tool.\n<h2>Menu Bar</h2>\r<table><tr><th>Menu</th><th>Description</th></tr>\n<tr><td><b>Control List</b></td><td>It contains all controls subscribed to this tool.</td></tr>\n<tr><td><b>Tools</b></td></tr>\n<tr><td><b>Relocate</b></td><td>If the current control is moved, the tool tips are not moved. This command allows relocating the tooltips respect the position of the associated component control.</td></tr>\n<tr><td><b>Clear all</b></td><td>This command unloads the current control and removes all the tooltips from the screen.</td></tr>\n<tr><td><b>Help</b></td></tr>\n<tr><td><b>About</b></td></tr></table>\n<h2>Tabs</h2>\r <b>Document Outline</b><br />It allows to see the logic control tree, and showing or hiding the tooltips. We can work on a single tooltip or multiple tooltips, also we can select all controls under a container control.<br />The property grid shows the properties of the tooltips selected allowing change the appearance and layout.<br />Let&#39;s see an example in the following snapshot:<br /><img src=\"/projects/DocToolTipLib/0ef4a084-d024-4e42-9961-6f1deefae00d\" alt=\"ScreenShot2.jpg\" title=\"ScreenShot2.jpg\" /><br /> <b>Type Map</b><br />It shows the hierarchy class type of control contained within the selected control. This view allows showing/hiding the controls by type. The commands &quot;Hide Children&quot; and &quot;Show Children&quot; show and hide the controls contained within the controls are of the selected type.\n<h2>Systray Icon</h2>\rIt shows a information balloon when a control is subscribed. And it allows showing the doc tool tip manager by a double click.\n<h1>Funny things…</h1>\rThis tool was thought to use when the application is running. But it happens that can also be used from the designer of VS. When we work with a form in the designer, VS load the assembly, so, if we don&#39;t check DesignMode flag, we could work with doc tooltip manager as well in VS. I have hardly tested this feature, but it doesn&#39;t make sense to use this tool with the designer (that you can navigate between component controls), at least for me.\n<h1>Acknowledges</h1>\rMikael Wiberg for his MWTreeView control, it’s great! <a href=\"http://www.codeproject.com/KB/tree/mwcontrols.aspx\">http://www.codeproject.com/KB/tree/mwcontrols.aspx</a><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "user interface,documentation,screenshot,",
  "LastEdited": "2009-07-14T05:46:37.717-07:00"
}