{
  "ProjectName": "DotCommunities",
  "Title": ".communities",
  "Description": ".communities is an AJAX-enabled, multi-user content management system that allows for an individual or an ISP to quickly create and administer a collaborative website such as a club site, a user group site, or a news site. Based on the popular source code of the original Community Starter Kit (CSK) released in 2003, it has a number of standard content modules and supports multiple site/url configurations via a single database. .communities contains all the features that you would expect to find in any other Web 2.0 application; HTML content, Wikis, Blogs, Discussions, Photo Galleries, RSS Newsfeeds etc. as well as a plethora of advanced configuration options and settings. Out of the box, .communities has everything you need to create and manage most types of site - its easy to use and runs on a core framework that can be fully customised if required.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h3>PLEASE NOTE: This project is now CLOSED</h3>\rNo further development will made on this project.<br /><br /><b>Alternatives</b><br /><br /><a href=\"http://www.telerik.com/products/sitefinity.aspx\">Telerik Sitefinity CMS</a> is a free product that has similar features to the .communities project.<br /><br />The <a href=\"http://www.codeplex.com/CASKDotNet\">Community Advanced Starter Kit</a> project is available for users requiring a complete implementation of a community content management framework.<br /><br /><b>The Project</b><br />.communities is more than just a refactored version of the <i>Community Starter Kit</i>, with .communities the intention is to create a full featured, industry standard web application which can be used without modification to create a multi-user collaborative website.  Included with .communities are a set of core modules which will allow users to perform generic tasks such as creating articles, blog entries, discussions etc.  .communities also makes it much easier to create new modules and is useful for developers who require a customised user experience for creating/displaying content.  The core framework has also been redesigned with a new level of customisation, allowing for developers to extend the framework however they see fit.<br />\n<ul><li><a href=\"https://dotcommunities.codeplex.com/wikipage?title=FAQ&referringTitle=Home\">Frequently Asked Questions</a></li>\n<li><a href=\"https://dotcommunities.codeplex.com/wikipage?title=Setup&referringTitle=Home\">Installation Guide</a></li>\n<li><a href=\"https://dotcommunities.codeplex.com/wikipage?title=Walkthrough&referringTitle=Home\">Configuring Your First Community</a></li></ul>\n<br /><b>Screen Shots</b><br /><img src=\"/projects/DotCommunities/ca3a506f-b4b6-48dd-b07b-d170d3123694\" alt=\"home_design_sample.jpg\" title=\"home_design_sample.jpg\" /> <img src=\"/projects/DotCommunities/403fb486-e428-4a83-a94b-b052263a3e08\" alt=\"admin_background_sample.jpg\" title=\"admin_background_sample.jpg\" /><br /><a href=\"https://dotcommunities.codeplex.com/wikipage?title=Screenshots&referringTitle=Home\">See More...</a><br /><br /><b>Advanced Features</b><br />Here are just a few of the more advanced features of .communities:<br />\n<ul><li>An extensible core framework architecture allowing for complete customisation</li>\n<li><i>Enterprise Library</i> integration for database access, caching, logging and exception handling</li>\n<li>ASP.NET 2.0 <i>Membership</i>, <i>Role</i>, <i>Profile</i> and <i>Personalisation</i> features (including <i>Web Parts</i> integration)</li>\n<li>Implements the <i>Provider Model</i> pattern for customised application configuration</li>\n<li>Includes the <i>Tasks Application Block</i> for running scheduled background processes</li>\n<li><a href=\"https://dotcommunities.codeplex.com/wikipage?title=Features&referringTitle=Home\">Read More...</a></li></ul>\n<br /><b>Get Involved</b> <br />If you would like to provide feedback on .communities, please direct your comments or questions to the developer forums - accessed via the <a href=\"http://www.codeplex.com/DotCommunities/Thread/List.aspx\">Discussions</a> tab at the top of this page. Please <u>do not</u> post work items to the <i>Issue Tracker</i>, I will convert a discussion to a work item if I feel that it is worth further investigation (this will make it easier for me to manage the project).</div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,RSS,ASP.NET,C#,blogging,CMS,watch,collaboration,tasks,blog,CASK,Starter Kit,Community,Articles,Photo Gallery,Events,Communities,Web 2.0,.NET 2.0,Enterprise Library,ISP,CSK,Content Management,Modules,Modular,Framework,web,Portal,Web Part,forum,patterns,patterns &amp; practices,Web Framework,best practices,favorite,C# 2.0,ASP.NET 2.0,Web Services,AJAX Control Toolkit,web parts,FCKEditor,Membership,ASP.NET Ajax,newsletter,Reviews,Discussions,TinyMCE,WebParts,Personalization,Forums,DotCommunities,.communities,jeffday,",
  "LastEdited": "2009-06-18T06:55:36.893-07:00"
}