{
  "ProjectName": "dynamicsaxbuild",
  "Title": "Dynamics AX Build Scripts",
  "Description": "Sharing build scripts for Dynamics AX integration with source control, focused on Team Foundation Server (TFS)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Dynamics AX Build Scripts</h1>\r\nThis project is intended for the AX developer community to share scripts, code snippets and solutions related to source control, build processes and testing for Microsoft Dynamics AX.<br /><br /><b>If you are looking for Team Foundation Server (TFS) activities for Dynamics AX 2012, please use <a href=\"http://dynamicsaxadmin.codeplex.com\">http://dynamicsaxadmin.codeplex.com</a>! If you are looking for PowerShell scripts or AX 2009 scripts, you&#39;re in the right project.</b><br />\n<h2>Build Activities</h2>\r\nBuild activities for TFS have been refactored entirely and are available from <a href=\"http://dynamicsaxadmin.codeplex.com\">http://dynamicsaxadmin.codeplex.com</a>.<br />\n<h2>How To Get Started</h2>\r\nI have some information on <a href=\"http://daxmusings.blogspot.com\">my blog</a>, including an overview of how to <a href=\"http://daxmusings.blogspot.com/2011/05/tfs-build-workflow.html\">modify the standard build template</a>, and an <a href=\"http://daxmusings.blogspot.com/2011/06/ax-tfs-faq.html\">FAQ on AX &amp; TFS</a>. To use unit tests in your builds, download the SysTestListenerTRX classes. To setup a test project read my article on <a href=\"http://daxmusings.blogspot.com/2011/07/generic-unit-tests-for-dynamics-ax-in.html\">wrapping AX unit tests in a Visual Studio generic tests</a>.<br />\n<h2>Please Contribute Your Scripts and Derivative Scripts</h2>\r\nBy sharing our scripts and code we use related to source code integration and builds, we&#39;re hoping to encourage others to do the same. Whether you have your own scripts, modified any of the scripts available in this project, we want to see it!<br />Please <a href=\"http://www.emailmeform.com/builder/form/O5KkB4Z3qx58WfbY2XdGUu\">contact me</a> and I will get you access to upload and maintain your scripts.<br />\n<h2>Special Thanks</h2>\r\nTo all contributors. We are trying to build something for the community, and we can&#39;t do it without your input.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-04-08T10:02:54.257-07:00"
}