{
  "ProjectName": "EAppointments",
  "Title": "E-Appointments",
  "Description": "Microsoft ASAP (Aspiring Software Architects Program) Case Study Implementation using the latest .NET 3.0 Technologies and proven Microsoft patterns and practices like Software Factories and Enterprise Library.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><img src=\"/projects/EAppointments/f6012f75-be67-4174-8bbf-da5a7f1c8aa8\" alt=\"asap-logo.bmp\" title=\"asap-logo.bmp\" /><br /><b>Project Description</b><br />E-Appointments - Microsoft ASAP &#40;Aspiring Software Architects Program&#41; Case Study Implementation using the latest .NET 3.0 Technologies and proven Microsoft patterns and practices like Software Factories and Enterprise Library.<br /><br /><b>About ASAP Program</b><br />ASAP (Aspiring Software Architects Program) is a series of web casts designed specifically based on the needs of aspiring application architects in India. It brings Champion Architects from Microsoft&#39;s partner organizations who are challenged by Microsoft host, Vikram Rajkondawar to share their experience, challenges faced, pitfalls and lessons learnt across interesting topics. You can learn more about the program <a href=\"https://eappointments.codeplex.com/wikipage?title=ASAP%20Program&referringTitle=Home\">here</a>. <br /><br /><b>What is E-Appointments?</b><br />E-Appointments is the blue-print application that will be covered as a case study durig the ASAP web cast series. The E-Appointments application has been designed to demonstrate how you can develop a distributed application using several new Microsoft technologies. The sample application utilizes several technologies including: Windows Communication Foundation, Windows Workflow Foundation, Windows Presentation Foundation, ASP .NET Ajax, Live Maps.<br />The entire source code for the E-Appointments sample application is provided as a download so you can learn how these technologies can be used within a scenario-based application. <br /><br />The application was architected and developed by <a href=\"http://www.indigoarchitects.com\">Indigo Architects</a><br /><br /><b>E-Appointments Business Scenario</b><br />The Department of Health for one of the developed countries is trying to bring the doctors and patients together into a single market place. According to their research, patients want to be more involved in making decisions and choosing their healthcare. Keeping this in mind, the E-Appointments system has been designed to provide more choice and flexibility to patients. It allows patients to exercise choice of doctors and therefore facilitates a seamless appointment and booking process. Patients will be able to choose from a range of hospitals as well as choose a convenient date and time for an appointment to see a specialist.<br /><br /><u><i>Mission</i></u> : <i>Every hospital appointment will be booked for the convenience of the patient, making it easier for patients and their GPs to choose the hospital and Hospital Consultant that best meets their needs</i>.<br /><br /><b>Quick Links</b>\n<ul><li><a href=\"http://www.codeplex.com/EAppointments/Release/ProjectReleases.aspx\">Download the latest E-Appointments release</a></li>\n<li><a href=\"http://www.codeplex.com/EAppointments/Thread/List.aspx\">Discuss the sample and share your feedback in the forum</a></li>\n<li><a href=\"http://www.codeplex.com/EAppointments/WorkItem/Create.aspx\">Report bugs, suggestions and issues with the samples</a></li></ul>\n<b>Learn More</b><br />Want to learn more about the E-Appointments sample application or the technologies used in the sample?Here are some key resources:\n<ul><li><a href=\"/projects/EAppointments/b62a728a-7ad6-4f67-9d69-c7d3b7e2d6f1\">Requirements</a> - E-Appointments Requirements (Brief)</li>\n<li><a href=\"/projects/EAppointments/2b538392-7709-4b81-941a-246395145da5\">Scope</a> - E-Appointments Sample Application Scope Document</li>\n<li><a href=\"/projects/EAppointments/3d6a4d22-2ae4-4812-92b5-9fe7aee1226c\">User Manual</a> - E-Appointments User Manual</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,workflow,WPF,wcf,Software Factory,.net 3.0,WCSF,ASP.NET 2.0,AJAX Control Toolkit,Maps,MyList,ASAP,Aspiring Software Ar,",
  "LastEdited": "2008-03-25T03:08:43.383-07:00"
}