{
  "ProjectName": "EasyDiagram",
  "Title": "EasyDiagram.Net",
  "Description": "A custom composite control using pure AJAX and Javascript to provide real-time diagram and flowcharting to your asp.net 2.0 pages. Unlike most commercial products that I've seen, EasyDiagram.NET offers a smooth real-time redrawing of node hierarchy. Please visit www.EasyDiagram.net for examples.\n\nEasyDiagram.NET can be imported into your toolbox for use on your webforms. Currently, the page that uses EasyDiagram.NET must have div { position: absolute } in its header in order for the diagramming to render correctly. The component is 100% C# and implements ICallBackEventHandler for AJAX processing. The amazing real-time line drawing is done in Javascript and I give all the credit to this developer with this great idea: http://www.p01.org/articles/DHTML_techniques/Drawing_lines_in_JavaScript/\n\nPlease note that this project is in the early stage of development, and as such there are plenty of bugs yet to work out and features to be added.\n\nNote to Developers\nI would be happy for you to join me in making EasyDiagram.NET even better, so if you'd like to know more, please email me at timheckel@gmail.com. Thanks.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A custom composite control using pure AJAX and Javascript to provide real-time diagram and flowcharting to your asp.net 2.0 pages. Unlike most commercial products that I&#39;ve seen, EasyDiagram.NET offers a smooth real-time redrawing of node hierarchy. <br /><br />Please visit <a href=\"http://www.EasyDiagram.net\">http://www.EasyDiagram.net</a><br /><br />EasyDiagram.NET can be imported into your toolbox for use on your webforms. The component is 100% C# and implements ICallBackEventHandler for AJAX processing. <br /><br />Finally, with the beta release of EasyDiagram.NET, the control should be usable with minimal effort. I understand that more documentation is needed, and it is forthcoming.<br /><br />Note to Developers<br />I would be happy for you to join me in making EasyDiagram.NET even better, so if you&#39;d like to know more, please email me at <a href=\"mailto:timheckel@gmail.com\">here</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "diagramming,flowchart,uml,EasyDiagram,Diagram,ASP.NET,workflow,EasyDiagram.NET,visio,asp.net 2.0,Genealogy,schema,ajax,cool,utility,asp.net controls,javascript,yorkrj,web workflowdesigner,",
  "LastEdited": "2008-04-30T21:03:04.127-07:00"
}