{
  "ProjectName": "elo",
  "Title": "Elo",
  "Description": "This program is a simple implementation of the Elo ranking system which is commonly used for games like chess and go. It uses a SQL backend and there are two sql scripts included which must be run. Also the connection string in the app.config file must be configured before use.\n\nIt's fairly straightforward. The only thing that might be a little confusing is that the point value of the game is not used in the rating. Currently, this number is just stored in the database but later it will be used to calculate betting payouts between players.\n\nAlso, this was initially made for backgammon so there are radio buttons that control whether it was a regular game, gammon (x2), or backgammon (x3). If you are using this for something else, just leave Points set to 1 and the radio button set to regular. That will give you a value of 1 point per game.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This program is a simple implementation of the Elo ranking system which is commonly used for games like chess and go. It uses a SQL backend and there are two sql scripts included which must be run. Also the connection string in the app.config file must be configured before use.<br /><br />It&#39;s fairly straightforward. The only thing that might be a little confusing is that the point value of the game is not used in the rating. Currently, this number is just stored in the database but later it will be used to calculate betting payouts between players.<br /><br />Also, this was initially made for backgammon so there are radio buttons that control whether it was a regular game, gammon &#40;x2&#41;, or backgammon &#40;x3&#41;. If you are using this for something else, just leave Points set to 1 and the radio button set to regular. That will give you a value of 1 point per game.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2008-08-20T16:01:19.163-07:00"
}