{
  "ProjectName": "EnhancedGridView",
  "Title": "Enhanced GridView",
  "Description": "Enhanced version of the GridView. Includes an InsertRow and FilterRow that work using the normal databinding syntax and BoundFields. Also includes an Enhanced TemplateField to enable the FilterTemplate, as well as an Enhanced CommandField to allow for a filter button, resolve image button double postbacks, and enable some of the Enhanced GridView's capabilities. Additionally, provides \"safe\" functionality when ViewState is disabled by performing all row operations based on a Datakey rather than a RowIndex. Finally, provides better tracking of the EditIndex and SelectedIndex as underlying datasource changes occur, and allows for \"Unselecting\" the SelectedRow. Most features are accessable and configurable in Design Mode, but the Filter Template currently is not.\n\nNow includes a batch update mode and supporting templates / commands, as well as a customizable CommandRow that can be added to automatically enable the batch edit feature. The batch edit template and command row are not currently available in design mode.\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Enhanced version of the GridView. Includes an InsertRow and FilterRow that work using the normal databinding syntax and BoundFields. Also includes an Enhanced TemplateField to enable the FilterTemplate, as well as an Enhanced CommandField to allow for a filter button, resolve image button double postbacks, and enable some of the Enhanced GridView&#39;s capabilities. Additionally, provides &#34;safe&#34; functionality when ViewState is disabled by performing all row operations based on a Datakey rather than a RowIndex. Finally, provides better tracking of the EditIndex and SelectedIndex as underlying datasource changes occur, and allows for &#34;Unselecting&#34; the SelectedRow. Most features are accessable and configurable in Design Mode, but the Filter Template currently is not.<br /><br />Now includes a batch update mode and supporting templates &#47; commands, as well as a customizable CommandRow that can be added to automatically enable the batch edit feature. The batch edit template and command row are not currently available in design mode.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,Controls,ASP.NET 2.0,GridView,webcontrols,grid,",
  "LastEdited": "2007-08-06T05:16:14.023-07:00"
}