{
  "ProjectName": "EnhancedWebControls",
  "Title": "Enhanced Web Controls",
  "Description": "The Enhanced Web Control Library Contains web controls that enhance the functionality of the microsoft input controls. New functionality includes labels, css skins, watermarks, masking. The library also includes a robust navigation bar or menu control.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1><b>Enhanced Web Controls</b></h1>\rThe Enhanced Web Control library is a .Net 3.5 Web Server Control library that adds enhanced functionality to the Basic Web Controls provided by Microsoft. Many controls are included and the list continues to grow, but some of the most usefull are listed below. The code is written in C#.<br />\n<ul><li><b>EnhancedTextBox</b> - Enhances the TextBox Web Control. This control includes an attached label, Empty Textbox Watermarking, visual behavior enhancements - including onFocus/onBlur label and field changes, onkeyup autopostback, phone number masking</li>\n<li><b>EnhancedDropDown</b> - Enhances the DropDown Web Control. This control includes an attached label, Support for Default Rows, visual behavior enhancements - including onFocus/onBlur label and field changes, Selected Value enhancements (No more &quot;Selected Value Not Found in List&quot; errors, return focus on autopostbacks.</li>\n<li><b>EnhancedCheckBox</b> - Enhanced the CheckBox Web Control. This control includes an attached label, an attached description label, crossbrowser checkbox positioning, visual behavior enhancements - including onFocus/onBlur label and field changes.</li>\n<li><b>EnhancedCalendar</b> - Enhances the Ajax Control Toolkit Calendar extender. Includes an attached label, an attached Enhanced TextBox, visual Behavior enhancements, autopostback support.</li>\n<li><b>NavBar</b> - A Completely new Navigation Bar Control. This control supports a parent and child navigation menu, has popup child menus, default styling, supports Horizontal or Vertical menus, is fully skinable via CSS classes, rendering as links or postback buttons with custom events</li>\n<li><b>ModalProgressPanel</b> - A completely new progress panel for Update Panel postbacks. This control will allow a custom message box to be displayed as a popup during a partial postback. The control will fade and disable all graphics and controls within the provided content div during the partial postback. Also this panel supports partial postback queueing, giving the user the ability to initiate several panel updates simultaniously while in the background the partial postbacks are queued and executed in the proper order.</li>\n<li><b>MulitSelectDropDown</b> - A completely new drop down control created using jquery. Behaves just like the Enhanced Drop Down but allows the user to select multiple items. Contains support for select all and clear selection commands, autopostbacks and Visual Enhancements including onFocus/onblur label and field changes.</li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "AJAX,ControlToolkit,",
  "LastEdited": "2010-09-27T12:40:22.707-07:00"
}