{
  "ProjectName": "euphonics",
  "Title": "Euphonics",
  "Description": "Euphonics is an audio player for the Windows platform that supports many audio formats. Audio files can be played individually, or as part of a playlist. Other main features include: spectrum or oscilloscope visual feedback; tempo and pitch control; and a six-band equalizer.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Euphonics is an audio player that supports the following audio formats: MP3, CD tracks, WAV, OGG Vorbis, MOD, MP4, AAC, PCM, RAW, ACE, M4A, FLAC, WavPack, AC3, ALAC, AU, CAF, IRCAM, PAF, SVX, NIST, PVF, VOC and W64. <br /><br />Audio files can be played individually, or as part of a playlist that can be looped and/or shuffled. Audio and playlist files can also be dragged and dropped onto the Euphonics window to be played automatically. Other main features of Euphonics include: spectrum or oscilloscope visual feedback; tempo and pitch control; and a six-band equalizer.<br /><br />Euphonics is developed in C# for the Windows platform, and requires the Microsoft .NET Framework 3.5 to run. (Users will be prompted to download and install the .NET Framework 3.5 component during the setup process if it is missing from their system. The link to the download site will be provided automatically.)<br /><br /><a href=\"http://www.codeplex.com/euphonics/Release/ProjectReleases.aspx?ReleaseId=22282\">Download Euphonics</a><br /><br />Euphonics in simple mode; playing one song at a time:<br /><img src=\"/projects/euphonics/4dcebde7-70e6-4e8f-9044-8d82abd1a96d\" alt=\"Euphonics&#32;in&#32;simple&#32;mode&#59;&#32;playing&#32;one&#32;song&#32;at&#32;a&#32;time.\" title=\"Euphonics&#32;in&#32;simple&#32;mode&#59;&#32;playing&#32;one&#32;song&#32;at&#32;a&#32;time.\" /><br /><br />Euphonics in playlist and equalizer mode:<br /><img src=\"/projects/euphonics/3d84e679-1875-44cf-a56a-68533ac2c961\" alt=\"Euphonics&#32;in&#32;playlist&#32;and&#32;equalizer&#32;mode.\" title=\"Euphonics&#32;in&#32;playlist&#32;and&#32;equalizer&#32;mode.\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-02-09T22:35:30.453-08:00"
}