{
  "ProjectName": "ExportToExcel",
  "Title": "Export To Excel control",
  "Description": "Hello Folks,\n\nRaise your hands if you enjoy the power of \"Zero Code\" ? That's everyone.  Thanks to ASP.NET 2.0.  Most of the heavy lifting is done by the framework.\n\nI would like to present to you a new custom control that I developed.  This control \"Exports\" the contents of your",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nHello Folks,<br>\r\n<br>\r\nRaise your hands if you enjoy the power of &quot;Zero Code&quot; ? That's everyone. Thanks to ASP.NET 2.0. Most of the heavy lifting is done by the framework.<br>\r\n<br>\r\nI would like to present to you a new custom control that I developed. This control &quot;Exports&quot; the contents of your &quot;GridView&quot; into Excel format with &quot;Zero Code&quot;. That's right. Simply drag and drop and you are all set.<br>\r\n<br>\r\nNote:<br>\r\n<br>\r\nCopyright (c) Rajesh Krishnamohan. All rights reserved.<br>\r\nThis software is provided &quot;AS IS&quot;, without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software.<br>\r\n<br>\r\nExport Gridview to Excel <br>\r\n<br>\r\n<strong>Features:</strong><br>\r\n<br>\r\n1) <strong>Styling</strong> : If you used &quot;HeaderStyle&quot;, &quot;RowStyle&quot;, &quot;AlternateRowStyle&quot; in your GridView, you can simply enable styling by setting the &quot;ApplyStyleInExcel' property to &quot;True&quot;. Note: CSS styling is not supported at this point\r\n<a href=\"/wikipage?title=future%20candidate&referringTitle=Home\">future candidate</a><br>\r\n<br>\r\n2) <strong>TimeStamp</strong>: If you set the &quot;IncludeTimeStamp&quot; to true, the filename is appended with a &quot;time Stamp&quot;. These are very useful for time sensitive reports.<br>\r\n<br>\r\n3) <strong>PageSize</strong>: If you are using Pagination in your GridView, you can choose to export the &quot;Current&quot; page, the &quot;Entire Grid&quot;\r\n<a href=\"/wikipage?title=all%20pages&referringTitle=Home\">all pages</a> or set a specific number of records to export. Use &quot;All&quot; for all pages, &quot;Current&quot; for the current page and 20 for first 20 records.<br>\r\n<br>\r\n4) <strong>Sorting</strong>: The Export supports sorting. In otherwords, if you sort your gridview and then export, the excel spreadsheet will also be sorted.<br>\r\n<br>\r\n5) <strong>GridViewID</strong>: If you have more than one gridview in a page, you can specify which gridview you'd like to export by setting this property. You do not have to set any value if you just have one grid view.<br>\r\n<br>\r\n6) <strong>FileName</strong>: You can set the filename that you want to export.<br>\r\n<br>\r\n7) <strong>EnableHyperLinks</strong>: If set to &quot;True&quot; the exported excel file will have &quot;Live&quot; links. If set to &quot;False&quot;, only the text will be exported.\r\n<a href=\"/wikipage?title=Alpha%201.1%20release%20feature&referringTitle=Home\">Alpha 1.1 release feature</a><br>\r\n<br>\r\n<strong></strong>Following are NEW in BETA version***<br>\r\n<br>\r\n8) <strong>Charset</strong> - Allows you to setup a Charset Multi-lingual support<br>\r\n<br>\r\n9) <strong>ContentEncoding</strong> - Allows you to set the Encoding Multi-lingual support<br>\r\n<br>\r\n10) <strong>ColumnsToExclude</strong> - Allows you to input the columns comma separated that you'd like to exclude in your export.\r\n<br>\r\n<br>\r\n11) <strong>PreExport</strong> <span style=\"text-decoration:underline\">Event</span> - For those of you who dynamically bind the GridView at runtime, use this new event to databind the GridView just before &quot;Exporting&quot;<br>\r\n<br>\r\n<strong></strong><strong></strong><span style=\"color:#ff0000\"><strong>******Following are NEW additions added on 3/24/2011 to the BETA version\r\n</strong>************</span><br>\r\nThe following addtions compelled me to upgrade the component to .NET 3.5. The features added below uses System.IO.Packaging namespace for compression.<br>\r\n<br>\r\n12) <strong>ZipTheFile</strong> - if set to True, compresses the generated file into Zip file and saves download bandwidth<br>\r\n<br>\r\n13) <strong>ZipMode</strong> - choose between Fast, Maximum, Normal, SuperFast and get the desired results.<br>\r\n<br>\r\n<strong>Usage</strong><br>\r\n<br>\r\nSimply drag and drop the ExportToExcel button on your page and enjoy &quot;Zero code&quot; export feature.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Excel,Office,Export,Export To Excel,Export Gridview,Export Grid View,asp.net controls,shmu,shmulik,Excel Export,",
  "LastEdited": "2011-03-24T14:25:18.14-07:00"
}