{
  "ProjectName": "FacebookNET",
  "Title": "Facebook.NET",
  "Description": "Facebook.NET is a framework for creating Facebook applications in .NET in either C# or VB.NET. It is optimized for creating ASP.NET-based Facebook applications, and at the same time, can also be used for creating desktop client applications that consume Facebook APIs.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Facebook.NET</b> provides a .net library for use in developing Facebook applications and accessing Facebook APIs. The library primarily geared around and optimized for developing ASP.NET-based Web applications, both FBML and IFrame-based Facebook applications through an intuitive API and small set of server controls. It does support the use of the Facebook API from desktop applications as well, and will eventually enable Silverlight application usage.<br /><br />The library is built on .NET 2.0, but should run on future versions of the .NET framework as well. Applications using Facebook.NET can be written in either C# or VB.NET.<br /><br />The library is still in early form (some APIs haven&#39;t been implemented yet, there are only a couple server controls: FacebookApplication, and FqlDataSource at the moment, etc.) but the intent is to grow this over the course of building some Facebook applications, and through community usage/feedback as well. Please help improve this project by submitting bugs and feature suggestions through the issues list, or if you have ideas that need more discussion, please submit them on the discussions forum.<br /><br /><b>Associated Links</b>\n<ul><li>The introduction to this framework is on my <a href=\"http://www.nikhilk.net/FacebookNET.aspx\">Facebook.NET</a> blog post, along with a few other useful developer links.</li>\n<li>Steve Trefethen has posted a <a href=\"http://www.stevetrefethen.com/blog/VSNETStarterKitForNikhilKotharisFacebookNET.aspx\">VS Starter Kit</a> for getting started with Facebook development using Facebook.NET.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,ASP.NET,C#,Controls,Web 2.0,.NET 2.0,Framework,Library,favorite,ASP.NET 2.0,Server Controls,Facebook,Facebook Developer,Facebook Toolkit,FBML,FQL,Shortcut,nlinq,.NET 3.5,FacebookNet,facebook .net ,website,Facebook.NET,Nabaztag,social networking,",
  "LastEdited": "2007-09-21T19:15:11.507-07:00"
}