{
  "ProjectName": "FacebookToolkit",
  "Title": "Facebook Developer Toolkit",
  "Description": "Clarity Consulting Inc. http://www.claritycon.com developed the original Facebook Developer Toolkit for the Microsoft Visual Studio Express Team.  We have seen lots of feedback on suggestions on improving the codebase.  We worked with Microsoft on an idea to keep the code relevant and up to date for all the Facebook Developers.  Together we decided that hosting the source here on CodePlex will be the best way to track items and allow community involvement in the source.  We encourage anyone to get involved.\n\nWe would like to thank Microsoft for the great support they are giving this project, and the effort they are willing to commit to helping us keep the library up to date.\n\nThis project contains .NET wrappers to the Facebook API.  Also, includes sample projects and controls.  We are going to start by trying to maintain both the vb.net and C# code bases.  We will see how it goes.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><br /><br /><b>Please note:</b> After several months of analysis and recent discussions with Microsoft <b>we have decided to discontinue support of this library</b>.  The library grew to the point that it is hard to maintain and was designed when Facebook&#39;s api was different and types of applications being developed were different.  We have considered changes that would make things easier, but after discussion with Microsoft and after examining the new sdk that has been published by some of our colleagues in the community, <b>we feel that the new library provides a very solid and flexible approach to building facebook apps</b> and seems that it will be easier to maintain moving forward. We are planning to lend our support however we can to the new sdk listed below.  Thanks to everyone who has invested their time and effort into supporting this library over the years.  I am sure that the leaders of the new library would appreciate the feedback and support that we have gotten.<br /><br /><b>New SDK can be found here:</b> <a href=\"http://facebooksdk.codeplex.com/documentation\">http://facebooksdk.codeplex.com/documentation</a><br /><br />The new SDK has been completely retooled and it incorporates Facebook’s latest capabilities like the Graph API and REST API Calls.  You will also find useful sample apps to get you started such as:<br />*<a href=\"http://facebooksdk.codeplex.com/wikipage?title=ASP.NET%20MVC%20Sample&amp;referringTitle=Documentation\">ASP.NET MVC Sample</a><br />*<a href=\"http://facebooksdk.codeplex.com/wikipage?title=WebForms%20iFrame%20Sample&amp;referringTitle=Documentation\">WebForms iFrame Sample</a><br />*<a href=\"http://facebooksdk.codeplex.com/wikipage?title=Silverlight%204%20Out%20of%20Browser%20Sample&amp;referringTitle=Documentation\">Silverlight 4 Out of Browser Sample</a><br />*<a href=\"http://facebooksdk.codeplex.com/wikipage?title=Silverlight%204%20In%20Browser%20Sample&amp;referringTitle=Documentation\">Silverlight 4 In Browser Sample</a><br />*<a href=\"http://facebooksdk.codeplex.com/wikipage?title=Windows%20Phone%207%20Sample&amp;referringTitle=Documentation\">Windows Phone 7 Sample</a><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "watch,favorites,API,Toolkit,Library,Visual Studio,Microsoft,Coding4Fun,Social,website,social networking,Facebook,Facebook Developer,Facebook Toolkit,Wouter,FBML,FQL,kj,Facebook Developer T,visual studio addin,Developer Kit,require_add,form,Fackbook,install,SilverlightFacebook ,",
  "LastEdited": "2011-01-10T14:58:49.873-08:00"
}