{
  "ProjectName": "filepropertiestask",
  "Title": "File Properties Task",
  "Description": "Retrieves and optionally sets properties on a file in the SQL Server Integration Services Control Flow.  Available properties include file existence, size, read/write locks, creation/last access/last modification date, and file attributes.\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Retrieves and optionally sets properties on a file in the SQL Server Integration Services Control Flow.  Available properties include file existence, size, read&#47;write locks, creation&#47;last access&#47;last modification date, and file attributes.<br /><br /><br /><img src=\"http://7y0rtw.blu.livefilestore.com/y1pXkhQovyU1z9vlsgOeYy-6Y4j1Otys0XMdBhwOjPsZ2fZ-nyJoQvKd415sqmWjgtwYUbl1YIPxHMRHp_x5OYWOqBeDlRTkeEA/2009-08-07%20FilePropertiesTaskOnDesignSurface.jpg\" /><br /><br />Please visit the <a href=\"http://ssisctc.codeplex.com\">SSIS Community Tasks and Components</a> project on CodePlex for more useful SSIS tools.<br /><br />The Task is intended to read properties from a given file, and optionally update some of those properties.<br /><br />The file name can be &quot;hardcoded&quot; (specified literally), specified by property expression, or supplied in a string-typed SSIS variable.<br />The Task can be configured to fail if the file doesn&#39;t exist, or it can be configured to always report Success and record whether or not the file exists in a boolean-typed SSIS variable.<br />The Task can attempt to open the file for reading and record whether it was successful or not into a boolean-typed SSIS variable.  It can attempt a similar write test to check for exclusive file locks.<br />The Task can read the file&#39;s length, creation date, last access date, and last modification date and place those values into SSIS variables.  It can also read attributes of the file - such as the ReadOnly and Hidden attributes - into boolean-typed SSIS variables.<br />The Task can also be configured to update the file&#39;s date properties (creation, last access, last modified), or attributes.<br /><br />The following sample shows the Task configured to read properties from a file whose name is stored in the <b>FileName</b> SSIS variable.  If the file exists, &quot;true&quot; will be stored in the <b>FileExists</b> variable, otherwise &quot;false&quot; will be stored.  If the file exists, the Task will attempt to open it for reading - and record whether it was successful or not in the <b>FileIsReadable</b> variable.  (The Task releases the file immediately.)  The Task is also configured to read the file&#39;s length (size) into the <b>FileSize</b> variable, and store the last modification date into the <b>LastModifiedDate</b> variable.<br /><br /><img src=\"http://7y0rtw.blu.livefilestore.com/y1p7_CQMsuwvEP62UaE_KXa9IhV7si_TbHGxFreOr5nf4vH74xl6vWXwZ0gND9YHjd-vg-Bf141Gk6DHdMCP5Ea0TAgE1cmbam8/2009-08-07%20FilePropertiesTaskEditor.jpg\" /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-08-06T01:24:05.443-07:00"
}