{
  "ProjectName": "flowgraph",
  "Title": "FlowGraph",
  "Description": "A flow chart view and design component for the WinForms (.Net) platform.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>FlowGraph</h1>\r\n<img src=\"http://imgur.com/vwCvZWm.jpg\" /><br /><br />A clean and simple yet considerably robust and good-looking component letting you display interactive (visually editable) or non-interactive (if you seek just to visualize) flow charts of blocks linked in any order through any reasonable number of input and output connections.<br /><br />The project is actually a heavily reworked <i>fork</i> of <a href=\"http://nodegraph.codeplex.com/\">Thomas Iche&#39;s NodeGraph</a> redesigned, cleaned and enhanced with presentation-logic separation in mind. Although FlowGraph and NodeGraph look almost identical at the first sight, they are very different. The following changes were made to the original (Feb. 13 - 2013) NodeGraph code:<br />\n<ul><li>Almost everything (in the source code) was renamed to follow common naming conventions (which I find easier to read) and, in some places, make more sense</li>\n<li>The code was split into more code files to increase maintainability by separating different logical parts</li>\n<li>Lots of presentation-irrelevant features were removed to unclutter the code and delegate the business logic part to the control consumer (an application developer)</li>\n<li>New events were added, old events were changed and unimplemented events were implemented to deliver full track and control over what happens to the flow chart</li>\n<li>Nodes are now added in an easy dynamic way (given just metadata), no need to code a dedicated class for every node type</li>\n<li>Optional non-interactive mode added for view-only graphs visualization (useful for cases when you want the user to read a graph but not to change it)</li></ul>\n<br />Questions, bug reports and feature suggestions are highly welcome! <b>I am actually offering free support to everybody!</b> (under the condition that you grant me full copy and disclosure rights on your questions texts letting me to put them into a &quot;FAQ&quot; style documentation this way)<br /><br />Feel free to contact me through <a href=\"https://www.codeplex.com/site/users/view/StrangeAttractor\">my profile here at CodePlex</a> or <a href=\"https://plus.google.com/104689782038901384658/about\">at Google+</a>.<br /><br />---</div><div class=\"ClearBoth\"></div>",
  "TagList": "flowgraph,nodegraph,graph,chart,flowchart,winforms,c#,control,visualization,modelling,flow,sequence,process,algorithm,model,",
  "LastEdited": "2014-04-23T02:43:42.697-07:00"
}