{
  "ProjectName": "flux",
  "Title": "Flux.NET Content Management",
  "Description": "Flux.NET CMS is a content management solution and web application framework. Flux makes it easier for developers to create dynamic, user controlled web sites and applications with comprehensive features like workflow out of the box.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Have you seen Orchard?</h1>\rYou&#39;ve probably noticed I&#39;ve not updated Flux for quite some time, a lack of volunteers to help out and a busy work schedule has meant that I&#39;ve not really been able to take this project further. I was thinking of moving the platform forward by refactoring out all of the data access layer and moving it to NHibernate or entity framework and I wanted to move the underlying architecture to ASP.NET MVC. I think this might be a futile effort however since there is already a great tool in this space already, fully open source and backed and funded by Microsoft. If you haven&#39;t seen it yet, go take a look at <a href=\"http://www.orchardproject.net\">http://www.orchardproject.net</a> - at the time of writing this, they had just released v1.1, it&#39;s been in development for a couple of years now and it&#39;s a pretty awesome tool. As such, one day I might update Flux, or Flux might become a set of extension to Orchard...... I will continue to support anyone using Flux today, but encourage you to look at orchard for new projects.<br />\n<h1>Latest news!</h1>\r<b>Article series on using flux with MVC</b> - Tony is writing a series of articles on using flux as a management tool for an ASP.NET MVC based front end web site. The first article is available <a href=\"http://www.deepcode.co.uk/2009/12/building-aspnet-mvc-e-commerce-app-with.html\">HERE</a> and there is a new codeplex project just for this source code <a href=\"http://fluxmvcstore.codeplex.com\">HERE</a>.<br /><br /><b>Quick start package now available</b> - we&#39;ve put together a quick start package for the CMS that allows you to start with a working basic site rather than from scratch. <a href=\"http://flux.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=26826#DownloadId=86138\">Download it now</a> or <a href=\"http://www.deepcode.co.uk/2009/10/fluxnet-quick-start-package-released.html\">read this article on Tony&#39;s Blog</a>.<br /><br /><b>Project Description</b><br />Flux.NET CMS is a content management solution and web application framework. Flux makes it easier for developers to create dynamic, user controlled web sites and applications with comprehensive features like workflow out of the box.<br /><br /><b>What is FLUX.NET?</b><br />Flux is a content management system and web application framework that provides developers with an approach to creating highly dynamic, user controlled sites with the minimum of fuss. Defining the structure of content through configuration artefacts, we define the detail of content and how it relates to other elements. Using the API we then construct the forms that plug-in to the CMS framework to capture the content into the repository and write the templates to render the data to the user. By providing core functionality for the CMS, yet leaving the forms and templates in the hands of the ASP.NET developer, the framework and application can be used to build any website/web application imaginable in a variety of different ways.<br /><br /><b>Useful information</b><br /><a href=\"https://flux.codeplex.com/wikipage?title=Flux%20Roadmap&referringTitle=Home\">Flux Roadmap</a><br /><a href=\"https://flux.codeplex.com/wikipage?title=Flux.NET%20Articles&referringTitle=Home\">Flux.NET Articles</a><br /><a href=\"https://flux.codeplex.com/wikipage?title=Installation%20Guide&referringTitle=Home\">Installation Guide</a><br /><br /><b>Basic Features</b>\n<ul><li>Content management facilities including\n<ul><li>WYSIWYG Editing (provided by external WYSIWYG editors such as FCKEditor)</li>\n<li>Version control with check-in/check-out</li>\n<li>Workflow</li>\n<li>Data taxonomy and categorisation</li>\n<li>Fully customisable content type definitions and fine grained control over forms</li>\n<li>Host multiple web sites through single implementation</li></ul></li>\n<li>File based asset management facilities</li>\n<li>Roles based security</li>\n<li>Scheduled task execution</li>\n<li>Comprehensive auditing and event logging</li>\n<li>Virtual settings registry</li>\n<li>Highly customisable and extensible workflow engine\n<ul><li>Content management workflow schema included</li>\n<li>Workflow schemas to manage any data can be added through the API easily</li></ul></li>\n<li>Easy to use framework for extensibility</li>\n<li>SQL console</li></ul>\n<br /><img src=\"/projects/flux/2435a11c-4879-4a0c-a0ec-ff3cc1e464c5\" alt=\"fl1.png\" title=\"fl1.png\" /><br /><br /><img src=\"/projects/flux/50b53f1f-45cc-4728-9b97-98bb13937fcd\" alt=\"fl2.png\" title=\"fl2.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "content management,CMS,Web Framework,Workflow,",
  "LastEdited": "2011-05-06T02:03:23.433-07:00"
}