{
  "ProjectName": "fotoflyphotoviewer",
  "Title": "Fotofly PhotoViewer",
  "Description": "A Silverlight control that uses the Fotofly metadata library to show the people in a photo (using Windows Live Photo Gallery People metadata) and a map of the location (using Bing Maps Silverlight SDK).",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A Silverlight control that uses the Fotofly metadata library to show the people in a photo &#40;using Windows Live Photo Gallery People metadata&#41; and a map of the location &#40;using Bing Maps Silverlight SDK&#41;.<br /><br />The download consists of a single Visual Studio Solution containing three projects:<br /><br /><b>Fotofly.PhotoViewer</b> (Silverlight Class Library) This is the core of the project and the part you’ll want to copy into your own solution. It consists of six UserControls that draw the various parts of the application. The one you’ll need to get started is PhotoPanel which provides methods and properties to control what is displayed. <br />The idea is that you build your own Silverlight application that handles the fetching of metadata and then pass that into the PhotoViewer. The other two projects are a simple examples of how to do this.<br /><br /><b>Fotofly.PhotoViewer.SilverlightExample</b> (Silverlight Application) - This is an example Silverlight application that calls the webservice hosted by the example website to retrieve the metadata for the image. It then instantiates the PhotoViewer.PhotoPanel and passes in all the data it needs.<br /><br /><b>Fotofly.PhotoViewer.WebsiteExample</b> (ASP.Net Web Application) - This is an example website that you can copy to host the PhotoViewer. It consists of two parts; A sample webpage that simply renders the Silverlight Object. And a sample webservice that is used to transfer the metadata to Silverlight.<br /><br />More info at <a href=\"http://www.tassography.com/fotofly\">http://www.tassography.com/fotofly</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight,Windows Live,Bing Maps,XMP,metadata,Exif,",
  "LastEdited": "2010-03-06T18:27:23.983-08:00"
}