{
  "ProjectName": "FrameWork",
  "Title": "ASP.NET权限管理系统(FrameWork)",
  "Description": "Introduction \n      In our development process on the Web, often need to develop a background of management procedures. We have developed for the management of the future procedures. \nWhen you develop the procedures more often, the management background you will more and more. Then if there is a unified management background. Come to management. A unified Taiwan Account, a unified authority to conduct background over the management enough. \nFrameWork is in such demand emerged. \n\n  Profiles \n     Its main function is to conduct background management module integration. \n1) which can support multiple applications, multiple modules to the competence of management. \n2) Access and MsSql200/2005 support. \n3) Use role for the authority's mandate, each user can belong to different roles, given the right authority. \n4) facilitate the integration, testing authority httpmodule testing techniques used. Basically no need to amend the existing procedures, the existing procedures could be integrated. \n5) Visual Editor, the new Tab Control and Menu. Support drag-and-drop editing. \n6) unified event log management, all landing operation has safety record.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Introduction <br />      In our development process on the Web, often need to develop a background of management procedures. We have developed for the management of the future procedures. <br />When you develop the procedures more often, the management background you will more and more. Then if there is a unified management background. Come to management. A unified Taiwan Account, a unified authority to conduct background over the management enough. <br />FrameWork is in such demand emerged. <br /><br />  Profiles <br />     Its main function is to conduct background management module integration. <br />1) which can support multiple applications, multiple modules to the competence of management. <br />2) Access and MsSql200/2005 support. <br />3) Use role for the authority&#39;s mandate, each user can belong to different roles, given the right authority. <br />4) facilitate the integration, testing authority httpmodule testing techniques used. Basically no need to amend the existing procedures, the existing procedures could be integrated. <br />5) Visual Editor, the new Tab Control and Menu. Support drag-and-drop editing. <br />6) unified event log management, all landing operation has safety record.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Framework,RBAC,",
  "LastEdited": "2007-08-11T05:18:54.947-07:00"
}