{
  "ProjectName": "FranchiseComputing",
  "Title": "Franchise Computing Model",
  "Description": "Franchise Computing is a channeled cloud computing model that draws service participation through a set of publish/subscribe contracts. Under this model a franchise is branded under two contracts - one for the service consumption and one for service subscription. The initiating party of both contracts is known as the franchisor who is also responsible for commercializing the service to its clients as well as enforcing the back-end contract with its service providers. Service providers are known as the franchisees, they join a franchise by subscribing to the servicing contract and by adhering to all its governing policies. Once registered and certified the service provider is said to be franchised and it will begin receiving service requests according to the contract it signed on. Under this model service providers are relieved from having to negotiate with the service's consumers directly since all undertakings involving service consumption (e.g.. the service definition, service advertisement, service discovery, contract violation and disputes etc.) are administered and mitigated at the service frontier by the franchisor.\r\n\r\nThe goal of Franchise Computing (FC) is to seek a more balanced approach between the traditional client/server model and the very loosely defined cloud computing model(s). Rather than handing over its entire operation to the cloud, FC is aimed at maximizing service usability and scalability while still maintains control over the critical aspects of policy conformance for service delivery. To its consuming organizations a franchised service may be viewed as a more dependable computational resource and bandwidth chartered in the cloud.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Franchise Computing is a channeled cloud computing model that draws service participation through a set of publish/subscribe contracts. Under this model a franchise is branded under two (set of) contracts - one for the service consumption and one for service subscription. The initiating party of both contracts is known as the franchisor who is also responsible for commercializing the service to its clients as well as enforcing the back-end contract with its service providers. Service providers are known as the franchisees, they join a franchise by subscribing to the servicing contract and by adhering to all its governing policies. Once registered and certified the service provider is said to be franchised and it will begin receiving service requests according to the contract it signed on. Under this model service providers are relieved from having to negotiate with the service&#39;s consumers directly since all undertakings involving service consumption (e.g.. the service definition, service advertisement, service discovery, contract violation and disputes etc.) are administered and mitigated at the service frontier by the franchisor.<br /><br />The goal of Franchise Computing (FC) is to seek a more balanced approach between the traditional client/server model and the very loosely defined cloud computing model(s). Rather than handing over its entire operation to the cloud, FC is aimed at maximizing service usability and scalability while still maintains control over the critical aspects of policy conformance for service delivery. To its consuming organizations a franchised service may be viewed as a more dependable computational resource and bandwidth chartered in the cloud.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-11-17T12:39:24.12-08:00"
}