{
  "ProjectName": "ftpclient",
  "Title": "FTPclient",
  "Description": "An FTP client library to provide high-level FTP functionality for the FTPrequest in the .NET Framework 2.0",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />An FTP client library to provide high-level FTP functionality for the FTPrequest in the .NET Framework 2.0<br />\n<h1>MOVED TO GITHUB</h1>\r<b>As you may be aware, CodePlex is shutting down in Dec 2017. The source code for the project has been copied to GitHub at <a href=\"https://github.com/conficient/ftpclient\">https://github.com/conficient/ftpclient</a></b><br /><br /><b>Source note</b><br />If downloading the source code, please use FtpClient2 version, as this is the latest one.<br /><br /><b>Project Home Page</b><br />FTPclient implements a high-level FTP client library using the System.NET.FTPrequest library in the .NET Framework 2.0 and above. Although .NET now supports FTP it is a very basic protocol-level support, hence I wrote this library to give easy access to .NET functionality. <br /><br />To find out more about this library in the first instance read my <br /> <a href=\"http://www.codeproject.com/vb/net/FtpClient.asp\">CodeProject article</a>. Originally written in VB.NET it has been translated into C# as well and I hope to maintain both versions as people will find it easier to debug and add functionality if it remains in both versions.<br /><br /><b>Why put it in CodePlex?</b><br />If the source is available on CodeProject, why add it to CodePlex as well? I would like to allow others to share modifications, bugfixes and improvements, which isn&#39;t really that easy in CodeProject. It is much easier in CodePlex so I have set up the code here as well. <b>If you are interested helping with modifications and improvements please let me know.</b><br /><br /><a href=\"https://ftpclient.codeplex.com/documentation?referringTitle=Home\">Documentation</a><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Tools,networking,FTP,Controls,.net FTP,",
  "LastEdited": "2017-11-10T02:07:59.9-08:00"
}