{
  "ProjectName": "genproj",
  "Title": "GenProj, a tool for automatic maintenance of Visual Studio .csproj files",
  "Description": "Creates a .csproj by scanning folders for files and injecting XML into a previously created .csproj template. Uses a configuration file to control behavior.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>GenProj</strong><br>\r\nCreates a .csproj by scanning folders for files and injecting XML into a previously created .csproj template. Uses a configuration file to control behavior.<br>\r\n<br>\r\nThis tool is designed to help with management of .csproj files used by Visual Studio. This was originally created by me (Eric Cosky of Bounding Box Games, LLC) for internal use but I decided to share this here in case other people find it useful.<br>\r\n<br>\r\nThe basic purpose is to read a configuration file which will specify a project template file, an output directory, and a collection of directories to include each file discovered using recursive pattern matching into the project. The generated .csproj data\r\n can use linked files to simplify the task of sharing source code in common libraries without duplication.\r\n<br>\r\n<br>\r\nThis tool has been essential for keeping projects synchronized between platforms and configurations that do not play nicely together in a single solution. A side effect of using this tool is that a carefully tuned .csproj template file will never have settings\r\n changed by accident during normal development since it is generally configured once and left alone after that.\r\n<br>\r\n<br>\r\nAdopting GenProj will incur one significant workflow change: adding files to projects within Visual Studio can interfere with the process. It can work, but it might not work as expected. It is generally recommended to add new files to the folder in Windows\r\n Explorer, and run genproj to get the files incorporated into the .csproj.<br>\r\n<br>\r\nIf you do need to make changes to the .csproj settings, it is recommended that these changes are migrated to the template.csproj using a tool such as WinMerge to carefully integrate the changes so they are not blown away the next time GenProj is run. Should\r\n this happen by accident, GenProj does retain backups of the current .csproj files each time they are rebuilt in a subdirectory under the project.<br>\r\n<br>\r\nLike the project? Please consider <a href=\"http://www.boundingboxgames.com/tools\">\r\nmaking a donation</a>&nbsp;or <a href=\"http://marketplace.xbox.com/en-US/Product/Thunder-Moon/66acd000-77fe-1000-9115-d80258550d37\">\r\nbuy our latest game, Thunder Moon</a>. Thanks!</p>\r\n<p><a href=\"http://www.boundingboxgames.com/tools\"><img src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donateCC_LG.gif\" alt=\"PayPal - The safer, easier way to pay online!\" width=\"147\" height=\"47\" style=\"border:0\"></a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2013-07-31T10:34:13.973-07:00"
}