{
  "ProjectName": "GestureLib",
  "Title": "GestureLib",
  "Description": "GestureLib is an extensible framework for recognizing mouse gestures (represented by 2D coordinates) or acceleration gestures of the Wiimote (represented by 3D coordinates) or controling the mouse with those devices is possible.\nNew devices can be added easily without touching the GestureLib-Framework. Actions, which will be executed after a specified gesture was recognized, can also be added. There are also interfaces for implementing a ConfigurationManager, which can save oder load associations between gestures and actions from a persistent data source.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h3>Project Description</h3>\rGestureLib is an extensible framework for recognizing mouse gestures &#40;represented by 2D coordinates&#41; or acceleration gestures of the Wiimote &#40;represented by 3D coordinates&#41; or controling the mouse with those devices is possible.<br />New devices can be added easily without touching the GestureLib-Framework. Actions, which will be executed after a specified gesture was recognized, can also be added. There are also interfaces for implementing a ConfigurationManager, which can save oder load associations between gestures and actions from a persistent data source.<br /><br />Please switch to the &quot;Releases&quot; or &quot;Source Code&quot; tab to get the diploma thesis or the source code for this project.<br />\n<hr />-------------------------------------------------------<br />\n<h3>German summary</h3>\rDie immer wichtiger werdende Interaktion zwischen Mensch und Rechner kann durch verschiedene technische Mittel realisiert werden. Eins von diesen Mitteln stellt die Bedienung von Programmen mithilfe von Gesten dar. Um auf einen einfachen und schnellen Weg Gestensteuerung in neue oder bestehende Anwendungen zu integrieren, wurde in einem Projekt im Rahmen einer Diplomarbeit ein modular erweiterbares Framework kreiert, mit welchem diese Funktionalit&#228;t zur Verf&#252;gung gestellt wird.<br />Durch bereits implementierte Module ist das Erkennen mit der Maus oder dem Wii-Controller durchgef&#252;hrten Gesten m&#246;glich.<br /><br />Es k&#246;nnen neue Module f&#252;r folgende Bereiche erstellt werden:\n<ul><li>Ger&#228;te (z.B.: Maus, Wii-Controller, TCP-Server (zur Erkennung von Gesten von Remoteger&#228;ten))</li>\n<li>Algorithmen (z.B.: Maus nach rechts, dann nach oben bewegen oder Wii-Controller sch&#252;tteln)</li>\n<li>Aktionen (z.B.: Datei ausf&#252;hren oder direkt auf die Anwendung angepasste Aktion)</li>\n<li>Verkn&#252;pfungen Algorithmus-Aktion persistent speichern (z.B.: Speichern als Xml-Datei, Speichern in vom Programm verwendeter Datenquelle)</li></ul>\n<br />Bitte zum Tab &quot;Releases&quot; oder &quot;Source Code&quot; wechseln um die schriftliche Ausarbeitung der Diplomarbeit und den Quellcode des Projektes zu erhalten.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2008-11-01T09:53:26.74-07:00"
}