{
  "ProjectName": "googlestorage",
  "Title": "Google Storage for .NET",
  "Description": "Google Storage for .NET (GSN) is an open source library that provides .NET developers with easy access to the Google Storage API.  The library allows you to perform all major functions of the API including creating/deleting buckets, uploading/downloading files, and ACL control.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Welcome to Google Storage for .NET</h1>\r\n<br /><b>What is Google Storage?</b><br /><br />Google Storage is an innovative new offering from Google, Inc to provide cloud based file storage similar to Amazon S3 or RackSpace CloudFiles. The service, which hasn&#39;t been officially launched to the public yet, provides a completely REST based interface that allows developers to easily upload and download files, create buckets (folders) and control file access based on ACL&#39;s.<br /><br /><b>What is Google Storage for .NET?</b><br /><br />Google Storage for .NET (GSN) is a .NET library that provides .NET developers a pure .NET interface to the Google Storage API.  Using GSN, developers will be able to perform all of the functions the API provides easily, quickly, and without any knowledge of the underlying API details or REST at all.  The library is completely open source and distributed under a liberal license that allows it to be used in both commercial and open source projects. <br /><br /><b>Is GSN an official Google Release? </b><br /><br />No, GSN is a completely independent project that is not, in any way, associated with Google. However, if Google would like to contribute code to the project, we more than welcome the opportunity to work with them in any capacity.<br /><br /><b>When will GSN be available?</b><br /><br />We&#39;re working on GSN now and should have working code available by late June or early July. We&#39;re going to test everything to make sure nothing breaks should Google make changes to the API and we&#39;re trying to make sure everything is easy to use.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-06-14T22:48:19.54-07:00"
}