{
  "ProjectName": "GovDevForTFS",
  "Title": "GovDev for TFS",
  "Description": "Microsoft Team Foundation Server (TFS) 2010 is the collaboration platform at the core of Microsoft’s application lifecycle management solution. In addition to core features like source control, build automation and work-item tracking, TFS enables teams to align projects with industry processes such as Agile, Scrum and CMMi via the use of customable XML Process Templates.  \r\n\r\nSince 2005, TFS has been a welcomed addition to the Microsoft developer tool line-up by Government Agencies of all sizes and missions.  However, many government development teams consistently struggle with leveraging an iterative development process all while providing the structure, visibility and status reporting that is required by many Government, waterfall-centric, project methodologies.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>Update (11/26/2013)</h1>\r\n<p>GitHub public repository is now available at <span style=\"font-family:'Calibri','sans-serif'; color:black\">\r\n<a href=\"https://github.com/briancjordan/GovDev\"><font size=\"3\" color=\"#0000ff\">https://github.com/briancjordan/GovDev</font></a></span></p>\r\n<p>I have separate branches for 2010, 2012, and 2013 that contain the code for updates and releases.&nbsp; The alpha releases that you can get from the CodePlex download page are tagged.&nbsp; These tags&nbsp;point to the latest stable changes that are modifications\r\n to the XML Process Template portion of the project--no changes have been made to update the SharePoint solutions, Reporting or Documentation.&nbsp; You can actually deploy this to your respective server and have the Workitems, workflow and new TFS 2012/2013\r\n web access features work.<br>\r\n<br>\r\nAs to the list of work, it is extensive but not....</p>\r\n<ol>\r\n<li>I want to rework the whole reporting as I have gotten feedback that it is taking a long time for the Requirements Traceability Matrix (RTM) report to run when there are a large number of requirements. This occurs when someone has 1000 or more requirements.\r\n The database records return in less 2 seconds, the issue is that Reporting Services is generating 150&#43; HTML pages to render the report.&nbsp; I am not a SSRS expert so I need help to figure out how to control this to make it more responsive by not generating\r\n all of those pages. Additionally, I would like to rework the UI a bit and then create linked drill down reports for each of the work item columns. As more WIs are added, the field get really big and distorts the RTM report. I want to do something like show\r\n the last 3-4 WI/CS IDs and hovering to show the set. Then clicking to get a more detailed drill-down report.&nbsp; Thnis is just a thought and I welcome other approaches.\r\n</li><li>I also want to redo the contribution report to add more metrics. </li><li>I need to update the SharePoint Features. I took a dependency on a SharePoint-TFS assembly that was removed between TFS 2010 and 2012. A simple policy redirect assembly will likely take care of it but I would like to refactor to remove the dependency.\r\n</li><li>I want to make the lookup of the TFS URL more robust and have created a bug to fix this on the backlog.\r\n</li><li>There are probably a bunch of little things that I have not gotten feedback on....\r\n</li></ol>\r\n<p>If you are game to contribute, let me know but I will be plugging away at it over the coming weeks/months. If you have feature requests, enhancements, bugs, etc., please post them here on the CodePlex site.<br>\r\n<br>\r\nThanks <br>\r\n<br>\r\nBrian</p>\r\n<p><strong>Project Description</strong><br>\r\nMicrosoft Team Foundation Server (TFS) 2010 is the collaboration platform at the core of Microsoft&rsquo;s application lifecycle management solution. In addition to core features like source control, build automation and work-item tracking, TFS enables teams\r\n to align projects with industry processes such as Agile, Scrum and CMMi via the use of customable XML Process Templates.\r\n<br>\r\n<br>\r\nSince 2005, TFS has been a welcomed addition to the Microsoft developer tool line-up by Government Agencies of all sizes and missions. However, many government development teams consistently struggle with leveraging an iterative development process all while\r\n providing the structure, visibility and status reporting that is required by many Government, waterfall-centric, project methodologies.<br>\r\n<br>\r\nGovDev is an open source, TFS Process Template that combines the formality of CMMi/Waterfall with the flexibility of Agile/Iterative:<br>\r\n<br>\r\n<img title=\"GovDev Process\" src=\"/projects/GovDevForTFS/07cd6cbf-44f2-4e3b-bc71-df23baf0e5b5\" alt=\"GovDev Process\"><br>\r\n<br>\r\nThe GovDev for TFS Accelerator also implements two new custom reports to support the customized process and provide the real-time visibility across the lifecycle with full traceability and drill down to tasks, tests and code:<br>\r\n<br>\r\n<img title=\"GovDev Process\" src=\"/projects/GovDevForTFS/71dad0bb-cc4c-43fc-ba81-514f2a92e7f5\" alt=\"GovDev Process\"><br>\r\n<br>\r\n<br>\r\nFor a 45min demo of GovDev, visit: <a href=\"https://msevents.microsoft.com/CUI/EventDetail.aspx?EventID=1032508359&culture=en-us\">\r\nhttps://msevents.microsoft.com/CUI/EventDetail.aspx?EventID=1032508359&amp;culture=en-us</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "govdev,devgov,TFS 2010,",
  "LastEdited": "2013-11-26T11:52:43.233-08:00"
}