{
  "ProjectName": "governance",
  "Title": "SharePoint Governance and Manageability",
  "Description": "Solutions to provide IT Professionals tools and resources to support and compliment the management and control aspects of Microsoft SharePoint Products.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\r\nSolutions to provide IT Professionals tools and resources to support and compliment the management and control aspects of Microsoft SharePoint Products.<br />\n<h1>Tools</h1>\r\n<h2>SharePoint Foundation 2013 &amp; SharePoint Server 2013</h2>\r\n<a href=\"https://governance.codeplex.com/wikipage?title=Id%20Management%20Configuration%20Tool&referringTitle=Home\">Id Management Configuration Tool</a> (SharePoint Server 2013)<br /><i>The Id Management Configuration Tool is a Windows Forms Application designed to simplify the configuration of outbound hybrid identity management solutions with SharePoint Server 2013 and Office 365 most commonly implemented to support OneDrive for Business redirection in SharePoint Server 2013 Service Pack 1.</i><br />\n<h2>SharePoint Foundation 2010 &amp; SharePoint Server 2010</h2>\r\n<a href=\"https://governance.codeplex.com/wikipage?title=SharePoint%20Site%20Recycle%20Bin&referringTitle=Home\">SharePoint Site Recycle Bin</a> (SharePoint Foundation 2010)<br /><i>The SharePoint Site Recycle Bin is a SharePoint Foundation 2010 solution package that when deployed to a Microsoft SharePoint Foundation 2010 or Microsoft SharePoint Server 2010 server farm enables administrators to create a snapshot of subscriptions, site collections and Webs as they are deleted through the SharePoint user interface, the SharePoint Administration Tool, the SharePoint 2010 Management Shell, SharePoint 2010 Central Administration, or SharePoint Designer.</i><br /><br /><a href=\"https://governance.codeplex.com/wikipage?title=SharePoint%20Site%20Recycle%20Bin&referringTitle=Home\">SharePoint Site Recycle Bin</a> (Windows SharePoint Services 3.0)<br /><i>The SharePoint Site Recycle Bin is a Windows SharePoint Services 3.0 solution package that when deployed to a Windows SharePoint Services 3.0 or Microsoft Office SharePoint Server 2007 server farm enables administrators to create a snapshot of site collections and Webs as they are deleted through the SharePoint user interface, the SharePoint Administration Tool, SharePoint 3.0 Central Administration, or SharePoint Designer.</i><br /><blockquote><blockquote><a href=\"https://governance.codeplex.com/wikipage?title=FAQ&referringTitle=Home\">FAQ</a></blockquote></blockquote>\n<h1>Documentation</h1>\r\n<h2>SharePoint Foundation 2013 &amp; SharePoint Server 2013</h2>\r\n<a href=\"http://technet.microsoft.com/en-us/library/dn197169(v=office.15).aspx\">Configure identity management for a hybrid topology in SharePoint Server 2013</a><br /><i>This page provides guidance on how to synchronize on-premises user accounts with Office 365, and build a server-to server trust between SharePoint Server 2013 and SharePoint Online.</i><br />\n<h2>SharePoint Foundation 2010 &amp; SharePoint Server 2010</h2>\r\nTechNet Resource Center - <a href=\"http://technet.microsoft.com/en-us/sharepoint/ff800826.aspx\">Governance in SharePoint Server 2010</a><br /><i>This page provides tools and resources for IT Professionals to use in governing SharePoint Server 2010 environments.</i><br /><br />Whitepaper - <a href=\"http://technet.microsoft.com/library/ff848257(office.14).aspx\">SharePoint 2010 Governance Planning</a><br /><i>This white paper focuses on what we call the “front end” of the SharePoint environment – the business aspect of governance - the areas that effect business users. This white paper uses a fictitious company named Contoso to provide guidance for the necessary governance planning and implementation of SharePoint Server 2010.</i><br /><br />Whitepaper - <a href=\"http://technet.microsoft.com/en-us/library/ff969355.aspx\">Implementing Governance in SharePoint 2010</a><br /><i>This document focuses on the “back end” of SharePoint Governance – the technical implementation. It provides high-level guidance about the many configuration options that SharePoint Server 2010 provides to enable you to manage the environment for the benefit of all.</i><br /><br />Whitepaper - <a href=\"http://technet.microsoft.com/library/gg277248(office.14).aspx\">SharePoint 2010 Operations Framework and Checklists</a><br /><i>This document details the operational processes, tasks, and tools that are required to operate and maintain a Microsoft SharePoint Server 2010 environment. It explains how the management of SharePoint Server 2010 fits in with the overall Microsoft Operations Framework (MOF) model. It will help you design your approach to operational management and give you the means to implement processes and procedures that help keep your environment running smoothly. The white paper includes checklists for daily, weekly, and monthly operations tasks.</i></div><div class=\"ClearBoth\"></div>",
  "TagList": "Sharepoint,SharePoint 2010,Sharepoint Tools,Manager,governance,msit,Toolkit,management,MOSS,to follow,to explore,",
  "LastEdited": "2014-04-15T11:34:30.593-07:00"
}