{
  "ProjectName": "gridsoccer",
  "Title": "Grid-Soccer Simulator",
  "Description": "Grid-Soccer Simulator is a multi-agent soccer simulator in a grid-world environment. The environment provides a test-bed for machine-learning, control algorithms, and multi-agent learning especially multi-agent reinforcement learning.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br /><br />Grid-Soccer Simulator is a multi-agent soccer simulator in a grid-world environment. The environment provides a test-bed for machine-learning, and control algorithms, especially multi-agent reinforcement learning.<br /><br /><b>Dependencies</b><br /><br />You need <a href=\"http://www.mono-project.com\">Mono</a> (available for all platforms) or .NET Framework (available for Microsoft Windows only) to run the simulator and the sample clients.<br /><br /><b>Download</b><br /><br />At the current development stage of the Grid-Soccer Simulator; it is more recommended that you directly download the latest source codes from the <a href=\"http://gridsoccer.codeplex.com/SourceControl/list/changesets\">Source Codes</a> page. There&#39;s also a stable possibly outdated source release available at the <a href=\"http://gridsoccer.codeplex.com/releases\">Downloads</a> page.<br /><br /><b>User&#39;s Manual</b><br /><br />Please read the user&#39;s manual to get started with the contents of the source package, and basic functionalities of the simulator and the agents. The manual also contains information about the communication protocol between the simulator and the clients, and formalizes the model of the dynamics of the environment. Download the manual from:<br /><a href=\"http://gridsoccer.codeplex.com/releases/view/64543\">http://gridsoccer.codeplex.com/releases/view/64543</a><br /><br /><b>Cite Grid-Soccer Simulator</b><br /><br />If you are using this environment in your research, please cite the Grid-Soccer User&#39;s Manual in your related publications using the following BibTeX entry:<br /><br /><pre>\n@Manual{gsman11,\n  title = {Grid Soccer Simulator 1.0: User&#39;s Manual},\n  author = {Sina Iravanian and Sahar Araghi},\n  month = {April},\n  year = {2011},\n  note = &quot;http://gridsoccer.codeplex.com&quot;,\n  url = &quot;http://gridsoccer.codeplex.com&quot;\n}\n</pre><br /><br /><b>Features</b><br />\n<ul><li>The communication between players and the simulator is performed using a human-readable, plain text, network protocol; hence one can create a player in virtually any programming language that supports networking</li>\n<li>Several C# agents, and C++, Java, and Matlab sample agents</li>\n<li>Change almost every aspect of the simulator using the simulator&#39;s settings file (located in /Bin/﻿﻿﻿﻿﻿﻿GridSoccerSimulator.exe.config; the settings file is an XML file which can be easily edited using an ordinary text-editor)</li>\n<li>Connect any desired number of players for each team as specified in the simulator settings file</li>\n<li>Change the dimension of the field and the goal-width as desired (﻿﻿﻿﻿﻿﻿﻿﻿as specified in the simulator settings file)</li>\n<li>Change the passable distance of each player</li>\n<li>Change the view distance of each player</li>\n<li>and more... </li></ul>\n<br /><b>Screen-shots</b><br /><br />A Game in the Grid-Soccer Simulator in a grid of 10 x 6 cells.<br /><br /><img src=\"/projects/gridsoccer/55f4e39f-eb76-4b98-9a53-f4547ef3a263\" alt=\"Gird-Soccer&#32;10&#32;x&#32;6\" title=\"Gird-Soccer&#32;10&#32;x&#32;6\" /><br /><br />A Game in the Grid-Soccer Simulator in a grid of 20 x 30 cells, and goals of width 6 cells.<br /><br /><img src=\"/projects/gridsoccer/ebf1280c-f298-42a2-9b11-c06640e6dfb1\" alt=\"Gird-Soccer&#32;20&#32;x&#32;30\" title=\"Gird-Soccer&#32;20&#32;x&#32;30\" /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Grid-Soccer,GridSoccer,Multi-agent System,Multiagent System,MAS,Reinforcement,Machine Learning,MARL,Mutli-agent RL,Client Server,Distributed AI,Soccer Simulator,Grid World,",
  "LastEdited": "2012-07-21T01:24:42.327-07:00"
}