{
  "ProjectName": "HackingSilverlight",
  "Title": "HackingSilverlight Code Browser",
  "Description": "Out with the old and in with the new... the HackingSilverlight Code Browser is a reference tool for code snippets so that I can not have to remember how todo things.  for that matter the tool doesn't really show you how it just has a bunch of code that is tagged and searchable.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Description</h2>\rOut with the old and in with the new... the HackingSilverlight Code Browser is a reference tool for code snippets so that I can not have to remember how todo things.  for that matter the tool doesn&#39;t really show you how it just has a bunch of code that is tagged and searchable.  If you are interested in contributing I&#39;d love the help in making it cooler so please contact me :)<br /><br />here is a link to the application running in browser: <br /><br /><a href=\"http://www.hackingsilverlight.net/HackingSilverlightCodeBrowser.html\">http://www.hackingsilverlight.net/HackingSilverlightCodeBrowser.html</a><br />\n<h2>Detail Overview: </h2>\r\nSo sometime ago I had been working on a sample browser for all the different samples I had used for hackingsilverlight and for blog posts. After awhile with all the jumping around between projects, and my failing memory I found I needed a quick easy way to remember all the code clips I used often. For me I needed something like a rola-deck for code so after taking my toys and leaving the sandbox as it were regarding the book HackingSilverlight between projects for the 5 minutes here or there I&#39;ve been working on a tool that I&#39;m using in place of the older sample browser. And so the HackingSilverlight Code Browser was born. Its still a work in progress and really its all about me and my workflow but on the off chance it might help some one here it is:<br /><br /><a href=\"http://www.hackingsilverlight.net/HackingSilverlightCodeBrowser.html\">http://www.hackingsilverlight.net/HackingSilverlightCodeBrowser.html</a><br /><br />of course if you go to just hackingsilveright.net there is a click here to install button that will install the oob version but from this link you can also just right click and select install. Remember this tool is not designed to teach anything or example things to anyone, its purpose is to quick recall code that I know how to use already and make it easier to remember. So remember this isn&#39;t silverlight 101 , its more like silverlight 400 :) In any case when you first load the app there is a number of key elements. First on the left is a tag cloud where the tags related to blocks of code that have been &#39;tagged&#39;. in the center is everything matching the search result and then in the far right is the search box. there is no search button as it updates dynamically as you type. I did put a reset and help link below this but really just start typing.<br /><br />in the bottom corner you&#39;ll notice a version number, a contributor link and a add to library link so if I run across a bit of code that I think is important I can send email to my self to remind me. Also back on the left at the top is a cover shot that links back to the site and if you are running an outdated version you will get a warning along the left side.<br /><br />If you happen to select one of the results from the middle you get a code box viewer that does some simple formating of the code and lets you select the contents. also all the tags associated with that block are shown and they are clickable. Clicking tags will close the code viewer and do a search on that tag. There are two arrow buttons if you get board and want to scroll through blocks quickly plus there are the help and contributor dialogs.<br /><br />The help dialog is much like this post just giving a basic discriptions of functionality and then the contributor dialog is is a list of everyone that has helped, inspired or contributed in some way.<br /><br />And thats pretty much it. oh and one more thing. only constructive feedback is of any use or more importantly if you have cool snippets to add... please feel free to contact me about it. And the code base I&#39;ll use to replace the existing HSL codeplex project... </div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,C#,Controls,Enterprise Library,Toolkit,Library,xaml,Animation,MyList,Silverlight,hack,User Controls,Silverlight Controls,chart,Silverlight 2.0,panel,Hacking Silverlight,Browser History,panels,MouseWheel,bitmap effects,MyList.SilverLight,Silverlight NPE,Silverlight 3,Routed Events,",
  "LastEdited": "2010-05-06T11:26:28.51-07:00"
}