{
  "ProjectName": "halfwit",
  "Title": "Halfwit",
  "Description": "A minimalist WPF Twitter client.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h2>Halfwit's Source has Moved!</h2>\r\n<p><a href=\"https://bitbucket.org/mabster/halfwit\">Halfwit now lives over on BitBucket</a>. This project will remain open for some time, so you can compare this code base with the largely-rewritten code of Halfwit 2.</p>\r\n<h2>What is Halfwit?</h2>\r\n<p>Halfwit is a Twitter client written in C# and WPF. It uses <a href=\"http://tweetsharp.com\">\r\nTweetSharp</a> to talk to the Twitter API.</p>\r\n<p>For more information (including a ClickOnce install link and a few screenshots) see the\r\n<a href=\"http://madprops.org/halfwit\">Halfwit home page</a>.</p>\r\n<h2>Features</h2>\r\n<p>Along with some of the standard things you'd expect in a Twitter client (post a tweet, read direct messages etc), Halfwit has a few little usability features:</p>\r\n<p><strong>Smart Retweeting</strong><br>\r\nWhen retweeting an interesting tweet, Halfwit will use Twitter's &quot;native&quot; retweet feature unless you modify (or add to) the original text.</p>\r\n<p><strong>URL Shortening</strong><br>\r\nInitially just using <a href=\"http://is.gd\">http://is.gd</a>, Halfwit lets you selectively shorten any URLs you've typed into a tweet, or shorten them all with a single keystroke or click. Don't want the short version? That's ok. Press Ctrl&#43;Z and undo your\r\n change.</p>\r\n<p><strong>Unicode Emoticons<br>\r\n</strong>Include smileys or other symbols in your tweet easily with a handy list of common &quot;emoticons&quot;. They only use one character!&nbsp;</p>\r\n<p><strong>Username Autocomplete<br>\r\n</strong>Halfwit keeps track of usernames it sees in tweets as they come in, and autocompletes usernames in the editing panel whenever you type an &ldquo;@&rdquo; sign.</p>\r\n<p><strong>Font Scaling</strong><br>\r\nThe primary reason I created Halfwit was that my favourite Twitter clients just didn't give me the control over the font size that I wanted. Halfwit lets you adjust the font size via a slider on the Options page.</p>\r\n<p><strong>Conversation Tracking<br>\r\n</strong>If you see an &quot;in reply to&quot; link, you can click on it, and Halfwit will take you to the original tweet. If it's not already in your timeline, Halfwit will retrieve it and insert it. You can use the Backspace key to navigate backwards through a conversation\r\n this way.</p>\r\n<p><strong>Keyboard Control<br>\r\n</strong>I'm a keyboard junkie, and love being able to control all my apps without reaching for the mouse. Halfwit includes lots of keyboard shortcuts, so keyboard nuts like me will feel right at home.</p>\r\n<h2>Plug-Ins</h2>\r\n<p>Halfwit has a simple extensibility system:</p>\r\n<ul>\r\n<li><a href=\"http://halfwit.codeplex.com/wikipage?title=Plug-In%20Installation\">Plug-In Installation</a>\r\n</li><li>List of Available Plug-Ins </li><li>Creating Your Own Plug-In </li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "twitter,WPF,Twitter API,C#,TweetSharp,",
  "LastEdited": "2011-03-24T15:48:15.01-07:00"
}