{
  "ProjectName": "happyturtle",
  "Title": "Happy Turtle Plugins for BVI :: Repository Based Versioning for Visual Studio",
  "Description": "The Happy Turtle project creates plugins for the Build Version Increment Add-In for Visual Studio (BVI). The focus is to automatically version assemblies in Visual Studio based on a revision number from a source control repository.  The initial plugin is SVN based.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>What is Happy Turtle?</h2>\rHappy Turtle is a collection of plug-ins for the <a href=\"http://autobuildversion.codeplex.com/\">Build Version Increment project</a>.  Using revision numbers from a source control repository, these plug-ins can automatically version assemblies that are built in Visual Studio.  Currently, only one source control is supported, SVN, but more should be coming.\n<h4>An Example</h4>\rLet&#39;s say you want your project to have version numbers like this: 1.0.<b>x</b>.0. You want &#39;<b>x</b>&#39; to be the revision number of the source you are compiling.  A Happy Turtle plug-in can do this for you.<br />You have have some source code checked out at revision 509.  When you build a release, the Happy Turtle plug-ins and BVI will build a project with the version 1.0.509.0.<br />All you have to do (after installing BVI and the plug-in) is change the Build Version Increment version settings to use the right version style.  In this case, the setting would look something like: None.None.SVNRevision.None.<br /><br />\n<h3>What is Build Version Increment?</h3>\rBuild Increment Version is an add-in for Visual Studio.  It can be easily configured to increment the version number of a project when the project is built.  BVI has a number of basic version incrementing schemes, but also includes a plug-in system so that custom incrementors can be used.  That&#39;s where the Happy Turtle comes in.<br />Check out <a href=\"http://autobuildversion.codeplex.com/\">Build Version Increment</a> to learn more.</div><div class=\"ClearBoth\"></div>",
  "TagList": "versioning,",
  "LastEdited": "2010-03-11T20:45:17.187-08:00"
}