{
  "ProjectName": "HTMLPresenceControls",
  "Title": "HTML Presence Controls for Microsoft Lync Server 2010",
  "Description": "The HTML Presence Controls for Microsoft Lync Server 2010 allow you to easily add presence to your web applications.  The controls work in all browsers, and are developed in C#, AJAX, WCF, and UCMA 3.0. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1><b>Please note that this project is no longer actively maintained.</b></h1>\r\n<br />\n<h1>Project Description</h1>\rThe HTML Presence Controls for Microsoft Lync Server 2010 allow you to easily add presence to your web applications.  The controls work in all browsers, and are developed in C&#35;, AJAX, WCF, and UCMA 3.0. \n<h2>About</h2>\rThe HTML Presence Controls were developed by <a href=\"http://www.claritycon.com\">Clarity Consulting</a> for a keynote demo at TechEd 2010 in New Orleans.  We would like to thank Microsoft for allowing us to publish the project on CodePlex.  We will be upgrading the code as new builds of Lync Server 2010 become available. <br /><br />The code is compatible with build <b>4.0.7557</b> (RTM) of Microsoft Lync Server 2010 and UCMA 3.0.  \n<h2>Documentation</h2>\rPlease see the <b>Documentation</b> tab for instructions on how to deploy the HTML Presence Controls in your environment.\n<h2>Known Issues</h2>\rPlease see the project <b>Issue Tracker</b> for details on all open issues.  Please vote on the issues that you would like to see addressed.  \n<h2>Contributing</h2>\rAre you interested in contributing to the project?  Please send a note to the project administrator. <br />\n<h1>Architecture</h1>\rThe <b>HTML Presence Controls</b> are powered by a back end UCMA 3.0 trusted application and REST-based WCF service.  <br /><br />The <b>HTML Presence Controls Service</b> is deployed to IIS and consists of a UCMA 3.0 application and a REST-based WCF service.  <br /><br />The <b>HTML Presence Controls</b> poll the <b>HTML Presence Controls Service</b> for the presence of a contact specified by a SIP URI.  The service in turn queries the UCMA application for the presence of a particular contact.  The UCMA application implements a caching mechanism in order to efficiently manage presence subscriptions for contacts.  Presence for a contact is always retrieved from the cache, whose contents are updated only when the presence of a subscribed contact changes. <br />\n<h2>Implementations</h2>\r\n<h3>ASP.NET Server Control Implementation</h3>\rThe <b>HTML Presence Controls</b> are implemented as a <b>PresenceIndicator</b> ASP.NET server control which can be used as a standalone control, or in a layout control such as an ASP.NET GridView or Repeater.  The <b>PresenceIndicator</b> control exposes properties that allow you to customize its appearance, e.g. to toggle the display mode of the contact&#39;s name or availability. <br /><br /><img src=\"http://employees.claritycon.com/gdurzi/blog/HTMLPresenceControls/ServerControl.PNG\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "OCS,Communicator,UCMA,Lync,",
  "LastEdited": "2014-06-04T19:22:58.87-07:00"
}