{
  "ProjectName": "iconset",
  "Title": "SharePoint Calculated Field: IconSet",
  "Description": "The IconSet custom field is a combination between a Calculated field and the “Conditional Formatting” found on Microsoft Excel 2007 application. The user can define a mathematical formula and the rendering template for calculated value. It is a handy feature for all users that are using SharePoint on daily basis to use this custom field as a simple way of identifying visually critical items within their lists.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The IconSet custom field is a combination between a Calculated field and the &#8220;Conditional Formatting&#8221; found on Microsoft Excel 2007 application. The user can define a mathematical formula and the rendering template for calculated value. It is a handy feature for all users that are using SharePoint on daily basis to use this custom field as a simple way of identifying visually critical items within their lists.<br /><br /><b>Features</b><br />\n<ul><li>Formula parser, based on the library of <b>Eugene Ciloci</b> project found on <a href=\"http://sourceforge.net/project/showfiles.php?group_id=189947\">http://sourceforge.net/project/showfiles.php?group_id=189947</a></li>\n<li>Available Templates:  \n<ul><li>3-Traffic Lights (Unrimmed); </li>\n<li>3-Traffic Lights (Rimmed); </li>\n<li>3-Flags;</li>\n<li>3-Arrows (Colored); </li>\n<li>3-Arrows (Gray) </li></ul></li>\n<li>Reverse Icon Order</li>\n<li>Show Icon Only (available on Beta Release Only)</li>\n<li>Show Snapshot Value: used only when the formula is time dependant (available on Beta Release Only, the new realease is a Snapshot calculated value)</li></ul>\n<br /><b>Features available soon</b><br />\n<ul><li>More templates available thru a customizable XML file</li>\n<li>The option to have Hints within the template, this will give to the user a better understanding why a certain icon gets displayed</li>\n<li>The option to set the entire background color of the view row; Customizable</li>\n<li>Customizable option to Show/Hide the field within the display forms</li></ul>\n<br /><b>Help, FAQ, How To...</b><br /><br />Please check my personal blog (<a href=\"http://stefancostan.blogspot.com/\">http://stefancostan.blogspot.com/</a>) or drop me an email.<br /><br /><b><u>AJAX Support:</u></b> Now IconSet can be tweaked to support AJAX, thanks to the contribution provided by J&#248;rn Bratland. <br />Original post can be found here: <a href=\"http://stefancostan.blogspot.com/2009/01/running-ajax-within-sharepoint-list.html\">http://stefancostan.blogspot.com/2009/01/running-ajax-within-sharepoint-list.html</a> and the better solution here: <a href=\"http://sharepointfiesta.blogspot.com/2009/01/iconset-and-ajax.html\">http://sharepointfiesta.blogspot.com/2009/01/iconset-and-ajax.html</a>.<br /><br /><b><u>IconSet ASP.NET Caching</u></b> <a href=\"http://stefancostan.blogspot.com/2009/02/how-to-use-aspnet-caching-with-iconset.html\">http://stefancostan.blogspot.com/2009/02/how-to-use-aspnet-caching-with-iconset.html</a><br /><br /><br /><b>Known Bugs and Limitations</b><br /><br /><b>Bugs</b><br />\n<ol><li>First time when the custom field is added to a list the custom properties are not saved. - <b>fixed in IconSet Snapshot Release</b></li>\n<li>Running the field within a list under a sub-site of the main site, the field doesn’t render properly. - <b>fixed in IconSet Snapshot Release</b></li>\n<li>The field doesn’t work in views with <b>Group By</b> clause. - <b>fixed in IconSet Snapshot Release</b></li>\n<li>Only one field per view can be used. More fields generates unexpected behavior - <b>fixed in IconSet Snapshot Release</b></li></ol>\n<br /><b>Limitation</b><br />\n<ol><li>When the field formula is changed, or any other properties, the existing values of the field are not updated. Missing event receiver that should handle this occurrences on list level. - <b>fixed in IconSet Snapshot Release</b> </li>\n<li>There is no user friendly way to define and test the formulas and also to display all supported Excel functions of the Eugene Ciloci library. </li>\n<li>It is not possible to sort the field values <b>fixed, available in future release</b>.</li>\n<li>The field doesn&#39;t store the calculated values <b>fixed, available in future release</b>.</li></ol>\n<br /><br /><b>Screenshots</b><br />Usage within a view<br /><img src=\"/projects/iconset/eeb2d7bb-2801-4705-9699-d4652ea1eca8\" alt=\"001.JPG\" title=\"001.JPG\" /><br /><br />IconSet settings page<br /><img src=\"/projects/iconset/9246b794-aa12-4055-8b0d-3ebd22662f37\" alt=\"002.JPG\" title=\"002.JPG\" /><br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Sharepoint,Custom Fields,web controls,Calculated Field,KPI,",
  "LastEdited": "2009-02-17T07:40:34.237-08:00"
}