{
  "ProjectName": "iEnergis",
  "Title": "iEnergis",
  "Description": "Reducing the energy needs of buildings plays a key role in achieving climate protection goals worldwide. The biggest potential for savings is in the consumption of heating energy. The latter currently accounts for about a third of our total energy requirement. In commercial buildings and other purpose-built structures the lighting is also an important factor, responsible for some 20% of overall power consumption in this sector. In addition to protection of the environment, there are also sound economic reasons that compel us to act. This applies in particular to public buildings such as schools and universities, whose escalating operating and energy costs make a big dent in the budgets of communities and states.\n\nJust like we humans depend on our mind and perception, intelligent green buildings need a complete and intelligent system (iENERGIS) that makes decisions depending on the energy consumption.In addition, the iENERGIS application provides remote monitoring and control of the electrical appliances in a building. Through our web site every user can send his data to our live database, and so, with the use of virtual earth, we can monitor the energy consumption in a whole area. These could be used from environmental organisations and energy companies so that to optimize the energy supply in an area and to export statistical data.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><img src=\"/projects/iEnergis/aa6e372f-75cc-4c76-9a54-cd3939815957\" alt=\"iEnergis.PNG\" title=\"iEnergis.PNG\" /><br />\n<h2>Team Members</h2>\rAnargyros\t\tChristakos<br />Ilias\t\t\tKoumoundouros<br />Konstantinos\tChalvantzis<br />Othonas\t\tAntoniou<br /><br />\n<h1>Project Description</h1>\rReducing the energy needs of buildings plays a key role in achieving climate protection goals worldwide. The biggest potential for savings is in the consumption of heating energy. The latter currently accounts for about a third of our total energy requirement. In commercial buildings and other purpose-built structures the lighting is also an important factor, responsible for some 20&#37; of overall power consumption in this sector. In addition to protection of the environment, there are also sound economic reasons that compel us to act. This applies in particular to public buildings such as schools and universities, whose escalating operating and energy costs make a big dent in the budgets of communities and states.<br /><br />Just like we humans depend on our mind and perception, intelligent green buildings need a complete and intelligent system &#40;iENERGIS&#41; that makes decisions depending on the energy consumption.In addition, the iENERGIS application provides remote monitoring and control of the electrical appliances in a building. Through our web site every user can send his data to our live database, and so, with the use of virtual earth, we can monitor the energy consumption in a whole area. These could be used from environmental organisations and energy companies so that to optimize the energy supply in an area and to export statistical data.<br /><br /><img src=\"/projects/iEnergis/e6fd178c-eb2a-4b1d-84c3-dd09c7da0519\" alt=\"Chart.png\" title=\"Chart.png\" /><br />\n<h1>Project Goals</h1>\r•Energy savings with lighting control<br />•Energy savings with temperature control<br />•Energy savings by controlling the rest of the electric devices<br />•Energy savings  by implementing building automation scenarios<br />•Energy savings with motion detector control<br />•Remote monitor and control of the house<br />•Real time monitoring of the energy consumption in whole areas<br />•Statistical analysis of the data provided by the users<br />\n<h1>Project Requirements</h1>\r<ul><li>Visual Studio 2008</li>\n<li>Microsoft .Net Framework 3.5</li>\n<li>Windows Mobile Pro 6 SDK</li></ul>\n    <a href=\"http://www.microsoft.com/downloads/details.aspx?familyid=06111A3A-A651-4745-88EF-3D48091A390B&amp;displaylang=en\">http://www.microsoft.com/downloads/details.aspx?familyid=06111A3A-A651-4745-88EF-3D48091A390B&amp;displaylang=en</a>\n<ul><li>Silverlight 2</li></ul>\n    <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=e0bae58e-9c0b-4090-a1db-f134d9f095fd&amp;displaylang=en\">http://www.microsoft.com/downloads/details.aspx?FamilyID=e0bae58e-9c0b-4090-a1db-f134d9f095fd&amp;displaylang=en</a>\n<ul><li>Microsoft SQL Server Compact 3.5 SP1</li></ul>\n    <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyId=68539FAE-CF03-4C3B-AEDA-769CC205FE5F&amp;displaylang=en\">http://www.microsoft.com/downloads/details.aspx?FamilyId=68539FAE-CF03-4C3B-AEDA-769CC205FE5F&amp;displaylang=en</a>\n<ul><li>ADO.NET Entity Framework Beta 3 &amp; ADO.Net Entity Framework Tools Dec 07 Community Technology Preview</li></ul>\n    <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyId=15DB9989-1621-444D-9B18-D1A04A21B519&amp;displaylang=en\">http://www.microsoft.com/downloads/details.aspx?FamilyId=15DB9989-1621-444D-9B18-D1A04A21B519&amp;displaylang=en</a><br />    <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyId=D8AE4404-8E05-41FC-94C8-C73D9E238F82&amp;displaylang=en\">http://www.microsoft.com/downloads/details.aspx?FamilyId=D8AE4404-8E05-41FC-94C8-C73D9E238F82&amp;displaylang=en</a><br />\n<h1>iEnergis Architecture</h1>\r<img src=\"/projects/iEnergis/86adc8a7-a573-420e-aded-897d8e72910a\" alt=\"ienergis5.png\" title=\"ienergis5.png\" /><br />\n<h1>Application Components</h1>\r\niENERGIS application can be divided into four distinct, yet integrated, modules:<br /><br />• <b>iENERGIS PC Application</b><br />The iENERGIS PC Application serves as the control system of the iENERGIS application for the specific house. The PC application communicates, via RS-232 serial port, with the CM11 or Z-Wave Controller. Using Microsoft Virtual Earth, a certain household can be located and, then, saved in the application database. Next, the user can determine the zones of the house, filling the information concerning its name and id which must match the zone id of every plug end in the specific zone. Finally, in each zone the user can add a plug by filling the information concerning its name, power consumption in watts and id which must match the plug id of the specific plug end. The aforementioned information is, then, saved in the database. Another feature of the PC Application is the real-time monitoring of the household. The user can view the total power consumption of the household and also, partially, the consumption of every zone and every unique plug. Apart from monitoring the system, the user can intervene by turning on and off a specific plug.<br /><img src=\"/projects/iEnergis/c3a08d1d-d80a-4810-8574-711424fcb1f6\" alt=\"ienergis1.png\" title=\"ienergis1.png\" /><br /><img src=\"/projects/iEnergis/8f7a1ba4-24b9-43ef-8ef6-b55cfff3aeb0\" alt=\"ienergis2.png\" title=\"ienergis2.png\" /><br /><img src=\"/projects/iEnergis/5459b81e-9951-49db-9150-439a939137f2\" alt=\"ienergis3.png\" title=\"ienergis3.png\" /><br /><br />• <b>iENERGIS Mobile Application</b><br />The iENERGIS Mobile Application can be used for monitoring and controlling the power consumption of the household. The user can view the total power consumption of the household and also, partially, the consumption of every zone and every unique plug. Apart from monitoring the system, the user can intervene by turning on and off a specific plug.<br /><img src=\"/projects/iEnergis/3e1da9d9-92b7-4447-8e93-cedf4e66dbdd\" alt=\"ienergis4.png\" title=\"ienergis4.png\" /><br /><br />• <b>iENERGIS Server Application</b><br />The iENERGIS server is composed of an IIS Web Server hosting Web Services for the exchange of the aforementioned data between the server, the Mobile Application and the Website<br /><br />• <b>iENERGIS Website</b><br />The iENERGIS Website support multiple households per user. To explain, each user can have several households manipulated by the iENERGIS application, each one using its own iENERGIS PC Application. Using Microsoft Virtual Earth the user, after logging to the system, can view all his households in the map. In addition, the user can view the total power consumption of a specific household and also, partially, the consumption of every zone and every unique plug. Apart from monitoring the system, the user can intervene by turning on and off a specific plug. In addition, via Microsoft Virtual Earth, the user can view in real time the power consumption in the surrounding area.<br /><img src=\"/projects/iEnergis/e1a047cb-da6c-4474-936a-13c5b931ad51\" alt=\"ienergisweb.png\" title=\"ienergisweb.png\" /><br /><img src=\"/projects/iEnergis/5f6f2768-7fbf-4eb3-b663-e5e25d0e5ef8\" alt=\"ienergisweb2.png\" title=\"ienergisweb2.png\" /><br /><img src=\"/projects/iEnergis/8b511aab-7489-4d66-a46c-f05e8dcdd647\" alt=\"ienergisweb3.png\" title=\"ienergisweb3.png\" /><br />\n<h1>Technologies</h1>\r\n<b>Servers:</b> IIS, Microsoft SQL Server 2005 Developer Edition, Microsoft SQL Server 2005 Compact Edition SP1<br /><b>Development Tools:</b> Microsoft Visual Studio 2008 Team Suite<br /><b>Other Technologies:</b> .NET Compact Framework 3.5, Windows Mobile SDK 6.0, Windows Vista Ultimate, Microsoft Silverlight 2.0, Microsoft  Expression Studio 2, ASP.NET, VB.NET, C#, WCF, WPF, ADO.NET Entity Framework, Microsoft Virtual Earth<br /><b>Hardware:</b> X10 Protocol, CM11 Serial RS-232 Controller, X10 Appliances, Z-Wave <br />SDK, Dell Axim 51V.<br />\n<h1>Further Improvements</h1>\r\nThe iENERGIS PC Application will be modified in order to support real-time statistics of the power consumption of the house, specific zone or specific plug for a specific time period and presenting them with charts. In addition, the algorithm that makes energy-efficient decisions will be optimized using fuzzy logic decisions and sending user notifications via SMS and e-mail. Finally, the energy-efficient decisions can be altered by some additional web services, i.e. a weather service can affect the heating or cooling system.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2008-05-21T09:17:14.28-07:00"
}