{
  "ProjectName": "imagedotnet",
  "Title": "Image.NET",
  "Description": "Image.NET is designed to be a very lightweight and fast image viewing software.  Its goal is to be anti-bloat and intuitive to use.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\rImage.NET is designed to be a very lightweight and fast image viewing software.  Its goal is to be anti-bloat and intuitive to use.<br /><br /><br />Currently the project is developed under .NET 2.0 for Windows Forms.  A future release will include moving all logic into controllers (aka MVC pattern) in order to facilitate an eventual move to a WPF frontend.<br />\n<h2>News</h2>\r<b>06.09.07</b> Code is buildable and works pretty good.  Faster than I expected.  Debug build will automatically break into debugging, so if you want to mess with it you&#39;ll have to build a release version.  <br /><br /><b>06.09.07 (after sleeping)</b>  Okay, have the first official release up.  Removed most of the buggy stuff (how much does form property binding SUCK?).  <br /><br /><b>06.12.07</b>  Have fixed some of the outstanding issues; will probably have an update this weekend.<br /><br /><b>06.13.07</b> 1.1 is out.  This program is almost usable.  Get it here:  <a href=\"https://imagedotnet.codeplex.com/releases/view/4883\">1.1</a> <br /><br /><b>07.04.07</b> Happy 4th, and DAMNITI just lost my update when I clicked on the Full Markup Guide link.  Holy crap, Codeplex people, OPEN LINKS IN NEW TABS.  Anyhow, the latest source is working and is full of multi thread drifting.  That means its much more responsive when browsing your porn folder.  Still some issues here and there, but if you&#39;re not liking because of responsiveness then grab the latest source <a href=\"http://www.codeplex.com/imagedotnet/SourceControl/DownloadSourceCode.aspx?changeSetId=7575\">here</a>.  Just build and enjoy.<br /><br /><b>11.07.07</b> Two days off work sick and I made some major changes in the code.  I&#39;m much closer to bringing the application to a fully mulithreaded application with caching.  I&#39;ve made enough changes to create a new release.  Its almost usable, now.  Also added a test project, and all new code is tested.  Get it here: <a href=\"https://imagedotnet.codeplex.com/releases/view/8235\">1.3</a> </div><div class=\"ClearBoth\"></div>",
  "TagList": "imaging,Image Control,",
  "LastEdited": "2007-11-07T20:52:21.993-08:00"
}