{
  "ProjectName": "InlineEditExtender",
  "Title": "Inline Edit AJAX Control Extender for both Textboxes and Dropdown Lists",
  "Description": "",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>INLINE EDIT EXTENDER</h2>\rThis is a proposed ASP.NET AJAX Toolkit Extender Control.  It extends both dropdownlist and textbox controls.  Its purpose is to allow normal, inline text to be exposed as either a textbox or dropdownlist control and therefore edited (i.e., <u>user clicks label, label turns into textbox or dropdownlist, user edits value, control turns back into label with new value</u>).  This is an excellent visual solution for situations such as when there are many search criteria to be displayed on the page, but you do not want to clutter the page with &quot;option entering&quot; controls.  This is a much more subtle and aesthetically pleasing presentation.<br /><br /><br /><b>Extending TextBox Controls</b><br /><br />This will probably be the most common use of this extender.  The label is initialized with the value of the textbox.  Upon clicking the label, the textbox is shown.  The user can then edit the contents of the textbox.  Upon blurring focus, the textbox is hidden and the label shown.  Should the user delete the contents of the textbox or only enter whitespace into the textbox, the textbox is not hidden, thus avoiding showing a label with no text.<br /><br /><br /><b>Extending DropDownList Controls</b><br /><br />The label is initialized with the text property of the selected item in the dropdownlist.  The value property is not used to allow for situations where the value property is empty but the text property is not, which is quite common.  Upon clicking the label, the dropdown list is shown with the selected item showing.  The user can then expand the dropdown list and make a new selection.  Upon making a new selection or blurring focus, the dropdownlist is hidden and the label shown.<br /><br /><br /><b>Demonstration</b><br /><br />A small demo of this control may be found at <a href=\"http://www.svfriends.com/demo/\">http://www.svfriends.com/demo/</a>.<br /><br /><br /><b>InlineEdit Properties:</b><br />\n<ul><li><b>TargetControlID</b> - Required.  The ID of the dropdownlist or textbox for this extender to operate on.</li>\n<li><b>LabelControlID</b> - Required.  The ID of the label control that displays the value of the dropdownlist or textbox.</li>\n<li><b>TargetCssClass</b> - <i>Optional.</i>  The CSS class applied to the dropdownlist or textbox.</li>\n<li><b>LabelNormalCssClass</b> - <i>Optional.</i>  The CSS class applied to the label in its non-mouseover state.</li>\n<li><b>LabelHoverCssClass</b> - <i>Optional.</i>  The CSS class applied to the label on mouseover.</li>\n<li><b>OnClientTargetValueChanged</b> - <i>Optional.</i>  Client-side script to execute after the dropdownlist&#39;s or textbox&#39;s value has changed.</li></ul>\n<br /><b>Comments</b><br />\n<ul><li>The <i>LabelNormalCssClass</i> and <i>LabelHoverCssClass</i> should be used to provide visual clues as to the purpose of the text displayed.  Visual clues such as underlining, changing background colors, and changing cursors should be used to indicate that the text has an interactive purpose.</li>\n<li>This extender has been tested on IE6, IE7, FF2, NN8, and Safari 3 for PC.  It has not yet been tested on Opera or Mac Safari.</li>\n<li>Enter key behavior is intercepted while changing the dropdownlist or textbox values to avoid form submission.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,ASP.NET,",
  "LastEdited": "2007-11-20T08:41:18.757-08:00"
}