{
  "ProjectName": "instruman",
  "Title": "InstruMan - Scientific and Didactic data logger and processor",
  "Description": "This is an interface used to program and control Voltcraft DPPS-32-15 Power Supply, and to log data from Victor 86C Multimeter.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h3><a href=\"http://instruman.it/site/en/\" target=\"_blank\">Visit InstruMan official website</a></h3>\r\n<p><br>\r\n<img src=\"/projects/instruman/a9331f0a-6ebd-4e96-8e5e-f3b485ee5e7e\" alt=\"\" width=\"610\" height=\"311\"></p>\r\n<h1><a href=\"http://instruman.it/site/en/download-versione-android/\" target=\"_blank\">Android Version out NOW! Go and test it!</a></h1>\r\n<h2><a href=\"https://instruman.codeplex.com/documentation\">Go to documentation section to see ideas and practical applications of the software!</a></h2>\r\n<h2>Seeking&nbsp;help!</h2>\r\n<p>Due to the high number of android devices out there, I need some help to test the compatibility of the APIs and libraries with the highest number of smartphones and tablets. If you have the possibility to test the application with your android device (you'll\r\n also need one of the two instruments Victor or Voltcraft or both, and a USB OTG cable) please let me know! Go in the PEOPLE section and contact me by mail.</p>\r\n<h2>Great News!</h2>\r\n<p><strong>The new InstruMan Mobile app is being developed</strong> (currently only for android devices)!!!</p>\r\n<p>You'll be able to control your instruments with your smartphone or tablet&nbsp;in total mobility! The only requirement is a USB OTG cable and a device with android 5.0&#43; that supports the OTG feature!</p>\r\n<p>&nbsp;</p>\r\n<p><strong>For anyone willing to help</strong>: please download the application and test any feature of it. Post any bug or comment in the forum, in the download review, or by private message.</p>\r\n<p>Tests are needed to make sure the application is stable enough to be published as the first official release, so as to bring an end to the beta testing, at least for now.</p>\r\n<h2><strong>New version 1.26b</strong></h2>\r\n<p>New version out! You can download it with the button on the right.</p>\r\n<h2><strong>New version 1.24b</strong></h2>\r\n<p>Some important fixing has been done in this release! Be sure to update soon with the button on the right</p>\r\n<h2><strong>New version 1.21b</strong></h2>\r\n<p>New update 1.21b ready for download. On the right side of this page you'll find the download link for the setup.</p>\r\n<p><br>\r\nThis is an interface used to program and control Voltcraft DPPS-32-15 Power Supply, and to log data from Victor 86C Multimeter.<br>\r\nIt's an all-in-one solution to use the two instruments at the same time for Scientific, Research and Study purposes.</p>\r\n<p>Functions avaible are the following:</p>\r\n<ul>\r\n<li>Victor 86C USB HID connection protocol </li><li>86C data reading and logging -COM port selection </li><li>Voltcraft DPPS-32-15 control and logging </li><li>Continuous reading of Voltage and Current </li><li>Continuous logging of Voltage and Current in a Chart with the option to export data to csv file\r\n</li><li>Possibility to set logging rate from 50 ms -Turn ON and OFF instrument </li><li>Set Voltage and Current </li><li>Set a custom voltage loop to play and reiterate </li><li>Reiteration possible in three ways: for a fixed time, for a fixed number of cycles and until the STOP button s pressed\r\n</li><li>Open/Save your project </li><li>Export to excel spreadsheet </li><li>Real time Heat exchange monitor and logging </li><li>Real time Power consumption monitor and logging </li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "voltcraft,power supply,multimeter,log,logging,project,save,data processing,data logging,instrument,interface,scientific,didactic,science,physics,C#,.NET,ok,",
  "LastEdited": "2016-09-08T11:03:05.803-07:00"
}