{
  "ProjectName": "ironserver",
  "Title": "Iron Server",
  "Description": "Access/Control Your PC from a Publicly hosted website OR Twitter OR Webmail",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><em><span style=\"color:#008000\"><span style=\"font-weight:800\">Iron Server</span><strong><strong>&nbsp;Alpha release is available now!</strong></strong></span></em></p>\r\n<p><strong>Iron Server!! what is this name..?</strong></p>\r\n<p>Since it executes Iron Languages Scripts on the system and serves the output..</p>\r\n<p><br>\r\n<strong>About the Project</strong></p>\r\n<p>Iron Server<span>&nbsp;is an application for experimental/demonstration purpose. The aim of the project is allowing you&nbsp;to the&nbsp;&nbsp;access the information from your computer from anywhere(Public Hosted Website,Twitter,Facebook,web mails ) by simply\r\n sending some Iron language's(IronPython, IronRuby) scripts/DOS commands. Infact you can control the PC depending on the Scripts you send.</span></p>\r\n<p><strong>Why to use Iron Server</strong></p>\r\n<p>To communicate/connect two personal computers you need a Server between them to get access and forward the data.Firewalls often block direct connections and it is not possible for most of the people to have internet-connections with static IP&nbsp;address.&nbsp;Many\r\n people think why should i use <strong>Iron Server</strong>&nbsp;application if there are things like Remote Desktop/VNC &amp; Other softwares. To use these, you still need the IP-Address and need an open port for being able to use these technologies. Iron\r\n Server application doesn't need any open ports. Firewalls simply assume that you are browsing a website OR using twitter OR using a web mail. The application doesn't require any installation you can just copy the .NET EXE &amp; supporting DLLS.</p>\r\n<p><strong>Software Requirements</strong></p>\r\n<ul>\r\n<li>.NET Framework 4.0 </li><li>Iron Languages DLLS ( Available with download&nbsp;<a title=\"Iron Python\" href=\"http://ironpython.codeplex.com\" target=\"_blank\">Iron Python</a>&nbsp;,<a title=\"Iron Ruby\" href=\"http://ironruby.codeplex.com/\" target=\"_blank\">&nbsp;Iron Rub</a>y)\r\n</li><li>If you want to run the source code use Visual&nbsp;C# Express Edition, Visual Web Developer Express Ediion.\r\n</li></ul>\r\n<p><strong>What's there in this Release:</strong></p>\r\n<ul>\r\n<li>Alpha release supports, allow you to access your computer information/control from free&nbsp;<strong>Publicly Hosted Website</strong> using\r\n<strong>Iron Python.</strong> </li></ul>\r\n<p><strong>Work In-Progress</strong></p>\r\n<ul>\r\n<li>Testing </li><li>Documentation&nbsp; </li><li>Support for Iron Ruby </li><li>Support DOS commands using custom DOS shell </li><li>Creating a Custom Protocol(which i call it as IronProtocol) for this type of Application\r\n</li><li>Control and access your computer from Twitter,Facebook, web mail </li><li>Code Cleanup </li><li>Reducing the Build Time Dependencies on Iron Languages DLL's </li></ul>\r\n<p><span style=\"color:#ff0000\"><strong><strong>Attention!!!&nbsp;</strong></strong></span></p>\r\n<ul>\r\n<li>&nbsp;My intention is not to Create/Demonstrate a Malware with this application using .NET\r\n</li></ul>\r\n<p>Iron Server allows the execution of Iron Languages on your computer. Bad scripts can read/modify/delete your data and to destroy your system. The code can be easily customized to create Zombie Servers. As the application is written in C# &amp; .NET, generally\r\n the Attack Surface for a Hacker may be less due to the other dependencies. But it is&nbsp;completely&nbsp;dependent on the execution environment. As mentioned previously code can be customized depending on the needs and can be easily turned into a Malware\r\n application to generate different type of payloads. Current Day Anti virus Scanners cannot understand such payloads.&nbsp;</p>\r\n<p>The best way to use this application is with a reliable and secure source.</p>\r\n<p><strong>About My Self</strong></p>\r\n<ul>\r\n<li>10 Yrs of IT Experience </li><li>Certified Ethical Hacker </li><li>Submitting Bugs to Iron Python Project </li><li>Writing Web Bots </li></ul>\r\n<p>P.Sunil&nbsp;</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Nice One,",
  "LastEdited": "2012-04-01T00:02:29.863-07:00"
}