{
  "ProjectName": "isehg",
  "Title": "IseHg",
  "Description": "The IseHg project is an add-on for the Windows PowerShell ISE, that allows you to easily perform basic Mercurial source control functions.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The IseHg project is an add-on for the Windows PowerShell ISE, that allows you to easily perform basic Mercurial source control functions.<br /><br />If you are a heavy user of the PowerShell Integrated Scripting Editor (ISE), and frequently perform source control actions, such as adding files, removing files, committing changes, and checking file status, then this module will be of great value to you. Using easy to remember keyboard shortcuts, you can perform these basic functions, and enhance your productivity <u>without leaving the ISE</u>.<br /><br />There are five Mercurial functions provided in the initial version of the IseHg module. The functions and keyboard shortcuts are included in the table below.<br /><br /><table><tr><th> Command </th><th> Keyboard Shortcut </th><th> Alternate Keyboard Shortcut </th><th> Notes </th></tr>\n<tr><td> Init </td><td> CTRL + SHIFT + I </td><td> ALT + A, M, I </td><td> Creates a new Mercurial repository in the current working directory. </td></tr>\n<tr><td> Add </td><td> CTRL + SHIFT + A </td><td> ALT + A, M, A </td><td> Adds the currently selected file to a Mercurial repository </td></tr>\n<tr><td> Remove </td><td> CTRL + SHIFT + V </td><td> ALT + A, M, V </td><td> Removes the currently selected file from a Mercurial repository </td></tr>\n<tr><td> Commit </td><td> CTRL + SHIFT + C </td><td> ALT + A, M, C </td><td> Commits changes to the current file to its Mercurial repository </td></tr>\n<tr><td> Status </td><td> CTRL + SHIFT + S </td><td> ALT + A, M, S </td><td> Retrieves the status of a file in its repository </td></tr></table><br /><br /><img src=\"https://www.codeplex.com/Download?ProjectName=isehg&amp;DownloadId=865458\" /><br /><br />Most of the functions in this module do not require input, as they operate on either the current file, or current working directory. The Commit operation does pop up a dialog box that asks for a commit message, however. This dialog can be seen in the screenshot below.<br /><br /><img src=\"https://www.codeplex.com/Download?ProjectName=isehg&amp;DownloadId=865459\" /><br />\n<h2>Installation</h2>\r\nTo install the IseHg module, you should first install the <a href=\"http://tortoisehg.bitbucket.org/\">TortoiseHg</a> tools. After doing this, you can download and extract the IseHg module into your PowerShell modules directory. To find an appropriate modules directory, use the <b>$env:PSModulePath</b> environment variable from PowerShell.<br /><br />Once you have extracted / installed the module to the appropriate directory, you can call <b>Import-Module -Name IseHg;</b> to import the module into your ISE environment. To remove the module, and clean up the add-on menus, run the command: <b>Remove-Module -Name IseHg;</b><br />\n<h4>PowerShell 5.0 Preview</h4>\r\nIf you&#39;re using the Windows Management Framework Core 5.0 Preview, you can install the IseHg module from the PowerShellGet module gallery! To do this, simply run:<br /><br /><pre>\nInstall-Module -Name IseHg -Scope CurrentUser;\n</pre><br />\n<h2>Cleanliness</h2>\r\nThis PowerShell module is easy to install or remove, just like any other module. Additionally, when you remove this module from the PowerShell ISE, it will clean up all of its menu items! You don&#39;t have to worry about leftover crud in your session, when utilizing IseHg!</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-06-20T08:47:46.253-07:00"
}