{
  "ProjectName": "itproject",
  "Title": "ITProject",
  "Description": "ITProject will be a ASP MVC 3 web application to storage and versioning code and menagement your project. \r\n\r\nITProject makes it easier for project leaders to control your source code, bugs and programmers teams. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>ITProject</h1>\r\n<br /><b>Software Team:</b><br />Jakub Szatkowski - Software Team Leader (szatek)<br />Natalia Wyczislok - Junior Software Developer, Designer (Nethia)<br />Alicja Zwiewka - Junior Software Developer (alice1989)<br />Michał Gajewski - Senior Software Developer (gajes08)<br /><br /><u><b>ITProject</b> jest projektem typu Open Source, kt&#243;ry będzie pozwalał w łatwy spos&#243;b zarządzać projektami informatycznymi.</u> Pozwalać będzie na wersjonowanie kodu źr&#243;dłowego, tworzenie zespoł&#243;w w ramach jednego projektu, przydzielanie zadań do zespołu lub uczestnika projektu i raportowanie błęd&#243;w. Kod każdej aplikacji będzie zamknięty z możliwością otwarcia kodu.<br /><br /><i>ITProject to projekt tworzony na potrzeby zajęć programowania zespołowego na Wydziale Fizyki, Astronomii i Informatyki Stosowanej na Uniwersytecie Mikołaja Kopernika w Toruniu na kierunku Informatyka Stosowana.</i><br /><br />Prosty interfejs pozwalać będzie na porozumiewanie się z innymi członkami projekt&#243;w, dyskusje na jego temat i komentowanie danych projekt&#243;w. Gdy wersja projektu będzie gotowa do wydana serwis ITProject będzie pozwalał na pobranie skompilowanego projektu.<br /><br />Cały projekt ma za zadanie stworzenie aplikacji WWW spełniającej wyżej napisane wymagania.<br /><br />Aplikacja tworzona jest w systemie <b>ASP.NET MVC 3</b> firmy Microsoft. Baza danych przechowywana jest na serwerze Microsoft SQL Server. W projekcie obowiązuje wzorzec projektowy Model, View, Contoller. <br /><br /><b>Podział na Model, View i Contoller w ITProject</b>:\n<ul><li><u>Model</u> składa się z trzech części, każda z nich jest pisana w języku C#\n<ul><li>zmapowane obiekty bazodanowe </li>\n<li>interfejsy do pobierania obiekt&#243;w modelu bazodanowego i implementacje korzystające z Entity Framework</li>\n<li>modele widokowe - modele kt&#243;ry są wysyłane do widok&#243;w w celu pobrania danych od użytkownika lub w celu wyświetlenia użytkownikowi</li></ul></li>\n<li><u>Contoller</u> - kod pisany w C# zawierający klasy kontroler&#243;w odpowiadających za obsługę zapytań do serwera i za renderowanie widok&#243;w z odpowiednimi modelami</li>\n<li><u>View</u> - widoki pisane w plikach w formacie cshtm z użyciem silnika Razor służą do wyświetlania tego co użytkownik ma widzieć w przeglądarce.</li></ul>\n<br /><u>W projekcie ITProject korzystamy z następujących gotowych komponent&#243;w</u>:<br />- Razor - jako silnik generowania kodu html <br />- Entity Framework jako system ORM (Mapowanie krotek bazy danych na obiekty)<br />- T4MVC do ułatwienia pisania kodu w silniku Razor<br />- NInject jako biblioteka służąca do Dependency Injection. Wstrzykujemy klasy w interfejsy po to by cały projekt interfejsu WWW był niezależny od źr&#243;dła danych<br />- Skrypty jquery do walidacji danych po stronie uzytkownika<br /><br />Do tej pory aplikacja testowana była tylko na serwerze ASP.NET Deployment Serwer postawionym na localhost.<br /><br /><b>Gł&#243;wne etapy tworzenia ITProject</b>:<br /><br /><u>Etap 1</u><br />Podstawowa funkcjonalność użytkownika - logowanie, rejestracja użytkownik&#243;w, edycja danych, tworzenie projekt&#243;w, system wewnętrznych wiadomości<br /><br /><u>Etap 2</u><br />Wersjonowanie kodu, skorzystanie z systemu SVN do wersjonowania kodu, po wrzuceniu odpowiedniej wersji na stronie www będzie spis wersji wraz z komentarzami i datą dodania<br /><br /><u>Etap 3</u><br />System zarządzania projektami, wsparcie dzięki interfejsowi www metody SCRUM. Możliwości przydziału zadań, raportowania błęd&#243;w etc.<br /><br /><u>Etap 4</u><br />Dokumentacja i przygotowanie materiał&#243;w do zajęć programowania zespołowego. Stworzenie dokumentacji technicznej kodu, analizy wymagań, diagram&#243;w i innych<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-03-29T14:57:17.607-07:00"
}