{
  "ProjectName": "jquerywebcontrol",
  "Title": "jQuery Web Control",
  "Description": "A web control that performs an jQUery include, it not only checks to see if the jQuery control has been rendered before, if not render it but also allows you to simply specify the jQuery version, path to the file and which type to use, normal, minified or packed.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A web control that performs an jQUery include, it not only checks to see if the jQuery control has been rendered before, if not render it but also allows you to simply specify the jQuery version, path to the file and which type to use, normal, minified or packed.<br />\n<h2>How To Use It</h2>\r\nSo add a register assembly into the top of your aspx file<br /><br />    &lt;%@ Register Assembly=&quot;jQueryWebControl&quot; Namespace=&quot;jQueryWebControl&quot; TagPrefix=&quot;jQuery&quot; %&gt;<br /><br />Then which ever page, master page or even web control will need jQuery add the jQuery Web Control.<br /><br />    &lt;jQuery:jQuery runat=&quot;server&quot; ID=&quot;jQuery&quot;/&gt;<br /><br />As the control checks to see if a jQuery control has rendered before you don&#39;t have to worry about only including the control once. This should ensure you don&#39;t have to waste time checking but also means your controls can be used independantly in different sites.<br />\n<h2>Using the three optional parameters, Version, Type and Path.</h2>\r\nVersion - this is just a string parameter that allows you to specify the version of jQuery to use. E.G &quot;1.2.2&quot; - if this is left out then the control defaults to 1.2.0<br /><br />Type - again a string parameter, this time with three options, empty string &quot;&quot; = default / development version, &quot;min&quot; = minified version, &quot;pack&quot; - the packed version for people who cant serve up gzipped files. - if left the control defaults to the normal development version<br /><br />Path - a string parameter indicating the path to the javascript files. E.G &quot;/javascript/jquery&quot;. - if left the control defaults to the /javascript/<br /><br />It is worth noting that the control expects you to host the jQuery files, so in order to render the script tag for version 1.2.2 pack&#39;d jQuery file you will need jquery.1.2.2.pack.js in the location you specify with the path parameter.<br />\n<h2>Example of use using parameters</h2>\r\n    &lt;jQuery:jQuery runat=&quot;server&quot; ID=&quot;jQuery&quot; Version=&quot;1.2.2&quot; Type=&quot;min&quot; Path=&quot;/javascript/jQuery/&quot;/&gt;<br /><br />I personally have made use of the version parameter the most as it has means different sites that have been developed against different jQuery releases can be updated / forced to use one version of the library. It also works best if all your jQuery files are in one centralised location, using a virtual directory or a shared location.<br /><br />So hope you like the control, let me know any thoughts, comments or improvements and enjoy.</div><div class=\"ClearBoth\"></div>",
  "TagList": "JQuery,",
  "LastEdited": "2008-05-16T15:50:46.173-07:00"
}