{
  "ProjectName": "jquidnn",
  "Title": "jQuery UI DotNetNuke integration",
  "Description": "The goal of jQUI-DNN is to provide an easily deployable solution for developers wanting to use jQuery UI in a DotNetNuke context. The core and themes are provided as separate modules for easy deployment in a DotNetNuke host. It is developed in C#.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The goal of jQUI-DNN is to provide an easily deployable solution for developers wanting to use jQuery UI in a DotNetNuke context. The core and themes are provided as separate modules for easy deployment in a DotNetNuke host. It is developed in C&#35;.<br /><br />\n<h1>Current development</h1>\rThe latest development has been released in the current downloads. More features will be added as the need arises or someone specifically asks for them. So don&#39;t hesitate to drop us a line, or code yourself and aid us in making the integration package complete.<br />\n<h2>Important notice from the maintainer</h2>\rRecent developments have made it necessary to rename the module and its various parts. My previous company has been closed. Instead, the project is now maintained by myself, hopefully making future refactoring unneccessary. I&#39;m very sorry for any inconveniences this causes.<br />\n<h1>Current release</h1>\rThe current release is the <a href=\"https://jquidnn.codeplex.com/releases/view/65190\">jQUI-DNN 0.7.0</a>. It is a refactoring of the older version, moving it to a new namespace. It also includes the more current versions of jQuery 1.5.2 and jQuery UI 1.8.12. You can try it out at our new demo site <a href=\"http://jquidnn.heroldit.de/\">http://jquidnn.heroldit.de/</a>.<br /><br />The extras package has been upgraded as well to use the new jQuery UI 1.8 infrastructure.<br /><br />Both releases are packaged for installation as DNN modules. The core module package contains the core functionality for the jQuery UI integration. It includes the web controls, infrastructural code for including the required javascript libraries on the page, and the smoothness theme. Current library versions are:\n<ul><li>jquery-1.5.2.min.js</li>\n<li>jquery-ui-1.8.12.min.js</li></ul>\nThe currently implemented web controls are:\n<ul><li>DatePicker (Textbox-Popup-Mode)</li>\n<li>Dialog</li>\n<li>Progressbar</li>\n<li>Slider</li>\n<li>Tabs</li></ul>\n<br />The Extras module contains supplementary web controls and widget code for non-core widgets. The currently implemented web controls are:\n<ul><li>Watermark</li>\n<li>WindowedDialog</li></ul>\n<br />Currently, we have no End-User Documentation for the module package, but the provided web controls are now documented in code, and the compiled xml documentation files are available as a separate release (see below). To view a demo of the available controls, simply place the core module on a tab, or visit the demo page at <a href=\"http://jquidnn.heroldit.de/\">http://jquidnn.heroldit.de/</a>.<br /><br />After installing the DotNetNuke modules, be sure to mark them as premium, so they are not visible in the module selection list. The intended usage is not as modules, but as a library for developers wanting to use jQuery in their module views.<br /><br />For developers wanting to create DotNetNuke components using the supplied web controls, we supply four releases containing just the dll and xml documentation files, a debug and a release build. Be sure to grab those, if you want to start developing. They are available in the <b>Available Downloads</b> section of <a href=\"https://jquidnn.codeplex.com/releases/view/65190\">jQUI-DNN 0.7.0</a>.<br />\n<h1>Products using JQUI-DNN</h1>\rLike every developer, we also like to see examples of work based on our library. So, if you are developing modules or skins using our library, <i>please</i> show them off by leaving a link in the discussion board :-) If you like, we can even link them in the list below.\n<ul><li><a href=\"http://dnnmlnews.codeplex.com/\">DotNetNuke Multilanguage News</a> makes heavy use of JQUI-DNN in the administration backend.</li></ul>\n<br /><b>More developers are welcome to help the project!</b></div><div class=\"ClearBoth\"></div>",
  "TagList": "DotNetNuke,DotNetNuke Module,jQuery,web controls,Integration,jQuery UI,Tabs,Datepicker,",
  "LastEdited": "2011-04-26T13:06:25.867-07:00"
}