{
  "ProjectName": "kinductor",
  "Title": "Kinductor",
  "Description": "Kinductor puts you on the podium and in control of a full symphonic orchestra using just your hands and Kinect.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Kinductor puts you on the podium and in control of a full symphonic orchestra using just your hands and Kinect.<br /><br />This project was created in under 24 hours during the Kinect Code Camp on June 15th, 2011 and demonstrated during the live Kinect for Windows SDK beta launch. The contributors were:\n<ul><li>Joshua Blake, Technical Director of the <a href=\"http://www.infostrat.com\">InfoStrat Advanced Technology Group</a></li>\n<li>Jeff Garra, a developer from <a href=\"http://www.zaaz.com\">ZAAZ</a></li>\n<li>Shani Jayant, a recent computer science PhD graduate from University of Washington</li></ul>\n<br />A video of the application in use and interview* with the developers:<br /><div class=\"video\" style=\"text-align:Center\"><span class=\"player\"><object height=\"285px\" width=\"320px\"><param name=\"movie\" value=\"http://www.youtube.com/v/2PoSQxktU9s\"></param><param name=\"wmode\" value=\"transparent\"></param><embed height=\"285px\" width=\"320px\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" src=\"http://www.youtube.com/v/2PoSQxktU9s\" /></object></span><br /><span class=\"external\"><a href=\"http://www.youtube.com/watch?v=2PoSQxktU9s\" target=\"_blank\">Launch in another window</a></span></div><br />\n<ul><li>This was shot after the Code Camp and at least 36 hours of being awake, so forgive any lapses in our ability to think or speak.</li></ul>\n<br />The source code is available on the source code tab. At this point this is exactly what we created during the Code Camp and has some occassional bad coding style or other weirdness. We&#39;ll clean it up as we have the chance. It also requires the <a href=\"http://Kinect for Windows SDK\">http://research.microsoft.com/en-us/um/redmond/projects/kinectsdk/download.aspx</a>. <br />\n<h2>Notes on usage</h2>\r\nUntil we clean up the code, you&#39;ll have to deal with a few loose ends.<br /><br />First, put the midi files from the Audio folder into c:\\temp\\midi\\, or change the file path in Main.xaml.cs Init() method.<br /><br />Second, when you run the program, it will load the midi file and then pulse the lines separating the instrument sections once to indicate loading complete. You can push the spacebar to toggle between starting the music playback and stopping playback and resetting to the beginning of the song.<br /><br />When you play the music, you can control the tempo by conducting. Right now it will only look at your right hand&#39;s beat pattern. The best result is when your beat battern is in front of your body with the lowest part bouncing about chest height.<br /><br />Finally, volume control is a bit finicky. Put your left hand far to your left and hold it steady for a second or two, then you can raise or lower it to change the volume. The volume is mapped directly to the height of your hand. (We had a relative mode, but it wasn&#39;t working well.)<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-07-04T13:02:44.107-07:00"
}