{
  "ProjectName": "kpaint",
  "Title": "Kpaint",
  "Description": "Our work with Kpaint has proven to have provide highly accurate results mostly with the exception of occasion jittery of the paint brush. The voice recognition ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br /><br />Kpaint is hands free drawing experience that allows people to enjoy accurate digital painting and providing the closest feeling to drawing on paper. Integrated with voice recognition and gesture recognition to help bring the most seamless and comfortable experience to fully enjoy painting. <br /><br /><br /><b>Features:</b>\n<ul><li>Drawing</li>\n<li>Gesture  Check  (Save , Capture ,Exit)</li>\n<li>Add Gesture</li>\n<li>Voice Recognition (Change color)</li>\n<li>Change color and size </li>\n<li>Capture photo and edit to it </li>\n<li>Photo Gallery </li>\n<li>Clear</li></ul>\n<br /><br /><br />This Project was created using Visual Studio 2010, C# WPF, Kinect SDK v1.6, Microsoft Speech Engine v11.<br /><br />This was submitted as the graduation project in Cairo University - Faculty of Computers and Information year 2013, Cairo, Egypt. <br /><br /><br /><b>Usage:</b><br /><br />Stand a good distance away from the camera untill the body color turns yellow in the depth color screen in the lower right corner, when the red circle in the middle turns green means u can draw. <br /><br />Wave hand above icon and wait for progress bar to be filled for the required action to complete. for actions like &quot;check gesture&quot;, &quot;add gesture&quot;, &quot;capture&quot;, an extra bar will quickly fill giving you time to prepare.<br /><br /><u>In case of:</u>\n<ul><li>Add gesture: after you choose the action you want to execute, you will be given time to record your gesture.</li>\n<li>Check gesture: u will be given time to replicate the gesture recorded.</li>\n<li>Capture: you will be given time to pose for the picture.</li></ul>\n<br /><u>Photo gallery:</u>\n<ul><li>Swipe your right hand from &quot;right - left&quot; to swipe next.</li>\n<li>Swipe your left hand from &quot;left - right&quot; to swipe next.</li>\n<li>Swipe your right hand from &quot;left - right&quot; to close photo gallery.</li></ul>\n<br />Note: your hand must be above your elbow for the move to be registered, and you will have a certain time and a progress bar to execute the move before it completes.<br /><br />Images can be edited in the &quot;images&quot; folder in the project.</div><div class=\"ClearBoth\"></div>",
  "TagList": "kinect,WPF,C#,Kinect Speech,paint,kpaint,Gesture Recognition,Voice,visual studio 2010,Kinect sdk v1.6,",
  "LastEdited": "2013-07-22T11:58:20.213-07:00"
}