{
  "ProjectName": "lbnet",
  "Title": "LightBox.NET",
  "Description": "LightBox.NET is the packaging of Lightbox JS v2.0 into a .NET assembly along with two simple web controls to provide the “lightbox” support.  The first web control, ScriptManager, is used to install (creates a directory and related files) the necessary script, image and CSS files into your ASP.NET application and to add the correct HTML elements to your element.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><a href=\"https://lbnet.codeplex.com/wikipage?title=News%20Feeds&referringTitle=Home\">News Feeds</a><br /><b>Decription</b><br /><br />LightBox.NET is the packaging of <a href=\"http://www.huddletogether.com/projects/lightbox2\">Lightbox JS v2.0 project</a> developed by <a href=\"http://www.huddletogether.com/\">Lokesh Dhakar</a> into a .NET assembly along with two simple web controls to provide the “lightbox” support.  The first web control, ScriptManager, is used to install the necessary script, image and CSS files into your ASP.NET application and to add the correct HTML elements to your element.  If you want to use LightBox.NET in your page, you need to place a ScriptManager control in it.  <br /><br />The syntax is something like this:<br /><pre>\n&lt;lbn:scriptmanager runat=&quot;server&quot; id=&quot;imgManager&quot; /&gt;</pre><br /><br />From here, you can now use the Hyperlink web control to render out your &quot;lightboxed&quot; image by setting the imageurl and navigateurl properties.  If you want to take advantage of the image set feature the script offers, you will only need to specify the group property of the control.  The syntax is something like this:<br /><br /><pre>\n&lt;lbn:hyperlink id=&quot;img1&quot; runat=&quot;server&quot; imageurl=&quot;images/thumb-1.jpg&quot; navigateurl=&quot;images/image-1.jpg&quot; tooltip=&quot;Picture 1&quot; /&gt;</pre><br /><br />Check out the <a href=\"https://lbnet.codeplex.com/releases/view/694\">latest release</a> to see if you like LightBox.NET!</div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,ASP.NET,javascript,web controls,LightBox JS,LightBox.NET,Light Box.Net (Ajax),",
  "LastEdited": "2006-12-07T15:16:02.313-08:00"
}