{
  "ProjectName": "listbox",
  "Title": "Xceed Ultimate ListBox for Silverlight",
  "Description": "Xceed Ultimate ListBox for Silverlight makes it easier for Silverlight developers to deliver apps with smooth-scrolling, always-responsive listbox controls. Makes use of advanced data virtualization techniques to stream content instead of having to load it all into the listbox first. This project is developed in C# and XAML.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Free and easy to use, Xceed Ultimate ListBox for Silverlight behaves and feels the way a Silverlight listbox should.<br /><br /><b>The smoothest, most responsive Silverlight listbox—even with remote data</b><br /><br />Most Silverlight listboxes feel sluggish with remote data, which is increasingly prevalent and important. But thanks to an innovative background data retrieval engine that uses virtualization, optimized network communication, and a top-to-bottom asynchronous architecture, the listbox interface—and therefore your app—is always responsive. <br /><br /><b>Easy on developers? Couldn’t be easier.</b><br /><br />Simply drops in as a replacement of the stock Silverlight listbox, mirroring that control’s API as its core. But it provides so much more, helping you create apps that will wow your end-users.<br /><br /><b>More than just a ListBox</b><br /><br />As well as powerful grouping, filtering, navigation, and a traditional vertical listbox, this project provides a horizontal layout and unique “path” views in which items scroll along any sort of geometrical path. Six themes are included. <br /><br /><b>Tested and Used by Developers</b><br /><br />Xceed Ultimate ListBox for Silverlight on CodePlex is provided under an Open Source license, but is otherwise identical to the commercial product (provided under a proprietary license) that can be used in closed source projects. And because our commercial product is used by developers in production scenarios, you know you can trust it in your Open Source projects. You can obtain the listbox with a commercial license from <a href=\"http://xceed.com\">xceed.com</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-07-20T09:14:44.517-07:00"
}