{
  "ProjectName": "lizardtf",
  "Title": "LizardTF",
  "Description": "LizardTF is a TortoiseSVN like client (icon overlays and context menus) for MS Team Foundation Version Control (TFS) using MS Windows Explorer shell extensions and the MS Team Foundation API.\n\nLizardTF supports (or will support) all TFS functions from explorer, has bespoke difference, history, and merge tools, all richer than the Team Explorer offerings and will also offer rollback and baseless merging.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>LizardTF  <img src=\"/projects/lizardtf/c6ba039d-d9c8-42f3-8738-731b59fd1e9c\" alt=\"Lizard.bmp\" title=\"Lizard.bmp\" /></h1>\r<h2>Free open-source Microsoft Team Foundation Server Version Control Client.</h2>\r\nThis has by and large been superseded by the TFS Power Tools with Explorer integration, and general improvements with TFS 2010 and now TFS 2012.<br /><br />However I still use the diff and merge tools (there are probably better ones out there, but I really like that the merge tool allows me to split the target file off, and onto my second monitor).<br /><br />I have just checked in a new project just called &#39;diffs&#39; that just has the diff and merge tools - everything stripped out. I was planning to completely re-write these as the code isn&#39;t a great example, and I&#39;ve got something looking nice-ish using the Sharp-Develop teams Avalon WPF code editor - but that is going to take forever, so I created for me and anyone else who liked the diff and merge tool. They can be easily set to be the default tools used by Visual Studio for TFS compare and merge operations. Instructions will follow on the blog soon(ish), but it is quite straight forward.<br /><br />Ian.<br /><br /><br /><br />\n<hr />------------------------------------------------------------------------------ <br /><br />I&#39;ve neglected this for a long time, but now I&#39;m working on updating everything to run on windows 7 with .Net 4.0.<br /><br />Source code is now available right here from the CodePlex TFS servers - This is the source for the LizardTF 0.3.0 release.<br /><br />A .msi installer is also posted under Releases - but this hasn&#39;t had much testing yet.<br /><br />All shell extensions are now written in c++, Icon overlays are handled via TortoiseOverlays, so Lizard can be used with Tortoise SVN/CSV without running out of overlay resources. Metadata has been moved to dedicated storage folder, so working folder structure is not polluted with LizardTF metadata. Multiple server support is next on the list (now that I&#39;m using CodePlex and local TFS servers). I&#39;m hoping all this will be in a build in about a months time (mid/late October 2008).<br /><br /><b>It&#39;s like TortoiseSVN, SVN Bridge and DubbleBock, but all in one handy dedicated package!</b><br /><br /><b>For the latest news, developments and comments on LizardTF please visit <a href=\"http://www.iansbitsandbobs.blogspot.com\">http://www.iansbitsandbobs.blogspot.com</a></b><br /><br />LizardTF is a (sort of) TortoiseSVN clone for Microsoft Team Foundation Server version control. It uses Explorer shell extensions to provide status overlays, TF item information as additional list columns, context menus from explorer to drive TF operations and an extra tab on the file properties form to show TF item status and history. <br /><br />LizardTF has it&#39;s own bespoke review, diff, merge/conflict, and history tools/browsers and a blame tool. LizardTF does not use the TF.exe command line for any operations.<br /><br />LizardTF has an extra build/install to support 64-bit XP (I haven&#39;t had a vista machine to test it on yet)<br /><br />You can use LizardTF for your CodePlex projects!<br /> <br />Currently it supports most functions except merging this will be coming soon, and I just noticed moving and renaming are missing, they will be here sooner.<br /> <br />It has a bespoke review page for viewing and checking on out of date files, conflicts and pending changes all in one place, and a handy diff tool for reviewing changes between folder structures on disk, in the repository or both. <br /><br />Repository Browser allows you to view the repository content at any revision, and see deleted items.<br /> <br />Planned extras are &#39;Changeset roll back&#39; to undo a single, or range of, changesets (like svn), the ability to apply a changeset to a different (unrelated) branch (like svn) - The diff tools currently allows this on a file by file basis.<br /><br /><b>LizardTF is not associated with Tigris or TortoiseSVN/TortoiseCVS - it&#39;s just a copy(ish) for Team Foundation Server</b><br /><br />Explorer showing the LizardTF project with overlays:<br /><br /><img src=\"/projects/lizardtf/ee681a28-689e-4e75-aed7-18dec9432196\" alt=\"LizardExplorerSmaller.jpg\" title=\"LizardExplorerSmaller.jpg\" /><br /><br /><br />Explorer Property Page for LizardT:<br /><br /><img src=\"/projects/lizardtf/e6b8949c-49d4-4c54-8ae7-0b96b33a1850\" alt=\"LizardPropertiesSmaller.JPG\" title=\"LizardPropertiesSmaller.JPG\" /><br /><br /><br />Conflicts/Pendings/Out-Of-Date review:<br /><br /><img src=\"/projects/lizardtf/c9584dab-a6d5-49ec-abae-37ab3860a59c\" alt=\"LizardReviewSmaller.JPG\" title=\"LizardReviewSmaller.JPG\" /><br /><br /><br />Folder/Branch/Version Diff Tool:<br /><br /><img src=\"/projects/lizardtf/5aa07f78-f7ee-4380-83bb-bf3530168071\" alt=\"LizardDifSmaller.JPG\" title=\"LizardDifSmaller.JPG\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Team System,Explorer plugin,LizardTF,TFS,",
  "LastEdited": "2013-05-21T15:01:02.19-07:00"
}