{
  "ProjectName": "managedupnp",
  "Title": "ManagedUPnP (Managed UPnP client library)",
  "Description": "ManagedUPnP is a library built in .NET 4 using C# for Visual Studio 2010 Express.\r\n\r\nIt uses the Microsoft UPnP COM Implementation.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />ManagedUPnP is a library built in .NET 4 using C&#35; for Visual Studio 2010 Express.<br /><br />It uses the Microsoft UPnP COM Implementation.<br /><br />It provides these features as a fully Managed code set:<br />\n<ul><li>Easily discover services and / devices using synchronous or asynchronous methods.</li>\n<li>Use the UPnPDiscovery component, by dropping it on a form for easy asynchronous discovery of devices and services.</li>\n<li>Load the device service descriptions,  to determine the actions / arguments, and state variables supported by a device into structured classes to determine service capabilities.</li>\n<li>Dynamically query StateVariables and call service Actions.</li>\n<li>Generate classes for individual devices / services in the C# or VB.NET language</li>\n<li>Receive events when evented State Variables change on services</li>\n<li>Generate a total hierarchical tree of services and device classes for a device in the C# or VB.NET language</li>\n<li>Has built-in functionality for advanced logging, simply attach to event and enable logging to get logging information in your program</li></ul>\n<br /><b>Please see the discussions for some simple examples of how to use the library, also, if there is anything you need help with, please post in the discussions.</b><br /><br />Included with the solution is the Library Project (ManagedUPnP) and a demo project (ManagedUPnPTest). The demo project will enumerate all available UPnP devices and allow the user to execute actions or query state variables. Also, a simple console project is included which demonstrates how to query a UPnP enabled modem for the true external IP address of the WAN connection.<br /><br /><b>NOTE:</b> If you get DisconnectedContext or ContextSwtichDeadlock MDAs while using this library do not be concerned, simply disable the MDAs while debugging, more information can be found here:<br /><br /><a href=\"http://managedupnp.codeplex.com/discussions/276221\">http://managedupnp.codeplex.com/discussions/276221</a><br /><br />Two projects I have made with this library are:<br /><br />UPnP Monitor - <a href=\"http://home.exetel.com.au/amurgshere/upnpmonitor.phtml\">http://home.exetel.com.au/amurgshere/upnpmonitor.phtml</a><br />Hardware Monitor - <a href=\"http://home.exetel.com.au/amurgshere/hwmonitor.phtml\">http://home.exetel.com.au/amurgshere/hwmonitor.phtml</a><br /><br />I have personally tested (or had others test) these pieces of UPnP enabled hardware / software with this library:<br /><br />Vuze - torrent downloader (software)<br />UPnP enabled Samsung TVs - allows you to control TV remotely<br />Netgear DG834G ADSL Modem / Router<br />Windows Media Player<br />PS3 Media Server<br />\n<h1>History</h1>\r<b>Version 2.1 Changes</b>\n<ul><li>Added new overload for &quot;DeviceServiceDescription&quot; to Service extension methods - this will get the DeviceServiceDescription object for that service, one optional parameter of useCache can be specified</li>\n<li>ManagedUPnPTest has new &quot;Properties&quot; tab added for Services and Descriptions which displays all XML properties for that device or service (and device service in the case of a service)</li>\n<li>Added GetSCPDUrl, GetControlURL and GetEventSubURL to DeviceServiceDescription (these urls are full URLs that you can use to get the documents or post data to)</li></ul>\n<br /><b>Version 2.0 Changes</b>\n<ul><li>Added an extra overload for Discovery.FindServices(ipAddressFamily, resolveNetworkInterfaces), this will find all services in a synchronous manner.</li>\n<li>Better support for new Adapters, AdapterUnicastIPAddressInformations, AdapterIPAddresses, RootHostAddresses, and RootHostName Device properties with IPv6 (removed address type checking).</li>\n<li>Added more parameter checking with Find Services and raises exceptions.</li></ul>\n<br /><b>Version 1.9 Changes</b>\n<ul><li>Added Adapters, AdapterUnicastIPAddressInformations, AdapterIPAddresses, RootHostAddresses, and RootHostName properties to Device class</li>\n<li>Added NIC Device IP Addresses to device info in ManagedUPnPTest application</li>\n<li>Added Description support for all UPnP datatypes: bin.base64, number, uuid, bin.hex</li>\n<li>All new data types also support to and from string conversions</li>\n<li>ManagedUPnPTest application now supports the reading and entering of byte array types (bin.Base64)</li>\n<li>New property added to data type information attribute - AllowEmpty, is true if array or string datatypes can be empty</li>\n<li>Added AddressFamily and ResolveNetworkInterfaces properties to AutoDiscoverServices class</li>\n<li>Updated ManagedUPnP test to display IP addresses of conencted interfaces utilising the InterfaceGuid where available (Windows Vista and above)</li>\n<li>Other minor bug fixes</li></ul>\n<br /><b>Version 1.8 Changes</b>\n<ul><li>Code generation now supports VB.NET generation</li>\n<li>ManagedUPnPTest updated to support new VB.NET code generation</li>\n<li>New class added to ManagedUPnP.Components - LogInterceptor - a GUI thread safe ManagedUPnP logging component</li>\n<li>Added LogInterceptor example to ComponentsTest project</li>\n<li>More examples added via XML comments</li>\n<li>Other minor bug fixes</li></ul>\n<br /><b>Version 1.7 Changes</b>\n<ul><li>XML Comments added to code generation for Devices and Services including Service Action parameter properties</li>\n<li>New WindowsFirewall static class added - This class can check the Windows firewall settings and fix them under Windows XP</li>\n<li>More comphensive XML comments in the code</li>\n<li>Brings code inline with new CHM help file located in Documentation section (more documentation to come)</li>\n<li>Many little bug fixes</li></ul>\n<br /><b>Version 1.6 Changes</b>\n<ul><li>NOTE: None of these changes should break any of your code, I have done my very best to keep it backward compatible</li>\n<li>Code generation for Devices and Services is now smarter - it will not create empty Regions</li>\n<li>Code generation for Services now adds generic typed events for each &quot;Evented&quot; state variable - saves you doing the work</li>\n<li>New classes added in ManagedUPnP.Components namespace, the UPnPDiscovery component allows extremely easy access to discovering Devices and Services from a windows forms application asynchronously, simply drop the component on your form, add the events and set the Active property to true. This component will automatically take into account for GUI Thread related issues. See the example project.</li>\n<li>New demo Project added to solution - ComponentsTest - demonstrating the UPnPDiscovery component</li>\n<li>ManagedUPnPTest project now defers code generation of Services and Devices until after you click the tab - this reduces lag</li>\n<li>New conditional defines added to allow you to compile ManagedUPnP.DLL without certain namespaces, see ConditionalDefines.CS in the root of the ManagedUPnP project for more information.</li>\n<li>Added more XML comments to Discovery class to make it easier to understand</li>\n<li>Many little bug fixes</li>\n<li>PLANNED FOR FUTURE VERSION: XML Comments in all generated class code. including extra information about parameters and state variables</li>\n<li>PLANNED FOR FUTURE VERSION: Proper documentation - thanks Chloh for the review! :)</li></ul>\n<br /><br /><b>Version 1.5 Changes</b>\n<ul><li>Fixed problem with generating service classes with default Services namespace (ManagedUPnP.Services was being confused with local namespace)</li></ul>\n<br /><b>Version 1.4 Changes</b>\n<ul><li>Added Logging static class to ManagedUPnP namespace, simply use Logging.Enabled = true, and Logging.LogLines += to enable a verbose UPnP log for runtime debugging. This is great for Devices off site which have incorrect Or malformed XML.</li>\n<li>Added Log box to ManagedUPnPTest project</li>\n<li>Added Verbose Log option to ExternalIPAdress project (/V)</li>\n<li>Added extra static functions to Service class code generation to get all services for the type and return array of class objects</li>\n<li>Other minor enhancements (nothing that should break your code).</li></ul>\n<br /><b>Version 1.1 Changes</b>\n<ul><li>Fixed problem with ServiceDescriptionCache where it wasnt using the RootDevice for the caching resulting in issues when using the cache (thanks to tbau from Whirlpool.net.au for his help with testing).</li>\n<li>Other minor enhancements (nothing that should break your code).</li></ul>\n<br /><b>Version 1.0 Changes</b>\n<ul><li>Now out of beta!</li>\n<li>ArgumentsDescription list used to use a dictionary for its items, however, dictionaries are not garunteed to preserve order, the arguments must stay in order so they are accessible in the order that they need to be provided in the action calls, this has now been changed and this dictionary uses a OrderedIndexedDictionary instead.</li>\n<li>Other minor changes (nothinn to break dependent code).</li></ul>\n<br /><b>Version 0.93b Changes</b>\n<ul><li>ManagedUPnP namespace no longer needs the ManagedUPnP.Descriptions namespace to compile, this means you can include ManagedUPnP into your project but exclude the entire Descriptions (and CodeGEn) folder if you dont need it (Code generation still needs the descriptions namespace however). All functions are still provided as extension methods within the Descriptions namespace, so no other code should need to be changed, just your using clause.</li>\n<li>All description related functions have been moved to ManagedUPnP.Descriptions as Extension Methods (so you may need to add using ManagedUPnP.Descriptions to some classes that you have written)</li>\n<li>AutoDiscoveryServices status notifications have changed - COMDeviceNetworkInterfaceGuid and FullRootDeviceDescription have been replaced with DeviceFound - Use ((Device)data).InterfaceGuidAvailable and ((Device)data).InterfaceGuid to get the network interface guid if available, and use ((Device)data).RootDescriptionCache.Cache[ldDevice].ToStringWithFullServices() to get the root description. This is to prevent the description from being loaded unless necessary.</li>\n<li>All description objects now have access to their Parent (Parent proeprty) description object as a polymorphic reference of type Description, a new protected method has been added to the description base class to get a certain generation of parent (see GetParentFrom). All constructors for the descriptions now require a parent to be passed, this can be null if no parent is valid. This change should not require any changes to dependent code unless you have created your own description objects (which should be very rare).</li>\n<li>The ArgumentDescription object now has a new property: RelatedStateVariableDescription, which will get the actual related state variable description object if the state variable information is available.</li>\n<li>The Discovery.FindServicesAsync incorrectly passed false for the resolveNetworkInterfaces parameter, this has been fixed by adding the parameter in and passing it to the FindDevicesAsync function call.</li>\n<li>Demonstration apps updated where applicable for any changes.</li></ul>\n<br /><b>Version 0.92b Changes</b>\n<ul><li>More static functions added to Discovery class to enable Async searching using delegate callback with timeout / number of devices (searching for Devices or Services is provided) see Discovery.FindDevicesAsync and Discovery.FindServicesAsync, of course the Discovery class can still be instantiated to use events.</li>\n<li>Included with this download is the ExternalIPAddress console application, it demonstrates how to use ManagedUPnP to write a console application to show the user their external IP address on a UPnP enabled modem / router.</li></ul>\n<br /><b>Version 0.91b</b>\n<ul><li>Contains the ability to fully generate classes for Devices and Services, whether it be generating them as standalone classes, or generating an entire tree of a device, the demonstration application has been updated as well to provide access to these features from a user interface.</li>\n<li>Minor bug fixes with some devices which have malformed XML descriptions</li>\n<li>Other minor bug fixes in the library and testing application</li>\n<li>More functions added to Devices, and Device for finding devices by Type and / ModelName</li>\n<li>Other enhancements (nothing that should break your code).</li></ul>\n<br /><b>Version 0.9b</b>\n<ul><li>Initial release contains ability to discover services / devices</li>\n<li>Easily get service and device descriptions to determine capabilities (as a structured class set)</li>\n<li>Demo project included to provided user ability to navigate all UPnP devices and execute actions or query state variables</li></ul>\n<br />Please post bugs / suggestions in the discussions area.<br />\n<h1>Windows XP (runtime setup)</h1>\r\nFor windows XP users, you will need to turn on the Windows UPnP device discovery network component, to do this follow these instructions:<br />\n<ul><li>Select Start - Settings - Control Panel</li>\n<li>Network Connections</li>\n<li>In the menus select Advanced - Optional Networking Components...</li>\n<li>Select Networking Services</li>\n<li>Click Details</li>\n<li>Place check mark next to &quot;Internet Gateway Device Discovery and Control Client&quot;</li>\n<li>Click OK</li>\n<li>Click next until complete</li></ul>\n<br /><img src=\"/projects/managedupnp/2bf6423d-75e0-4f70-a007-1be5b2004969\" alt=\"setting.PNG\" title=\"setting.PNG\" /><br />\n<h1>Screenshots</h1>\r\n<img src=\"/projects/managedupnp/22728f81-baac-4ff7-88f4-b1bc8897e9e3\" alt=\"DeviceInfo.PNG\" title=\"DeviceInfo.PNG\" /><br /><br /><img src=\"/projects/managedupnp/3856da79-6357-4777-9521-4e4ab2fb19ac\" alt=\"DeviceCode.PNG\" title=\"DeviceCode.PNG\" /><br /><br /><img src=\"/projects/managedupnp/10158882-1568-40d2-b75b-e33710d41fb8\" alt=\"DeviceRecursiveCode.PNG\" title=\"DeviceRecursiveCode.PNG\" /><br /><br /><img src=\"/projects/managedupnp/ac35ac4a-4e6a-41d7-aafa-71b6ed2321f5\" alt=\"ServiceActionIn.PNG\" title=\"ServiceActionIn.PNG\" /><br /><br /><img src=\"/projects/managedupnp/d4fdc6fc-54dc-435e-a7ca-66ed7157e3a6\" alt=\"ServiceActionOut.PNG\" title=\"ServiceActionOut.PNG\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "UPnP,c#,.NET 4.0,Control Point API,UPNP.DLL,MCEBuddy2x,",
  "LastEdited": "2014-10-04T08:12:41.173-07:00"
}