{
  "ProjectName": "mapsforcrm2011",
  "Title": "Bing Map Browser for Microsoft Dynamics CRM 2011",
  "Description": "Bing map silverlight control to show any number of entities records on bing map. In addition, user can apply filters, see important links and fields in details pane and find near records.\r\n\r\nCompatible with CRM Online and CRM On-Premise.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>Bing Maps Silverlight control for Microsoft Dynamics CRM 2011<br>\r\n<br>\r\nSilverlight Application to show multiple entity records on Bing map. Idea is to show records from any number of entities and provide user some additional capabilities(explained below). Also, the content displayed on the map is configurable.<br>\r\n<br>\r\nSOAP (Organization.svc) endpoint is used in Silverlight control to get the data from CRM. Silverlight Bing map control is used to display records in Silverlight type Web Resource.<br>\r\n<br>\r\nSome nice features of Solution:<br>\r\n<br>\r\n&bull; All the settings, starting from entities to be displayed to the fields and filters applicable is configurable and is defined in xml file.<br>\r\n&bull; Clicking on the pushpin shows the display pane, which contains links, list of fields of the record clicked. Again fields are configurable.<br>\r\n&bull; Find near by records. Click on the map from where you find the nearby records. Then fill the distance (in KMs) and click Load. You will get a list of near by records. To open record, first left click the row and then right click.<br>\r\n&bull; Contains HTML web resource to locate the latitude and longitude on Entity form. You need to provide address fields in the xml file.<br>\r\n<br>\r\n<img src=\"http://download.codeplex.com/download?ProjectName=mapsforcrm2011&DownloadId=233822\" alt=\"screenshot\" width=\"1171\" height=\"342\" style=\"float:left\"></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "crm,CRM 2011,Bing Maps,Map,Microsoft CRM,Microsoft Dynamics,Dynamics CRM,",
  "LastEdited": "2011-04-29T06:25:57.853-07:00"
}