{
  "ProjectName": "MapViewer",
  "Title": "MapViewer: Display Maps from Spatial Data Stored in SQL 2008",
  "Description": "A .NET 3.5  web control that you can include in your project. This control extracts data from SQL 2008 geometry columns and draws a map image on your web page. The source download includes a Sample web page and a sample SQL 2008 database. Works in IE, FF, Opera, Chrome & Safari\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A .NET 3.5  web control that you can include in your project. This control extracts data from SQL 2008 geometry columns and draws a map image on your web page. The source download includes a Sample web page and a sample SQL 2008 database. Works in IE, FF, Opera, Chrome &#38; Safari<br /><br /><br /><b>Important Notice</b><br />This project is no longer supported, and is left as a sample and exercise on what&#39;s possible with just SQL Server geometry queries.<br /><br /><b>Requirements</b>\n<ol><li>SQL Server 2008, any edition including the free Express Edition will work</li>\n<li>Visual Studio 2008. The free &quot;Visual Studio Web Developer Express&quot; works well.</li></ol>\n<br /><b>Getting Your Data into SQL Server</b> \n<ol><li>Install SQL Server 2008. The free express version will work just fine (http://www.microsoft.com/express/sql/download/). Just make sure you download the &quot;With Tools&quot; or &quot;With Advanced Services&quot; version to get the basic version of SSMS. Once you&#39;re set up, create a database for your GIS data</li>\n<li>Load your shapefile and attributes into SQL Server using &quot;Shape2Sql.exe&quot; from SqlSpatialTools (http://www.sharpgis.net/page/SQL-Server-2008-Spatial-Tools.aspx)</li>\n<li>After your data is loaded, fix up the geometry column by running the following update against your table in SSMS:</li></ol>\n        update <i>&lt;tablename&gt;</i> set <i>&lt;geometrycolumnname&gt;</i> = <i>&lt;geometrycolumnname&gt;</i>.MakeValid()<br /><br /><b>Using the MapViewer Control in Your Visual Studio Project</b>\n<ol><li>Download the source code</li>\n<li>Copy the files with names starting with &quot;MapViewer&quot; to your project</li>\n<li>Copy the images directory to your project</li>\n<li>Create a Connection to the database with spatial data in it. (See above for getting spatial data into SQL 2008).</li>\n<li>Look at &quot;Sample.aspx&quot; and &quot;Sample.aspx.cs&quot; for an example of how to set up the MapViewer Control</li></ol>\n<br /><br /><b>Running the Included Sample Project</b>\n<ol><li>Install SQL Server as above.</li>\n<li>In SSMS, right click on &#39;Databases&#39; in the Object Explorer. Select &#39;Restore Database&#39;. Enter &#39;GIS&#39; in the To Database field. Click on From Device, and then the &quot;...&quot; button to the right. Click &#39;Add&#39; and then locate the &quot;GIS.BAK&quot; file from the source code download. Click Ok, and then Ok again to restore the backup.</li>\n<li>Open the project in Visual Studio, and change the connection &quot;GISLocalConnectionString&quot; in web.config to point to your SQL Server 2008 installation and to use credentials with access to the database restored above.</li>\n<li>Run the Sample.ASPX file in the browser/debugger.</li>\n<li>As an example, enter &#39;cuba&#39; in the country name field.</li></ol>\n<br /><br /><b>Troubleshooting</b>\n<ol><li>If you receive a  404 error for your page in ii6 or later and the log entry has 1260 as the sc-win32-status, then you need to allow ASP.NET server extensions in the Web Service Extensions in your IIS manager.</li>\n<li>If you receive a .NET error saying that Microsoft.SQLServer.Types cannot be loaded, then you need to install the Microsoft SQL Server System CLR Types (SQLSysClrTypes.msi) from the Microsoft SQL Server 2008 Feature Pack, October 2008 on the microsoft.com site.</li></ol>\n<br /><br /><b>Acknowledgements</b><br />My thanks to the Spatial Viewer project, <a href=\"http://www.codeplex.com/SpatialViewer\">http://www.codeplex.com/SpatialViewer</a> without which the MapViewer project would not have happened.<br /> </div><div class=\"ClearBoth\"></div>",
  "TagList": "Spatial,C#,SQL 2008,Web,",
  "LastEdited": "2014-02-13T14:26:25.07-08:00"
}