{
  "ProjectName": "mdiwinman",
  "Title": "Tabbed MDI Window Manager",
  "Description": "MDIWindowManager is a control that allows you to create MDI applications using a modern Tabbed Document Interface. The control works on traditional MDI forms and does not require that children be derived from some proprietary base class or implement some special interface or framework. The goal of MDIWindowManager was complete transparency and absolute ease of use all while supporting advanced features such as tiling.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><img src=\"/projects/mdiwinman/533e74aa-253b-4393-98a4-1e2a1787a9fb\" alt=\"mdiwinman_pic1.jpg\" title=\"mdiwinman_pic1.jpg\" /><br /><br />MDIWindowManager is a control that can be added to your MDI Parent forms to achieve the Tabbed Document Interface seen in many modern applications.<br /><br />Not a beta. <br />Very stable at this point and already in use in several in-house business applications.<br />Fully Open Source, not a commercial pre-release.<br /><br />Mature and complete features:<br />\n<ul><li>Completely transparent and non-intrusive. There is no complex &quot;framework&quot; locking you into a particular technology... windows do not need to derive from some base class and no code changes need to be done on either the child windows or in MDI child loading code. </li>\n<li>Built-in support for various window layouts, Tile Vertically, Tile Horizontally, Pop out to desktop... all while keeping the Tabbed Interface aesthetic (no title bar on child windows, no overlapping windows, etc). </li>\n<li>Supports CTRL+TAB forward and reverse window switching. </li>\n<li>Supports advanced 2 and 3-pane views without forcing the user to implement their windows as UserControls. </li>\n<li>Supports minimizing the window manager (in multi-pane scenarios) in a novel way. </li>\n<li>Built-in &quot;Windows&quot; menu that can be cloned and added to your parent form. Furthermore, since MDI Children are still MDI Children under the scenes, there is full support for menu merging. </li>\n<li>Supports several tab styles including the intrinsic Windows/.NET tab control and custom painting of tabs.</li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "winforms,Controls,tabbed midi u razvoj,Windows Forms, Windows Forms,Tabbed MDI Window,Tabbing,MDI,control,Future Use,WinForm,",
  "LastEdited": "2013-05-08T05:55:24.897-07:00"
}