{
  "ProjectName": "MeshDiagram3D",
  "Title": "Mesh Diagram 3D",
  "Description": "A .NET library that allows to visualize mesh diagrams in 3D. This library uses WPF 3D features to display mesh diagrams. It provides simple API and user controls. Sample application that utilize this library is included with the library package.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A .NET library that allows to visualize mesh diagrams in 3D. This library uses WPF 3D features to display mesh diagrams. It provides simple API and user controls. Sample application that utilize this library is included with the library package.<br /><br /><b>NOTE: The project is at very initial stage.</b><br /><br />The main functionality is to give the possibility to present 3D diagrams in .NET (WPF) application easily for different types of networks, for example:\n<ul><li>Computer networks,</li>\n<li>The files and directories structure on disk,</li>\n<li>Information model of database</li>\n<li>OPC Unified Architecture (<a href=\"http://www.opcfoundation.org/ua\">http://www.opcfoundation.org/ua</a>) Information Model.</li>\n<li>Other ....</li></ul>\n<br />The library should provide support for various types of structures. To ensure this, there is going to be implemented mechanism of handling of different data providers. The library will support tree and fully-meshed structures.<br /><br />From the GUI point of view, library provides a graphic panel (as control), that support:\n<ul><li>Presentation of the set of items (objects, links, labels and other information)</li>\n<li>Customizable view (by the user) (like viewing direction, position of the viewer, level of detail and others).</li></ul>\n<br />Long term plans includes:\n<ul><li>Plug-ins support (as data providers of structures or objects displayed)</li>\n<li>Ribbon GUI</li>\n<li>Printer support</li></ul>\n<br /><br />I encourage everyone (especially from Poland) to observe the project and the entries on my blog (<a href=\"http://maciej-progtech.blogspot.com/search/label/MeshDiagram3D\">http://maciej-progtech.blogspot.com/search/label/MeshDiagram3D</a>) (ungfortunattelly most of blog entries are available in polish only).<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-08-24T14:24:18.467-07:00"
}