{
  "ProjectName": "metabuildersweb",
  "Title": "MetaBuilders WebControls",
  "Description": "MetaBuilders WebControls Server Control Library",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />MetaBuilders WebControls Server Control Library<br /><br /><br />By popular demand, the MetaBuilders WebControls have finally been brought up to v2 of the framework. Most of the old controls are included, but some were not needed because of improvements to asp.net itself. To make up for the loss, I&#39;ve added a few more new treats to the mix.<br /><br />Here&#39;s the list of controls available in the current release:<br />\n<ul><li><b>AdSense Ads</b> - Controls to show your Google AdSense ads.</li>\n<li><b>CheckedListBox</b> - A Listbox with checkboxes for selection</li>\n<li><b>ComboBox</b> - The classic type-or-choose control.</li>\n<li><b>DataControlFields</b> - Three fields for the GridView, <b>BooleanField</b> for boolean values (better than the CheckBoxField), <b>LookupField</b> for ID/Key data to a child datasource, and <b>SelectorField</b> for row selection using checkboxes or radiobuttons.</li>\n<li><b>DialogWindow</b> - A set of controls which make creating dialog windows a lot easier</li>\n<li><b>DualList</b> - move items back and forth between two listboxes to select the items</li>\n<li><b>DynamicListBox</b> - a base control which stores changes to its list of items</li>\n<li><b>ExpandingButtons</b> - hide and show a target control</li>\n<li><b>ExpandingPanel</b> - hide and show the content of the panel</li>\n<li><b>FileUpload</b> - A nicer wrapper than the builtin for basic file uploading</li>\n<li><b>GlobalRadioButton</b> - A radiobutton which has a page-wide, cross-namingcontainer Group property</li>\n<li><b>Grouped Lists</b> aka GroupedListBox and GroupedDropDownList enabled support of the html option grouping in extensions of the standard data controls.</li>\n<li><b>ListLink</b> - A non-visual control which helps you create parent/child relationships between list controls</li>\n<li><b>MultiFileUpload</b> is a nice compact UI that lets the user select more than one file to upload to the server.</li>\n<li><b>MultiViewBar</b> is now free and included in the library, source and all.</li>\n<li><b>OneClick</b> - non-visual control that helps the page developer avoid the dreaded double-button-click</li>\n<li><b>Polling</b> - controls and framework for showing users simple web polls. Uses a provider framework, with built-in providers for Access and Sql Server.</li>\n<li><b>ParsingContainer</b> - control which parses a string of server control markup at runtime</li>\n<li><b>QueryCall</b> - Component which maps querystring parameters to methods in the codebehind</li>\n<li><b>RemoteWindow</b> - Easy popup windows</li>\n<li><b>ResizeMonitor</b> - causes a postback on browser-resize, if you need to keep track of dimensions in your app</li>\n<li><b>RollOverLink</b> - the old mouse-over-out effect on images, made dead-easy</li>\n<li><b>RuntimeTemplate</b> - Makes it easier to create templates for controls at runtime in code</li>\n<li><b>UpDown</b> - the classic Windows Up/Down control for numeric entry.</li></ul>\n<br />Visit <a href=\"http://www.metabuilders.com\">MetaBuilders.com</a> to see live examples.<br />Hope you like them. Hopefully I didn&#39;t introduce too many bugs in the upgrade to v2, but you find anything, just let me know.</div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,Controls,ASP.NET 2.0,Server Controls,asp.net controls,webcontrols,Web Controls,Useful,MetaBuilders WebCont,",
  "LastEdited": "2007-09-22T12:41:22.673-07:00"
}