{
  "ProjectName": "midimix",
  "Title": "MidiMix",
  "Description": "MidiMix is small app to play back a MIDI file via a simple mixer.  It visualizes the notes played on a piano keyboard and provides control over the playback speed.\r\n\r\nThe primary purpose of the app is to help choir members learn their parts from a single MIDI file with all parts.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br /><br />MidiMix is an app designed to help choir members learn their parts, given a midi file that has all the parts in it for a given piece.<br /><br />Depending on the level of ability to read music and personal preferences, people have different needs for efficient learning, and a MIDI playing all the parts isn&#39;t necessarily the most helpful thing.   Some folks will want:<br />\n<ul><li>Solo: just their part</li>\n<li>Highlight: their part prominent (louder) with the other parts quieter</li>\n<li>Challenge: just the other parts</li></ul>\n<br />So either people just make do and struggle along with the MIDI file, or some helpful person processes it and creates individual midi files (or MP3s) for each part in some or all of the above configurations.   So take a single piece with 8 choral parts, and that poor person has to create 24 separate midis to distribute.   :(<br /><br />So... MidiMix aims to provide a way for each choir member to load up the single MIDI with all parts, and play it back in ways that are customized to their needs.   Thus there is no need for some helpful person to manually process the MIDI files for each part.<br /><br /><b>Features:</b><br />\n<ul><li>a mixer that lets the sound level of each track to be set separately, as well as allowing each track to be muted or solo&#39;d</li>\n<li>presets built in that allow any of the aforementioned three configurations for any of the parts in the file, to be selected with a single click.</li>\n<li>ability to show each track played on a piano keyboard and the user can select which tracks are shown on the piano.  </li>\n<li>control over the speed of playback (from 1/3 to 3x normal tempo), allowing parts to be played slowly at first to help learning.</li>\n<li>ability to set in and out markers and loop between them to repeatedly play a given section of the file</li>\n<li>midi inspector to allow the midi file contents to be browsed (including tempo changes and any embedded lyrics)</li>\n<li>save a copy of the Midi with the mixer settings applied - enabling a customized version of the file to be played on other devices that don&#39;t have MidiMix installed (e.g. mobile devices)</li></ul>\n<br /><br /><b>Current Release Known Limitations:</b><br />\n<ul><li>In the current version (1.0.0.0) the input MIDI file needs to be structured such that each part is on its own MIDI &quot;track&quot;.   Many MIDI files are structured this way.  Some are not and have all parts in a single MIDI track.  In this case, they may (or may not) have each part going to a separate MIDI &quot;channel&quot;, in which case it would be possible to extract tracks by MIDI channel.     In a later version it is planned to add the ability to extract tracks from a single track MIDI file based on MIDI Channel.   At the moment though the pre-req is a properly structured MIDI file.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-02-02T05:54:54.317-08:00"
}