{
  "ProjectName": "MOSSSiteReports",
  "Title": "SharePoint Site Data Reports",
  "Description": "I have created a user control in SharePoint that will show Site Data based on the URL chosen in a drop down list.  Currently, it dynamically links to the site collection, so that it can populate the drop down list with the Site Name and Url.  So far I have it showing the relative site url, user alerts, permissions, lists/libraries with different permissions and there permissions.  If anyone wants to modify the code feel free.  I am not sure how much time I will be spending on this item.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />I have created a user control in SharePoint that will show Site Data based on the URL chosen in a drop down list.  Currently, it dynamically links to the site collection, so that it can populate the drop down list with the Site Name and Url.  So far I have it showing the relative site url, user alerts, permissions, lists&#47;libraries with different permissions and there permissions.  If anyone wants to modify the code feel free.  I am not sure how much time I will be spending on this item.<br /><br />If you have any comments or questions e-mail me at rebecca.isserman@gmail.com.<br /><br /><b></b><b>Version 2.0</b>***<br />I changed the user control to a TreeView, instead of a table.  It looks a lot cleaner.  I used a bit of grouping.<br /><br />How to Implement this Web User Control:<br />Install the Smart Part: http://www.codeplex.com/smartpart and follow all the instructions.<br />Copy the Web User Control for SiteDataReports.ascx into the usercontrol directory for the site collection that you want to see reports.<br />Add an instance of the SMARTPart Web Part to a page on the top level site and choose the SiteDataReports Web User Control from the Drop Down List. <br /><br />How to User the Web User Control:<br />Choose a Site From the Drop Down List<br />Click on the Site you want to receive a report for and click Submit</div><div class=\"ClearBoth\"></div>",
  "TagList": "SharePoint,SharePoint Tools,SharePoint 2007,MOSS,MOSS 2007 Tools,",
  "LastEdited": "2008-04-10T15:38:45.033-07:00"
}