{
  "ProjectName": "mpcu",
  "Title": "Missing Profile Clean Up",
  "Description": "Missing Profile Clean Up is a sharepoint 2007 solution that allows administrator control over the cleaning of profiles missing from profile imports including profile and personal site deletion, soon to include personal site back up and adminstrator notification emails.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Missing Profile Clean Up</h2>\r\nMissing Profile Clean Up is a Microsoft SharePoint Server 2007 solution that allows administrators to control the clean up of user accounts and their corresponding SharePoint user profiles and personal sites missing from the previous SharePoint Shared Service Provider profile imports.  The solution includes an application page and a link on the Shared Service Provider page under the User Profiles and My Sites section.  Missing Profile Clean Up will only work with SharePoint Server 2007.<br /><br />The default process for deleting missing user profiles in SharePoint Server 2007 is to run a job called &quot;My Site Clean Up&quot; which checks for flagged profiles, grants the users manager site collection admin access on their personal site, and sends an email to the users manager that the site is scheduled for deletion.  If you have Site User Confirmation and Deletion turned on for the web application it will delete the personal site in due time, but if you do not you are stuck with all of these missing profiles that you need to clean up.  <br /><br />The existing process does not allow any control over it at all and this solution is aimed at providing an adequate way for SharePoint administrators to control the clean up process by providing the ability to back up personal sites, grant access to personal sites, email about changes, delete personal sites, and delete profiles that are missing for the profile imports. <br /><br /><b>Screenshots</b><br /><br /><img src=\"/projects/mpcu/c45050d6-7cb9-48ea-a86e-2369ac64dfdf\" alt=\"uap.jpg\" title=\"uap.jpg\" /><br /><br /><img src=\"/projects/mpcu/71c2ee32-a3e4-4f34-9cb4-6fe73626d446\" alt=\"mpcu.jpg\" title=\"mpcu.jpg\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Sharepoint,SharePoint 2007,Sharepoint Tools,sharepoint profile,my site clean up,profile clean up,my site delete,profile delete,",
  "LastEdited": "2009-11-01T20:03:49.863-08:00"
}