{
  "ProjectName": "MPG",
  "Title": "MobilePrettyGUI",
  "Description": "A set of controls for .Net Compact Framework 3.5 which provide a good looking smooth finger friendly UI without a lot of ridiculous complexity found in so many other finger friend controls.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>PROJECT MOVED</h1>\rDue to the impending release of WP7, this API is not really needed anymore.  That said, I&#39;m still using it for my remaining WM6.5 projects.  You can find the latest source and binaries as a part of Avian Play @ <a href=\"http://avianplay.codeplex.com\">http://avianplay.codeplex.com</a>.  This project page is no longer being updated.<br /><br /><b>Project Description</b><br />A set of controls for .Net Compact Framework 3.5 which provide a good looking smooth finger friendly UI without a lot of ridiculous complexity found in so many other finger friend controls.<br /><br /><b>How it works</b><br />MPG provides basically two controls right now: (1) The Sliding Button Strip and (2) The Pretty List.  Both controls provide an interface that represents items in their respective lists of items.  You must implement the interface to represent the items you need in your app and provide user-owned rendering of each individual item (OnPaint is not implemented in a default way for each item).  Everything else is handled by MPG!  See the Avian Play source code for examples of how this is implemented.<br /><br /><b>Sliding Button Strip</b><br />This is similar to the horizontal list of buttons, as seen in HTC&#39;s proprietary TouchFlo(TM) user interfaces.<br /><br /><b>Pretty List</b><br />This is a general purpose ListBox replacement that allows finger friendly manipulation of items.<br /><br />This is being developed in parallel with Avian Play, which is makes heavy use of these controls.  Avian Play: <a href=\"http://avianplay.codeplex.com\">http://avianplay.codeplex.com</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-05-23T10:59:31.567-07:00"
}