{
  "ProjectName": "mscrmautonumbering",
  "Title": "Microsoft Dynamics CRM 4 100% Unique Auto Number Solution",
  "Description": "Features easy to use highly customizable guaranteed unique auto numbering solution for Microsoft Dynamics CRM 4.0, enables users to customize auto number  with in application and can define auto number for any attribute of system (Leads, Opportunity etc..)or custom entity. \r\n\r\n• No manual code changes are required, every functionality is controlled via application administration and provides 100% unique auto number for entity records. The customization automatic makes changes in plugin step registration as per creation or deletion of Auto Number configuraiton .\r\n\r\n• Guaranteed unique auto number solution for custom and system customizable entities, tested with over 100,000 parallel record entries via CRM Performance Toolkit\r\n\r\n• Auto number custom coding is also supported for multiple attributes of same entity with prefix, postfix, padding length and delimitation paramters configuration via administratively user interface\r\n\r\n• No plugin steps registration for auto numbering, Simple guidelines to Install Auto numbering SDK plugin into CRM. On creating auto number sequence system will automatic registers plugin steps for execution.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong></p>\r\n<p>Features easy to use highly customizable guaranteed unique auto numbering solution for Microsoft Dynamics CRM 4.0, enables users to customize auto number with in application and can define auto number for any attribute of system (Leads, Opportunity etc..)or\r\n custom entity. <br>\r\n<br>\r\n&bull; No manual code changes are required, every functionality is controlled via application administration and provides 100% unique auto number for entity records. The customization automatic makes changes in plugin step registration as per creation or deletion\r\n of Auto Number configuraiton .<br>\r\n<br>\r\n&bull; Guaranteed unique auto number solution for custom and system customizable entities, tested with over 100,000 parallel record entries via CRM Performance Toolkit<br>\r\n<br>\r\n&bull; Auto number custom coding is also supported for multiple attributes of same entity with prefix, postfix, padding length and delimitation paramters configuration via administratively user interface<br>\r\n<br>\r\n&bull; No plugin steps registration for auto numbering, Simple guidelines to Install Auto numbering SDK plugin into CRM. On creating auto number sequence system will automatic registers plugin steps for execution.</p>\r\n<p><strong>Documentation URL</strong></p>\r\n<p><a href=\"http://mscrmautonumbering.codeplex.com/releases/view/67260\">http://mscrmautonumbering.codeplex.com/releases/view/67260</a></p>\r\n<p><strong>Microsoft Dynamics CRM 2011 Version:</strong></p>\r\n<p>For Microsoft Dynamics CRM 2011 OnPremise/Online Unquie Auto Numbering Solution refer\r\n<a href=\"http://worldofdynamics.blogspot.com/2011/05/microsoft-dynamics-crm-2011.html\">\r\nhttp://worldofdynamics.blogspot.com/2011/05/microsoft-dynamics-crm-2011.html</a></p>\r\n<p>For more details refer <a href=\"http://worldofdynamics.blogspot.com\">http://worldofdynamics.blogspot.com</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "plug-in,Microsoft CRM,Microsoft CRM 4.0,CRM 4.0,dynamics crm,Auto Number,CRM 4 Auto Number,Microsoft Dynamics,MS CRM 4 Auto Number,Unique Auto Number,Unqiue Auto Number,CRM 4 Plugin,",
  "LastEdited": "2011-05-29T09:35:47.253-07:00"
}