{
  "ProjectName": "mvcstarter",
  "Title": "ASP.NET MVC Starter",
  "Description": "Tekpub's ASP.NET MVC 2.0 Starter Site, as put together by Rob Conery in Episode 15 of Mastering ASP.NET MVC (http://tekpub.com/production/starter)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>The <a href=\"http://tekpub.com\">Tekpub</a> ASP.NET MVC 2.0 Starter Site</h1>\r\n<img src=\"http://tekpub.com/content/titles/aspmvc_slide.png\" /><br /><br />This is the project that Rob Conery built out for Tekpub&#39;s Mastering ASP.NET MVC 2.0  <a href=\"http://tekpub.com/preview/aspmvc\">series with Rob and Steven Sanderson</a>. The idea behind the creation of this site is to get you down the path of success as far as we can push you, with things like:<br />\n<ol><li>IoC setup and ready to go (Ninject 2.0)</li>\n<li>Logging in place (Nlog)</li>\n<li>CodeTemplate overrides for safety by default</li>\n<li>Full data access enabled and ready with implementations for Linq to SQL, MongoDB (using NoRM), and DB4O. You can plug in whatever you like, however, <a href=\"http://tekpub.com/preview/nhibernate\">including NHibernate</a></li>\n<li>Structural CSS in place and ready to go using the popular Blueprint CSS framework</li>\n<li>Error pages created and setup for you</li>\n<li>Redone Authentication system that allows you to use ASP Membership or whatever system floats your boat</li>\n<li>Reporting interface prepared for you and ready to go</li>\n<li>A Task Engine setup (Console app) for running typical developer tasks, such as minifying javascript, emailing users, etc.</li>\n<li>BDD test engine setup for you - SpecFlow</li></ol>\n\n<h1>Need more info?</h1>\rThere&#39;s a full 80 minute screencast that Rob put together - episode 15 of the ASP.NET MVC series - <a href=\"http://tekpub.com/production/starter\">that we&#39;re giving away for free to you</a>. Of course we&#39;d love it if you would watch the rest of the series, but this should show you how we built the site and why, and hopefully show you enough so you can pick up and run with it.</div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,ASP.NET MVC,Starter Kit,NoSQL,Inversion of Control,dependency injection,db4o,MongoDB,LINQ,LINQ TO SQL,OpenID,NLog,",
  "LastEdited": "2010-04-20T14:14:51.577-07:00"
}