{
  "ProjectName": "myinventory",
  "Title": "MyInventory",
  "Description": "MyInventory is an Inventory Management System (IMS), also known as Inventory Control System (ICS), fully developed in ASP.NET. *Currently under development*.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br /><br />MyInventory is an Inventory Management System &#40;IMS&#41;, also known as Inventory Control System &#40;ICS&#41;, fully developed in ASP.NET. &#42;Currently under development&#42;.<br />\n<hr />\n<img src=\"/projects/myinventory/dd647eb9-f924-44fd-9a12-aff298a3a459\" alt=\"MyInventory.jpg\" title=\"MyInventory.jpg\" /><br /><br />Developed in Visual Studio Professional 2010 as an ASP.NET application, compatible with all NetFramework 4.0 releases.  MyInventory source code and updates will be available here. <br /><br />Please read the Documentation at <a href=\"http://myinventory.codeplex.com/documentation\">http://myinventory.codeplex.com/documentation</a> for instructions on how to install this application in your Web server.<br /><br />MyInventory keeps track of any type of inventory, for personal or commercial use.  It provides you with all the necesary toolds to create, manage and maintain any type of inventory. Both, perishable and non-perisable items are allowed.<br /><br />MyInventory is a fully featured CBI&amp;D  (&quot;constantly being improved and developed&quot;) Inventory Management System (IMS). Once properly installed on an IIS Web server, MyInventory can be operated by any experienced computer user. Non-experienced users will requiere some basic training to understand the complexity of this application.<br /><br />All features available in this application use standard components provided as COM/DCOM components packaged and shipped with Microsoft Visual Studio Professional 2010. <br /><br />Only experienced Wedmasters can Install and use this application. If you do not know how to install and run ASP.NET applications than this prodcut is not a product for you. Please request the advice of an experienced ASP.NET programmer or a Webmaster to install and use MyInventory.<br /><br />The background database uses a MS-SQL Server 2008 and it can be adapted to use any other database server like: MS-SQL-2013, MS-SQL-2005, MS-SQL-2000, or any version of the MSDE and MSSQLExpress editions.<br /><br /><b>Project currently under development</b><br /><br />MyInventory is not ready for deployment on a real environment but it is here for evaluation purposes only, to see how is being designed and developed.  It is a practical tool for new programmers to learn how to program in ASP.NET.   I do not recommend using it on a real situation at this time but to evaluate it&#39;s functionality only, to make sure you and us have the same perspective on the overall goals of this project, and to get prepared for the final release sometime in the near future.<br /><br />Certainly, this application is not anywhere near being a finished product.   It is available here for development, testing and evaluation purposes only, it is not intended for the end-users but only for end-user&#39;s feedback &quot;prior to the final release only&quot;.   By &quot;end-users&quot; we mean: Webmasters and  ASP.NET programmers only.  Both experienced and non-experienced are welcome.<br /><br />To help us during the final release of this product, and/or to help us enhance and improve this application during develpment time, please install and evaluate this application at your free will.  (Please read the usage License for more information). <br /><br />Installation should take about 10 minutes only, so please install it, evaluate it, and suggest any changes as appropiate, so we can have a better finished product in the near future.<br /><br /><b>Use My Inventory from anywhere in the world</b><br /><br />As a web based application, MyInventory allows you, your employees, your suppliers and/or colaborators, and &quot;even your customers&quot;, to easily access and interact with your inventory database from anywehere in the world.<br /><br />Bar code readers, RFID scanners, palm held devices and wireless PDA mobile devices can easily be adapted to interact with this application from anywhere in the world. Please contact us by phone or email on how to make it possible for you and your business to take full advantage of this information system.<br /><br />If at least one &quot;payment gateway&quot; is declared in your control panel, your customers can order and pay electronically for the goods and services you offer using this system.<br /><br />If you would like to see any special feature added to this application, just write me a note using our technical support system here in this Web site, or send me an email at: <b><a href=\"mailto:peterjaramillo@hotmail.com\">peterjaramillo@hotmail.com</a></b> <br />\n<hr />\n<br />Don&#39;t forget to click on <b>Follow</b> to be automatically notified everytime there is a new release.<br />\n<hr />\n<br />Additional information on starting a new project is available here: <a href=\"http://codeplex.codeplex.com/wikipage?title=Start%20a%20Project\">Project Startup Guide</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "inventory,asp.net,source code,myinventory,daprose,Inventory Management,check-in,check-out,asset tracking,",
  "LastEdited": "2013-03-24T23:05:17.657-07:00"
}