{
  "ProjectName": "neoforce",
  "Title": "Neoforce Controls",
  "Description": "Neoforce Controls library provides WinForms like UI for your XNA project.",
  "MovedLink": "",
  "HomeWiki": "\r\n<div class=\"wikidoc\"><strong>Skinnable GUI library for XNA 4</strong><br>\r\nNeoforce Controls library provides WinForms like UI for your XNA project.</div>\r\n<p>&nbsp;</p>\r\n<p><a href=\"http://tomshane.cz/images/neoforce/preview.jpg\"><img src=\"http://tomshane.cz/images/neoforce/preview_.jpg\" alt=\"\"></a></p>\r\n<p>&nbsp;</p>\r\n<p><strong>23/05/2013</strong></p>\r\n<p>Source code is now maintained at <a title=\"Neoforce Controls GitHub Url: https://github.com/NeoforceControls\" href=\"https://github.com/NeoforceControls\">\r\nGitHub.</a></p>\r\n<p><strong>6/04/2013 New Life!</strong></p>\r\n<p>The Neoforce Project will, continue on. A new change set is now available. Along with a new binary release, including most of the bug fixes submitted to the issue tracker.<strong>&nbsp;</strong></p>\r\n<p>New skins are also available, with the binary release, and the source.</p>\r\n<p>3.1 Will still be available for historical purposes.</p>\r\n<p>If you have any questions or issues with the new release, either make a discussion about the issue, or a new item in the issue tracker.</p>\r\n<p><strong>Old notes to the project:</strong></p>\r\n<div>- this project is no longer maintained or developed</div>\r\n<div>- full source code for XNA 4 version is available to you</div>\r\n<div>- there is also last XNA 3.1 release, however source code is not available</div>\r\n<div>- XNA 4 release works for x86 -- to make it work for Xbox 360 you have to update some code</div>\r\n<div>- the main problem is XmlDocument is no longer available for Xbox 360 runtime, you can replace it with XDocument</div>\r\n<div>- System.IO.Compression class is also not available so you have to replace the code or get rid of it altogether</div>\r\n<div>- when you manage to update these parts you should be ready to go for Xbox 360 platform</div>\r\n<div>- x86 version works well for the my testing project, but it doesn't cover every way how you can use the library, so some problems may arise in your project</div>\r\n<p>&nbsp;</p>\r\n<div>- facts about the source code:</div>\r\n<div>\r\n<ol>\r\n<li>you won't find many comments there </li><li>some parts left there as I were prototyping a new functionality, so it might not be optimized\r\n</li><li>some things could be solved more effectively or in another way </li><li>to sum it up - it is not perfect by any means </li><li>I most likely won't be able to provide much of a support for this project anymore, however you can always try and ask -- it costs nothing afterall\r\n</li></ol>\r\n</div>\r\n",
  "TagList": "XNA,neoforce,",
  "LastEdited": "2014-03-19T04:56:05.213-07:00"
}