{
  "ProjectName": "neonmikawebserver",
  "Title": "NeonMika.Webserver",
  "Description": "NeonMika.Webserver is easy to set up and easy to extend. With minimal code you can achieve great results controlling and accessing your Netduino+.\r\n\r\nIt is easy to run this on your .Net MF device, as long as it has an ethernet port. It's espacially created for the Netduino, but I think it's no big work to port it to other plattforms.\r\n\r\nIt provides the following functionalities:\r\n\r\n-XML Responses ... Just create an Instance of XMLResponse, give it an URI to listen for and fill a Hashtable with your response keys and values... Voila ;)\r\n \r\n-File Response ... No XML Response fitting your URL? Probably you want to watch a file saved on your device? No problem. This webserver will be able to work as a standard webserver just serving .html files, but you also could save Pictures, Music or ... everthing ... on SD and host it via NeonMikaWebserver.\r\n\r\n-Complex Response ... Don't want to send a saved file or XML? Probably you want to return dynamicly created ressources? Then just use a Complex Response. Implement your return logic, still using the functionalities of an Basic Response. :)\r\n\r\nSo this is a \"very easy to expand\" webserver. Create your webserver with ONE line of code. And just watch it work ;)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>NeonMika.Webserver @ http://neonmikawebserver.codeplex.com/</strong><br>\r\n<br>\r\n<strong>Introducing</strong><br>\r\n<br>\r\nHey guys,<br>\r\n<br>\r\nNeonMika.Webserver is an pre-setup and easy to extend webserver. With minimal (to no) code you can achieve great results controlling your Netduino&#43;, accessing and uploading files, create&nbsp;WebServices&nbsp;and more!</p>\r\n<p>It's supports:</p>\r\n<ul>\r\n<li>SD card access </li><li>Controlling your Netduino using existing methods like setPWM or setDigitalPinState\r\n</li><li>Adding your own webservice-like methods so you can expand NeonMika.Webserver to your own needs for every project.\r\n</li><li>Add more </li></ul>\r\n<p>Go to the Documentation page to find everything that gets you started with NeonMika.Webserver.</p>\r\n<p>Have a look at the NeonMika.Webserver thread in the Netduion forum: <a title=\"the Netduino forum thread.\" href=\"http://forums.netduino.com/index.php?/topic/2889-neonmikawebserver/\" target=\"_blank\">\r\nhttp://forums.netduino.com/index.php?/topic/2889-neonmikawebserver/</a> if you have any further question or want to discuss about the code.</p>\r\n<p>Greets, Markus</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Netduino,",
  "LastEdited": "2013-04-03T13:33:59.06-07:00"
}