{
  "ProjectName": "net7ntcip",
  "Title": "National Transportation Information Control Protocol Suite",
  "Description": "A Standards Compliant Extensible NTCIP Software Solution. It is utilized in all federally funded projects in the world over.\r\n\r\nIt contains utilities for encoding and decoding (transcoding) various data such as HDLC, PMPP, SNMP (BER, PER Etc.)\r\n\r\nThere are also some proprietary features.\r\n\r\nThis software was developed in my Free Time because the software in use by my organization was severely lacking and always required some type of major change for the smallest thing. \r\n\r\nAfter implementation and utilization of this software package our organization seemed to be able to accomplish just about anything we required in a minimal amount of time.\r\n\r\nJr. Developers at my organization are currently in the process of re-writing the entire library to understand it and make possible improvements where they see fit.\r\n\r\nI also imagine a Messenger or Transporter interface which will make Socket Communication more fun and less obnoxious.... You will have to keep checking back because there are even some interesting Math and Physics Gems {IMHO} at use in the library.\r\n\r\nOne of the best (again IMHO) is the QDTS.\r\n\r\nQuantum Distance and Time System\r\n\r\nIt allows you to input things such as a latitude or longitude and utilize the extra spacial meta information such as Bearing and Altitude to find objects which correlate to the path which is of highest interest between two given points.\r\n\r\nI am also sure that some may find the software not so impressive and is my main motivation for contributing to CodePlex.\r\n\r\nHopefully together we can foster and create a wonderful library in which all who require it can utilize it under a safe and free license in which the onus is truly on the developer and network administrators of the world to research, utilize and implement correctly.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Update</b><br />This project is alive and kicking, there are several updates pending release from this library which will be propagated to the source control as soon as they are replaced in the production version of this project. We have just been enjoying the beginning of summer...<br /><br /><b>Project Description</b><br /><br />An implementation of the NTCIP software protocol. It is utilized the world over.<br /><br />There are implementations for the various NTCIP standards such as but not limited to:<br />Traffic Cameras (1209)<br />Highway Sensors (1205)<br />Dynamic Messages Signs (1203)<br /><br />Once the library is understood the developer can also communicate with Traffic Lights, Lighting and even devices which are not part of a global standard.<br /><br />There are implementation of various other IEEE Protocol support such as PMPP, SNMP, and some proprietary features as well.<br /><br />The NTCIP Standards can be found at The NTCIP Website @ <a href=\"http://ntcip.org/\">http://ntcip.org/</a><br /><br />The TMDD Standards can be found at The <a href=\"https://net7ntcip.codeplex.com/wikipage?title=ITE%20%28Means%20Institute%20of%20Transport%20Engineers%29&referringTitle=Home\">ITE &#40;Means Institute of Transport Engineers&#41;</a> Website @ <a href=\"http://www.ite.org/standards/tmdd/\">http://www.ite.org/standards/tmdd/</a><br /><br />RFC1213 Can be found at the  <a href=\"https://net7ntcip.codeplex.com/wikipage?title=IETF%20%28Means%20Internet%20Engineering%20Task%20Force%29&referringTitle=Home\">IETF &#40;Means Internet Engineering Task Force&#41;</a> Website : <a href=\"http://www.ietf.org/rfc/rfc1213.txt\">http://www.ietf.org/rfc/rfc1213.txt</a> and is highly referenced by the NTCIP Standards.<br /><br />There are various other proprietary manufacture protocols and the like however every device which is federally funded by the U.S. Government in the whole wide world over utilizes these specific protocols and communication processes. (Either via adapting, translation, relaying or virtualization of the subject data and performing analyzation therein, sometimes a response is required which can either be formulated by the software or manually through the processes mentioned previously inter alia).<br /><br />The goal of this project in short is to provide a suite of heterogeneous communication libraries so that individual developers do not need to be overwhelmed by the large amount of information contained within these standards (or lack thereof).<br /><br />These libraries were developed solely by myself with the influence of various other libraries I saw and tested to determine what the best design pattern would be.<br /><br />Issues go in the issue tracker and from there they get solved for the better of the world! (Same with bugs and feature requests inter alia et al)<br /><br /><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><br /><br />Project Summary<br /><br />A Standards Compliant Extensible NTCIP Software Solution. It is utilized in all federally funded projects in the world over.<br /><br />It contains utilities for encoding and decoding various data formats such as HDLC, PMPP, SNMP (BER, PER Etc.)<br /><br />There are also some proprietary features.<br /><br />This software was developed in my Free Time because the software in use by my organization was severely lacking and always required some type of major change for the smallest thing. <br /><br />After implementation and utilization of this software package our organization seemed to be able to accomplish just about anything we required in a minimal amount of time.<br /><br />Jr. Developers at my organization are currently in the process of re-writing the entire library to understand it and make possible improvements where they see fit.<br /><br />I also imagine a Messenger or Transporter interface which will make Socket Communication more fun and less obnoxious.... You will have to keep checking back because there are even some interesting Math and Physics Gems {IMHO} at use in the library.<br /><br />One of the best (again IMHO) is the QDTS.<br /><br />Quantum Distance and Time System<br /><br />It allows you to input things such as a latitude or longitude and utilize the extra spacial meta information such as Bearing and Altitude to find objects which correlate to the path which is of highest interest between two given points.<br /><br />I am also sure that some may find the software not so impressive and is my main motivation for contributing to CodePlex.<br /><br />Hopefully together we can foster and create a wonderful library in which all who require it can utilize it under a safe and free license in which the onus is truly on the developer and network administrators of the world to research, utilize and implement correctly.</div><div class=\"ClearBoth\"></div>",
  "TagList": "NTCIP,C#,SNMP,BER,TMDD,Wavetronix,PSC,Manager,Messenger,EIS,Transportation,",
  "LastEdited": "2012-06-25T06:31:47.6-07:00"
}