{
  "ProjectName": "netadvantagemvc",
  "Title": "Infragistics NetAdvantage ASP.NET for ASP.NET MVC",
  "Description": "Support controls and sample site for using the Infragistics NetAdvantage ASP.NET controls in ASP.NET MVC applications.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>In this Application</h1>\rThis application is built using NetAdvantage for Web Client 2010 Vol. 2 <a href=\"http://www.infragistics.com/dotnet/netadvantage/aspnet.aspx\">http://www.infragistics.com/dotnet/netadvantage/aspnet.aspx</a> and ASP.NET MVC 1 <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=53289097-73ce-43bf-b6a6-35e00103cb4b&amp;displaylang=en\">http://www.microsoft.com/downloads/details.aspx?FamilyID=53289097-73ce-43bf-b6a6-35e00103cb4b&amp;displaylang=en</a>. The controls in this application are un-modified versions of the existing NetAdvantage ASP.NET product. This sample application demonstrates how to take advantage of many of the features of the existing toolset in an MVC application.<br /><br /><b>Note: The key is to only use the features of the controls that do not cause a postback and turn off ViewState ;)</b><br /><br />The Issue Tracker models a typical line-of-business web application where rich server controls help boost the user’s experience of an application. A number of the Infragistics NetAdvantage Web Client controls are used in this sample. The following is a list of the controls and associated behaviors implemented in this demo:<br />\n<ul><li>WebDataGrid\n<ul><li>Column Resizing</li>\n<li>Activation</li>\n<li>Row Selectors</li>\n<li>Selection</li>\n<li>Paging (custom template)</li></ul></li>\n<li>WebDropDown\n<ul><li>Custom Template</li></ul></li>\n<li>WebHTMLEditor\n<ul><li>Custom editor options</li></ul></li>\n<li>WebSlider\n<ul><li>Custom value constraints</li></ul></li>\n<li>WebChart\n<ul><li>Chart Presets</li></ul></li></ul>\n\n<h2>Infragistics MVC ScriptManager</h2>\rTo support the controls outside the context of WebForms, the view pages use a new control called the Infragistics MVC ScriptManager. This control decouples the traditional server controls from requiring a server-form and the ASP.NET AJAX ScriptManager.<br /><br />The control interrogates each Infragistics UI control for the required JavaScript files and commands rendering the appropriate markup to the page.<br /><br />You may download the assembly for the this control by itself here <a href=\"http://netadvantagemvc.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=28616\">http://netadvantagemvc.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=28616</a><br />\n<h2>What About Your Other Controls?</h2>\rThis site is built as a demonstration of how the Infragistics NetAdvantage ASP.NET controls may be used in the context of an ASP.NET MVC web project. While only a few of the controls from the library are used in this sample, many of the web client controls may be used in a MVC project using the approach demonstrated in this application.<br />\n<h2>What if I have Questions?</h2>\rPlease note that this application represents guidance for use of NetAdvantage Web Client in a ASP.NET MVC application. There is no official support through the Infragistics Developer Support for the toolset in MVC.<br /><br />We do, however, have a new support forum available for your questions surrounding NetAdvantage for ASP.NET in ASP.NET MVC <a href=\"http://blogs.infragistics.com/forums/369.aspx\">http://blogs.infragistics.com/forums/369.aspx</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "MVC,ASP.NET,",
  "LastEdited": "2010-07-13T14:50:18.493-07:00"
}