{
  "ProjectName": "nmctl",
  "Title": "VB and C# Scrolling/Scaling OwnerDraw Control Templates",
  "Description": "VB and C# Scrolling/Scaling OwnerDraw Control Templates.  Implements a cleaner scrolling paradigm and demonstrates identical code in both VB and C#.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>VB and C# Scrolling/Scaling OwnerDraw Control Templates</b><br /><br />This is a template for using the .NET scrolling feature and getting it to behave the way you&#39;d expect a scrolling user-drawn control to behave.<br /><br />The templates are <b>identical</b> implementations in both VB .NET and C#.<br /><br />They&#39;re not bad for what the .NET framework can do.  This implements a sort of &quot;triple&quot; buffering scheme.  Of course, there really is no replacement for C++/Win32 owner-drawn controls as far as responsiveness is concerned, but I&#39;ve implemented very substantial and complex controls with the templates I&#39;ve created, here.<br /><br />Some of the implementation may seem redundant to the built-in .NET platform functionality, but it is clearly not.  For one thing, it takes care of futzing around with all of the built-in auto-scrolling functionality and replaces it with something that is a bit easier to work with vis a vis dealing with a virtual canvas of a size greater than the ClientRectangle of the control.<br /><br />In the example project form, the C# control is placed on the left, and the VB control is placed on the right. <br /><br />C# is ever more popular than VB .NET is, nowadays, so I decided I would put both examples on here.<br /><br />Even though my stronger suit has always been VB, by far, I am taking cues from the software community that people are going the way of C# in waves and droves.  I translated my control template from VB to C# to give myself a crash course in navigating the differences. <br /><br />Hopefully, if you&#39;re learning to navigate one language from the other, you can look at these identical implementations as a guide to compare and contrast what has been done.<br /><br />Enjoy!  <br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,C#,VB,Template,control,usercontrol,Scrolling,scaling,user drawn,owner drawn,component,example,OnPaint,",
  "LastEdited": "2013-12-02T07:12:26.35-08:00"
}