{
  "ProjectName": "nucleo",
  "Title": "Nucleo.NET",
  "Description": "This project is a utility project, and has many base classes that make it easier to develop software.  It also contains providers/controls that are useful to users, and uses unit testing as much as possible.\r\n\r\nIt leverages code in the windows and web environments, primarily meant to be a shortcut/reuse way for me to build my projects.  It also sets up base classes that make it easier and less redundant to develop your own classes, such as custom control, data control fields (gridview/detailsview), configuration collections, etc.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>GitHub Release</b><br />Because CodePlex is shutting down, I pushed everything up to GitHub at the following location: <a href=\"https://github.com/brianmains/Nucleo.NET\">https://github.com/brianmains/Nucleo.NET</a><br /><br />The GitHub site has the following folders which contains the following:<br /><br />Binary Distributables<br />- Last important Zip Archives of DLL&#39;s originally available on Nucleo.NET<br />- Documentation - included documentation on some components; copied over as is, but is currently complete. More documentation is available on a OneDrive public folder: <a href=\"https://onedrive.live.com/?id=7AD307E4C39E56BD%21185&amp;cid=7AD307E4C39E56BD\">https://onedrive.live.com/?id=7AD307E4C39E56BD%21185&amp;cid=7AD307E4C39E56BD</a><br />- Sandcastle - generated CHM file<br />- MVP_SRC - MVP framework source code<br />- SRC - Original SRC code before attempting 1.0 rewrite<br />- SRC_WIP - Was trying to convert everything over to a more normalized structure, but was a WIP<br /><br />Please refer to this site for the future.<br /><br /><b>Project Description</b><br />This project is a consortium of code that I have put together from my various projects, which has made all of my development purposes easier.  Lately, the releases that I am deploying are AJAX-enabled controls using the MS AJAX framework (I hope to eventually get a framework up and running that uses JQuery).  I have also created several classes for other reasons, whether purposeful or experimental, that may benefit someone else.  Right now, I have a lot of unit testing/documentation to do.</div><div class=\"ClearBoth\"></div>",
  "TagList": "API,ASP.NET Controls,",
  "LastEdited": "2017-06-26T10:16:37.8-07:00"
}