{
  "ProjectName": "nxtcodecollection",
  "Title": "NXT Tri-Bot collection using C# Express and MindSqualls Library",
  "Description": "This code was made over a period of time using C# Express 2005 and 2008. All of the code ran on XP Home and XP Professional.\nI am now using Vista Ultimate. All programs seem to run the same on Vista except for some of the Web Cam code and a directory issue which I have chanced to run under Vista.\n\nSorry, but the form layout is for 1204 X 768. I have no idea if the forms would be useable at lower resoultions. \n\nI am NOT a professional programmer. I only code to keep my old brain active. Self taught so many, many things may be wrong or you feel stupid. But... I had fun!\n\nThis code is NOT a library or something to program a NXT Tri-Bot to do a specific task. It is just a collection of projects I did to experiment with a LEGO Mindstorms Tri-Bot (I suppose some sort of trademark should be here) using the MindSqualls Library. I have tried to give visual feedback on what the motors and sensors are doing through User Controls and ALOT of labels showing current states of different parameters.\n\nREAD THIS PLEASE! \nI have changed the MindSqualls Library in several places. Not for any reason other than what I wanted to do. I have placed a text file stating what I have changed. There are NO hidden changes in the Library (unless I forgot to put it in the text file). I state this so you know up-front... \n\nYOU ARE NOT USING Niels K. Handest original code! \nIf you do not like this, please do NOT download or try to run my code.\n\nIt has been modified slightly.\nhttp://www.mindsqualls.net/Introduction.aspx\n\nI hope somebody finds it useful for something. If not.. OK also...\n\nA NOTE: \nThere is one project named WiiNXT that contains ALOT of the code within the test project provided with the Managed Library for Nintendo's Wiimote v1.5.2.0 by Brian Peek (http://www.brianpeek.com/)\n\nI assume this is OK. Not a Lawyer.. He uses the Microsoft Public License (Ms-PL). If I am wrong, I'm sure somebody will inlighten me!\n\nNot a gripe.. But my Vista sure fights that WiiMote.\n\n\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">This code was made over a period of time using C# Express 2005 and 2008. All of the code ran on XP Home and XP Professional. I am now using Vista Ultimate. All programs seem to run the same on Vista except for some of the Web Cam code and a directory issue which I have chanced to run under Vista. Sorry, but the form layout is for 1204 X 768. I have no idea if the forms would be useable at lower resoultions. <br /><br />I am NOT a professional programmer. I only code to keep my old brain active. Self taught so many, many things may be wrong or you feel stupid. But... I had fun!<br /><br />This code is NOT a library or something to program a NXT Tri-Bot to do a specific task. It is just a collection of projects I did to experiment with a LEGO Mindstorms Tri-Bot (some sort of trademark should be here) using the MindSqualls Library. I have tried to give visual feedback on what the motors and sensors are doing through User Controls and ALOT of labels showing current states of different parameters.<br /><br />READ THIS PLEASE! <br />I have changed the MindSqualls Library in several places. Not for any reason other than what I wanted to do. I have placed a text file stating what I have changed. There are NO hidden changes in the Library (unless I forgot to put it in the text file). I state this so you know up-front... Nothing to harm you or your computer!<br /><br />YOU ARE NOT USING...  Niels K. Handest original code! <br />If you do not like this, please do NOT download or try to run my code.<br /><br />It has been modified slightly.<br />http://www.mindsqualls.net/Introduction.aspx<br /><br />I hope somebody finds it useful for something. If not.. OK also...<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Hobby,Lego,",
  "LastEdited": "2008-08-11T12:15:38.963-07:00"
}