{
  "ProjectName": "NxtNet",
  "Title": "NXT.NET for LEGO Mindstorms",
  "Description": "NXT.NET is a .NET library written in C# 3.0 that enables host applications to control the LEGO Mindstorms NXT from managed code via Bluetooth connection. NXT.NET contains a desktop and a mobile library and sample desktop Windows Forms and Windows Mobile Pocket PC applications.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />NXT.NET is a .NET library written in C&#35; 3.0 that enables host applications to control the LEGO Mindstorms NXT from managed code via Bluetooth connection. NXT.NET contains a desktop and a mobile library and sample desktop Windows Forms and Windows Mobile Pocket PC applications.<br /><br />The download contains code snippets from the mobile and the desktop remote application to demonstrate how to use the library and help you getting started writing applications with NXT.NET. The <b>source code is also published</b> as a separate download (May 26 2010).<br /><br />NXT.NET is created by the <b>Hungarian MSDN Competence Center</b> (and not by the LEGO Group). Please visit our homepage at <a href=\"http://www.msdnkk.hu\">http://www.msdnkk.hu</a> or send us direct feedback to <u>msdnkk at aut dot bme dot hu</u>. Thank you.<br /><br /><b>Gy&#246;rgy Bal&#225;ssy</b><br /><i>Microsoft Regional Director, Hungary, ASP.NET MVP</i><br /><i>MSDN Competence Center</i><br />\n<h2>Components</h2>\rNXT.NET contains the following components:\n<ul><li><b>NxtNet.DesktopLib</b> and <b>NxtNet.MobileLib</b> are two class libraries with the same feature set compiled as a desktop and as a mobile component. The library enables the host application to control a LEGO Mindstorms NXT robot via a Bluetooth connection. See the <a href=\"https://nxtnet.codeplex.com/wikipage?title=Library%20Help%20Screenshots&referringTitle=Home\">Library Help Screenshots</a> here.</li>\n<li><b>NxtNet.DesktopApp</b> is a .NET Windows Forms desktop application that is built using the NxtNet.DesktopLib component and enables the user to test the library features and remotely control a LEGO Mindstorms NXT robot from a PC. See the <a href=\"https://nxtnet.codeplex.com/wikipage?title=Desktop%20Screenshots&referringTitle=Home\">Desktop Screenshots</a> here.</li>\n<li><b>NxtNet.MobileApp</b> is a .NET Compact Framework mobile application that is built using the NxtNet.MobileLib component and enables the user to test the library features and remotely control a LEGO Mindstorms NXT robot from a Windows Mobile 5.0 Pocket PC. See the <a href=\"https://nxtnet.codeplex.com/wikipage?title=Mobile%20Screenshots&referringTitle=Home\">Mobile Screenshots</a> here.</li></ul>\n\n<h2>Current project status</h2>\rThe library currently enables the host to connect to the NXT, query general parameters (brick name, version, Bluetooth address, free flash memory, battery level, keep alive time), initialize sensors and query sensor values. These features are already available in the desktop application and partly in the mobile application. The library is <u>fully documented</u> in the C# source code with XML comments in English.<br /><br />Major part of motor control is also implemented but not fully tested yet. Querying sensor states is not tested from the mobile client and not available in the mobile application. Direct Bluetooth communication is also implemented but not fully tested yet.<br />\n<h2>Technical background</h2>\rNXT.NET is written in C# 3.0 and compiled with Visual Studio 2008 to the .NET 3.5 platform. The single source code of the library is compiled as a desktop library to .NET Framework 3.5 and also as a mobile library to .NET Compact Framework 3.5. The sample desktop application is a Windows Forms application and the sample mobile application is a Smart Device Application optimized to Windows Mobile 5.0 Pocket PC.<br /><br />The HTML help documentation (CHM) is compiled with NDoc 1.3 and the Microsoft HTML Help Workshop using the extensive XML documentation in the C# source code.<br /><br />NXT.NET uses the .NET Framework&#39;s <b>SerialPort</b> class to communicate with the NXT brick via a Bluetooth connection that is simulated as a COM port on the PC or the Pocket PC. The remote control is implemented with the direct commands of the NXT.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Lego,mobile,NXT,Mindstorms,Library,PocketPC,bluetooth,remote control,C#,Framework,Windows Forms,windows mobile,winforms,.NET 3.5,Compact Framework,",
  "LastEdited": "2010-05-25T22:29:59.77-07:00"
}