{
  "ProjectName": "ofxaggregator",
  "Title": "Active Statement Generator (moved to activestatement project)",
  "Description": "!!!! Unfortunately, I must have made something really bad to the Team Foundation Server project, because I started having problems with semi-disappearing files on the server. I chose to move the files to the activestatement project !!!!\n\nI'm using this project both to handle a chore I have, as well as to learn a few technologies and methodologies I haven't had the chance to at work yet.\n\nOFX stands for Open Financial Exchange, and is a standard used by Microsoft Money and Intuit Quicken to download statements from financial institutions. This project aims to bridge the gap between FI which don't yet provide OFX files (also known as Active Statements) and those personal finance packages. It is fully extensible and relies on the following components:\n\n- a Statement Retriever (Clipboard is currently implemented in release 0.1);\n- a Statement Interpreter (currently Via Verde and BESnet credit card statements are supported);\n- a Statement Serializer (where the Statement is serialized to XML);\n- a Statement OFX Converter (where the XML is converted to OFX);\n- a Statement Action (where the OFX is opened in the finance package).\n\nAny of these areas is open for extension, through the use of a Inversion of Control Container, in this case, Castle Windsor. I also make use of LINQ to Objects and LINQ to XML and Regular Expressions. Release 0.2 introduces support for automatic scraping of the FI website for information without user intervention (BESnet only for now).",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />&#33;&#33;&#33;&#33; Unfortunately, I must have made something really bad to the Team Foundation Server project, because I started having problems with semi-disappearing files on the server. I chose to move the files to the activestatement project &#33;&#33;&#33;&#33;<br /><br />I&#39;m using this project both to handle a chore I have, as well as to learn a few technologies and methodologies I haven&#39;t had the chance to at work yet.<br /><br />OFX stands for Open Financial Exchange, and is a standard used by Microsoft Money and Intuit Quicken to download statements from financial institutions. This project aims to bridge the gap between FI which don&#39;t yet provide OFX files &#40;also known as Active Statements&#41; and those personal finance packages. It is fully extensible and relies on the following components&#58;<br /><br />- a Statement Retriever &#40;Clipboard is currently implemented in release 0.1&#41;&#59;<br />- a Statement Interpreter &#40;currently Via Verde and BESnet credit card statements are supported&#41;&#59;<br />- a Statement Serializer &#40;where the Statement is serialized to XML&#41;&#59;<br />- a Statement OFX Converter &#40;where the XML is converted to OFX&#41;&#59;<br />- a Statement Action &#40;where the OFX is opened in the finance package&#41;.<br /><br />Any of these areas is open for extension, through the use of a Inversion of Control Container, in this case, Castle Windsor. I also make use of LINQ to Objects and LINQ to XML and Regular Expressions. Release 0.2 introduces support for automatic scraping of the FI website for information without user intervention &#40;BESnet only for now&#41;.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "OFX,IoC,Microsoft Money,LINQ,Regex,XSLT,Active Statements,scraping,",
  "LastEdited": "2008-08-09T14:19:55.777-07:00"
}