{
  "ProjectName": "onvifipcameraviewer",
  "Title": "Onvif-IP-Camera-Viewer",
  "Description": "This is a C# camera viewer software (device manager) that can be used to control your IP surveillance system by providing advaned USB webcam/IP camera features.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>What is Onvif IP Camera Viewer (C#)</h1>\r\nThis is an Onvif IP Camera Manager that is a fully-functional camera software written in C#.NET that can be used to control your whole IP surveillance / monitoring system by providing all the most useful USB webcam and IP camera features. Due to its great functionalities, this Onvif IP Camera viewer (device manager) allows you to:<br />\n<ul><li>Connect to more IP cameras, ONVIF IP cameras and USB webcams and display their image</li>\n<li>Manage the PTZ (Pan-Tilt-Zoom) functionality (move up, down, right, left and even zoom)</li>\n<li>Adjust the camera image (saturation, contrast, brightness, backlight, white balance)</li>\n<li>Take video recordings and snapshots</li>\n<li>Improve your alarm system with motion detection (you can send snapshots/videos as alerts in email; you can upload the snapshots/videos to FTP server; you can implement alarm notifications through a VoIP video phone call)</li>\n<li>Send and receive IP camera stream to/ from a SIP video phone call</li>\n<li>Perform general settings (time, name, location etc.) even remotely</li>\n<li>Implement an Onvif IP camera server and provide Onvif service</li>\n<li>Carry out security configurations to protect your IP camera against the malicious non-authorized persons (including setting the visibility of the IP camera on the network; network settings like IP, netmask, gateway, DNS, NTP etc. in DHCP or manually; and user management to authenticate)</li>\n<li>Stream IP camera image to a website and mobile devices (Android, iOS or Windows Phone smartphones and tablets)</li>\n<li>Find / discover ONVIF IP cameras and USB webcameras on your LAN</li>\n<li>Log in order to follow the events of the IP camera</li></ul>\nAfter downloading this demo program, feel free to modify its source code according to your needs. For this purpose you need to <a href=\"http://www.camera-sdk.com/p_13-download-onvif.html\">download Ozeki Camera SDK</a> that can be used to build webcam and IP camera solutions efficiently in C#.NET. After you have installed this software development kit, you can use it immediately for implementing C# camera solutions in order to improve your security monitoring system.<br />\n<h1>For USB webcam and IP camera developments (C#)</h1>\r<ul><li><a href=\"http://www.camera-sdk.com/\">Onvif Camera Software Development Kit</a></li>\n<li><a href=\"http://www.camera-sdk.com/p_27-onvif-ip-camera-manager-exe-demo-onvif.html\">How to implement an Onvif IP Camera Manager in C#</a></li>\n<li><a href=\"http://www.camera-sdk.com/p_240-c-camera-video-tutorials-onvif.html\">C# Camera Video Tutorials on how to build a USB webcam and IP camera viewer</a></li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "ip camera,software,device,manager,usb,webcam,web camera,ptz,pan tilt zoom,device discovery,c#,c sharp,video recording,snapshot,video server,onvif service,onvif,remote,surveillance,security,sdk,development kit,library,viewer,rtsp,stream,audio,sip,phone call,",
  "LastEdited": "2014-10-30T06:49:36.363-07:00"
}