{
  "ProjectName": "OOLib",
  "Title": ".net OpenOffice Automation Library",
  "Description": "The .net OpenOffice Automation Library makes it easier for .net developers to control OpenOffice or LibreOffice through the automation interface. You'll no longer have to browse the Uno docs and call everything by refelction. It's developed in C#. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The .net OpenOffice Automation Library makes it easier for .net developers to control OpenOffice or LibreOffice through the automation interface. You&#39;ll no longer have to browse the Uno docs and call everything by refelction. It&#39;s developed in C&#35;. <br /><br /><b>Creators comment</b><br />OOLib is far away from being complete. This project is mainly created for my needs.<br />This started as a very simple Delphi project which put all functionallity inte a hand full classes.<br />This project is a collection of wrapper classes for the OpenOffice UNO Services and interfaces.<br />Additionally some classes will be extended by some usefull utility functions.<br /><br /><b>What is missing</b>\n<ul><li>The majority of classes (services) is not implemented.</li>\n<li>The implemented classes does not support all of the interfaces.</li>\n<li>So far I could not get the listeners working. I would like to map the listener events to classic .NET events. Any help here is appreciated.</li></ul>\n<br /><b>What is done already</b>\n<ul><li>Implementing some basic classes</li>\n<li>Implementing a lot of classes related to TextDocument</li>\n<li>Some basic sample programs</li></ul>\n<br /><b>What is the goal for the 1st release</b>\n<ul><li>Support most common features for Writer and Calc documents</li>\n<li>Support listeners</li></ul>\n<br /><b>Some more info</b>\n<ul><li>OOLib will work with OpenOffice and LibreOffice</li>\n<li>I&#39;m testing with LibreOffice 3.3.2</li></ul>\n<br />If you have any suggestions or if you want to contribute on this project, feel free to contact me via discussions or codeplex.<br />You can also report issues by the Issue Tracker.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,OpenOffice,LibreOffice,Uno,Automation,Office,.NET,",
  "LastEdited": "2011-08-31T04:18:16.26-07:00"
}