{
  "ProjectName": "OverLookPa",
  "Title": "Over Look Pa Controller",
  "Description": "Real World Application for the Collection of Credit Card, Gift Card and Driver License information. Controls access to an Observation Tower via a turnstile.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><b>Project Description</b><br>\r\nReal World Application for the Collection of Credit Card, Gift Card and Driver License information. Controls access to an Observation Tower via a turnstile.</p>\r\n<p>&nbsp;</p>\r\n<p>‘draft’ Nov 1, 2012</p>\r\n<p>This application and project is currently developed for a specific use. One of the reasons I have made it open source is the use of technologies that can be useful in a number of applications. There is a lot of open source resources used and I will try to\r\n give proper credit to all of them.&nbsp; </p>\r\n<p>&nbsp;</p>\r\n<p>OverLook Pa Tower Access Controller:</p>\r\n<p>Self service POS(Point of Sale) device and software to collect and charge Credit/Debit Cards for access to an observation tower Above Pine Creek Gorge and the Pennsylvania Grand Canyon just outside of Wellsboro PA 16901. A windows 7 pc running inside of\r\n a steel container with a magnetic stripe card reader, web cam, dial up internet,USB i/o and relay boards allows visitors to swipe their Credit/Debit Cards or A pre-purchased Tower Pass Card to unlock a turnstile for one entry per card swipe to the Observation\r\n Tower. </p>\r\n<p>This project uses magnetic stripe reading and processing, Windows Service, Local Data Store, Remote Data Store, SqlCe, Credit Card Processing and Authorize.net Payment Processor, WPF Client GUI for configuration, reporting and troubleshooting,Asp.net web\r\n applications, encryption,USB i/o controllers and relays, MEF, Entity Framework, EF Migrations, caliburn.micro, IdeaBlade DevForce, CockTail (also from IdeaBlade), Breeze (also from IdeaBlade), PostSharp, AOP Aspect Oriented Programing, MvvM, repository, unit\r\n of work, async and await (VB and C#), Multi-Threading, rasdial and programmically controlling network connection and dialup,online and offline operation, ….</p>\r\n<p>&nbsp;</p>\r\n<p>The applications in the project:</p>\r\n<blockquote>\r\n<p>1. Windows Service - Collects magnetic stripe information from Credit/Debit Cards and Gift/Tower Pass Cards. Interact with customer. Persist data.&nbsp; Verify and process information. Activate electromagnetic solenoids to unlock&nbsp; turnstile. Processes\r\n turnstile action (turnstile was turned allowing access or failed preventing access). Process Credit/Debit Card charges. Update Website and remote server.\r\n</p>\r\n<p>2. DevForce BOS Service – Provides Data Persistence to SqlCe Database.</p>\r\n<p>3. Asp.net application Provides remote Data services, reporting, remote data persistence.</p>\r\n<p>4. WPF UI – Provides local monitoring, reporting, configuration and troubleshooting.</p>\r\n</blockquote>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-11-01T08:35:52.543-07:00"
}