{
  "ProjectName": "paarc",
  "Title": "Phone as a Remote Control",
  "Description": "PAARC is a library that enables Windows Phone 7 devices to be used as remote control or input devices for any .NET desktop application. Supports raw (multi-)touch input, gestures (tap, double-tap, hold, pinch, drag, flick), sensors (accelerometer, compass, gyroscope, combined motion) and text input using the SIP. Uses TCP/UDP sockets for maximum performance and responsiveness, and has a server discovery mechanism (multicast) to auto-connect to hosts on the same network. The library comes as multiple components (class libraries) that can be integrated in your own projects both on the phone (Silverlight/XNA) and desktop (.NET), and it has a reference WP7 client you can use to start without creating a separate Windows Phone app first.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Introduction</h1>\r\nPAARC is a library that enables Windows Phone 7 devices to be used as remote control or input devices for any .NET desktop application. Supports raw &#40;multi-&#41;touch input, gestures &#40;tap, double-tap, hold, pinch, drag, flick&#41;, sensors &#40;accelerometer, compass, gyroscope, combined motion&#41; and text input using the SIP. Uses TCP&#47;UDP sockets for maximum performance and responsiveness, and has a server discovery mechanism &#40;multicast&#41; to auto-connect to hosts on the same network. The library comes as multiple components &#40;class libraries&#41; that can be integrated in your own projects both on the phone &#40;Silverlight&#47;XNA&#41; and desktop &#40;.NET&#41;, and it has a reference WP7 client you can use to start without creating a separate Windows Phone app first.<br /><br />Please take a look at the <a href=\"https://paarc.codeplex.com/documentation?referringTitle=Home\">Documentation</a> to get more info.<br />\n<h1>Announcement</h1>\rThe project will switch from Mercurial to TFS shortly. Unfortunately this means that work items and source control history will be lost (more details <a href=\"http://codeplex.codeplex.com/wikipage?title=CodePlex%20FAQ#TFStoMercurial\">here</a>). <b>Update</b>: the conversion has finished and the old Mercurial source has been restored into a main and dev branch. I also updated the releases as far as possible, to point to the correct new change set identifiers (and remove old invalid ones). Apologies for any inconvenience this may have caused.<br />\n<h1>News </h1>\r\n<h2>PAARC accepted into the Marketplace</h2>\r\nA few days ago, the Windows Phone reference client has been accepted into the Marketplace and can now be installed comfortably by everyone who owns a &quot;Mango&quot;-compatible device. The Marketplace link is: <a href=\"http://windowsphone.com/s?appid=c094fd13-3771-4bf9-b546-83c482f293f2\">http://windowsphone.com/s?appid=c094fd13-3771-4bf9-b546-83c482f293f2</a>. <br /><br />More information on this milestone and what it has to offer for normal users and you as a developer can be found in my blog post here:<br /><a href=\"http://www.pitorque.de/MisterGoodcat/post/PAARC-Milestone-Reached.aspx\">PAARC Milestone Reached</a><br /><br />I&#39;ve also used this opportunity to add a first release of the library to the &quot;Downloads&quot; page. It contains both the binaries required to build your own applications as well as the complete source code of the project, including all samples. <br /><br />.</div><div class=\"ClearBoth\"></div>",
  "TagList": "sockets,networking,remote control,Touch,gestures,Windows Phone 7,WP7,",
  "LastEdited": "2013-04-04T03:53:24.47-07:00"
}