{
  "ProjectName": "pact",
  "Title": "Per-User ActiveX Conversion Toolkit",
  "Description": "Per-User ActiveX, introduced in IE8, gives developers and administrators power over how controls are installed on systems.  Installations handled through Internet Explorer now have the option to be directed to user profiles instead of to the system itself. \n\nThe Per-User ActiveX Conversion Toolkit (PACT) allows developers and system administrators to examine how per-user controls will run, how they will be affected in such a context, and how such a context will affect their systems.  Users of PACT can discover which controls are installed, downloaded, accessed, and used on their own machine.  PACT also enables these users to convert existing controls to a per-user context and try-out controls that have been converted to per-user.\n\nThe Per-User ActiveX Conversion Toolkit is intended only for investigational purposes and is not meant to create per-user controls for use in production environments or to produce released products.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Per-User ActiveX, introduced in IE8, gives developers and administrators power over how controls are installed on systems.  Installations handled through Internet Explorer now have the option to be directed to user profiles instead of to the system itself. <br /><br />The Per-User ActiveX Conversion Toolkit &#40;PACT&#41; allows developers and system administrators to examine how per-user controls will run, how they will be affected in such a context, and how such a context will affect their systems.  Users of PACT can discover which controls are installed, downloaded, accessed, and used on their own machine.  PACT also enables these users to convert existing controls to a per-user context and try-out controls that have been converted to per-user.<br /><br />The Per-User ActiveX Conversion Toolkit is intended only for investigational purposes and is not meant to create per-user controls for use in production environments or to produce released products.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2008-08-29T15:53:31.957-07:00"
}