{
  "ProjectName": "PageflowWF",
  "Title": "Pageflow WF",
  "Description": "Pageflow is based upon Workflow Foundation, and can be used to drive user interfaces. It has it's own workflow type and on every transition (movement from screen to screen) activity additional work can be done between the transition from one 'screen' to another 'screen'.\nIt can be used with ASP.NET or WPF.\nPageflow was initialy developed by Matt Winkler.\nAll additions we've done on pageflow will be submitted towards the codeplex source.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Pageflow is based upon Workflow Foundation, and can be used to drive user interfaces. It has it&#39;s own workflow type and on every transition &#40;movement from screen to screen&#41; activity additional work can be done between the transition from one &#39;screen&#39; to another &#39;screen&#39;.<br />It can be used with ASP.NET or WPF.<br />Pageflow was initialy developed by Matt Winkler.<br />All additions we&#39;ve done on pageflow will be submitted towards the codeplex source.<br /><br />Welcome to the project page for Pageflow.<br /><br />Pageflow was initially created by <a href=\"http://blogs.msdn.com/mwinkle/\">Matt Winkler</a>.<br />You can find the intial blogposting at the <a href=\"https://pageflowwf.codeplex.com/wikipage?title=blogpost%20page&referringTitle=Home\">blogpost page</a><br /><br /><b>Note</b><br />At this moment I haven&#39;t created a release yet. You have to download the latest changeset and compile it yourself. After that you can reference the compiled DLL, to your solution. Create a sequential workflow (or whatever) and let the workflow inherit from NavigatorWorkflow. Don&#39;t forget to add the toolbox items from the dll to your toolbox so you can add the interaction activities.<br /><br />BTW: If you would like to contribute to this project feel free to contact me, or put a note on the comment field. Your help is very welcome. :-)<br /><br />Current status:<br />- Initial sourcecode (For historical reasons.) uploaded<br />- Sourcecode updated with the possibility to access directly pages which are under pageflow. (See blogpost: <a href=\"http://conducido.nl/blog/2007/11/29/directly-access-a-webpage-which-is-part-of-the-pageflow-workflow\">Directly access a webpage which is part of the Pageflow Workflow</a> )<br /><br />TODO:<br />- Add samples to source control<br />- Add Visual Studio 2008 support<br />- Add documentation to WIKI (Quick start guide, how to install etc etc.)<br />- Repackage solution to new installer<br /><br /><a href=\"https://pageflowwf.codeplex.com/wikipage?title=Directly%20access%20a%20page%20under%20Pageflow&referringTitle=Home\">Directly access a page under Pageflow</a><br /><a href=\"https://pageflowwf.codeplex.com/documentation?referringTitle=Home\">Documentation</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,MVC,Workflow Foundation,WF,PageFlow,",
  "LastEdited": "2008-10-01T13:59:53.997-07:00"
}