{
  "ProjectName": "passkeeper",
  "Title": "PassKeeper",
  "Description": "A simple C# 2.0 GUI program that manages your usernames and passwords, that is, basically account information. All confidential information is saved using the latest encryption standard, AES (Advanced Encryption Standard), in the highest possible 256-bit strength.\n\nAccount information can be saved in an XML file, and each file is digitally signed using W3C's XMLDSIG recommended standard to make sure it is not tempered with prior to opening. All files are saved in UTF-8 (Unicode 8-bit encoding format), and hence makes possible for the use of East Asian and other non-English based languages.\n\nThe program also demonstrates separation of data logic from presentation logic and an implementation of AES in managed code, which is about 40-60% faster than that provided by the .NET Framework. \n\nIn the user interface area, it also shows how to create moderately complex controls layout that can resize accordingly automatically when the user resizes the main form. This is achieved through the use of FlowLayoutPanel , TableLayoutPanel and other types of panel controls. The program also uses a toolbar with large pretty icons instead of the standard and deprecating \"File, Edit, and Help\" menu system.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Summary</b><br />With so many accounts from so many different websites nowadays, this program can help you to manage all of them with ease using a simple user interface.<br /><br />This program also serves as a learning point for beginners hoping to write their own programs and utilities.<br /><br /><b>Project Description</b><br />A simple C&#35; 2.0 GUI program that manages your usernames and passwords, that is, basically account information. All confidential information is saved using the latest encryption standard, AES &#40;Advanced Encryption Standard&#41;, in the highest possible 256-bit strength.<br /><br />Account information can be saved in an XML file, and each file is digitally signed using W3C&#39;s XMLDSIG recommended standard to make sure it is not tempered with prior to opening. All files are saved in UTF-8 &#40;Unicode 8-bit encoding format&#41;, and hence makes possible for the use of East Asian and other non-English based languages.<br /><br />The program also demonstrates separation of data logic from presentation logic and an implementation of AES in managed code, which is about 40-60&#37; faster than that provided by the .NET Framework. <br /><br />In the user interface area, it also shows how to create moderately complex controls layout that can resize accordingly automatically when the user resizes the main form. This is achieved through the use of FlowLayoutPanel , TableLayoutPanel and other types of panel controls. The program also uses a toolbar with large pretty icons instead of the standard and deprecating &#34;File, Edit, and Help&#34; menu system.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,C#,xml,.NET 2.0,C# 2.0,Profile,Password,Cryptography,Encryption,username,account,password manager,secure,aes,xmldsig,",
  "LastEdited": "2008-04-20T03:40:32.24-07:00"
}