{
  "ProjectName": "PassiveControlModel",
  "Title": "MVP Passive View Control Model Framework",
  "Description": "Framework that builds on the power of my view on the Passive View pattern which I call the Passive Ciew Control Model.\nThis framework is my implementation of the pattern and shows how easy it is to build full MVP applications with a lot of plumbing for the controls done here.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Note: This project is in its start up phase. The code here is not yet completed. Work in progress...</b><br /><br /><b>Project Description</b><br />Framework that builds on the power of my view on the Passive View pattern which I call the Passive Ciew Control Model.<br />This framework is my implementation of the pattern and shows how easy it is to build full MVP applications with a lot of plumbing for the controls done here.<br /><br /><b>About the project</b><br /><br />In <a href=\"http://justyouraveragegeek.com/blog/index.php/2010/01/mvppattern-control-model/\">my blog post</a> of January 20th 2010 I described my view on the Passive View (MVP) pattern. I stated that it was wishful to make the view as passive as possible and define Controls instead of strings and booleans. I called it the Passive View Control Model pattern.<br /><br />I also stated that this pattern is only successful when you comply to two things. You got to define the Interfaces of the controls in a reusable library which you can use in your projects. And you have to make an library which implements those interfaces and provide you with the controls you need. In the Interfaces you describe how you want your controls to behave and in the implementation of those controls you do all the plumbing. When you have these two libraries it will be really easy and delightful to build applications with the Passive View pattern.<br /><br />This project will provide the libraries as described above. The libraries can be used as is or to learn about the Passive View Control Model and become able to design your own framework.<br /><br />Happy Coding!<br /><br />Michel van der Weide<br /><a href=\"http://www.justyouraveragegeek.com\">http://www.justyouraveragegeek.com</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-04-30T15:35:03.187-07:00"
}