{
  "ProjectName": "patchsolution",
  "Title": "Patch Solution",
  "Description": "This is a compilation of PowerShell scripts that controls what time and dates/day of week when a computer is able to install it's Windows Updates Patches.\r\n\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>Project Description</h1>\r\n<p>Patching is a problem or that topic most people don&rsquo;t want to talk about. There are many great solutions to managing patches, but the problem is defining when computers can actually install these approved patches. This is where the Patch Solution comes\r\n in.</p>\r\n<h2>Overview</h2>\r\n<p>The idea behind the patch solution is to apply approved patches to a computer at a specific time during a specific days within a month. Some computers may be part of a QA/Test environment and some may be part of a Production environment. Using the same solution\r\n and by modifying the XML configuration file, the solution can tell each type of computer when it&rsquo;s allowed to patch.</p>\r\n<p>As these scripts use free tools, and in order to help companies and individuals environments keep their environments more secure, this solution is also free.</p>\r\n<h3>Features</h3>\r\n<ul>\r\n<li>Uses free tools </li><li>Automated </li><li>Control when each computer starts patching and reboots </li><li>Configure Patch Schedules </li><li>Examples:\r\n<ul>\r\n<li>Every day at 00:30 </li><li>Monday, Wednesday, Saturday at 22:00 </li></ul>\r\n</li><li>Central Reporting (Only if WSUS is used) </li><li>Creates an Excel sheet with all outstanding updates/computers </li><li>Excel report is saved on a file share </li><li>An email is sent a day before showing machines that will be patched </li><li>Ability test servers in Maintenance Mode </li><li>Requirements\r\n<ul>\r\n<li>Active Directory </li><li>Computer has Access to\r\n<ul>\r\n<li>Microsoft Windows Update<br>\r\nor </li><li>Access corporate WSUS 2012R2 (Free/Preferred) </li></ul>\r\n</li><li>Computer is a member of Active Directory </li><li>PowerShell (v3&#43; Preferred) </li></ul>\r\n</li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2015-06-09T16:00:52.367-07:00"
}