{
  "ProjectName": "pdfirmprotector",
  "Title": "PDF IRM Protector For SharePoint 2007 And 2010",
  "Description": "The PDF IRM Protector controls the conversion of PDF documents to their encrypted, rights-managed format and the decryption of PDF documents from their rights-managed format back to their original format. The project targets both SharePoint 2007 and 2010. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nThe PDF IRM Protector controls the conversion of PDF documents to their encrypted, rights-managed format and the decryption of PDF documents from their rights-managed format back to their original format. The project targets both SharePoint 2007 and 2010.\r\n<br>\r\n<br>\r\nIRM protectors in SharePoint are vital for organizations that require some level of DRM, however use formats outside of those supported natively by MSFT. One of the most common formats used in the market today is PDF, unfortunately, this file format is not\r\n supported by Microsoft by default and the commercial solutions available seem to be overpriced.\r\n<br>\r\n<br>\r\nAs such, this project provides a solution whereby the standard Windows RMS security actions can be applied to PDF's by introducing linear transformation targeting security actions while maintaining content preservation. For more information regarding the project,\r\n please visit the following link:<br>\r\n<br>\r\n<a href=\"http://www.sharepointsecurity.com/sharepoint/sharepoint-development/pdf-irm-protector-for-sharepoint-2007-2010/\">http://www.sharepointsecurity.com/sharepoint/sharepoint-development/pdf-irm-protector-for-sharepoint-2007-2010/</a><br>\r\n<br>\r\nDepending on your <strong>exact</strong> requirements you may or may not need to make any code modifications. Please use the project at your own risk, however if you run into issues use the contact form in the below mentioned site.<br>\r\n<br>\r\nThe PdfIrmProtector.reg file is used for deployment, it makes the required registry changes to make SharePoint aware of the new protector. All other files are for direct binary building.\r\n<br>\r\n<br>\r\nAdam Buenz - SharePoint MVP<br>\r\n<a title=\"http://www.sharepointsecurity.com\" href=\"http://www.sharepointsecurity.com\">http://www.sharepointsecurity.com</a><br>\r\n<br>\r\n<br>\r\n</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-03-03T08:57:27.623-08:00"
}