{
  "ProjectName": "peoplepickerplus",
  "Title": "People Picker Plus for SharePoint 2010",
  "Description": "Globally replace the SharePoint people picker with a better control that works the same across IE, Chrome, and Firefox.\r\n\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nGlobally replace the SharePoint people picker with a better control that works the same across IE, Chrome, and Firefox.<br>\r\n<br>\r\n<img src=\"http://www.codeplex.com/Download?ProjectName=peoplepickerplus&DownloadId=627159\" alt=\"\"><br>\r\n<br>\r\nThe default 'People Picker' in SharePoint 2010 is an awful piece of code. It is inefficient, nearly inextensible, a usability nightmare, and extremely error prone. Anyone using Chrome or Firefox have even more to complain about - the 'down level' mode of the\r\n people picker takes them to new levels of horrid. Beyond that, if you try to use HTML5 within a SharePoint site, the default people picker causes even more problems across ALL browsers, including IE.</p>\r\n<p><strong>Features</strong></p>\r\n<ul>\r\n<li><strong>Activate 'n Go! <br>\r\n</strong>Activate the site collection scoped feature and be done - all people pickers will be replaced within the site.\r\n</li><li><strong>Fixes your &quot;People Picker doesn't work when I use HTML5 on my SharePoint 2010 site&quot;</strong><br>\r\nIf you have tried to&nbsp;make a real HTML5&nbsp;SharePoint 2010 master page, you should be aware of the broken people picker problem. Use this solution to address that problem - it was the main reason for creating this project!\r\n</li><li><strong>Cross-browser! </strong><br>\r\nUnlike the built in entity picker, which devolves into a textarea for non-IE browsers, the People Picker Plus works the same way no matter what browser is being used. Also, it is\r\n<strong>HTML5 friendly</strong>. </li><li><strong>Autocomplete Searches!</strong><br>\r\nAs the user types, search results are displayed, and even grouped by User, SharePoint group, and Security Group.\r\n</li><li><strong>User Image Proxy</strong><br>\r\nUser images located on mysites usually cause an annoying extra authentication prompt within the default people picker dialog. Your users won't miss this!\r\n</li><li><strong>Decent UI!</strong><br>\r\nThe UI for the built in people picker is awful. Especially for 'down level' browsers like Chrome and Firefox. The UI for the People Picker Plus is better than awful!\r\n</li></ul>\r\n<p><strong>Prerequisites</strong></p>\r\n<ol>\r\n<li><strong>SharePoint 2010 only<br>\r\n</strong>I know 2013 is out - if there is enough demand, maybe there will be one for it. Instructions for SharePoint 2007/2003: Upgrade to 2010. Good news for 2013 people: a 2013 version is in the works!\r\n</li><li><strong>jQuery<br>\r\n</strong>Should really be in everything at this point. However, if it is not currently part of your site, the MS CDN will be used to incorporate jQuery 1.9.x into the current page.\r\n</li><li><strong>json2.js<br>\r\n</strong>Like jQuery, this is a pretty common JavaScript lib to have around. Like the jQuery library, if it is not detected&nbsp;the solution will&nbsp;add it&nbsp;into current page.\r\n</li><li><strong>AdditionalPageHead control on the master page</strong><br>\r\nThis is a standard control found on most SharePoint master pages. </li></ol>\r\n<p><strong>&nbsp;</strong></p>\r\n<p><strong>Installation</strong></p>\r\n<ol>\r\n<li>Add the PeoplePicker.wsp to the farm solutions. </li><li>Deploy to the desired web application(s). </li><li>Activate the People Picker Plus feature in the desired site collection(s). </li></ol>\r\n<p><br>\r\n<strong>Limitations</strong></p>\r\n<p>Hopefully these will go away in time, but here we go:</p>\r\n<ol>\r\n<li>Only tested in IE 9&#43;10, Chrome, and Firefox. </li><li>jQuery dependent. </li><li>No type-ins allowed. &nbsp;So this one is up for debate. On one side, users MUST be selected, which minimizes errors and potential time lost due to fumbling through getting the typed data to resolve. On the other side, some implementations may utilize the\r\n type-in data to do custom resolution. </li></ol>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Sharepoint,jQuery,HTML5,People Picker,peoplepicker,select users,SharePoint 2010,Fix IE9,DRKENN,",
  "LastEdited": "2013-03-29T08:08:37.647-07:00"
}