{
  "ProjectName": "piston",
  "Title": "Piston Wheel Animation",
  "Description": "The aim of this project was to perform real-world like \r\nanimation, perform numerically controlled steering  and \r\ndiscover how small distortions influence mechanical system. \r\nThere is a piston and user sets its initial properties like initial \r\nangular velocity, piston mass, rod mass, wheel’s mass. Next he \r\ncan make it animating. There is a Hamilton mechanics task \r\nsolved on each animation step. For solving differential \r\nequations I used Runge-Kutta 4th\r\n  order method.  While \r\nanimating user can change error of rod’s length  (normal \r\nprobabilistic distribution), or change another parameters and \r\nsee how does it influence mechanical system on charts.\r\n\r\nThe mechanics of the system and numerical solution has been explained at my blog: http://cadcammodelling.wordpress.com/2011/02/14/piston-animation-using-hamiltonian-mechanics/",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The aim of this project was to perform real-world like <br />animation, perform numerically controlled steering  and <br />discover how small distortions influence mechanical system. <br />There is a piston and user sets its initial properties like initial <br />angular velocity, piston mass, rod mass, wheel&#8217;s mass. Next he <br />can make it animating. There is a Hamilton mechanics task <br />solved on each animation step. For solving differential <br />equations I used Runge-Kutta 4th<br />  order method.  While <br />animating user can change error of rod&#8217;s length  &#40;normal <br />probabilistic distribution&#41;, or change another parameters and <br />see how does it influence mechanical system on charts.<br /><br />The mechanics of the system and numerical solution has been explained at my blog&#58; http&#58;&#47;&#47;cadcammodelling.wordpress.com&#47;2011&#47;02&#47;14&#47;piston-animation-using-hamiltonian-mechanics&#47;<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-02-04T02:18:48.377-08:00"
}