{
  "ProjectName": "powerchumby",
  "Title": "PowerChumby",
  "Description": "PowerChumby is a Perl CGI script and a PowerShell module that gives you a PowerShell way of controlling your Chumby.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rPowerChumby is a Perl CGI script and a PowerShell module that gives you a PowerShell way of controlling your Chumby.<br />\n<h1>Background</h1>\r\nAfter doing some cleanup one evening I found a Chumby <a href=\"http://chumby.com\">http://chumby.com</a> sitting between my nightstand and my heater.  It had been long neglected due to the unstable wireless in my bedroom.  I decided it was high time I moved it next to my computer and workspace to assist me in my daily tasks.  I found it was exactly what I needed:  A pandora player, a facebook/twitter feed reader, a clock, and - well you know how it goes with a chumby.  <br /><br />The one thing I found to be troublesome was the speed of the control panel. While on a call for work I need the ability to quickly mute the volume or dim the lights. On occasion I&#39;d like to see a specific widget without having to push the face of the Chumby with my fat fingers.<br /><br />After some digging into the Chumby twiki I decided to dust off my Perl skills and create an interface to many of the items found here: <a href=\"http://wiki.chumby.com/mediawiki/index.php/Chumby_tricks#Sending_events_to_the_Control_Panel\">http://wiki.chumby.com/mediawiki/index.php/Chumby_tricks#Sending_events_to_the_Control_Panel</a><br /><br />The next step made perfect sense to me: Create the PowerShell cmdlets to interface with the .cgi script.  This gives me lightning fast access to the functions of my chumby from the comfort of the environment I spend all my time in.<br />\n<h1>Future</h1>\r\nI&#39;m more than happy to add more features as long as there is a viable way of controlling the feature via perl/cgi or any other method.  I cannot, however, make features that are not possible.  While I would love to create an Out-Chumby cmdlet this may not be doable without modifying the default build of the Chumby.  The goal of this project is to keep the Chumby builds intact to make installation of the package as simple as possible.  Please feel free to post any comments or feature requests in the Discussions.<br /><br />Tome Tanasovski<br /><a href=\"http://powertoe.wordpress.com\">http://powertoe.wordpress.com</a><br /><a href=\"http://twitter.com/toenuff\">http://twitter.com/toenuff</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-12-06T05:48:35.433-08:00"
}