{
  "ProjectName": "protoxaml",
  "Title": "ProtoXAML",
  "Description": "Prototyping has a wide range of applications. One is to gather user feedback in an early stage of the design process. A highly fidelity prototype might restrict the user in getting new ideas and inhibits honest feedback. In this case many use pen and paper for this early stage prototyping\nBut the artifacts you create are difficult to reuse. Wouldn't it be nice to get a \"pen and paper\" look and feel and easily use the result in XAML tools like Visual Studio and Expression Blend?\nProtoXaml is exactly that.\n\"Sketch\" a User Interface to gather feedback and ideas and turn it by a mouse click into an artifact that Designer and Developers can refine. You can even switch back to the \"pen and paper look\" \n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Prototyping has a wide range of applications. One is to gather user feedback in an early stage of the design process. A highly fidelity prototype might restrict the user in getting new ideas and inhibits honest feedback. In this case many use pen and paper for this early stage prototyping<br />But the artifacts you create are difficult to reuse. Wouldn&#39;t it be nice to get a &#34;pen and paper&#34; look and feel and easily use the result in XAML tools like Visual Studio and Expression Blend&#63;<br />ProtoXaml is exactly that.<br />&#34;Sketch&#34; a User Interface to gather feedback and ideas and turn it by a mouse click into an artifact that Designer and Developers can refine. You can even switch back to the &#34;pen and paper look&#34; <br /><br /><br /><br />The way it works is that the application to be designed references the ProtoXAML assembly and calls one method that swaps the top level ResourceDictionary with templates that are provided by ProtoXAML<br />The templates are the core. Currently we have a few templates for Buttons, Textboxes (including the scrollbar :-) ), Labels, Menus. <br />And the big hope is that we get more and more templates for the more complicated controls in WPF to make it more appealing.<br /><br />Below are two screenshots of simple demo application that uses ProtoXAML to have two visual Styles (skin/themes) <br />The form in the demo application is fairly useless and is just there to show the existing templates.<br /><br /><img src=\"/projects/protoxaml/abb861b8-7b6f-4f7c-974e-bc28e505d5db\" alt=\"screenshotDefault.jpg\" title=\"screenshotDefault.jpg\" /><br />Figure 1 – The original form, a simple registration form in WPF.  This is the type of form that you may show in management meetings.  <br /><br /><img src=\"/projects/protoxaml/a25dcb62-3119-4b8a-85cf-5b1eff77e361\" alt=\"screenshotNapkin.jpg\" title=\"screenshotNapkin.jpg\" /><br />Figure 2 – The same form, but with the new resource dictionary applied.  Note that the controls are still functional, but the look and feel is ideal for obtaining user feedback.</div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,xaml,WPF control template,prototyping,Useful,",
  "LastEdited": "2007-10-02T09:05:09.733-07:00"
}