{
  "ProjectName": "proudmonkeycontrols",
  "Title": "ProudMonkey MessageBox Controls for WebForms",
  "Description": "The customize MessageBox, ConfirmBox and FrameBox controls for ASP.NET WebForms was designed in which developers can easily prompt a message in the page whether they use it via server or client side without having much code and to present a user friendly message to end users.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nThe customize MessageBox, ConfirmBox and FrameBox controls was designed in which developers can easily prompt a message in the page whether they use it via server or client side without having much code and to present a user friendly message to end users.</p>\r\n<p><strong>The Idea:</strong></p>\r\n<p><span style=\"font-size:small\">As some of you may already know that displaying a pop-up message box has always been a pain for most developers in web programming. Everyone has probably used the Page.ClientScript.RegisterStartupScript or the ScriptManager.RegisterClientScriptBlock\r\n method to call the javaScript alert and confirm function for displaying a generic message box in the web page.</span></p>\r\n<p><span style=\"font-size:small\">I was working with a project before that uses a lot of popup message to prompt the end user a message based on certain actions. First I simply used the JavaScript alert and confirm function to prompt them a message until I realized\r\n that using the simple JavaScript alert and confirm functions makes the page ugly in terms of &quot;look-and-feel&quot; because I can't customize it to conform with the web page color scheme. Another thing is that I need to prompt end users based on different operations\r\n like for example, I need to display a successful message pop-up if a successful operation happened and using the JavaScript alert for prompting successful message may confused end users because it uses the default warning image. To overcome those problem I\r\n can simply create a modal panel within the Webform and apply some css for setting up the look and feel of the message box but this is not a good approach for me. Why? Two main reasons: Maintainability and Re-usability. Since I need to have a popup message\r\n that can be reused across multiple applications and can be easily maintained so I decided to create these controls.</span></p>\r\n<p><span style=\"font-size:small\"><strong>Main Features:</strong></span></p>\r\n<p><span style=\"font-size:small\">These controls was designed in which developers can easily prompt a message in the page whether they use it via server or client side without having much code and to present a user friendly message to end users.</span></p>\r\n<p><span style=\"font-size:small\">These were created as a common control which can be reuse across applications. The maintenance for this control is much easier because any changes made from it would be reflected to all that uses it.</span></p>\r\n<p><span style=\"font-size:small\">These controls provide options to developers to choose what type of message they want to show to the end user in which the standard JavaScript alert/confirm doesn't have. It also benefits the end users because these controls\r\n provide a user friendly interface and each message type are presented in a different color scheme and icon in which end users can easily recognize the message. These will help developers to have a consistent message box across applications and provide a fancier\r\n message box to end users.</span></p>\r\n<p><span style=\"font-size:small\">The latest version of the controls allows you to modify the look and feel since it already has properties that you can set.</span></p>\r\n<p><span style=\"font-size:small\"><strong><a href=\"http://proudmonkeycontrols.codeplex.com/releases/view/81058\">Download</a></strong><br>\r\n</span></p>\r\n<p><strong><span style=\"font-size:small\">How to use it?</span></strong></p>\r\n<ul>\r\n<li><span style=\"font-size:small\"><a href=\"http://proudmonkeycontrols.codeplex.com/documentation\">Using the Controls</a></span>\r\n</li><li><span style=\"font-size:small\"><a href=\"http://geekswithblogs.net/dotNETvinz/archive/2012/01/12/using-messagebox-control-outside-updatepanel-control.aspx\">Using the Controls with Update Panel</a></span>\r\n</li><li><span style=\"font-size:small\"><a href=\"http://geekswithblogs.net/dotNETvinz/archive/2012/02/01/using-proudmonkey-confirmbox-control-in-gridview.aspx\">Using ConfirmBox in GridView</a></span>\r\n</li><li><span style=\"font-size:small\"><a href=\"http://geekswithblogs.net/dotNETvinz/archive/2011/05/02/proudmonkey-controls-for-asp.net-4.0---customizing-the-modal.aspx\">Customizing the Modal</a><br>\r\n</span></li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "MessageBox,ConfirmBox,FrameBox,",
  "LastEdited": "2013-02-07T06:03:36.9-08:00"
}