{
  "ProjectName": "radiantq",
  "Title": "RadiantQ Community Controls",
  "Description": "The DataGridMovableRows control lets you move rows around in a DataGrid! We at RadiantQ.com created it for our Gantt control implementation and decided to share it with the community.\n\nEnd-users can select 1 or more rows and simply use the mouse to drag them to a new location.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The DataGridMovableRows control lets you move rows around in a DataGrid&#33; We at RadiantQ.com created it for our Gantt control implementation and decided to share it with the community.<br /><br />End-users can select 1 or more rows and simply use the mouse to drag them to a new location.<br /><br />The <b>DataGridMovableRows</b> control (deriving from DataGrid) allows the end user to select rows and simply drag them around to a new location. A visual drag cue is provided when the user moves the mouse over the row header of the selected row and visual cues are also provided to indicate drop location.<br /><br />[image:DataGridMovableRows.png]<br /><br /><b>BeforeMovingRows</b> and <b>RowsMoved</b> events are fired. RowsMoved will tell you which rows and being moved and to what new location. You could typically update your bound list to reflect this change. For persisting the new order you could use a &quot;sort order&quot; field in your bound objects (this is illustrated in the sample provided).<br /><br />This control was developed by <b>RadiantQ</b> (<a href=\"http://www.radiantq.com\">http://www.radiantq.com</a>). We specialize in Silverlight based GanttControls for Project and Resource management.<br /><br />RadiantQ also specializes in providing project implementation services for Silverlight based projects, especially GUI intensive applications where our expertise would be a great asset for your projects. Please visit our website for more information.<br /><br />Download stable from <b>Downloads</b> tab or get the latest from SVN in the <b>Source Code</b> tab.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-01-19T13:05:58.19-08:00"
}