{
  "ProjectName": "RCAPI",
  "Title": "RC API",
  "Description": "This is a Project to control RC devices like Bluetooth cars.\r\nCurrently the only supported car is Silverlit Ferrari Italia 458 (for Android).\r\nThe idea is to (wit",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>This is a project to control RC devices like Bluetooth cars.<br>\r\nCurrently the only supported car is Silverlit Ferrari Italia 458 (for Android).<br>\r\nThe idea is to (with the help of the community) add support for more cars and perhaps helicopters.<br>\r\n<br>\r\n</p>\r\n<h3>Backstory</h3>\r\n<p>For Christmas 2 years ago my mother-in-law got me a Silverlit Bluetooth car.</p>\r\n<p>Sadly it was a MFI device (Made for iPhone) and it seems to be more or less impossible to connect to an MFI-device without an iPhone (if someone has more info on this please let me know).</p>\r\n<p>After talking to Silverlit, trying to convince them to share the protocol I got a\r\n<a href=\"http://silverlit.com/toy/interactive-bluetooth-rc-458-italia-for-android\">\r\nSilverlit Ferrari 458 Italia (for android)</a> and managed to figure out how the protocol worked.</p>\r\n<p>RC API is an open source project on <a href=\"https://rcapi.codeplex.com/\">Codeplex</a> which currently support controlling the Silverlit Ferrari 458 Italia from Windows 8.1 and Windows phone 8.</p>\r\n<h3>How to use</h3>\r\n<p><a href=\"http://www.apeoholic.se/post/2014/01/12/Using-RC-API-on-Windows-8\">Windows 8.1</a><br>\r\n<a href=\"http://www.apeoholic.se/post/2014/01/12/Using-RC-API-on-Windows-Phone\">Windows phone</a></p>\r\n<h3>The future</h3>\r\n<p>I hope to be able to add more veichles and helicopters to the API, please let me know (or contribute) what you want me too add =D</p>\r\n<p>If you are an RC device manufacturer and would like to include your device in the API, please let me know and I&rsquo;ll make it happen.\r\n<br>\r\nMaking the API I have used inspiration from the <a href=\"https://legoev3.codeplex.com/\">\r\nLego EV3 codeplex project</a>, I liked how they solved Bluetooth communication and I decided to do it basically the same way.</p>\r\n<p>Let&rsquo;s bring more gadgets and RC-stuff to the Windows platforms =D</p>\r\n<p>&nbsp;</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-01-17T05:51:36.45-08:00"
}