{
  "ProjectName": "RDPWrapper",
  "Title": "Remote Desktop Client Wrapper For RDP 6.1 ActiveX Control",
  "Description": "This is a class created to handle differences between RDP6.1 ActiveX control and earlier versions. New ActiveX control uses a new interface to handle connection to Server Console. In order to handle both versions, c# wrapper class checks existing RDP version and creates correct wrapper object.\n\nThis is a .NET Framework class library. \nIt requires .NET Framework 3.5. \nIn order to use source code, RDP6.1 must be installed to the developers computer (Currently Windows 2008 and Vista SP1 has this version of RDP).",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">I have just created a new source management structure. You can access 3 different branches : Development, Main &amp; Release.<br /><br />I will keep Release branch as the most stable version of the project. <br /><br />Main will be the place to get the latest compiled version for test purposes.<br /><br />Development is the source code with new features (It may fail to compile).<br /><br />Please use the code from release branch since it is the only one tested. <br /><br />Also please report all bugs on release branch or main. Do not report any problems on Development.<br /><br />Thanks....<br /><br />RDPWrapper class library is created to overcome versioning issue betwen RDP6.1 ActiveX control and earlier versions. <br /><br />New RDP6.1 ActiveX control has one breaking change which is not compatable with the earlier versions : Connection to Server Console.<br />Earlier version of the RDP ActiveX control uses an interface with the property called MSTSCLib.IMsRdpClientAdvancedSettings5.ConnectToServerConsole.<br /><br />RDP6.1 ActiveX control ignores older interface property and expects the application to use new property on a new interface called MSTSCLib.IMsRdpClientAdvancedSettings6.ConnectToAdministerServer.<br /><br />RDPControl detects the version of the RDP and creates appropriate wrapper class and set the correct property.<br /><br />RDPControl implements all important properties and events that an application may require however there may be other properties which are not currently implemented.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-03-10T15:03:01.783-08:00"
}