{
  "ProjectName": "RequiredFieldExtende",
  "Title": "AJAX Control Toolkit - RequiredFieldExtender",
  "Description": "This control is built on top of the ASP.NET AJAX Control Toolkit and is designed to extend the ASP.NET RequiredFieldValidator control.\n\nIt extends the RequiredFieldValidator control by setting the CSS for a required control if it is invalid. It also extends a label control associated with the required control.\n\nFor instance, if you have a form where you have a textbox that is required and that textbox has a ASP.NET RequiredFieldValidator control applied to it, you can use this control to set the textbox's  CSS  property should the RequiredFieldValidator indicate the textbox is empty.  When the form is submitted, if the textbox is empty, your CSS class will be applied to the textbox client-side. You can also specify that a label control have your custom CSS class applied to it as well.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>New Version added via SVN  12/11/2008 in Source Code tab. Contains an example using the code inside a custom control.</b><br /><br /><b>Project Description</b><br />This control is built on top of the ASP.NET AJAX Control Toolkit and is designed to extend the ASP.NET RequiredFieldValidator control.<br /><br />It extends the RequiredFieldValidator control by setting the CSS for a required control if it is invalid. It also extends a label control associated with the required control.<br /><br />For instance, if you have a form where you have a textbox that is required and that textbox has a ASP.NET RequiredFieldValidator control applied to it, you can use this control to set the textbox&#39;s  CSS  property should the RequiredFieldValidator indicate the textbox is empty.  When the form is submitted, if the textbox is empty, your CSS class will be applied to the textbox client-side. You can also specify that a label control have your custom CSS class applied to it as well.<br /><br />This control is built on top of Microsoft&#39;s AJAX Control Toolkit. It extends the behavior of an ASP.NET RequiredFieldValidator control to apply a CSS class to the control being validated if it is invalid (client side). It also will apply a CSS class to an ASP.NET Label control as well. For example, say you have a textbox on your ASP.NET page that is required such a name textbox: <br /><br /> <img src=\"/projects/RequiredFieldExtende/50185820-a505-4ea6-a97d-09f592fcc61d\" alt=\"image1.png\" title=\"image1.png\" /><br /><br />If the user submits the form with an empty textbox, the result will be that the textbox and label will have the CSS class you specify applied to them. In my case, I wanted them to show in red: <br /><br />  <img src=\"/projects/RequiredFieldExtende/852b9e9d-3640-4f75-933c-93111fddb273\" alt=\"image2.png\" title=\"image2.png\" /><br /><br />And here is a screenshot of the ASP.NET Markup used to create the sample above: <br /><br />  <img src=\"/projects/RequiredFieldExtende/851974db-1ec8-471f-b248-1617f8d51c06\" alt=\"image3.png\" title=\"image3.png\" /><br /><br />With this control, all you need to do to add your custom CSS to a required field is to reference the assembly in your ASP.NET project, register the control in your web.config file,  and then add the RequiredFieldExtender as shown above to your ASP.NET Markup.  The control can be used against any control being validated with a RequiredFieldValidator control such as TextBox, RadioButtonList, DropDownList, etc.  <br /><br /><br /><a href=\"http://www.brentlamborn.com\">http://www.brentlamborn.com</a><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "AJAX Control Toolkit,Extenders,ASP.NET Ajax,RequiredFieldValidat,validation,AJAX,",
  "LastEdited": "2008-12-11T09:21:37.473-08:00"
}