{
  "ProjectName": "restarts",
  "Title": "restarts - Command Line Windows Services Controlling Application",
  "Description": "A console based Windows Services Controlling application that has the abillity to restart (main feature), start, stop, pause, control, continue, query, disable, delete, enable, create,... Windows Services in the local or remote SCM database. It also can list all services, devices/drivers and processes available on a local or remote system. Its main purpose is to operate on more than one service other than the \"sc\" which only can handle one service at time. There is also a simple plug-in interface available that notifies the loaded plugins of any action that is performed by the restarts application. Its not published yet, but in future it will. It also has very usefull functions like arp, dns, ping and network query functions for checking remote systems availablity and comes with lots of powerfull and usefull commands like killing/creating processes, services, query processes locally and remote. Has a simple, yet very usefull scripting interface and lots of other powerfull thigs like user context switch, process/user token privilege enabling, configuration registry values editor. Supports operating system level commands like reboot, shutdown, logoff, hibernate, suspend, etc,.... Runs starting at Windows 2000 and higher with Microsoft .NET 2.0 Framework. Check it out, you will like it and you will ureally use it every day, since it will ease the handling of service handling/controlling process, especially with the *.restarts files, that will process series of commands inside a file with a single click!",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1><b>restarts - The powerful alternative to SC Command</b></h1>\r\nrestarts.exe - Restarts Windows System Services<br />License: GNU/GPL 3<br />Contact: Kerem G&#252;mr&#252;kc&#252; &lt;kerem.g@arcor.de&gt;<br /><br /><br />First read the License! Its GNU/GPL3! If you dont <br />have it or cant find it with this application see here:<br />http://www.gnu.org/licenses/gpl.html<br /><br /><br /><img src=\"http://www.pro-it-education.de/software/restarts/restarts.jpg\" /><br /><br /><br /><b><u>REREQUISITES:</u></b><br /><br />Windows NT based Operating System starting at <br />Windows 2000, Microsoft .NET Framework 2.0 or higher<br />Administrative User Context (Administrator) for <br />most of the Tasks. Some can even be done by Standard<br />Users, like Service and Process Queries. Impersonation<br />into another user context is possible from less powerful<br />to more powerful user context.<br /><br /><br /><b><u>PURPOSE:</u></b><br /><br />The &quot;restarts&quot; application is a very powerful windows service<br />controlling software from which you can restart, stop, start, <br />delete, create, query, etc,...remotely and locally. It comes with<br />lots of handy commands and many many functions on windows<br />services. Type &quot;restarts -help&quot; at the command prompt to get <br />detailed help on it.<br /><br /><b><u>FEATURES:</u></b><br />\n<ul><li>control local and remote services in any way like, enable, disable, start, stop, etc,...</li>\n<li>create or delete local or remote services</li>\n<li>list local and remote Services and Processes</li>\n<li>query detailed local and remote Process and Service Information</li>\n<li>kill or start local and remote processes and services</li>\n<li>can load script files to process multiple commands like a batchfile</li>\n<li>file association with &quot;*.restarts&quot; files to process their content</li></ul>\n  by simply clicking them. See &quot;restarts -sh&quot; for more info.\n<ul><li>imerpsonate from less powerful account into another account with user credentials </li></ul>\n  to execute commands which need more access rights\n<ul><li>logon and impersonate on local or remote systems</li>\n<li>open registry keys from command line</li>\n<li>application registry configuration editor or open registry key in registry editor directly</li>\n<li>invoke operating system level command like, logoff, reboot, shutdown, etc,..</li>\n<li>get networking information from local system, send ping, arp, dns requests to hosts</li>\n<li>and lots of other interesting functions,...</li></ul>\n<br /><b><u>FUTURE PLANED:</u></b><br /><br />-PlugIn System to handle Service Events<br />  <br />  <br /><b><u>BUGS:</u></b><br /><br />Not really a bug but a advise: Not all Commands<br />can be executed on a remote system and Remote System<br />must have running the &quot;remoteregistry&quot; Service to<br />get access from restarts.exe to the remote system.<br />Simply type &quot;restarts remoteregistry&quot; (on the remote system!!!)<br />to start the service on the remote system or enable it <br />on the remote system. <br /><br /><br />If you have questions feel free to contact me: <br />kerem.g@arcor.de<br /><br />Please also report any bugs to me and for sure<br />improvement suggestions!<br /><br /><br />Have fun!<br /><br /><br />Regards<br /><br />Kerem Gmr&#252;kc&#252;<br /><a href=\"mailto:kerem.g@arcor.de\">kerem.g@arcor.de</a><br /><br /><br /><br /><br /><br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Debjit_01,",
  "LastEdited": "2009-12-11T05:29:38.77-08:00"
}