{
  "ProjectName": "rhyduino",
  "Title": "Rhyduino - Arduino and Managed Code",
  "Description": "Rhyduino makes it easy for Visual Studio / Windows devs to control the Arduino using a computer. It's like supercharging your Arduino with all the horsepower of your PC. Using XBees, they don't even have to be physically connected to each other. It's kick ass! Written in C#.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Introduction</h1>\rRhyduino is a managed component that implements the Firmata v2.1 protocol to communicate with and control a device via a serial communication channel. Theoretically, it can control any device implementing the Firmata v2.1 protocol, but this project focuses on the Arduino Duemilanove because (1) the Arduino IDE ships with a number of different Firmata sketches (Arduino apps), and (2) because the Duemilanove is the predominant Arduino device. <br /><br />The initial Rhyduino release (v1) has been tested with the SimpleFirmata.pde sketch running on Arduino Duemilanove and Uno hardware. The SimpleFirmata.pde sketch used is the one provided with v21 of the Arduino IDE (the Uno release). <br />\n<ul><li><a href=\"http://rhyduino.codeplex.com/releases/view/46531\">Rhyduino Release Page</a></li></ul>\n\n<h1>How is it being used?</h1>\r\nThe precompiled versions of the library report anonymous usage statistics back to the CodePlex server. You can see how people are using the code by clicking on the <a href=\"http://rhyduino.codeplex.com/stats\">View Detailed Statistics</a> button on the right. I activated this tracking today (17-Nov-2010) and it will probably take a few days before the server has any useful data, so please be patient. As interesting information is revealed, I will summarize and post it here.<br />\n<h1>Future Direction</h1>\r\nThis is the working list of features that I will be integrating into the product (in no particular order):\n<ul><li>I2C implementation</li>\n<li>Caching of Arduino state to FLASH or EEPROM.</li>\n<li>Designing and implementing a protocol for reading and writing to the Arduino&#39;s non-volatile RAM locations. This involves extending Firmata so it&#39;s not high on my list of priorities, but priorities tend to change quickly as the global landscape changes, so <i>let me know if it&#39;s something you want to see</i>.</li>\n<li>Redesign of Rhyduino as a MS Robotics Developer Studio service.</li>\n<li>Core library redesign to enable customizable board software templates (to support other Arduino/clone devices).</li></ul>\n \n<h1>How to Help</h1>\rThere are several areas that I could use help in. I could always use feedback from people reviewing the code and generally playing with it. Any feedback you have is helpful, positive or negative. If you&#39;d like to take a more formal role in the project, look at the <a href=\"https://rhyduino.codeplex.com/wikipage?title=How%20to%20Help&referringTitle=Home\">How to Help</a> page to learn more.<br />\n<h1>Frequently Asked Questions</h1>\rIf you&#39;d like to see what other&#39;s are asking, look at the <a href=\"https://rhyduino.codeplex.com/wikipage?title=Frequently%20Asked%20Questions&referringTitle=Home\">Frequently Asked Questions</a> page.<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,Visual Studio,robotics,MSRDS,arduino,Visual Studio 2010,Robotics Studio,Rhyduino,Firmata,remote control,xbee,duemilanove,atmega,usb,serial,wireless,embedded,embedded system,simple,.NET 4.0,.net,",
  "LastEdited": "2010-11-17T08:21:58.333-08:00"
}