{
  "ProjectName": "RibbonExplorer",
  "Title": "Windows 7 Ribbon Explorer",
  "Description": "A win7 application which takes a ribbon markup (XML) and shows the resulting ribbon. The application compiles the Ribbon XML, (UICC.exe, RC.exe Link.exe). loads it and instantiate a window with the resulting Ribbon. The application controls the Ribbon and shows the Ribbon events.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rA win7 application which takes a ribbon markup &#40;XML&#41; and shows the resulting ribbon. The application compiles the Ribbon XML, &#40;UICC.exe, RC.exe Link.exe&#41;. loads it and instantiate a window with the resulting Ribbon. The application controls the Ribbon and shows the Ribbon events.<br />\n<h2>Non-Functional Requirements</h2>\r1.\tRun on Windows 7<br />2.\tBased on Windows 7 SDK and Win32 API with ATL, but with no other framework like MFC.<br />3.\tVisual Studio 2008 SP1<br />\n<h2>Features:</h2>\r<ol><li>Read a Ribbon markup file which its full path is provided in the first argument of the command line.</li>\n<li>Enable editing of the supply XML file, or a new XML file</li>\n<li>Show the Ribbon XML, in an editor</li>\n<li>Open/Save/Close of Ribbon XML file</li>\n<li>Compile the XML file into a Dynamic Library that contains the Ribbon resources</li>\n<li>Show the compilation output text in a read only text window (Tab)</li>\n<li>Show the resulting resource file text in a read only text window (Tab)</li>\n<li>Show the resulting header file text in a read only text window (Tab)</li>\n<li>Load the result Dynamic Link Library and show the Ribbon</li>\n<li>Display a Ribbon for managing the created Ribbon</li>\n<li>Set the various Application Modes</li>\n<li>Show the various popup menus and mini-toolbars</li>\n<li>Show the various contextual tabs</li>\n<li>Invalidate a property of a Ribbon command</li>\n<li>Set directly a property of a Ribbon command</li>\n<li>Change Ribbon Colors</li>\n<li>Save &amp; Load the Ribbon (QAT/Minimized) state</li>\n<li>Display the Ribbon callback method calls and the property key/property variant values     (  <i>partially implemented</i> )</li>\n<li>Use a resource from executable or dynamic link library as the ribbon source for the application, for example show the ribbon of Paint    (  <i>not implemented yet</i> )</li></ol></div><div class=\"ClearBoth\"></div>",
  "TagList": "Ribbon; Windows 7,",
  "LastEdited": "2009-08-20T06:25:52.943-07:00"
}