{
  "ProjectName": "RoundedGroupBox",
  "Title": "Winforms Rounded Group Box Control",
  "Description": "Rounded Group Box - A Grouping control with Rounded Corners, Gradients, and Drop Shadow",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Rounded Group Box - A Grouping control with Rounded Corners, Gradients, and Drop Shadow<br /><br /><img src=\"http://www.staffinder.net/carbisoft/images/roundedgroupbox.gif\" /><br /><br /> I created this control due to a lack of good grouping controls in Visual Studio. I was tired of the usual single line frame control that&#39;s been around for years so I came up with this replacement.  The standard Label control also lacks the ability to change the border color so this is an excellent replacement when you need to spice up a page.<br /><br />Visit my site at <a href=\"http://www.staffinder.net/carbisoft\">http://www.staffinder.net/carbisoft</a> to see more of my free controls.<br /><br />The RoundedGroupBox supports many properties to adjust the Visual layout...<br /><br />    <b>BackgroundColor / BackgroundColorGradient</b> - These properties allows you to create a gradient pattern inside the frame by blending one color to the other.<br />    <b>BackgroundGradientMode</b> - Sets the type of gradient to use (Vertical, Horizontal, Diagonal, None)<br />    <b>Caption</b> - The text to appear in the caption area<br />    <b>CaptionAlignment</b> - Set the Justification of the caption text (Left, Right, Center)<br />    <b>Corners</b> - This property allows you so specify which corners to round.  You can specify any variation you like or turn them off to simulate a label control.<br />    <b>CornerRadius</b> - Set the size of the corner radius<br />    <b>CaptionBackColor</b> - Sets the background color of the caption bar. Set it to transparent to let the background show.<br />    <b>CaptionHeight</b> - Sets the height of the caption bar<br />    <b>CaptionVisible</b> - Shows or hides the caption bar<br />    <b>DropShadowThickness</b> - The thickness of the drop shadow<br />    <b>DropShadowVisible</b> - Shows or hides the drop shadow<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-03-14T14:02:48.927-07:00"
}