{
  "ProjectName": "rte",
  "Title": "RTE (Rich Text Editor) ASP.NET Control",
  "Description": "Self contained Rich Text Editor ASP.NET ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>NOTE: The <a href=\"http://ajaxcontroltoolkit.codeplex.com\">AJAX Control Toolkit</a> contains an HTML Editor that is more mature than this project.</h1>\r\nThe key feature of the RTE is to support <b>WYSIWYG</b> along with the following generic feature set below. The key goal has been to encapsulate all the complex functionality of web based rich text editing into a single control. <br /><br />All that you need is to drop the control dll into your bin directory, and include a single tag like <b>&lt;cc1:RichTextEditor ID=&quot;Rte1&quot; Theme=&quot;Blue&quot; runat=&quot;server&quot; /&gt;</b> to get the full rich text editor working on your page!. You can use the Culture attribute to set it for use with other supported languages listed below.<br /><br /><b>Download:</b> If you&#39;re wanting to download the latest stable bits, use the &quot;Releases&quot; tab, and if you want to get the latest source code bits, check out the &quot;Source Code&quot; tab.<br /><br /><b>Supported Browsers:</b> Internet Explorer and FireFox<br /><b>Live demo:</b> See this Rich Text Editor in action at the <a href=\"http://rteditor.members.winisp.net/\">live demo site!</a><br /><b>Supported Styles / Formats:</b> Bold, Italic, Underline, Justify, indentations, Plain Lists, Numbered Lists<br /><b>Supported Commands:</b> Copy, Paste, Cut, Add Hyperlink, Set Foreground Color, Set Highlight Color, Set Fonts, Set Font Sizes, Insert Smiles<br /><b>Supported Views:</b> Text View, Html View<br /><b>Localization:</b> Supported Languages include en-us, cs-cz, es-es, de-de, fr-fr, it-it, ja-jp, ko-kr, pt-br, ru-ru, zh-cn, zh-hk, zh-tw<br /><br /><img src=\"/projects/rte/7620d741-8bc6-4b70-94fd-1ff0342dbd8d\" alt=\"Rte.png\" title=\"Rte.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,Controls,favorites,Editor,RTE,webcontrols,Text Editors,Rich Text Editor,RT editor,edit,DLL,WYSIWYG,yorkrj,ASP.net Rich Textbox,RTE control,RTE (Rich Text Edito,",
  "LastEdited": "2012-01-24T13:03:41.367-08:00"
}