{
  "ProjectName": "scheduler",
  "Title": "Silverlight Scheduler Control",
  "Description": "The scheduler allows users to visualize appointments like in MS Outlook.\r\nThe project is developed in Silverlight.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\r\nThe scheduler allows users to visualize appointments like in MS Outlook.<br />The project is developed in Silverlight.<br />\n<h1>Views</h1>\r\nThere are two main views to visualize your appointments. Firstly the calendar view and secondly the timeline view. <br />These views are further seperated into day, workweek and full week views.<br />\n<h2>Calendar view</h2>\r\n<img src=\"http://download.codeplex.com/download?ProjectName=scheduler&amp;DownloadId=235980\" /><br />\n<h2>Timeline view</h2>\r\nThe timeline view is also known as resource-view.<br />Appointments can be grouped and displayed in rows, so you can easily compare them. <br />You can choose what rows are visible and you can also reorder them.<br /><br /><img src=\"http://www.codeplex.com/download?ProjectName=scheduler&amp;DownloadId=236155\" /><br />\n<h1>Appointments</h1>\r\nTo display your objects in the scheduler you must provide a List with objects that inherit from the interface <i>IAppointment</i>.<br />This interface enforces you to implement the following properties:\n<ul><li>Begin</li>\n<li>End</li>\n<li>Background</li>\n<li>Header</li>\n<li>Description</li>\n<li>GroupingMember (used to group the appointments in the timeline view)</li></ul>\n\n<h1>Context menu</h1>\r\n<img src=\"http://www.codeplex.com/download?ProjectName=scheduler&amp;DownloadId=225431\" /><br /><br />The context menu allows you to set ... \n<ul><li>the interval, </li>\n<li>the starttime or </li>\n<li>the endtime  (used to only display appointments between 7:00 and 19:00 for example)</li></ul>\n... of the scheduler. <br />It also contains menuitems to copy, delete or paste items. But the logic for clipboard isn&#39;t implemented in the scheduler itself, it only fires events when these menuitems are clicked.<br /><br />There are also checkboxes to auto-size the interval-width to avoid scrollbars. So you can see all appointments for a whole week at once for example.<br />This feature is also available for the rowheight, so if you compare 10 rows for example, you don&#39;t have to scroll.<br />\n<h1>Additional</h1>\r\nAs this is my first custom control, I&#39;m sure there are some things which can be done much better. So I would be glad if you could give me feedback on such things.<br />And as this is a very first release, the code isn&#39;t very clean and tidied up, this will be one of my next steps ;)<br /><br />Further steps are to implement the calendar view and to implement a function, that allows you to assign holidays.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Scheduler,Calendar,Timeline,Week,Date,",
  "LastEdited": "2011-05-05T04:51:39.887-07:00"
}