{
  "ProjectName": "scs",
  "Title": "Source Control Selector",
  "Description": "This project aims to address a very basic problem of developers using Visual Studio: Forcing VS to select the correct Source Control Provider.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\n<br>\r\nThis project aims to address a very basic problem of <strong>developers using Visual Studio</strong>: Forcing VS to select the correct Source Control Provider based on the currently opened solution.</p>\r\n<p><strong>How It Works</strong></p>\r\n<ol>\r\n<li>The program is fed a Visual Studio Solution (.sln) file path, either through a file browser window or as a command-line argument\r\n</li><li>The program then scans the solution's folder, going up the folder tree until it detects a folder / file specific to a certain source-control provider (for ex. a .hg folder means the project is hosted on Mercurial)\r\n</li><li>The program then edits the Windows Registry, setting Visual Studio's current Source Control Provider as the detected source control provider\r\n</li><li>Visual Studio is then started with the selected solution as the currently open solution.\r\n</li></ol>\r\n<p><strong>Features</strong></p>\r\n<ul>\r\n<li>Scan the project's folder to detect source-control specific files &amp; folders (for ex. .hg, .svn etc.)\r\n</li><li>Allow the user to select the solution being started </li><li>Allow passing of command-line arguments (such as the .sln path) which will allow scripting\r\n</li><li><em>Generate shortcuts for a selected solution which would start the Source Control Selector with the solution as an argument, automatically selecting the right SC provider and then starting Visual Studio with the specified solution (In Work)</em>\r\n</li><li><em>Configurable provider IDs (In Work)</em> </li><li><em>Configurable provider recognition patterns (In Work)</em> </li></ul>\r\n<p><strong>Future development directions</strong></p>\r\n<ul>\r\n<li>Extensible Visual Studio Support (extracting direct dependencies on current Visual Studio version)\r\n</li></ul>\r\n<p>Any ideas that anyone might have, please share them in the <a title=\"Source Control Selector Discussions\" href=\"https://scs.codeplex.com/discussions\" target=\"_blank\">\r\ndiscussion </a>board.</p>\r\n<p><strong>Note</strong></p>\r\n<p>The current code base contains a lot of hardcodings, as I have initially created this just for me, and later decided to make it open-source in case it proves useful for anyone else. If you want to be a contributor, just create a fork and then send me a pull\r\n request.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-07-01T23:31:00.533-07:00"
}