{
  "ProjectName": "sdae",
  "Title": "SetDefaultAudioEndpoint",
  "Description": "SetDefaultAudioEndpoint (Set Default Audio Endpoint) allows users to set the default audio playback device using computer code. The solution opens the Sound Control Panel and uses the Microsoft UI Automation accessibility framework to make changes.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Downloaders!</b> Please give feedback on this project! How you&#39;re using it. How it works for you. Code quality. Feature requests. Anything! No need to register with CodePlex. Send comments to SetDefaultAudioEndpoint roundabout gmail.com. (Roundabout probably should be an &quot;at&quot; sign there. :)<br />\n<h1>Project Description</h1>\rSetDefaultAudioEndpoint (Set Default Audio Endpoint) allows you to set the Windows system default audio playback device using computer code. <br />\n<h1>Need</h1>\rConsider a computer that serves as a workstation and a Home Theater PC (HTPC). When using the computer as a workstation, you may wish to have audio played back through the computer&#39;s speakers output. When using the computer as a HTPC, you may wish to have audio played back through the computer&#39;s digital output or HDMI output, perhaps connected to a surround sound receiver. Windows 7 allows audio playback through only one output device at a time. Thus, the audio playback must be switched between the computer&#39;s speaker output and the digital or HDMI output.<br /><br />The only way to change the default audio playback device in Windows 7 is to use the Sound control panel. To access the Sound control panel, search for <b>Manage audio devices</b> from the Windows 7 start orb. Or, right-click on the &quot;speaker&quot; icon in the Windows system tray, and then click <b>Playback devices</b>.<br /><br /><img src=\"/projects/sdae/fb32c1d8-b44e-4557-8eab-50bbbefc499a\" alt=\"SoundControlPanel.jpg\" title=\"SoundControlPanel.jpg\" /><br /><br />We think switching between outputs like this is tedious. There has got to be a better way.<br />\n<h1>Approach</h1>\rWe have created a computer program that can automatically make changes on the Sound control panel window. The program can be executed using the Windows command line, scripting language (such as VBScript), or any .NET language. Creating a Windows Desktop shortcut to execute the program is a recommended method.<br /><br />We use the Microsoft UI Automation accessibility framework to control the Sound control panel.<br />\n<h1>Benefits</h1>\rOnly the Microsoft .NET 3.5 framework is used. After that requirement is met, nothing else needs to be installed on your system.<br /><br />The solution is Free Open Source Software; &#39;nuff said.<br />\n<h1>Competition</h1>\r&quot;Hotkey&quot; applications, such as <a href=\"http://www.autohotkey.com/\">AutoHotKey</a>. This approach requires a computer program to check if you have pressed a certain combination of keys. The computer program must always be running, and uses your computer&#39;s resources continuously, even though it is needed for only a few seconds.<br /><br /><a href=\"http://sourceforge.net/projects/vachanger/\">Vista Audio Changer</a> may be a solution, but we have not researched it. The project appears to be abandoned.<br /><br /><a href=\"http://software.muzychenko.net/eng/vac.htm\">Virtual Audio Cable</a> may be a solution, but it is complex, and is not free or open source.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Windows,sound,HTPC,Audio,",
  "LastEdited": "2011-03-22T20:46:44.957-07:00"
}