{
  "ProjectName": "seqcos",
  "Title": "Sequence Quality Control Studio (SeQCoS)",
  "Description": "Sequence Quality Control Studio (SeQCoS) is an open source .NET software suite designed to perform quality control (QC) of massively parallel sequencing reads. It includes tools for evaluating sequence and base quality of reads, as well as a set of basic post-QC sequence manipulation tools. SeQCoS was written in C# and integrates functionality provided by .NET Bio and Sho libraries.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Sequence Quality Control Studio (SeQCoS) is an open source .NET software suite designed to perform quality control of massively parallel sequencing reads. <br />\n<h1>News</h1>\r * Dec. 19, 2014 - SeQCoS has migrated from TFS version control to Git<br /> * <b>Dec. 15, 2014</b> - Due to time constraints, I have not been developing this project since 2012. If you would like to help contribute to SeQCoS, feel free to <a href=\"https://www.codeplex.com/site/users/view/kch\">contact me</a>.<br /> * Nov. 9, 2011 - SeQCoS featured on <a href=\"http://blogs.msdn.com/b/msr_er/archive/2011/11/09/building-a-net-quality-control-tool-for-next-generation-sequencing-technologies.aspx\">Microsoft Research Connections Blog</a><br />\n<h1>Project Description</h1>\r\n<ul><li>SeQCoS generates a series of standard plots to illustrate the quality of the input data. These plots (saved in JPEG file format) provide information on commonly observed measurements, such as GC content and distribution of quality scores at position-specific and sequence-specific levels.</li>\n<li>Basic trimming and discarding functions are provided to manipulate sequence files, according to:\n<ul><li>Minimum read length; or</li>\n<li>Minimum base quality score; or</li>\n<li>Pattern matching by regular expression</li></ul></li>\n<li>(Experimental) As an optional step, SeQCoS can invoke NCBI BLAST (standalone blast+ toolkit) to search the input against a BLAST-formatted database. A pre-formatted database of <a href=\"http://www.ncbi.nlm.nih.gov/VecScreen/UniVec.html\">NCBI UniVec</a>, a repository of vector sequences, adapters, linkers and PCR primers that are used in DNA sequencing, is provided <a href=\"http://seqcos.codeplex.com/wikipage?title=Pre-formatted%20BLAST%20Databases\">here</a>; however, users are free to supply their own database for searching.</li></ul>\n<br />SeQCoS was written in C# using .NET 4.0. One of the goals of this project was to develop an application that integrates with the <a href=\"http://bio.codeplex.com\">.NET Bio</a>, an open-source bioinformatics library. Hence, this application takes advantage of functionality offered by .NET Bio for handling sequence data as well as <a href=\"http://research.microsoft.com/en-us/projects/sho/\">Sho</a>, a data analysis and visualization application. The SeQCoS GUI was developed using Windows Presentation Foundation 4.0. <br /><br /><blockquote><blockquote><img src=\"/projects/seqcos/6ab3fb3b-f7bd-461d-8dc9-09d19ec3bd55\" alt=\"Seqcos_main.sm.jpg\" title=\"Seqcos_main.sm.jpg\" /></blockquote></blockquote>\n<h3>Formats Supported</h3>\rCurrently, the input and output formats supported by SeQCoS are limited to FASTA and FASTQ. For FASTA, only sequence-level analysis is performed. Future support for other sequence formats (e.g. BAM/SAM) are planned.<br />\n<h3>System requirements</h3>\r * Windows 7 or newer (older versions of Windows should work but has not been tested)<br /> * <a href=\"http://www.microsoft.com/net/\">Microsoft .NET 4.0</a><br /> * <a href=\"http://research.microsoft.com/en-us/projects/sho/\">Sho 2.0.5</a> or higher (tested on 2.0.5)<br /> * <a href=\"http://www.ncbi.nlm.nih.gov/books/NBK52637/\">Standalone blast+</a> (NCBI Blast for Windows) - required for executing BLAST searches, otherwise it is optional<br /> * 4 GB RAM or more<br />\n<h3>Availability</h3>\rSee <b><a href=\"http://seqcos.codeplex.com/releases\">Downloads</a></b> for the latest release or view the <a href=\"http://seqcos.codeplex.com/SourceControl/list/changesets\">Source Code</a>.<br />\n<ul><li><a href=\"http://seqcos.codeplex.com/wikipage?title=Pre-formatted%20BLAST%20Databases\">Download</a> UniVec pre-formatted BLAST databases</li></ul>\n\n<h3>Support</h3>\rPlease visit the <a href=\"https://seqcos.codeplex.com/documentation?referringTitle=Home\">Documentation</a> page for more info. Please report any bugs using the <a href=\"http://seqcos.codeplex.com/workitem/list/basic\">Issue Tracker</a>.<br /><br />\n<hr />\n<h2>About</h2>\r\nSeQCoS was written by Kevin Ha, currently a PhD candidate in the Department of Molecular Genetics, University of Toronto, Toronto, Canada.<br /><a href=\"http://www.google.com/recaptcha/mailhide/d?k=015aecx7ECylEwVgnTEhv1zg==&amp;c=VfD5Qi_wqo1t2U2X_uhg3zRM5BcpSawxYA-69EUnSxA=\">E-mail (requires reCAPTCHA)</a><br /><br />The SeQCoS project was initiated by the Microsoft Biology Initiative group. Kevin started and developed the project while interning at Microsoft Research (Redmond, WA) in the summer of 2011. SeQCoS is an open source project licensed under Apache 2.0 (see <a href=\"http://seqcos.codeplex.com/license\">License</a>).</div><div class=\"ClearBoth\"></div>",
  "TagList": "Bioinformatics,Sequence analysis,Quality Control,",
  "LastEdited": "2014-12-19T06:57:30.407-08:00"
}