{
  "ProjectName": "SequenceSplitter",
  "Title": "Pageload optimizing, lazy loading, splitting the pageload n loading sequentially",
  "Description": "This is a control, helps splitting the  page and loads the same sequentially. \n\nThus, Sequence splitter control helps splitting the loading duration for a page and sequences them. Its provides a way to slice the complete loading duration into multiple chunks and thus allowing the page to load in steps. Thus it reduces the initial loading duration and enhances user experience. Apart from dividing the entire load duration into chunks, this also allows to set priorities for each chunk. So that the page is initially loaded with primary content and following which, the remaining portions of the page is loaded sequentially. \nThe concept behind the control is to create small chunks from the entire page content and load them in a sequential manner. Each of these chunks would be assigned a load order or a priority value, based on which the loading of the content would be ordered. Therefore, each time a chunk is loaded, page makes a new request to load next chunk. This process continues until the last chunk of lowest priority is rendered in the page.\n\nVisit [url:this|http://www.codeplex.com/SequenceSplitter/SourceControl/FileView.aspx?itemId=227565&changeSetId=6191] for a step by step guide and more information on using SequenceSplitter.\n\nVisit [url:this|http://www.codeplex.com/SequenceSplitter/SourceControl/FileView.aspx?itemId=227564&changeSetId=6191] for a detailed example on SequenceSplitter.\n\nRefer chm file included as part of the source code for help on SequenceSplitter APIs.\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Sequence splitter control helps splitting the loading duration for a page and sequences them. Its provides a way to slice the complete loading duration into multiple chunks and thus allowing the page to load in steps. Thus it reduces the initial loading duration and enhances user experience. Apart from dividing the entire load duration into chunks, this also allows to set priorities for each chunk. So that the page is initially loaded with primary content and following which, the remaining portions of the page is loaded sequentially. <br />The concept behind the control is to create small chunks from the entire page content and load them in a sequential manner. Each of these chunks would be assigned a load order or a priority value, based on which the loading of the content would be ordered. Therefore, each time a chunk is loaded, page makes a new request to load next chunk. This process continues until the last chunk of lowest priority is rendered in the page.<br /><br />Visit <a href=\"http://www.codeplex.com/SequenceSplitter/SourceControl/FileView.aspx?itemId=227565&amp;changeSetId=6191\">this</a> for a step by step guide and more information on using SequenceSplitter.<br /><br />Visit <a href=\"http://www.codeplex.com/SequenceSplitter/SourceControl/FileView.aspx?itemId=227564&amp;changeSetId=6191\">this</a> for a detailed example on SequenceSplitter.<br /><br />Refer chm file included as part of the source code for help on SequenceSplitter APIs.</div><div class=\"ClearBoth\"></div>",
  "TagList": "load balancing,lazy loading,load optimizing,sequencial loading,partial loading,asynchronous loading,ajax,step by step loading,",
  "LastEdited": "2008-10-20T09:50:04.01-07:00"
}