{
  "ProjectName": "SGBControls",
  "Title": "SGB Controls",
  "Description": "SGB Controls is a set of standard .net controls that include a number of enhancements to make life easier for the developer.\r\n\r\nThese controls include a number of enhancements over the standard controls and introduce a number of new controls not yet shipped with the .net framkework",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />SGB Controls is a set of standard .net controls that include a number of enhancements to make life easier for the developer.<br /><br />These controls include a number of enhancements over the standard controls and introduce a number of new controls not yet shipped with the .net framkework<br /><br />The project includes a number of enhancements to the standard controls that currently ship with the .net framework and will in the very near future include a number of new controls that are missing from the .net framework standard library of controls.<br /><br /><b>Current Version:</b>  0.4 Alpha <a href=\"https://sgbcontrols.codeplex.com/wikipage?title=Whats%20new&referringTitle=Home\">Whats new</a> | <a href=\"https://sgbcontrols.codeplex.com/wikipage?title=Whats%20Next&referringTitle=Home\">Whats Next</a><br /><br />I am currently propsing to update this project on a weekly basis until all the stanadard controls are working just as they do in the .net framework and then add on new controls.<br /><br /><b>Why more controls, there are loads out there at the moment?</b><br /><br />This is very true and i am sure there are libraries out there that are \\ will be much better than this library, however, i have very clear needs in my current business and the .net controls just do not provide these needs, so its much easier for me to right a control library that provides these needs and share them with the community.<br /><br /><b>So what does the library currently offer as of version 0.4 Alpha?</b><br /><br />The library currently offers only 2 extended controls and one new control.<br />\n<ul><li><a href=\"https://sgbcontrols.codeplex.com/wikipage?title=SGBTextBox&referringTitle=Home\">SGBTextBox</a> (<i>extended TextBox</i>)</li>\n<li><a href=\"https://sgbcontrols.codeplex.com/wikipage?title=SGBListBox&referringTitle=Home\">SGBListBox</a> (<i>exnteded ListBox</i>)</li>\n<li><a href=\"https://sgbcontrols.codeplex.com/wikipage?title=SGBEditStyleController&referringTitle=Home\">SGBEditStyleController</a> (<i>New control handles the painting of all edit based controls</i>)</li>\n<li><a href=\"https://sgbcontrols.codeplex.com/wikipage?title=SGBBaseControl&referringTitle=Home\">SGBBaseControl</a> is the control all controls are inherited from.</li></ul>\n<br /><b>What do you plan to implement and when?</b><br /><br />I plan on implementing all controls that are on the common controls list \\ tab of the toolbox by the end of April 2010 and resolve any issues reported by users, assuming anyone downloads this ;-).<br /><br />After April i will then work on making sure that the controls work on all version of the .net framework and if a version of the .net framework dosn&#39;t support a certain feature, ensure that is implemented so the controls work on all versions of the .net framework from 2.0.<br /><br /><b>What version of the .net framework will \\ do you support</b><br /><br />I only plan on support the .net framework 2 and above.  Currently the library is geared towards .net 3.5 and has not yet been tested on 2.0 or 3.0, however, if there is enough requests, i will take a little time to port it to lower frameworks if there are any issues.<br /><br /><b>Documentation</b><br /><br />Although i am an absolute stickler for documentation, i really don&#39;t like the way in which documentation is wrote on this site, primarily because i dont have the time to learn the wiki language.  I have tried my best to make the documentation as readable as possible and user friendly, but please do not hesitate to contact me if you find issues, spelling mistakes, missing links etc etc.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Controls,Library,Button Style,TextBox,ListBox,Styles,",
  "LastEdited": "2010-04-07T04:02:10.337-07:00"
}