{
  "ProjectName": "SharePointCSVImporte",
  "Title": "SharePoint Silverlight CSV Importer",
  "Description": "Convert .csv data into SharePoint list items.  A slick Silverlight control  to map and import a .csv files to a sharepoint list.  Includes transforms and keys.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>I had a need by several customers to routinely import .csv into a SharePoint list (BCS not an option).&nbsp;&nbsp;Both customers wanted to have capability to clean/modify data in .csv prior to any SharePoint import.&nbsp; The output in the .csv isn't always\r\n the same so they needed the ability to manage configuration(s).</p>\r\n<p><br>\r\nSo I created this SharePoint Silverlight CSV importer to parse a coma deliminated file and insert or update records in a list.\r\n<br>\r\nKey Features:</p>\r\n<ul>\r\n<li>Parse large files (uses lists.asmx and batches updates since max per update is 160 items).\r\n</li><li>Configure mapping of csv column to sharepoint list </li><li>Supports csv values with commas in quoted strings. </li><li>Identification of keys in csv and options to delete duplicate records. </li><li>export and&nbsp;import of mapping configuration </li><li>optional configuration of column rules/transformations, string replace, lookup replace, external lookup replace (get lookup values from list based on .csv column filter)\r\n</li><li>Solution is&nbsp; Silverlight .xap.&nbsp; No server configuration needed or deployment of solution, just upload the .xap and reference in Silverlight viewer.\r\n</li><li>Error output - to manually handle what the importer cannot import. </li></ul>\r\n<p>For those who crack open the code, I know it's a little messy, I haven't refactored yet.&nbsp; It does the job though.. UI isn't anything special either.</p>\r\n<p>Note:&nbsp; All scenarios I've used this were from .csv's that have a column&nbsp;header first line.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "SharePoint,Silverlight,CSV Import,CSV Parse and Import,SharePoint CSV,CSV,import,",
  "LastEdited": "2013-06-28T09:54:08.463-07:00"
}