{
  "ProjectName": "sharepointwp7",
  "Title": "Windows Phone 7 SharePoint Tool Kit",
  "Description": "Provides a set of tools and controls to allow you to build Windows Phone 7 Silverlight Applications against a SharePoint backend.  Requires that SharePoint be configured for Forms Based Authentication",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">The Windows Phone 7 SharePoint Tool Kit project will allow you to build Silverlight applications (both in Windows Phone 7 and the Desktop) that will do the following:<br />\n<ol><li>Authenticate against a SharePoint server configured to use Forms Based Authentication</li>\n<li>Download, filtered and sorted lists</li>\n<li>Display an auto generated data-driven from for editing list data that is based upon the metadata as provided from SharePoint.</li></ol>\n<br />This version is code-complete and working for the first feature set, but needs to be tested for edge-case scenario&#39;s.  <br /><br />To use this code base with your application, simply review the sample implementation and make sure you modify the following parameters on Common.cs in the library projects.\n<ol><li><b>WebId</b> - The unique identifier for the SharePoint web site you will be accessing.</li>\n<li><b>SiteAddress</b> - Full web address for your SharePoint server to include the name of the sub-site in the format <b>http<a href=\"https://sharepointwp7.codeplex.com/wikipage?title=%5bs%5d&referringTitle=Home\">&#91;s&#93;</a>://<a href=\"https://sharepointwp7.codeplex.com/wikipage?title=%5bWWW.YOURSITE.COM%5d&referringTitle=Home\">&#91;WWW.YOURSITE.COM&#93;</a></b></li>\n<li><b>SubWeb</b> - If you aren&#39;t connecting to the root web, you can put the path here.  Omit the opening forward slash</li>\n<li><b>Lists</b> - Upon startup of the application, the MetaData for the lists are downloaded from the server.  The names of the lists used in your application should populate this list.</li></ol>\n<br />The libraries that you download have default values that can be used as an example to work with your SharePoint server.<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "SharePoint 2010,Windows Phone 7,WP7,Silverlight,",
  "LastEdited": "2011-07-25T14:32:31.5-07:00"
}