{
  "ProjectName": "sharepointcache",
  "Title": "SharePoint Cache",
  "Description": "SharePoint Cache makes it easy to write performant and simple controls that present information from SharePoint data storages. It is inspired by MOSS Publishing Caching system and it doesn't interfere with it. It's meant to be its supplement and not its replacement.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">SharePoint Cache makes it easy to write performant and simple controls that present information from SharePoint data storages. It is inspired by MOSS Publishing Caching system and it doesn&#39;t interfere with it. It&#39;s meant to be its supplement and not its replacement.<br /><br />Features\n<ul><li>Enables automatic security trimming and caches security trimmed results</li>\n<li>Support Major/Minor versioning</li>\n<li>Result that is calculated from SharePoint objects can be any .Net type\n<ul><li>The only limitation is that it must be immutable (Because the same object is used across multiple threads), for example XslCompiledTrasform, String .....</li></ul></li>\n<li>Basic logging (Configuration.cs controls logging to ULS logs) - recomended to turn it off for performance reasons.</li>\n<li>Independant of MOSS Publishing System (<b>can be used on WSS only</b>) and can be used without interaction with it</li>\n<li>NLB agnostic</li></ul>\n<br />Impetus:<br />Author was frustrated with sealed internal classes from Microsoft.SharePoint.Publishing.dll and was convinced that he could do a more performant and elegant caching system. This system is centred on caching custom results that are calculated from SharePoint objects and not caching SharePoint objects. In that way your systems will be even faster because u can store whole HTML result that is calculated from data.<br /><br />I published source code for this project for the following reasons.\n<ul><li>To disable misunderstandings of how this system works</li>\n<li>To enable other people to join my cause and make a better system</li>\n<li>To report my bugs and to be able to debug my code</li>\n<li>There isn&#39;t a line in my code that writes to anything except ULS log file, so don&#39;t blame me for any damage</li>\n<li>To give me suggestions how to improve my system</li></ul>\n<br />If you have any ideas or suggestions, you can contact me on my <a href=\"mailto:axiom.maximus@gmail.com\">mail account</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Sharepoint,caching,cache,SharePoint 2007,Sharepoint caching,WebPart,WSS,WSS 3.0,wss caching,wss cache,dead,",
  "LastEdited": "2010-02-17T15:08:45.86-08:00"
}