{
  "ProjectName": "SilverBing",
  "Title": "Silverlight SDK for Bing",
  "Description": "The Silverlight SDK for Microsoft Bing provides a set of controls for Silverlight 3.0 that provide a rich user experience for consumption of Microsoft Bing search results in your Silverlight apps",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Welcome to the Silverlight SDK for Microsoft Bing. <br /><br />This SDK provides a working sample control for Silverlight 4 that implements all the features of two additional assemblies, which together provide a rich set of user experience for consumption of Microsoft Bing search results. <br /><br />The first component is a reusable framework extension to the Microsoft Silverlight Toolkit. This framework is designed to provide: \n<ul><li>Support controls for the sample Bing component </li>\n<li>A reusable view control toolkit for implementing and using some of the advanced data metaphors shown in the Bing search component. </li>\n<li>Components such as CloudView, TileView, BandCloudView and StackView can be used in any Silverlight application. All the controls in this assembly support theming and accessibility. All these controls are built on the same infrastructure as the Silverlight Toolkit Controls. </li></ul>\n<br />The second component is the Bing Silverlight service runtime itself - an assembly called Microsoft.Bing.Data. This assembly houses the service proxy for the Bing API, as well as a flexible interface contract for implementing search providers, and a concrete singleton implementation, called SearchEnvironmnent, for use in data binding and consuming results from Bing. <br /><br />The full documentation is available in the source tree in the /docs/help folder and can rebuild it through the provided Sandcastle project.<br /><br />See it at work on <a href=\"http://hostme.discoverbing.com/silverbing/index.html\">http://hostme.discoverbing.com/silverbing/index.html</a> <br /><br />The documentation is online at  <a href=\"http://hostme.discoverbing.com/silverbing/Help/Index.html\">http://hostme.discoverbing.com/silverbing/Help/Index.html</a><br /><br />Note:<br />To deploy and run the project successfully you need to provide a valid <a href=\"http://www.bing.com/developers\">AppID</a> at line 105 of SearchEnvironment.cs and recompile your XAP. Failing to do so will return a &quot;Client Error&quot;.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Bing,Silverlight,Silverlight controls,Silverlight Bing,silverlight 4,",
  "LastEdited": "2012-09-13T12:03:38.927-07:00"
}