{
  "ProjectName": "SimpleAJAXClockASP",
  "Title": "Simple Clock Control AJAX ASP",
  "Description": "This is a simple control that gives the date and time from the server, it has a great graphic level, the idea is to display the use of AJAX in ASP.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nThis is a simple control that gives the date and time from the server, it has a great graphic level, the idea is to display the use of AJAX in ASP.<br>\r\n<br>\r\n<br>\r\n<strong>[Espa&ntilde;ol]</strong></p>\r\n<p>Este proyecto tiene el objetivo de mostrar el uso de AJAX en ASP usando la fecha, la hora y un timer. No tiene un gran nivel gr&aacute;fico, la idea es que s&oacute;lo se vea el uso en c&oacute;digo dividido sin usar un mismo archivo mezclando script y presentaci&oacute;n.\r\n Se usa adem&aacute;s algo de CSS.<br>\r\nEste simple proyecto consta de un Control llamado ServerClockControl.ascx y de un WebForm para probarlo llamado WebForm1.aspx. Los controles deben tener la extensi&oacute;n &quot;ascx&quot; y la etiqueta Control en vez de Page al principio, esto es lo que mayormente\r\n diferencia un control de un WebForm.<br>\r\n<br>\r\n<strong>[Ingl&eacute;s]</strong>&nbsp;</p>\r\n<p>This project aims to demonstrate the use of AJAX in ASP using the date, time and a timer. Not a big graphic level, the idea is that you only see in code using split one file unused script mixing and presentation.&nbsp;It also uses some CSS.<br>\r\nThis simple project consists of a Control called ServerClockControl.ascx and to prove a WebForm called WebForm1.aspx. Controls must have the extension &quot;ascx&quot; and the label instead of Control Page at first, this is what most unlike a WebForm control.</p>\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Control Aspect:</p>\r\n<p><img src=\"http://www.codeplex.com/Download?ProjectName=simpleajaxclockasp&DownloadId=619205\" alt=\"Control Aspect:\" width=\"233\" height=\"131\" style=\"border:1px solid black\"></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2013-02-07T12:00:08.06-08:00"
}