{
  "ProjectName": "sitecollecmgmt",
  "Title": "SharePoint Site Collection User-Group Management Tool",
  "Description": "\"SharePoint Site Collection User-Group Management Tool\" helps SharePoint administrators, Support engineers and Application developers to maintain and control access permissions for users and groups on all the site collections available in the web applications.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">SharePoint support engineers, administrators and application developers frequently encounter incidents reported by users related to site access. Many a times these are as simple as the user not having adequate permissions on the site; and at the same time it must be acknowledged that this can prove to be a nightmarish challenge in those environments where security permissions are individually assigned to securable objects, breaking security inheritance from the parent site.<br /><br />Support Engineers/Application Developers: <br />SharePoint support engineers most of the time receive issues related to SharePoint is not accessible. This could happen due to lack of appropriate permissions. For resolving those types of issues, support engineers have to look at:<br /><br />1.\tSecurity permissions on the site/library/object that the user is not able to access.<br />2.\tSharePoint all users list to see whether the user is available in the list that has access. <br />/* Note: Access issues are dependent on permissions. For example: users included in the default Visitors group have only ‘Read’ permissions. */<br />3.\tSharePoint all groups list to see whether the group contains required users which ensure that users are available in the right group.<br />4.\tCheck what type of roles (like Full Control, Contribute, etc.) is assigned to a particular group. <br />5.\tCheck whether particular user has assigned to all required SharePoint groups.<br /><br />SharePoint Administrators: <br />Administrators have to maintain and control access permissions to all users and SharePoint groups for site collections. Administrators generally receive requests for doing following activities.<br /><br />1.\tCreate/Delete different SharePoint groups and assign appropriate roles to them.<br />2.\tAdd/Remove users to the appropriate SharePoint groups.<br />3.\tAdd/Remove roles to the appropriate SharePoint groups.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-06-07T02:40:21.283-07:00"
}