{
  "ProjectName": "smartsense",
  "Title": "SmartSense",
  "Description": "SmartSense is a wearable holographic gesture and voice controlled intelligent system.\r\nHuman-computer interaction (HCI) is a heavily researched area in today’s technology driven world. Most people experience HCI using a mouse and keyboard as input devices. We wanted a more natural way to interact with the computer that also allows instant access to information. We are developing a real-time system that is always on and available to collect data at any moment but also is accessible “on-the-fly”. Our aim is to make our machine usable and receptive to the user’s needs in a timely manner. We do this by developing algorithms to detect hand gestures that map to controlling the graphical user interface (GUI) in an expected manner. This allows the user to access this information without the need to turn on a laptop or reach in their pocket to view their computer device. In the future we will be tethering multiple health sensors to our system that will provide a user and their physician or other family members access to up-to-the-minute health statistics. We will also be looking at shrinking our apparatus as well as moving from a laptop to a smaller portable device for our processing engine.\r\nWe have taken current color tracking techniques used in the Touchless software development kit (SDK) and spun it so hand gestures can be recognized by using only a webcam. The webcam is worn on an apparatus that hangs from the user’s neck that also harnesses a pico-projector. The webcam takes in gestures which manipulate the graphical user interface that is projected onto nearby surfaces by the pico-projector. This system will allow users to easily access information using nothing but their hands. Not only is this a new and exciting way of using computers, but the hand gestures used to control the system are simple, which enables this computing system to be used by almost anyone. \r\n\r\nWith SmartSense you can also use Windows speech recognition which is powered by our intelligent virtual assi",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">SmartSense is a wearable holographic gesture and voice controlled intelligent system.<br />With the growing fascination in mobile/portable devices comes the question, what is the easiest way to access information throughout the day? Clearly, having to pull out a laptop, tablet or cell phone every time you need access to information can be frustrating. What if there was a device that could be worn everyday that put this information at your fingertips without having to dig into your bag or pockets? Our wearable computer allows users to interact with their system via simple hand gestures and view data in an easy to use graphical user interface that can be displayed virtually anywhere.<br />We have taken current color tracking techniques used in the Touchless software development kit (SDK) and spun it so hand gestures can be recognized by using only a webcam. The webcam is worn on an apparatus that hangs from the user’s neck that also harnesses a pico-projector. The webcam takes in gestures which manipulate the graphical user interface that is projected onto nearby surfaces by the pico-projector. This system will allow users to easily access information using nothing but their hands. Not only is this a new and exciting way of using computers, but the hand gestures used to control the system are simple, which enables this computing system to be used by almost anyone.<br /><br />Human-computer interaction (HCI) is a heavily researched area in today’s technology driven world. Most people experience HCI using a mouse and keyboard as input devices. We wanted a more natural way to interact with the computer that also allows instant access to information. We are developing a real-time system that is always on and available to collect data at any moment but also is accessible “on-the-fly”. Our aim is to make our machine usable and receptive to the user’s needs in a timely manner. We do this by developing algorithms to detect hand gestures that map to controlling the graphical user interface (GUI) in an expected manner. This allows the user to access this information without the need to turn on a laptop or reach in their pocket to view their computer device We will also be looking at shrinking our apparatus as well as moving from a laptop to a smaller portable device for our processing engine.<br />We have taken current color tracking techniques used in the Touchless software development kit (SDK) and spun it so hand gestures can be recognized by using only a webcam. The webcam is worn on an apparatus that hangs from the user’s neck that also harnesses a pico-projector. The webcam takes in gestures which manipulate the graphical user interface that is projected onto nearby surfaces by the pico-projector. This system will allow users to easily access information using nothing but their hands. Not only is this a new and exciting way of using computers, but the hand gestures used to control the system are simple, which enables this computing system to be used by almost anyone. <br /><br />With SmartSense you can also use Windows speech recognition which is powered by our intelligent virtual assistant called JARVIS. He got his name from the movie Iron Man. He is intelligent enough to search the internet for a word, say “Apple” when you ask him “What do you know about Apple?”.<br />JARVIS can recognize faces of people. You can turn on face recognition by telling “SCAN FACE”<br />Or “FACE RECOGNITION” or anything you like with almost the same meaning. If JARVIS is seeing the person for the first time, you will have the option to add the person’s name and profile to the database. If JARVIS knows the person before, the person’s profile will be projected on his body.<br />Modern society has quickly embraced the world of technology, and has openly accepted for the integration of computers in our everyday tasks. According to the International Telecommunication Union, close to 30% of the 2010 world population connects to the internet on a regular basis <a href=\"https://smartsense.codeplex.com/wikipage?title=1&referringTitle=Home\">1</a>. With the ever increasing popularity of the internet, and the use of computers in our daily lives, developers are creating useful and manageable technology that is easily accessible whenever and wherever it is needed.<br />Our wearable computing system is being developed with the incorporation of a display and controls that can easily be seen and used without requiring a laptop or other cumbersome device. By wirelessly connecting a smart phone with a webcam and a pocket projector, we are creating a device that will be non-intrusive and non-restrictive. The projector will project a graphical user interface in front of the user, and the webcam will take in video of the user’s surroundings. With the webcam, the user will have the ability to control the system by using simple hand gestures. This wearable interface will allow the user to manage the different functions of the system and wirelessly communicate with the smart phone device that will never need to leave the user’s pocket. Our prototype can take many forms: a pendant worn around the neck, a clip on device that can be attached at numerous locations or even a single-strap backpack with the hardware embedded in the strap.<br />The practical applications of this system are many, for e.g., holding a news paper in front of the webcam followed by a click gesture will project the online version of the news (online news topics related to the news on the paper) on the news paper. This is done with the help of Optical Character Reading Technology. SmartSense can receive GPS data from your phone through Bluetooth and synchronize it using Google Map. <br /> <br />HARDWARE REQUIREMENTS<br />      Laptop(Windows Vista or higher, 250 GB HDD, 2 GB RAM, Graphics card) <br />      Pocket projector<br />      Speaker<br />      Microphone<br />      Webcam<br />SOFTWARE<br />      SmartSense application<br />      Visual Studio 2008<br />      .Net framework 3.5 (or higher)<br /> <br />SmartSense is currently looking for help from the codeplex community.So please contribute...<br /><br />By <br />Fariz Rahman<br /><br />Next release (3rd Feb 2013) SmartSense v2.0 for Windows 8:<br /><img src=\"http://i45.tinypic.com/2jc6jxd.png\" /><br /><img src=\"http://i45.tinypic.com/353a9g6.png\" /><br /><img src=\"http://i45.tinypic.com/2u4owus.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,visual basic,artificial intellige,GUI,Source Code,programming,Touchless,smartsesense,wearable computer,sixthsense,holographic,JARVIS,",
  "LastEdited": "2013-01-25T22:22:10.747-08:00"
}