{
  "ProjectName": "solidcp",
  "Title": "SOLIDCP",
  "Description": "SolidCP formerly known as WebsitePanel is Another option for hosting providers, it's an open-source control panel for hosting companies.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<div><a id=\"logo\" title=\"SolidCP\" href=\"https://solidcp.com\"><img src=\"https://solidcp.com/wp-content/uploads/2016/03/Logo-horizontal.png\" alt=\"SolidCP\"></a></div>\r\n<div>&nbsp;</div>\r\n<div>&nbsp;</div>\r\n<h3>SolidCP is launched in 2016 as a new fork of WebsitePanel. Our aim is to create a controlpanel who is running stable (solid) and to combine windows and linux servers in one controlpanel. The linux part will be on our roadmap, which will be published soon.<br>\r\n<br>\r\nOur first goal was to release a version which is running bug free, because sadly enough this was in many cases not the case with Websitepanel.<br>\r\n<br>\r\nSolidCP is a joint effort from Marco Tiggelaar and Michel Jansen. If&nbsp;you would like&nbsp;to contribute to SolidCP, please contact us.</h3>\r\n<h3>&nbsp;<strong>SolidCP formerly known as WebsitePanel is Another option for hosting providers, it's an open-source control panel for hosting companies. With the help of Developers around the world investing in the future and success of SolidCP by contributing\r\n support for ongoing development efforts. &nbsp;</strong></h3>\r\n<h3><strong>SolidCP is a complete management portal for Cloud Computing Companies and IT Providers to automate the provisioning of a full suite of Multi-Tenant services on servers. The powerful, flexible and fully open source SolidCP platform gives users simple\r\n point-and-click control over Server applications including IIS 8.5, SQL Server 2014, MySQL 5, Exchange 2013, Sharepoint 2013, Lync 2013, Webdav, Microsoft RemoteApp and Hyper Deployments.</strong></h3>\r\n<p>&nbsp;</p>\r\n<h2>ALL Development Forks and Additional information on the SolidCP project is available here:\r\n<a href=\"https://git.key4ce.com/SolidCP/v1.0\">SolidCP</a></h2>\r\n<h2>The SolidCP Website is available here: <a href=\"https://solidcp.com/\">SolidCP</a></h2>\r\n<h2>&nbsp;You can find our documentation<a id=\"logo\" title=\"SolidCP\" href=\"https://solidcp.com/category/kb/\"> Here</a></h2>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2016-08-19T13:38:27.15-07:00"
}