{
  "ProjectName": "sp2010cookieapproval",
  "Title": "SharePoint 2010 Cookie Approval Control",
  "Description": "If you need to comply with EU cookie law this control displays a message to each user that cookies are in use on the site and allows them to accept the message",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Cookie Approval Control</strong></p>\r\n<p>Due to the new EU cookie laws that have taken effect since May 2011 you need to let users of a public website know that cookies are in use on your site.</p>\r\n<p>Generally speaking Cookies for authentication are not included in this but check&nbsp;<a href=\"http://www.ico.gov.uk/for_organisations/privacy_and_electronic_communications/the_guide/cookies.aspx\" target=\"_blank\">here</a>&nbsp;to see if your site needs to\r\n display this notification. For instance using any analytics service like Google Analytics would require you to notifiy the user and get their consent.</p>\r\n<p>This control that displays to each user a message that cookies are in use on the site.</p>\r\n<p><br>\r\n<a href=\"http://download.codeplex.com/Download?ProjectName=sp2010cookieapproval&DownloadId=390836\"><img title=\"TeamSiteTopPage\" src=\"http://download.codeplex.com/Download?ProjectName=sp2010cookieapproval&DownloadId=390837\" border=\"0\" alt=\"TeamSiteTopPage\" width=\"644\" height=\"169\" style=\"padding-left:0px; padding-right:0px; display:inline; padding-top:0px; border:0px\"></a></p>\r\n<p>&nbsp;</p>\r\n<p>The user can click Confirm Cookies and this will store a confirmation cookie on the users machine. When this cookie is set the message will not be displayed the next time the user visits.</p>\r\n<p>The Title, Message Body, Confirm Click Text and cookie name are configurable via central administration.</p>\r\n<p>The Install is provided as a WSP file and is activated per Web Application.</p>\r\n<p>No changes are required to master pages or layout pages the control is automatically injected to each page.</p>\r\n<p>July 2012</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "sharepoint,SharePoint 2010,javascript,Cookies,",
  "LastEdited": "2012-07-02T13:58:50.157-07:00"
}