{
  "ProjectName": "SPS2013SBL",
  "Title": "SharePoint 2013 Suite Bar Links Configuration",
  "Description": "This solution utilises the Suite Bar delegate control and allows you to link a managed metadata navigation enabled term set and display it along site or even in",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br /><br />SharePoint 2013 is a fantastic product and Microsoft have spent a lot of time and money on the next version of their content management system.<br /><br />Sometimes however, there are a few pieces of the puzzle missing and the Suite Bar is one such area. The Suite Bar is that lovely blue bar across the top of each and every page in your SharePoint farm and Microsoft utilise this area to display us our newsfeed, skydrive and site links and it does a good job. Wouldn&#39;t it be great if we could also utilise this area without all that mucking around with master pages etc. Well out of the box I&#39;m afraid you cant, but with this solution you can take back control on this prime piece of screen real estate without having to hack around with pages.<br /><br /><b>So what does this solution do?</b><br /><br />This solution utilises the Suite Bar delegate control and allows you to link a managed metadata navigation enabled term set and display it along site or even in place of the existing Suite Links. This enables you to show links in multiple site collections using the same managed metadata service application giving you some truly global links; you can even have different site collections using different termsets.<br /><br /><b>Can I use this in Office 365</b><br /><br />Unfortunately not, this is an on premises solution only as it has to deploy certain elements to the 15 hive. There are many great guide out there on how to get the same functionality using javascript.<br /><br /><b>What does the solution comprise of?</b><br /><br />The solution consists of the following<br />\n<ul><li>Delegate control to render the links</li>\n<li>Admin page in your site collection admin links to manage the control</li></ul>\n<br /><b>Head on over to the documentation area to get screen shots and documentation on installing and configuring this solution</b><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "SharePoint 2013,Suite Bar,SP,",
  "LastEdited": "2013-08-21T04:28:05.297-07:00"
}