{
  "ProjectName": "spsiteinstaller",
  "Title": "SPSiteInstaller",
  "Description": "This Project contains a set of PowerShell 2.0 Scripts for SharePoint 2010. \r\n\r\nUsing PowerShell, and a Config file to control all the aspects you can automate building a full web structure.\r\n\r\nThis will save you days, and automates quite a lot of common things, esp for custom apps.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This Project contains a set of PowerShell 2.0 Scripts for SharePoint 2010. <br /><br />Using PowerShell, and a Config file to control all the aspects you can automate building a full web structure.<br /><br />This will save you days, and automates quite a lot of common things, esp for custom apps.<br /><br /><br />The PowerShell script automates the following tasks:<br /><br />- Create WebApplications<br />- Extend WebApplication<br />- Create Content Databases<br />- Create Site Collections in the Content Databases<br />- Create SharePoint Groups in the Site Collections<br />- Add Users to SharePoint Groups in Site Collections<br />- Create Document libraries and Lists for Site Collection with Custom Content Types<br />- Create Sub-Sites<br />- Add Document Libraries and Lists to Sub-Sites with Custom Content Types<br />- Create Publishing pages for Site-Collections and Sub-Sites with Custom Page Layouts<br />- Install Solutions, Solutions with Web resources are installed against All- WebApplications<br />- Install and Activate Features in a Solution against a site/web<br />- Remove and De-Activate Features<br />- Uninstall Solutions<br />- Add WebParts to Publishing Pages.<br /><br />All of this is controlled via one siteconfig.xml Configuration file, easy and quite self-explainatory. <br /><br />Update: I have added some basic information on how to use the scripts under the Documentation section, do have a look if you are not familiar with PowerShell scripts, and XML configuration files.<br /><br />Update: Added v1.1 with some small fixes, also if you get into any issues with adding webparts on pages in installall, run addwebparts.ps1 after installall, this is something to do with timer job again and am looking into it.<br /><br />Update: Added 1.2, Now you can create Groups with special permissions, e,g Full Control, Read etc.<br /><br />Update: Added 1.3, Now you can upgrade your existing IA by re-running the script with the modified siteconfig.xml containing the new pages/webparts, no need for a new siteconfig.xml or heaps of different copies, have just one copy and rerun, remsolns , addsolns , createpages , addwebparts scripts as per your requirement, if a page already exists it will be skipped, if a webpart is already there on a page, it wont be added again. <br /><br />Javed Asghar.<br />http://au.linkedin.com/pub/javed-asghar/35/596/b81 </div><div class=\"ClearBoth\"></div>",
  "TagList": "powershell,SharePoint Scripts,PowerShell Scripts,SharePoint 2010,Migration,",
  "LastEdited": "2012-04-09T18:35:42.297-07:00"
}