{
  "ProjectName": "spuac",
  "Title": "SharePoint User Account Control",
  "Description": "The SharePoint User Account Control (SPUAC) feature is a collection of Central Administration pages that provides a single view of everything a user can access in the entire farm and an interface to revoke access.  SharePoint and nested domain group membership are considered. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The SharePoint User Account Control &#40;SPUAC&#41; feature is a collection of Central Administration pages that provides a single view of everything a user can access in the entire farm and an interface to revoke access.  SharePoint and nested domain group membership are considered. <br /><br /><b>Purpose</b><br />The main purpose for this feature is to allow an Administrator to determine exactly what a given user can access and revoke permissions as required.  In other words, if you were logged in as that user, exactly what could you access in the farm?<br /><br /><b>Walkthrough</b><br />After deploying the solution, a new section is added to the Operations page in Central Administration<br /><br /><img src=\"/projects/spuac/fc1cb571-0268-42d6-8238-f8499039e46e\" alt=\"spuacOperations.png\" title=\"spuacOperations.png\" /><br /><br />You can view what access a user has by entering their domain account<br /><br /><img src=\"/projects/spuac/b3846eed-281e-4e21-ac8c-76e0414c0c25\" alt=\"spuacCheckAccess.png\" title=\"spuacCheckAccess.png\" /><br /><br />A list is displayed of all the permissions that user has in the farm<br /><br /><img src=\"/projects/spuac/502a9e88-494f-49be-a8db-ba9e58a3ff7b\" alt=\"spuacCheckAccessResult.png\" title=\"spuacCheckAccessResult.png\" /><br /><br /><b>Background</b><br />The motivation behind this project is to provide administrators a tool to see what a user can access and revoke as necessary.  The SPUAC provides a level of confidence that is not afforded by the out of the box SharePoint administrative interfaces.  Do you really know everywhere a user has access?  What about implicit access through a domain group that is three, four or five levels deep?<br />  <br />There are actually several ways a user can be given permission to a securable in the farm and several nuances to be aware of.   The following are some of the things to consider:<br />*Users can be granted access directly, by SharePoint groups (which cannot be nested) and domain groups (which can be nested)<br />*Users can be given permissions to many securables such as sites, lists, list items, the farm<br />*Some areas are accessible to everyone (NTAuthority\\Authenticated Users) by default<br />*Some areas are accessible to server/domain adminstrators by default<br />*Grant user access to a list or list item in a site collection and they get limited access to the securable ancestors such as the site or list<br />*Grant a user access to a securable anywhere in a site collection, the user will appear in the All People list<br />*Web Application Policies can be used to grant or deny permissions to users or domain groups to an entire application, overriding permissions at the site level<br />*When a user is a site owner or secondary site owner, they are also added to the Site Collection Administrators group of that site<br />*When a user is removed as a site or secondary owner, they are also removed from the Site Collection Administrators<br />*You will get an error if you try to remove a site or secondary owner from the Site Collection Administrators group<br />*Grant a domain group access to a securable in a site collection, the group does not appear in the All People list, (but is present in the object model web.users)<br />*Delete a user from the All People list, all permissions to securables within the site collection are removed<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Sharepoint,SharePoint 2007,SharePoint Dev,Sharepoint Tools,Sharepoint Apps,WSS,WSS 3.0,WSS 3.0 Tools,WSS Admin Webpart(s),Central Admin,security,",
  "LastEdited": "2009-02-21T10:18:43.78-08:00"
}