{
  "ProjectName": "spycraft2gcs",
  "Title": "Spycraft™ 2.0 Game Control System",
  "Description": "The Spycraft™ 2.0 Game Control System is software that allows the GC to manage agents, missions, agencies, as well as providing a real-world interface into the GC's game world.  It implements a TCP/IP asynchronous server and provides telnet access from agents in the field. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><img src=\"/projects/spycraft2gcs/d86c3e4d-de1c-4a9c-a4e4-783d479b46b9\" alt=\"AgentDetails-ID.gif\" title=\"AgentDetails-ID.gif\" /><img src=\"/projects/spycraft2gcs/b3ddbe73-03f5-44da-ae15-54509ae61507\" alt=\"AgentDetail-Stats.gif\" title=\"AgentDetail-Stats.gif\" /><br /><br />The Spycraft™ 2.0 Game Control System is software that allows the GC to manage agents, missions, agencies, as well as providing a real-world interface into the GC&#39;s game world.  It implements a TCP/IP asynchronous server and provides telnet access from agents in the field.  This is meant to be used in real-time by the agents to interface with their agency, provide mission-specific or need-to-know (that is, they can receive agency emails, get paged, and access it in real time) information to the agent, and allow field agents the ability to particpate physically in hacking dramatic conflicts.<br />I created it for use in our cosmos with our agency: Executive Defense Directorate.  Because I happen to like the way Spycraft 1.0 handled agencies, the software supports a mix of 1.0 and 2.0 versions of agencies.  Here are the basic system specs.<br /><br />  * Windows XP and Vista compatible<br />    * clients can connect from any OS via telnet<br />          o Players have brought their laptops and one connected from his iPhone.<br /><br /><br />I have posted screen shots under <a href=\"https://spycraft2gcs.codeplex.com/documentation?referringTitle=Home\">Documentation</a>.  If you want to try out the proof-of-concept ALPHA release, click on Source Code then &quot;Download&quot; at the top right in the box.   Please note that this is v.0.5 at the time of this writing, and not all portions are complete.  I will showcase what I have completed.</div><div class=\"ClearBoth\"></div>",
  "TagList": "C++,Spycraft,RPG,Espionage,TCP/IP,",
  "LastEdited": "2010-11-09T22:43:44.75-08:00"
}