{
  "ProjectName": "SQL2005SrvcMngr",
  "Title": "SQL 2005 Service Manager",
  "Description": "Welcome to the SQL 2005 Service Manager project. SQL 2005 Service Manager is a replacement for the SQL Server Service Manager that came with SQL Server 2000 but is no longer shipped as part of SQL Server. It allows the management and monitoring of all local SQL Server related services from a convenient system tray application. Please note that there is a Vista specific release as well as the standard XP/Win2003 release. There are no differences in functionality, the Vista release has just been modified to accomodate the UAC (User Account Control) feature.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Welcome to the <b>SQL 2005 Service Manager</b> project. SQL 2005 Service Manager is a replacement for the SQL Server Service Manager that came with SQL Server 2000 but is no longer shipped as part of SQL Server. It allows the management and monitoring of all local SQL Server related services from a convenient system tray application for all editions of SQL Server 2000, 2005 and 2008. Please note that there is a <a href=\"https://sql2005srvcmngr.codeplex.com/releases/view/16330\">Vista or later (with UAC enabled) specific release</a> as well as the <a href=\"https://sql2005srvcmngr.codeplex.com/releases/view/16329\">standard XP/Win2003/Win2008 release</a>. There are no differences in functionality, the Vista release has just been modified to accomodate the UAC (User Account Control) feature.<br /><br />For more information and previous release history please see the following article <a href=\"http://www.sqldbatips.com/showarticle.asp?ID=46\">SQL 2005 Service Manager</a><br /><br /><br /><img src=\"/projects/SQL2005SrvcMngr/cb33d4f8-282d-445f-8590-44fbdfbf26e0\" alt=\"sm2005.gif\" title=\"sm2005.gif\" /><br /><br /><b>Help/Feedback</b> <br /><br />Find a bug? Need help? Have a suggestion? Use the <a href=\"http://www.codeplex.com/SQL2005SrvcMngr/Thread/List.aspx\">Discussions</a> or <a href=\"http://www.codeplex.com/SQL2005SrvcMngr/WorkItem/List.aspx\">Issue Tracker</a> tabs to provide feedback or email <a href=\"mailto:codeplex@sqldbatips.com\">codeplex@sqldbatips.com</a><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "SQL,SQL Server,Tools,sql express,SQL 2005,service manager,SQL 2008,SQL Server 2005,SQL 2005 Service Man,",
  "LastEdited": "2010-08-04T12:05:53.143-07:00"
}