{
  "ProjectName": "sqlautodoc",
  "Title": "SQLAutoDoc",
  "Description": "Automatic version control, database documentation and comparison tool for SQL Server. Also supports limited reporting of database size, connection counts and blocking.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Automatic version control, database documentation and comparison tool for SQL Server. Also supports limited reporting of database size, connection counts and blocking.\n<h2>About SQLAutoDoc</h2>\rA basic install, screen snapshots of the SQLAutoDoc reports and documentation can be found here:<br /><a href=\"http://www.jlion.com/docs/SQLAutoDoc_v2.aspx\">http://www.jlion.com/docs/SQLAutoDoc_v2.aspx</a><br /><br />SQLAutoDoc consists of these parts:\n<ul><li>A SQL Server (or SQL Server Express) database that contains metadata about the databases that are being monitored by SQLAutoDoc.</li>\n<li>A web-based reporting interface.</li>\n<li>A windows service that periodically polls monitored SQL Servers for new versions of stored procedures, functions and views, and retrieves updated statistics about connections, blocking, etc.</li>\n<li>An assembly that serves as the interface between the database and both the reporting app and the windows service.</li></ul>\n<br />Because setting up all this stuff can be somewhat involved, I have also created a windows setup application. \n<h2>Why SQLAutoDoc </h2>\rThere are lots of good SQL documentation tools out there. The primary purpose of SQLAutoDoc is as a sort of parachute for small SQL shops that don&#39;t keep database code in version control.<br /><br />SQLAutoDoc can help in these scenarios:\n<ul><li>A report stops working or returns strange results. Any changes to the database made recently?</li>\n<li>A change to a stored procedure appears to work correctly, but two weeks later critical problems are found. What was the source of the prior version?</li>\n<li>You return from vacation. Boss says &quot;I had to fix some things while you were gone&quot;. What did the Boss change?</li>\n<li>Database size is growing quickly. Which table(s) are responsible?</li></ul>\n<h2>History</h2>\rThe original idea for SQLAutoDoc originally arose back in about 1992 as a way to document Microsoft Access database schemas. It then, evolved into a way to compare the schema of two Access databases, then into a way to record and document SQL Server schemas, was updated to identify changes to stored procedures, views and functions, and finally to its present form, as a web interface/windows service combination with simple charting and reporting functionality.<br /><br />I envision future versions of SQLAutoDoc having better reporting capabilities, particularly relating to the indentification and tracking of blocking issues. I would also like to improve the performance of searches and comparisons.<br /><br /><b>Credits</b><br />I&#39;d like to thank Mark James of <a href=\"http://famfamfam.com\">http://famfamfam.com</a> for making his excellent collection of icons available.</div><div class=\"ClearBoth\"></div>",
  "TagList": "SQL Monitor,Documentation,",
  "LastEdited": "2007-12-13T13:05:31.323-08:00"
}