{
  "ProjectName": "sqlmeth",
  "Title": "SqlMeth",
  "Description": "SqlMeth is a command line tool to speed up development time by turning database diagrams into models with control columns, views and stored procedures.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>Project Description</h1>\r\n<p>SqlMeth (pronounced: &quot;sequel meth&quot;) is a command line tool to speed up development time by&nbsp;turning database diagrams into models and adding stored procedures, views and wiring the results of the stored procedures in the way. It was designed and developed\r\n by Elemental Enterprise Solutions Corp. (visit: http://www.be-elemental.com).</p>\r\n<p>It starts by adding control columns, like ROWVERSION,&nbsp;to tables; then it adds stored procedures; next, it&nbsp;adds stored procedures to handle CRUD on those tables; after that, it creates views for the tables in the database; creates models using a\r\n tool of choice (currently, only SqlMetal is supported); and, finally, wires the stored procedures to the actions&nbsp;for a table (such as &quot;InsertFunction&quot;) and modifies the return type of read, select, stored procedures. All of this is controlled by an argument\r\n called &quot;action&quot;; the higher it is, the more actions it does.</p>\r\n<p>The reason to &quot;bet&quot; on using stored procedures&nbsp;is:</p>\r\n<ul>\r\n<li>Security </li><li>Total amount of data transmitted </li><li>Taking advantage of the DB server's processing power </li></ul>\r\n<p>Views, just like stored procedures, can be secured. Views can also be indexed to improve performance. That's why the tool also creates them.</p>\r\n<h1>Looking for volunteers</h1>\r\n<p>Would you like to contribute to the tool? Please do so!</p>\r\n<div>In the future, I'd like the tool to:</div>\r\n<div>\r\n<ul>\r\n<li>Create models using EdmGen.exe </li><li>Run scripts to setup the DB security for the views and stored procedures generated\r\n</li><li>Better reflect SqlMetal processing options </li></ul>\r\n</div>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "SQL Server,LINQ-TO-SQL,DBML,T-SQL,Stored Procedures,Views,",
  "LastEdited": "2015-02-19T07:51:06.527-08:00"
}