{
  "ProjectName": "sqlquerytester",
  "Title": "ASP.NET SQL Query Tester",
  "Description": "This is a basic web site written in ASP and VB (.net 3.5) that allows students and other learners to test SQL queries on a database that is hosted online.  It's set up in such a way that other hosted databases can be connected to it quickly, with the user able to switch between databases with a dropdownlist control.  I included instructions on how to add another database in comments and examples within the VB code.  The interface is basically just a simple textbox, dropdownlist and error message label, but it does give useful feedback from the SQL error handler, and I've also set it up so that you can attach a convenient database diagram for each database you connect to it, so that users can figure out their join syntax by looking at the diagram.  (See demo link below.)\n\nThis is primarily intended for use in learning SQL syntax and testing queries for homework assignments, etc.  Primary downloaders will be instructors and educators looking to enhance their classroom experience.  But I image it could also be useful in certain team support and development scenarios.  I don't intend to spend a lot of time developing new versions or anything, this was just something I banged out quickly between other projects, but if you have any comments please feel free to leave them here or email me, and I may update it at some point in the future.  Enjoy.  :-)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This is a basic web site written in ASP and VB &#40;.net 3.5&#41; that allows students and other learners to test SQL queries on a database that is hosted online.  It&#39;s set up in such a way that other hosted databases can be connected to it quickly, with the user able to switch between databases with a dropdownlist control.  I included instructions on how to add another database in comments and examples within the VB code.  The interface is basically just a simple textbox, dropdownlist and error message label, but it does give useful feedback from the SQL error handler, and I&#39;ve also set it up so that you can attach a convenient database diagram for each database you connect to it, so that users can figure out their join syntax by looking at the diagram.  &#40;See demo link below.&#41;<br /><br />This is primarily intended for use in learning SQL syntax and testing queries for homework assignments, etc.  Primary downloaders will be instructors and educators looking to enhance their classroom experience.  But I image it could also be useful in certain team support and development scenarios.  I don&#39;t intend to spend a lot of time developing new versions or anything, this was just something I banged out quickly between other projects, but if you have any comments please feel free to leave them here or email me, and I may update it at some point in the future.  Enjoy.  &#58;-&#41;<br /><br /><b>Note:</b><br />This project does not include the Northwind and Pubs databases that it is set up to run on by default.  You&#39;ll need to download those separately and drop them into the App_Data folder for this to work as written.  It&#39;s really intended to be used to query your own databases (using your own connection string), but I&#39;ve set up a demo at the URL below so you can see how it works. <br /><br />If you&#39;re wondering why I wrote this, it&#39;s to support our lower-level SQL classes, not our .NET programming courses. But I imagine it might be handy for a number of things. A good instructor can never have too many tools! :-)<br /><br /><b>Demo:</b><br /><a href=\"http://www.aiuasp.net/QueryTester/\">http://www.aiuasp.net/QueryTester/</a><br /><br /><br /><b>Where I teach (come visit us!):</b><br /><img src=\"http://www.aiufl.edu/schools/AIU/images/logo.gif\" /><br /><a href=\"http://www.aiufl.edu\">http://www.aiufl.edu</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,ASP.NET,SQL,Database,tool,Chat,Testing,Query,FREE,Education,visual basic,Database Tools,Query Tester,tester,sql teaching tool,query teaching tool,query builder,we,",
  "LastEdited": "2008-07-14T00:09:33.217-07:00"
}