{
  "ProjectName": "ssisframework",
  "Title": "Enterprise SSIS Framework",
  "Description": "The Enterprise SSIS Framework is a project intended to simplify the management of an organization’s administration and ETL assets by abstracting the coordination and control flow into metadata. This project consists of the four parts:\r\n\r\n- Core SSIS Packages: A set of packages that are responsible for workflow within the framework\r\n- SQL Server 2008 DB: Holds all the metadata necessary to drive the application\r\n- Administration App: A web-based front end to facilitate managing assets running within the framework\r\n- Reports: A series of reports that provide both framework auditing and logging\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">The Enterprise SSIS Framework is a project intended to simplify the management of an organization’s administration and ETL assets by abstracting the coordination and control flow into metadata. This project consists of the four parts:<br /><br />-\tCore SSIS Packages: A set of packages that are responsible for workflow within the framework<br />-\tSQL Server 2008 DB: Holds all the metadata necessary to drive the application<br />-\tAdministration App: A web-based front end to facilitate managing assets running within the framework<br />-\tReports: A series of reports that provide both framework auditing and logging<br /><br />Framework Features:<br /><br />-\tSupport the notion of SSIS Applications. This basically boils down to a group of related SSIS packages (tasks).<br />-\tParallel package/task processing, configurable through metadata.<br />-\tApplication and Task recoverability<br />-\tDaily, Weekly and Monthly Task Scheduling<br />-\tInstrumentation and Logging including Tie-In with built-in logging features<br />-\tSupport for package/task hierarchies<br />-\tMulti-environment aware secure configuration<br />-\tNo pre-reqs or changes to run packages/tasks within the framework<br />-\tAutomatic package generation for repetitive and maintenance tasks<br />-\tProvides a reference set of template packages and BIML assets<br /><br />\n<ul><li>If you have feedback please feel free to share it as this is a project is actively under development. <b></b>*</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-11-08T12:19:23.79-08:00"
}