{
  "ProjectName": "StartComp",
  "Title": "StartComp",
  "Description": "Windows Start Menu Companion is a tool that helps you all day. Launch applications and control panel items, explore your drives, read feeds and keep notes.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>Windows Start Menu Companion is a tool that helps you all-day, every day. You can add links for your applications to the provided or self defined repositories and run them from there with command line argument support. Exploring your drives, launching windows\r\n control panel items, reading feeds and last but not least keeping notes is all packed into one single piece of free software.\r\n<br>\r\n<br>\r\nThis is the beta version which is currently under development. Most of the desired features have already been implemented. The beta is mostly about finding bugs and enhancing the user experience. All released versions are stable for everyday use. The full version\r\n will be released &quot;when it's done&quot;, but development has gone strong the last months.\r\n<br>\r\n<br>\r\nInformation on how about to use StartComp is available in the <a href=\"http://startcomp.codeplex.com/wikipage?title=Documentation\">\r\ndocumentation</a>.<br>\r\nYou can find the current release notes at the downloads page or read the complete\r\n<a href=\"http://startcomp.codeplex.com/wikipage?title=History\">history</a>. <br>\r\nPlease report any found bugs using the <a href=\"http://startcomp.codeplex.com/workitem/list/basic\">\r\nissue tracker</a>.</p>\r\n<hr>\r\n<p>Prerequisites: .NET Framework 4 Client Profile <br>\r\nSupported Platforms: Windows Vista, Windows 7, Windows 8</p>\r\n<hr>\r\n<p align=\"center\"><a href=\"http://startcomp.codeplex.com/wikipage?title=Screenshots\">Screenshots</a><img title=\"StartComp Favorites\" alt=\"StartCompScreenshot\" src=\"http://i3.codeplex.com/Download?ProjectName=StartComp&DownloadId=662644\"></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2013-04-28T15:38:49.393-07:00"
}