{
  "ProjectName": "Superlist",
  "Title": "Superlist",
  "Description": "Base on the codeproject project “Outlook Style Grouped List Control”\n(http://www.codeproject.com/cs/miscctrl/outlooklistcontrol.asp)\nCreated for the article author Lee Paul Alexander.\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><img src=\"/projects/Superlist/90873d66-0396-40b8-9bdb-f71475a2a18c\" alt=\"ArticleImage.gif\" title=\"ArticleImage.gif\" />\n<h1>Introduction</h1>\r\nThe Superlist is an Outlook style list control that you can group / customize as can be seen in the image above.  I built the Superlist control whilst developing an RSS reader called <a href=\"http://www.feedghost.com/\">FeedGhost</a>. Although there are plenty of commercial grouped list controls available I wanted to have total control over the code and of course its usability. Superlist supports drag drop column customisation, grouping as well as handling thousands of entries smoothly. It&#39;s also highly customizable if you want to change its look and feel. In this article I&#39;ll explain how to use and extend the control in a demo project. If you download the source, you can find demo project under the Tests/SuperListTest directory. <br />\n<h1>Background</h1>\rBefore deciding to develop my own list control I spent a couple of weeks fighting the standard Listview, trying to get it to work the way I wanted, but I finally gave up when I couldn&#39;t get the selected items in the grouped visual order. We needed this in <a href=\"http://www.feedghost.com/\">FeedGhost</a> so that articles that the user multi-selected would be displayed in the same order in the corresponding HTML view.<br /><br />I decided to write the control from scratch rather than basing it for example on the Grid controls. In previous projects I&#39;ve worked on, I&#39;ve seen the grids bent and warped into doing the bidding of its creator only to be a maintenance millstone around the projects neck later; not quite working the way you want with plenty of patching code to get it <b>nearly</b> there. In the end you have a pile of brittle code that people are too scared to touch. <br /><br />I developed Superlist in two weeks, strangely enough it was about the same time I spent trying to get the Listview working in the first place, admittedly I spent the following two weeks fixing the bugs<br /><br /><br />Read more <a href=\"https://superlist.codeplex.com/wikipage?title=Introduction&referringTitle=Home\">Introduction</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "winforms,Windows Forms,Superlist,Super List,Listview,Controls,control,",
  "LastEdited": "2007-09-05T01:49:39.137-07:00"
}