{
  "ProjectName": "surveyhost",
  "Title": "SurveyHost.NET",
  "Description": "A professional survey creation and hosting website.  SurveyHost.NET allows users to sign on and create surveys that include participant screening and proof of completion.  \n\nSurvey access is controlled by survey creators.  Users are created by survey administrators and login details are sent to participants.\n\nData is kept separate from user data in order to provide controlled access to the survey yet keep responses anonymous.\n\nSurvey data can be downloaded as XLSX (Open XML Excel) for use in answer analysis.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A professional survey creation and hosting website.  SurveyHost.NET allows users to sign on and create surveys that include participant screening and proof of completion.  <br /><br />Survey access is controlled by survey creators.  Users are created by survey administrators and login details are sent to participants.<br /><br />Data is kept separate from user data in order to provide controlled access to the survey yet keep responses anonymous.<br /><br />Survey data can be downloaded as XLSX &#40;Open XML Excel&#41; for use in answer analysis.<br />\n<h2>Updates </h2>\r<b>3.9.8</b> - Had some interest in the project, which has spurred me on to make some changes.  I&#39;ve added issues pertaining to the configuration of the website which will be implemented if not today then by next weekend.  <br /><b>5.24.8</b> - I&#39;ve got to get a working install running over this next weekend, so there should be a few more updates.  The screening questions will probably still be hard-coded.  I might be forking it and moving to a 2008 solution as well.  I&#39;m not sure how CodePlex will handle that.  I&#39;ve been working on an aspnet MVC site over the past two weeks, so I&#39;m not looking forward to going back to the heavyweight server control model.  Moving to the MVC model will happen eventually, if I stick with it.<br /><b>6.2.8</b>  First instance (that I know of) going live for private beta testing by the 4th.  If things go smooth I hope to have a workable release ready to go by next weekend.<br /><b>10.12.8</b> Best laid plans.  I&#39;m only seeing this version going as far as I need to get it working for the original survey it was designed for.  I&#39;ve been working with the new MVC framework and it is so much more suited for what this web application does that I can&#39;t see putting much more effort into it.  Apart from minor bugfixes, the work I put into this application will be a redesign.  I expect to be able to cut out about 60% of the code in moving it to MVC.  Yes, ASP.NET MVC is just that good a framework as compared to the old web forms model.  <br /><b>12.6.8</b> Amost done working on this version.  I&#39;ve started some work on MVC; I&#39;m thinking about ditching this project and creating a new one called SurveyHost.MVC.  Aaah, if I only knew then what I know now...<br /><b>12.31.8</b> Happy new year!  First checkin of SurveyHost.MVC here:  <a href=\"http://www.codeplex.com/SurveyHostMVC\">http://www.codeplex.com/SurveyHostMVC</a>.  No more updates will be made here.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Survey,",
  "LastEdited": "2008-12-31T15:07:09.223-08:00"
}