{
  "ProjectName": "SvnBridge",
  "Title": "SvnBridge - Use TortoiseSVN with Team Foundation Server",
  "Description": "SvnBridge allows you to use TortoiseSVN and other Subversion clients with Team Foundation Server. It converts the calls made by your Subversion client to the API supported by TFS.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />SvnBridge allows you to use TortoiseSVN and other Subversion clients with Team Foundation Server. It converts the calls made by your Subversion client to the API supported by TFS.<br /><br /><b>Note: You don&#39;t need to download SvnBridge to use Subversion clients with CodePlex.  Every CodePlex project automatically has a Subversion URL (e.g. <a href=\"https://tfsbuildextensions.svn.codeplex.com/svn/\">https://tfsbuildextensions.svn.codeplex.com/svn/</a>).</b><br /><br />SvnBridge acts as a bridge between TortoiseSVN and TFS.  You point SvnBridge at the TFS server, and point TortoiseSVN at SvnBridge.  This allows you to use TortoiseSVN with any TFS server without needing to change the TFS server in any way (no need to convince your TFS system administrator of anything!).<br /><br />SvnBridge has both a client and a server version.  The client version runs as an executable in your system tray, and the server version runs under IIS.  The client version is quick and easy to run on your development machine, and the server version lets you set it up for multiple developers to use or to have &quot;always on&quot;.<br /><br />Give SvnBridge a try and let us know how it works for you!  Feedback, issues, or suggestions can be submitted in the <a href=\"http://www.codeplex.com/SvnBridge/WorkItem/List.aspx\">issue tracker</a>.<br /><br /><b>Current Status</b><br />SvnBridge has released its fourth version.  The core source control features (checkout, update, commit, repository browser, show log) are all supported.  Click <a href=\"https://svnbridge.codeplex.com/wikipage?title=Current%20Feature%20Status&referringTitle=Home\">here</a> to see the current status of individual commands.<br /><br /><b>VisualSVN</b><br />If you haven&#39;t heard of VisualSVN, it integrates Visual Studio with TortoiseSVN.  I&#39;ve been using it with SvnBridge and highly recommend it.  Open source developers can request a free license of VisualSVN here: <a href=\"http://www.visualsvn.com/request-license.html\">http://www.visualsvn.com/request-license.html</a><br /><br /><b>Integration with CodePlex Work Items</b><br />You can visit this <a href=\"https://svnbridge.codeplex.com/wikipage?title=Work%20Items%20Integration&referringTitle=Home\">page</a> for detailed instructions about how you can integrate SVN commit message and CodePlex Work Items.<br /><br /><b>Reporting Errors</b><br />If you are running into errors using SvnBridge, please use our discussion forum for help.<br />When asking for help, please remember to include the SVN operation that have happened, and any errors that SvnBridge might have raised.<br />If you are using SvnBridge with the CodePlex servers, please specify the project that you are working with.<br />Using the information in <a href=\"https://svnbridge.codeplex.com/wikipage?title=TracingWithFiddler&referringTitle=Home\">TracingWithFiddler</a> can help us reproduce issues that happens against your local servers.<br /><br /><b>Future Plans</b><br />Version 5 plans include adding support for additional commands and continued bug fixes and performance optimizations.</div><div class=\"ClearBoth\"></div>",
  "TagList": "TFS,Team Foundation,Source Control,SubVersion,SVN,watch,Tools,codeplex,favorite,Source Code Control,Team System,cool,Team Foundation Serv,Codeplex Source Clnt,TortoiseSVN,Subscribed,svnbridge,infrastructure,TeamFoundationServer,https,SC,",
  "LastEdited": "2014-02-19T06:13:38.343-08:00"
}