{
  "ProjectName": "swoosh",
  "Title": "Swoosh",
  "Description": "Swoosh transfers active media playback from one to another player on another device sharing the same media storage. It currently supports VLC, XBMC and Winamp.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Swoosh</h1>\rSwoosh transfers active media playback from one to another player on another device sharing the same media storage. It currently supports VLC, XBMC and Winamp.\n<h3>How does it work?</h3>\rSwoosh does not stream media! It contains various Remote Control APIs in form of modules and defines actions which get triggered when the according global shortkey gets pressed. At the moment there is only one configurable action.<br />The Swoosh Action reads the playlist of the source machine including the current item and current seekposition. Then it applies the storage transformation defined for the target machine and enqueues all playlist items in the player running on the storage machine and resumes playback at the saved seekposition.<br /><br /><b>Example:</b> You are watching Doctor Who using VLC on you workstation while browsing. Eventually you want to turn off you pc and watch the rest of the episode on you tv connected to your mediapc which runs XBMC. You configure the Swooshaction on your workstation (once) an then press the configured short key. And the playback gets transfered.\n<h3>Remote Modules</h3>\rAt the moment the following modules are under development:\n<ul><li>VLC (OldHttp interface)</li>\n<li>XBMC v10 (v2 of the API)</li>\n<li>XBMC v11 (v4 of the API)</li>\n<li>WinAmp (AjaxAmp v3 interface)</li></ul>\nOne could think about:\n<ul><li>MediaCenter</li>\n<li>YouTube (scans all open browser sessions for youtube videos and assembles a playlist) (only a source module)</li>\n<li>A default module for all DirectShow compatible Players (wont support playlists)</li></ul>\n\n<h3>TODO</h3>\rGUI interface to configure the Swoosh setup. Currently one has to edit the xml configuration file manually.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "remote control,transfer,",
  "LastEdited": "2012-06-24T11:45:48.233-07:00"
}