{
  "ProjectName": "SyrinxMenu",
  "Title": "ASP.NET & MVC Multi-Level Drop Down Menu - JQuery",
  "Description": "A simple to use yet powerful and flexible Menu control that works in either ASP.NET or MVC style sites and comes with a jQuery plugin to manage in script.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Supports both ASP.NET MVC and ASP.NET WebForms</h1>\rRegularly maintained and used with confidence by thousands of production ASP.NET sites around the world.\n<h2>Some Examples</h2>\r<img src=\"http://www.syrinxcs.org/img/syrinxcsimages/CMS/TableSubMenu.jpg\" /><br />The above menu shows the new table menu item type and is from the demo site that comes with the download. <b>See a running demo of the above menu at <a href=\"http://menu.syrinx.ph\">http://menu.syrinx.ph</a></b>\n<hr />\n<img src=\"http://www.syrinxcs.org/img/syrinxcsimages/CMS/MenuWithDescriptions.jpg\" /><br />The above menu shows the description property of menu items.  In this example, the description is shown in the menu item with different css.  In other usages it could be a tooltip or even used as text for a statusbar type display.\n<hr />\n<img src=\"http://www.syrinxcs.org/img/syrinxcsimages/CMS/TwainMenu.JPG\" /><br /><br /><img src=\"http://www.syrinxcs.org/img/syrinxcsimages/CMS/ReadingMenu2.jpg\" /><br /><br /><img src=\"http://www.syrinxcs.org/img/syrinxcsimages/CMS/BlackMenu.jpg\" /><br />\n<h2>Get Started</h2>\rA simple quick start guide can be seen at<br /><a href=\"https://syrinxmenu.codeplex.com/documentation?referringTitle=Home\">Quick Start Guide</a><br /><br />Complete documentation on how to use this menu and apply CSS to it at<br /><a href=\"http://www.syrinxcs.org/dox/SiteMenu\">Complete Developer Guide</a><br /><br />General Topics of Discussion:\n<ul><li><a href=\"https://syrinxmenu.codeplex.com/wikipage?title=Why%20use%20Menus%20folder%20with%20xml%20files%20to%20define%20menu%20structure%3f&referringTitle=Home\">Why use Menus folder with xml files to define menu structure&#63;</a></li></ul>\n\n<h3>Overview</h3>\rThis is an easy to use yet powerful ASP.NET menu control that is an easy replacement for the standard ASP.NET menu control.  It also works as an ASP.NET MVC helper class.<br /><br /><b>Can use its own JavaScript to drive submenus, or integrate into systems like Twitter Bootstrap</b> which has its own JavaScript to drive submenus.  You still use the same .NET menu system, but can choose which type of browser menu you want to use.<br /><br />It supports unlimited levels of sub menus. It supports a variety of effects from jQuery to show/hide sub menus. Powerful CSS theme options. Best of all it works great in IE6 through 8, FireFox 3+, Chrome, and Safari. It works with a strict-mode DOCTYPE as well as html5 sites. Easy to extend to add additional functionality. <br /><br />This menu is stand alone and works by itself and is used as the foundation for the Syrinx Community Server (SCS) project menus which extends this menu to integrate deeply in SCS.<br /><br />The main full demo download is bulkier than it would be normally due to the MVC 4 project including its packages source.  This makes it easy to open the project, build it, and see the MVC menu in action.<br />Download now includes ASP.NET 3.5 demo site as well as new MVC 4 demo site and new ASP.NET 4.5 site using menu control integrated with bundling.<br /><br />Menu can now be used to generate standard &lt;ul&gt; style menu structure rather than its own table based structure.  This works well for site’s using a UI template that includes JavaScript for their own menu system.  The UL version of the menu is not supported by the menu JavaScript for showing submenus.  It is expected that the site has its own JavaScript and just wants the menu to generate the proper markup.  This is very common when getting themes from a place like <a href=\"http://themeforest.net/category/site-templates\">Theme Forest</a>.  This works great with Twitter Bootstrap navbars.<br /><br /><i>Note: The example images shown above are not provided with the menu.  They are examples of production sites that use the menu and ownership of the graphics remains with them.</i></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,C#,UserControls,jQuery,menu,Menubar,css,MVC,Menu control,Component,ASP.NET MVC,",
  "LastEdited": "2013-11-11T07:33:32.567-08:00"
}