{
  "ProjectName": "SyrinxCS",
  "Title": "Syrinx Community Server",
  "Description": "Use Syrinx Community Server to build dynamic and interactive web sites that use ASP.NET, AJAX, JQuery, kusog.org javascript framework, and the Nitobi AJAX controls like the Grid and Combo.\r\n\r\nNow supporting Phalanger PHP with targeted PHP support and PHP base starter site that uses Smarty Template Engine.  Amazing Possibilities with PHP .NET via Phalanger.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Syrinx Community Server</b><br />Use Syrinx Community Server to build dynamic and interactive web sites that use ASP.NET, AJAX, JQuery, kusog.org javascript framework, and the Nitobi AJAX controls like the Grid and Combo.<br /><br />Now supporting Phalanger PHP with targeted PHP support and PHP base starter site that uses Smarty Template Engine.  Amazing Possibilities with PHP .NET via Phalanger.<br /><br />Check out Syrinx and Syrinx CS in action at <a href=\"http://www.syrinxcs.org\">http://www.syrinxcs.org</a><br />View the step-by-step installation guide at <a href=\"http://www.syrinxcs.org/dox/SyrinxCSStarterSiteSetupGuide\">http://www.syrinxcs.org/dox/SyrinxCSStarterSiteSetupGuide</a><br /><br />This project is still very much active, and use use it every day to build web and windows apps in C# for our clients.  However, because we find the source repository on CodePlex to be sluggish for such a large code base, we moved to hosting the SVN repository on our own server.  We just couldnt use CodePlex for our daily development source repository, and once we made the move to our own SVN server the performance was good.  We&#39;d like to find a way to have our own SVN repository sync with CodePlex so that the latest changes were always here, but we didnt have to use CodePlex for the day-to-day check in/out work we do.<br /><br /><b>Multiple Starter Site Projects</b><br />You can start using Syrinx CS with our standard ASP.NET/JQuery system, or use the Phalanger PHP Starter Site to build your site using PHP and Smarty Template Engine using Syrinx CS.  Learn more about Phalanger at <a href=\"http://phalanger.codeplex.com\">http://phalanger.codeplex.com</a><br /><br />This project is huge and its very robust.  In a nutshell, it allows you to build core business logic that can then be used in a windows app and a web app.  Syrinx CS has dozens of features like CMS, contact management, ecommerce, media libraries, user forms, and more, all of which can be used in a web or windows interface.  Our clients do things like manage their ecommerce product data in the Syrinx CS windows app and then sync the changes to the web site when they are ready to go live.  They build business directory listings of things like restaurants and hotels offline on the windows app, and then sync to web site when its ready.  Of course, they can also write articles for the CMS in the windows app and then sync to their web site.<br /><br />The core library behind Syrinx CS helps make it possible for us to write 90% of our code once for all the GUI environments supported by syrinx CS, yet still take deep advantage of UI specific technologies like JQuery and Ajax for web sites and offline image editing and performance of working in windows app.  This is the power of Syrinx CS and SWAF.<br /><br />The Syrinx Community Server (Syrinx CS) open source project can take your next web site to new heights of power and ability. Because the Syrinx CS is built on top of our Syrinx Web Application Framework (SWAF) you can build sites as simple as a personal blog to as powerful as a multiple-membership media site with customized functionality built on top of it and beyond.<br /><br />At the simplest level, you can just deploy the starter site and database and customize its content. The starter site has real articles, images and themes that you can edit directly to make it into your own rather than starting from a blank web page.<br /> <br />If you’re a serious ASP.NET developer, you can dig deeply into the rich architecture and development environment of Syrinx CS to build powerful web applications that go way beyond what other “Community Building Environments” offer. Syrinx CS is built completely from standard C#. While we have been focusing on the Microsoft environment of Windows and IIS, we have done testing with Syrinx CS in Linux and Apache using the Mono .NET environment.   In the future we intend to have a deployment that is verified to work completely in Linux.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Community,CMS,ASP.NET 4.0,C#,ecommerce,",
  "LastEdited": "2012-01-14T20:37:35.877-08:00"
}