{
  "ProjectName": "TelescopeScripting",
  "Title": "TelescopeScripting",
  "Description": "Meant to be used as an interface with RTGUI+S for easy scripting and telescope control",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nThis project is mean to be used in conjunction with <a href=\"http://www.rtgui.com/\">\r\nRTGUI&#43;S</a>&nbsp;and <a href=\"http://sourceforge.net/projects/skychart/\">Cartes du Ciel (Skycharts)</a>&nbsp;for easy scripting and observing.<br>\r\n<br>\r\n<br>\r\nFeatures</p>\r\n<ul>\r\n<li>Scripts - consist of RTGUI&#43;S commands. &nbsp;These commands control RTGUI and Cartes du Ciel as well as telescopes or other programs that accept command line arguments. Per RTGUI&#43;S limitations, you can only have up to 25 commands per script.\r\n</li><li>Script saving and loading. &nbsp;Once you create and name a script, you can save it to your computer. &nbsp;You can then retrieve later and load it up.\r\n</li><li>Script modifications - It is made easy to add, insert, remove commands from a script. &nbsp;In addition, you can reorder commands in a script by moving them up or down. &nbsp;If you have a command selected, you can also modify it and save the changes.\r\n</li><li>Play Lists - these are groups of scripts that can be run, one after the other. You can add, remove or reorder playlists in a similar fashion to Scripts.\r\n</li><li>Catalogs - RTGUI comes with a couple of catalogs, as well as others that you can add. However, sometimes you want a more refined catalog to work with. &nbsp;You can now create &quot;sub-catalogs&quot; from other catalogs. &nbsp;\r\n</li><li>You can add, remove, and reorder items in these sub-catalogs you create. &nbsp;Once you have saved a &quot;sub-catalog&quot; you can create scripts and play lists based on the catalog.\r\n</li><li>You can refine catalogs you are searching through using&nbsp;<a href=\"https://msdn.microsoft.com/en-us/library/az24scfc%28v=vs.110%29.aspx\">regular expressions</a>\r\n</li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Telescope,RTGUI,RTGUI+S,Skycharts,Cartes du Ciel,",
  "LastEdited": "2015-04-11T09:41:46.713-07:00"
}