{
  "ProjectName": "TFSIntegration",
  "Title": "TFS Integration Platform",
  "Description": "The TFS Integration Platform enables developers to build tools that integrate other systems with TFS.  Building one way and bidirectional tools for VC and WIT is much simpler with this platform, as most of the TFS interaction and migration/sync actions are provided for you.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><span style=\"font-size:large\"><strong><span style=\"color:#ff0000\">THIS SOLUTION HAS BEEN DEPRECATED</span></strong></span> - Please refer to the&nbsp;announcement of&nbsp;the preview of the\r\n<strong><a href=\"https://blogs.msdn.microsoft.com/visualstudioalm/2016/11/16/import-your-tfs-database-into-visual-studio-team-services/\" target=\"_blank\">TFS Database Import Service for Visual Studio Team Services</a>&nbsp;</strong>for&nbsp;a recommended migration\r\n solution.</p>\r\n<p>&nbsp;</p>\r\n<h1>Welcome to the TFS Integration Platform!</h1>\r\n<hr>\r\n<p><span style=\"font-size:large\"><strong><span style=\"color:#ff0000\">NOTICE</span></strong></span></p>\r\n<ul>\r\n<li>TFS Integration Platform&nbsp;was designed to work with Team Foundation Server 2012 and earlier. Use of these integration tools with TFS 2013 and 2015 may cause errors. TFS Integration Platform&nbsp;will not be supported past May 31, 2016.\r\n</li><li>This project, issues and discussions are no longer tracked. Please use the MSDN\r\n<a href=\"https://social.msdn.microsoft.com/Forums/vstudio/en-US/home?forum=tfsintegration\" target=\"_blank\">\r\nforum </a>instead. </li></ul>\r\n<div>\r\n<hr>\r\n<br>\r\nThe TFS Integration Platform is a project developed by the Team Foundation Server (TFS) product group and the\r\n<a href=\"#Rangers\">Visual Studio ALM Rangers</a> to facilitate the development of tools that integrate TFS with other systems. Currently, the scope of this project is to enable TFS to integrate with other version control and work-item/bug tracking systems,\r\n but the eventual goal of this project is to enable integration with a broader range of tools/systems (i.e. build). This platform enables the development of two major classifications of tools: tools that move data unidirectionally into TFS, and tools that synchronize\r\n data bidirectionally. <br>\r\n<br>\r\nPrior to this project, we had a similar effort called the TFS Migration and Synchronization Toolkit. This platform is designed to replace that project. You can find the archived wiki content for that project on the\r\n<a href=\"/TFSIntegration/wikipage?title=Archive&referringTitle=Home\">Archive</a> page, and the releases are still available on the Downloads tab.</div>\r\n<h1>Should you be here or on Visual Studio Code Gallery?</h1>\r\n<p>The Microsoft Visual Studio <strong>TFS Integration Tools</strong> is a suite of tools, built on top of the\r\n<strong>TFS Integration Platform</strong>, that facilitate integration between external systems and Team Foundation Server. For more information visit\r\n<a href=\"http://blogs.msdn.com/b/willy-peter_schaub/archive/2010/09/02/tfs-integration-platform-or-tools-or-both.aspx\">\r\nthis page</a>&nbsp;or review <a href=\"http://tfsintegration.codeplex.com/releases/35476/download/147910\">\r\nthe latest data sheet</a>. <br>\r\n<br>\r\nThis product is also released through the Visual Studio Code Gallery.&nbsp; To decide whether you should be consuming that release or a build from this Codeplex site you can review the following three questions:</p>\r\n<ol>\r\n<li>Are you looking for&nbsp;a packaged&nbsp;product, that you can install and run, then you should be looking at the Team Foundation Server Integration Tool\r\n<a href=\"http://visualstudiogallery.msdn.microsoft.com/eb77e739-c98c-4e36-9ead-fa115b27fefe\">\r\nhere</a>. </li><li>Are you looking for the <strong>bleeding-edge</strong> (BETA &amp; work in progress) binary, source and documentation bits, then this Codeplex site is the correct location\r\n</li><li>Are you a <strong>custom adapter</strong> developer looking for the TFS Integration Platform, then this Codeplex site is the correct location\r\n</li><li>Interested in contributing? Visit the page on <a href=\"/TFSIntegration/wikipage?title=Contributing&referringTitle=Home\">\r\nContributing</a> for more information. Check out these <a href=\"/TFSIntegration/wikipage?title=Community&referringTitle=Home\">\r\nCommunity</a> developed migration/integration projects. </li></ol>\r\n<p><strong>Have a question or comment?</strong> Please use <a href=\"http://social.msdn.microsoft.com/Forums/en-US/tfsintegration\">\r\nthe forum</a> rather than the Issue Tracker on this site. We monitor the forum closely and infrequently look at items in the Issue Tracker.</p>\r\n<h2>Migration Guidance</h2>\r\n<p>If you&rsquo;re thinking about migrating to TFS, but don&rsquo;t know where to start, then check out the recommended download (Migration Guidance Document) for the\r\n<a href=\"http://tfsintegration.codeplex.com/releases/view/35476\">TFS Integration Platform</a> release. This document outlines many of the common scenarios for migrating data into TFS, and it provides recommended options for each scenario.\r\n<br>\r\n<br>\r\nIf you&rsquo;re looking for migration tools or partner services, please also see <a href=\"http://msdn.microsoft.com/en-us/teamsystem/bb840033.aspx\">\r\nthe TFS Migration and Integration Solutions page on MSDN</a>.</p>\r\n<h3>Upgrade vs. Migration</h3>\r\n<p>One common area of confusion is around the definition of &quot;migration&quot;, especially as to how it compares with the term &quot;upgrade&quot;. Below is an explanation of how these concepts differ (also see the aforementioned\r\n<a href=\"http://tfsintegration.codeplex.com/releases/35476/download/126821\">Migration Guidance Document</a>).</p>\r\n<ul>\r\n<li><strong>Migration</strong> - For this project, and for TFS in general, we use the term &quot;migration&quot; to refer to moving data between two TFS server instances. Migration is done through the APIs of TFS by using external tools, and is a\r\n<strong>lossy data transfer</strong>. </li><li><strong>Upgrade</strong> - We would define &quot;upgrade&quot; as the fully supported, in-the-box process of changing to the next version of TFS (e.g. upgrading from TFS 2005 to TFS 2008). Upgrades are done at the database level, and are\r\n<strong>full fidelity, meaning there is no data loss</strong>. </li></ul>\r\n<h2>Scope</h2>\r\n<p>TFS is currently comprised of several major feature areas, including, version control, work item tracking, build automation, reporting, and SharePoint. At this point in time, the TFS Integration Platform is scoped to only support a the following TFS features:</p>\r\n<ul>\r\n<li><strong>Version Control</strong> - This includes the migration of all files and folders, and support for preserving changeset contents. The following changetypes are currently supported: add, edit, rename, delete, branch, merge, and type.\r\n</li><li><strong>Work Item Tracking</strong> - This includes the migration of all work item revisions, fields, in-use areas and iterations, and links (including links to changesets).\r\n</li></ul>\r\n<h3>Vision</h3>\r\n<p>The TFS Integration Platform is a development platform for partners and customers who are interested in building bridges from other systems to TFS. One goal of the project is to make it simple to write a simple adapter for connecting such systems. We intend\r\n to continue to invest in raising the level of abstraction for those interested in building solutions by providing a common host UI and eventually wiring in features like offline and more natural cross-domain support into the platform.\r\n<br>\r\n<br>\r\nThrough the development of solutions built on top of this platform by our team, and by our partners, we plan to drive features back into the platform. Feedback from end users of those solutions will also be critical to prioritizing the right areas of investment,\r\n so please help us by sharing your experiences and feedback in our <a href=\"http://social.msdn.microsoft.com/Forums/en-US/tfsintegration\">\r\nforum</a>.</p>\r\n<h2>Limitations</h2>\r\n<p>Please also be aware of the Limitations that exist for this platform, as outlined on the\r\n<a href=\"http://visualstudiogallery.msdn.microsoft.com/eb77e739-c98c-4e36-9ead-fa115b27fefe\">\r\nVisual Studio Gallery</a> and in the <a href=\"http://tfsintegration.codeplex.com/releases/35476/download/126821\">\r\nMigration Guidance</a> document. Not all scenarios are currently able to be supported due to limitations of TFS, and not all features of TFS are in scope for this project.</p>\r\n<h2>Getting Started</h2>\r\n<p>If you're a developer and you are looking to get started building an adapter, the best resource for you is the Custom Adapter POC Documentation which you can find in\r\n<a href=\"http://tfsintegration.codeplex.com/releases/view/35476\">the TFS Integration Tools Documentation</a>, built by the Rangers. This release contains a document that walks through the setup of a development environment for the TFS Integration Platform,\r\n and contains a guided tour of a proof of concept (POC) adapter. The document was written with the purpose of helping adapter developers understand the key concepts for building adapters on the platform. Accompanying this document is the actual POC adapter\r\n source code, which is in the downloads page. <br>\r\n<br>\r\nIf you're looking to learn more details about the platform, the core architecture, and the included TFS adapters, check out\r\n<a href=\"http://tfsintegration.codeplex.com/releases/view/35476\">the TFS Integration Tools Documentation</a>.\r\n<br>\r\n<br>\r\nDevelopers looking to start building adapters will also need the installable from the\r\n<a href=\"http://visualstudiogallery.msdn.microsoft.com/eb77e739-c98c-4e36-9ead-fa115b27fefe\">\r\nVisual Studio Gallery</a>. This release contains the binaries for the platform as well as the TFS adapters.\r\n<br>\r\n<br>\r\nFor those developers that want to see the latest source code for this project, please go to the Source Code tab.\r\n<br>\r\n<br>\r\n<a name=\"Rangers\"></a></p>\r\n<h2>Visual Studio ALM Rangers</h2>\r\n<p>The <a href=\"http://msdn.microsoft.com/en-us/teamsystem/ee358786.aspx\">Visual Studio ALM Rangers</a> are delivering guidance to this initiative with support from Microsoft software engineers, Microsoft Most Valued Professionals (MVPs) and technical specialists\r\n from technology communities around the globe, giving you a real-world view from the field, where the technology has been tested and used.</p>\r\n<h2>Links</h2>\r\n<ul>\r\n<li><a href=\"http://msdn2.microsoft.com/en-us/teamsystem/bb840033.aspx\">Migration and Integration Solutions</a>\r\n</li><li><a href=\"http://blogs.msdn.com/b/willy-peter_schaub/archive/2011/06/06/toc-tfs-integration-tools-blog-posts-and-reference-sites.aspx\">Table of Contents for Willy's blog</a>\r\n</li><li><a href=\"http://blogs.msdn.com/willy-peter_schaub\">Willy Peter's Blog</a> </li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "TFS,power toys,vsts,Toolkit,Version Control,converter,migration,Workitem Tracking,tfs migration wit sc,TFS Migration,TFS Synchronization,Rangers; ALM Rangers,Visual Studio ALM,VS ALM Rangers,ALM,ALM Rangers,Guidance,Team Foundation Serv,Migration Tool,sad,",
  "LastEdited": "2016-11-19T19:18:24.143-08:00"
}