{
  "ProjectName": "tfsprojects",
  "Title": "TFS Projects",
  "Description": "Lists all projects and users for a given TFS instance, or optionally lists users for only one specified project.  Users are grouped into their server groups.",
  "MovedLink": "https://github.com/jeberhar/tfsprojects",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br /><br /><b>UPDATE:  TFS Projects 2.1 is here!  I spent a lot of time polishing the project on this release, but there are many new features I think you will like as well.  Download it today!</b><br /><br /><b>If you have downloaded TFS Projects, please leave a rating!  Also, feel free to suggest improvements or features in the discussions.  Your feedback is very important to me!</b><br /><br />TFS Projects will provide a list of all users, by group, for each project or for only one project on a given Team Foundation Server instance via the TFS API.  <br /><br />The default port for the instance is required, which is usually 8080 unless it has been customized, in which case you can specify your port in the app.  If you don&#39;t know the default port, ask your Team Foundation Server administrator.<br /><br />There is much more information about each user that could be displayed, look at the IGroupSecurityService2 object for more info.  For this program I only used Name and MailAddress for the sake of brevity.<br /><br />TFS Projects is a Windows Forms application, requiring .Net 4.5.  To make modifications download the source and load up in Visual Studio, the full project is in the zip file to make customizations easier.<br /><br />If you need CSV output, check out the helper utility that <b>lgwapnitsky</b> wrote at https://tfsprojectstocsv.codeplex.com/ <br /><br />If you are using TFS 2005, check out http://tfsusers.codeplex.com for a comprehensive user audit check for that version of TFS.<br /><br /><img src=\"/projects/tfsprojects/a5b7365a-71a4-4a8e-9010-0c2ef5088a5f\" alt=\"TFSProjectsScreenshot.jpg\" title=\"TFSProjectsScreenshot.jpg\" /><br /><br />Copyright 2016 Jay Eberhard.</div><div class=\"ClearBoth\"></div>",
  "TagList": "TFS,UserControls,User Controls,Audit,administration,cool,notification,Open Source,User Profiles,TFS Audit,",
  "LastEdited": "2016-08-05T11:59:04.777-07:00"
}