{
  "ProjectName": "tfsplus",
  "Title": "TFSPlus - Visual Studio Addin for Team Foundation Server",
  "Description": "TFS Source Control extensions to Visual Studio: 'Get' from History; Open .sln in new instance; Restore SC Explorer location on startup; 'Find File in SC Explorer' from Solution Explorer; plus more...",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>Project Description</h1>\r\n<p>TFS Source Control extensions to Visual Studio: 'Get' from History; Open .sln in new instance; Restore SC Explorer location on startup; 'Find File in SC Explorer' from Solution Explorer; plus more...</p>\r\n<h1>Features</h1>\r\n<ul>\r\n<li><strong>Find File in TFS Explorer</strong> - Navigate the Source Control Explorer window to the location of the selected file. Available in Solution Explorer, Code Window, and Pending Changes Window.\r\n</li><li><strong>Get Latest Version (Forced)</strong> - Gets the selected file or folder (recursive) even if local version matches the server version (useful if file has been deleted locally since last Get). Equivalent to Get Specific Version, with bottom checkbox\r\n ticked. Available in Solution Explorer, Source Control Explorer, and Code Window.\r\n</li><li><strong>Open Solution in New Environment</strong> - Opens the selected solution file (.sln) in a new instance of Visual Studio. Available in Source Control Explorer\r\n</li><li><strong>Get This Version</strong> - Gets the selected file or folder at the specified changeset version. If you have the file checked out, will 'rollback' to that version (ie. no conflict when you later checkin). Available from History window.\r\n</li><li><strong>Checkout non-latest notification</strong> - If you do not have the latest version of a file when you check it out, you will be prompted by a warning message box.\r\n</li><li><strong>Restore Source Control Explorer location on startup</strong> - Current location in Source Control Explorer is persisted on closing Visual Studio, and restored on next startup.\r\n</li></ul>\r\n<p><img src=\"http://download.codeplex.com/download?ProjectName=tfsplus&DownloadId=163588\" alt=\"Find File in TFS Explorer\" width=\"397\" height=\"219\" style=\"border:1px solid black; margin:4px\"></p>\r\n<p><img src=\"http://download.codeplex.com/download?ProjectName=tfsplus&DownloadId=163589\" alt=\"Get This Version\" style=\"border:1px solid black; margin:5px\"></p>\r\n<p><img src=\"http://download.codeplex.com/download?ProjectName=tfsplus&DownloadId=163590\" alt=\"Open in New Environment & Get Latest Forced\" style=\"border:1px solid black; margin:5px\"></p>\r\n<p>&nbsp;</p>\r\n<h1>Additional Notes</h1>\r\n<p>Developed for Microsoft Visual Team System 2008 Development Edition</p>\r\n<h1>Contact</h1>\r\n<p>tfsplus@live.com.au<br>\r\n<br>\r\n</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "TFS,TFS Addin,",
  "LastEdited": "2010-11-04T05:52:58.78-07:00"
}