{
  "ProjectName": "TfsSearchCode",
  "Title": "TfsSearchCode. Search strings across text files under TFS Version Control",
  "Description": "TfsSearchCode search a string across text files under Team Foundation Server Version Control.\r\nEnter a string to Search, the node of the three and search under like pattern of file names on serach.\r\nIt's developed under VB.NET languaje and Microsoft .NET Framework version 3.5\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />TfsSearchCode search a string across text files under Team Foundation Server Version Control.<br />Enter a string to Search, the node of the three and search under like pattern of file names on serach.<br />It&#39;s developed under VB.NET languaje and Microsoft .NET Framework version 3.5<br /><br /><br />In our develops we have find that we need searches like Visual Source Safe 6.0 in example to find a GUI string AAAA-BBBBB-CCCC-DDDD in some vbp proyect files on Visual Basic 6.0 and search any thing in our code in VB.NET<br /><br />This is the main form dialog. On this you can especify de id of TFS server in url or ip addresses, your count (login and password) and push over &quot;Connect button&quot;. Then connection is established and load the nodes of proyects on TFs server. You must especify your root node for your search, type the pattern of file names to include on the seacrh and type the text to search, then press search.<br /><img src=\"/projects/TfsSearchCode/06be9330-765f-432a-b53e-7aa6d77069b3\" alt=\"portada.jpg\" title=\"portada.jpg\" /><br /><br />When TfsSearchCode finish, shown on grid the details that match the search, if you press double clic or enter on item line displays a simply viewer of text file<br /><img src=\"/projects/TfsSearchCode/f5c6a64f-07b9-41b9-801e-006d1caca42d\" alt=\"portada2.jpg\" title=\"portada2.jpg\" /><br /><br />The solution compund 4 projects. TfsSearcCode.dll is the assembly with classes for operate with object family of TFS, is really the kernel of solution. <b>TfsSearcCodeDeskTop</b> is the first and more basic search of strings in TFS (in the future we hope a version of plugin addin for VB6 and VS2008, and new arquitect for cliente/server configurations for non local developers) use it for your job. There are three more projects (search server, simple client and console monitor) we use only for develop and investy reasons, not are projects to use.</div><div class=\"ClearBoth\"></div>",
  "TagList": "TFS,Version Control,Search,",
  "LastEdited": "2011-11-09T06:11:14.387-08:00"
}