{
  "ProjectName": "tfstimesheets",
  "Title": "TFS Timesheets",
  "Description": "A custom work item control for Team Foundation Server that allows timesheet data to be captured against a work item.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A custom work item control for Team Foundation Server that allows timesheet data to be captured against a work item.<br /><br />One of the key weaknesses (in my opinion) with Team Foundation Server work items at present is the difficulty to record time spent against a project.  Sure you can track time in the &#39;Work Completed&#39; field and can even report on what changes were made to this field over time ... but this assumes that developers will always update the work items on the correct day and still fails to give simple visibility of how much time different team members have spent on a given work item.<br /><br />At the moment the code included is far from perfect.  It was put together to allow me to learn about changes to custom work item controls in TFS2010 ... so there are still a few features that are less than ideal for anyone else to make use of this component.  An example is some of the field names are still hard coded into the control etc.<br /><br />We&#39;ve used this control on a couple of projects now, and I&#39;ve found that the control has helped to keep the work remaining / work completed values up to date by creating visibility of how much time team members are logging against work items on any given day.  I&#39;ve got a short list of changes that I plan on making, which I will log in the Issue Tracker shortly.<br /><br />A basic description of this component can be found in the following blog posts I created earlier this year about creating custom work item controls for TFS2010;<br />\n<ul><li><a href=\"http://nickhoggard.wordpress.com/2009/11/12/tfs-2010-beta-2-custom-work-item-controls-step-1-getting-started/\">http://nickhoggard.wordpress.com/2009/11/12/tfs-2010-beta-2-custom-work-item-controls-step-1-getting-started/</a></li>\n<li><a href=\"http://nickhoggard.wordpress.com/2009/11/14/tfs-2010-beta-2-%e2%80%93-custom-work-item-controls-step-2-work-item-setup/\">http://nickhoggard.wordpress.com/2009/11/14/tfs-2010-beta-2-%e2%80%93-custom-work-item-controls-step-2-work-item-setup/</a></li></ul>\n<br />One thing that isn&#39;t clear in the blog posts but is worth noting:  I&#39;ve decided to store the timesheet data for each work item <b>attached to the work item itself</b>.  This has the advantage of not needing to either hack with TFS database, or add a new database as a dependency.  It does however introduce a difficulty when it comes to project level reporting, but I have decided that is the lesser of two evils at this stage.<br /><br /><br /><b>Note: This solution is in Visual Studio 2010 and will not work in Visual Studio 2008.</b></div><div class=\"ClearBoth\"></div>",
  "TagList": "TFS,TMS,",
  "LastEdited": "2010-05-30T03:49:22.517-07:00"
}