{
  "ProjectName": "TFSVTreeBrowse",
  "Title": "TFS Source Code Version Tree Browser",
  "Description": "This project aspires to create a Version Tree Browser for Team Foundation Server allowing for the visual presentation of branches, merges and version information. The exact format and requirements will be determined as part of this project based on published best practices, similarly mature related product features and TFS version control specific feature sets.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=News%20Feeds&referringTitle=Home\">News Feeds</a><br /><img src=\"/projects/TFSVTreeBrowse/0528b8ee-18a7-4502-bda6-28d6aa2366cb\" alt=\"vertigo_label2_30x30_with_name.jpg\" title=\"vertigo_label2_30x30_with_name.jpg\" />     <br />To see alternate images or drop in your own proposed image see the <a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=logoPage&referringTitle=Home\">logoPage</a><br />                                               <br />\n<h3>Announcement - I personally am halting activity in this project and have been meaning to make such an announcement for months. When I saw my first look into this functionality in Rosario I decided that efforts to address the same were not of value compared to waiting for the Roasrio release. Also I realzed I should have looked around a little better at some alternate presentation ideas versus in this case a lot of the idea coming from the SVN approach. Roasrio I expect to provide this functionality and do it better.</h3>\r\n<h3>If someone else would like to take ownership of this project and feel they&#39;d like to move foward with it please let me know. I suspect not but let me know. I might even continue to be a contributor but think that this specific effort is best left to stagnate.</h3>\r\n<h3>If you disagree let&#39;s hear from you! </h3>\r\n\n<h4>Announcement - Vertigo Beta 0.30 March 24, 2007- Released.</h4>\rVertigo Beta Minus (really an Alpha) is released. This functions as a plugin only for VSTx.<br /><br />\n<h2>Table of Contents </h2>\r\n<ul><li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Vision%20Statement&referringTitle=Home\">Vision Statement</a></li>\n<li><a href=\"http://www.codeplex.com/Project/ProjectPeople.aspx?ProjectName=TFSVTreeBrowse\">People</a>\n<ul><li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Biographies&referringTitle=Home\">Biographies</a> </li>\n<li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Blog%20Roll&referringTitle=Home\">Blog Roll</a> </li></ul></li>\n<li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Shared%20Documents&referringTitle=Home\">Shared Documents</a> \n<ul><li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Requirements&referringTitle=Home\">Requirements</a></li>\n<li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Design&referringTitle=Home\">Design</a></li>\n<li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Test%20Cases&referringTitle=Home\">Test Cases</a></li></ul></li>\n<li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Project%20Help&referringTitle=Home\">Project Help</a> \n<ul><li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Project%20Structure&referringTitle=Home\">Project Structure</a> \n<ul><li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=SCM%20Policies&referringTitle=Home\">SCM Policies</a>\n<ul><li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=source%20repository%20template%20map&referringTitle=Home\">source repository template map</a></li></ul></li></ul></li>\n<li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Project%20FAQ&referringTitle=Home\">Project FAQ</a></li>\n<li><a href=\"http://www.codeplex.com/Wiki/View.aspx?ProjectName=CodePlex&amp;title=CodePlex%20Wiki%20Markup%20Guide\">Wiki Markup Guide</a></li></ul></li>\n<li><a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Related%20Advertising%20Space&referringTitle=Home\">Related Advertising Space</a> <i>commercial postings, please go here</i> </li></ul>\n\n<hr />------------------------------------------------------------------\n<h5>Special thanks to <a href=\"http://www.mindfusion.org/flowchart-net.html\">MindFusion</a> for going above and beyond in the support of this community coding project. I provide high praise not only in their actual product but in their special support. See the <a href=\"http://blog.magenic.com/michaelr/archive/2006/07/21/2898.aspx\">News Feed</a> related to MindFusion&#39;s support of this project.</h5>\r<hr />-------------------------------------------------------------------<br />\n<h2>Welcome to project Vertigo.</h2>\r<h5>Jump into the <a href=\"http://www.codeplex.com/Project/ListForums.aspx?ProjectName=TFSVTreeBrowse\">discussion groups</a>; development and continued iteration <a href=\"http://www.codeplex.com/Wiki/View.aspx?ProjectName=TFSVTreeBrowse&amp;title=Vision%20Statement\">envisioning</a> is continually underway and we want all the input we can gather.</h5>\r\nCodePlex and a TFS Project<br /><br />Project Vertigo is a project for the creation of a Team Foundation Server Source Code Version Tree Browser. If you are familiar with Tortoise SVN version tree browser or Rational&#39;s version tree browser in either BaseCase or ClearCase UCM then you know what this is all about. Team foundation server does not provide a visual browser of the version tree around files or projects. <br /><br />Definately see the <a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Vision%20Statement&referringTitle=Home\">Vision Statement</a> for what this is all about. <br /><br />In speaking with the VSTS/TFS team this tool is known to be needed, but is not slated to be in the Orca&#39;s release. Thus the earliest we can expect the functionality in release version is following Orcas. Thus this community project is in place to begin to fill that gap.<br /><br />This is a project to fill not only a gap in TFS functionality but also to experiment with added collaborative community development. The CodePlex site with its wiki access on the front and Team Foundation Server on the back are an ideal mechanism. <br /><br />If you are interested in the project and want to get in on the ground floor things are just starting to come together. The task list will continue to grow. A vision statement in an open wiki format for accepted contributors and with a comment section for encouraged participation by the casual passer by is one of the first tasks.<br /><br /><br />Here are the basics on Vertigo:<br />\n<ul><li>Check out the Table of Contents for the <a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Requirements&referringTitle=Home\">Requirements</a> and <a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=Design&referringTitle=Home\">Design</a>. Whatever state these documents may be in can be made more valuable with the contribution of your thoughts.</li>\n<li>This project will be performed under some nature of quick iteration and for lack of a better term - Agile (as best as Agile can be performed in a virtual development team).</li>\n<li>The project will be targeting the 1.0 release version of Visual Studio 2005 and will also be geared toward SP1 as it is released.</li>\n<li>The scope for 1.0 will be strictly limited to provide the minimal set of functionality to make the tool of some value. Then we&#39;ll move on to the next rev of the tool.</li>\n<li>The licensing terms will be in accordance with the Microsoft Shared Source Pemissive License- so it&#39;s about as free a license as you can find.</li>\n<li>All of this product is not open source. There is a third party diagraming component in use with free runtime distribution and through a special agreement, an open model so that any developers on this project can develop with the tool without any licensing fees. See the <a href=\"https://tfsvtreebrowse.codeplex.com/wikipage?title=SCM%20Policies&referringTitle=Home\">SCM Policies</a> and <a href=\"http://blog.magenic.com/michaelr/archive/2006/07/21/2898.aspx\">News Feed Post</a> related to such.</li>\n<li>The project will in future iterations utilize .NET 3.0 (the programmtic section formerly known as WinFX) targeted first for XP and meant to be also targeted for Vista in parallel. And you never know, you might even see an SVG based version. </li></ul>\n<br />As you can see from the last bullet point it would be encouraged for folks with desires to work in any number of presentation areas, or alternate technologies to join in and we&#39;ll create alternate branches for various technological implementations. <br /><br /><br />Jump in. Get involved. Technical guidance and designs are always in a state of flux. If you like what you see contribute. If you don&#39;t like what you see then definately contribute to fix it.</div><div class=\"ClearBoth\"></div>",
  "TagList": "TFS,Team Foundation,Source Code Control,Branching,Version Control,",
  "LastEdited": "2008-02-24T10:09:52.22-08:00"
}