{
  "ProjectName": "tfswic",
  "Title": "TFS Work Item Collaborator for Lync",
  "Description": "TFS Work item collaborator(WIC) is a tool to help team members collaborate using Lync client right from Visual Studio 2010. WIC is a Visual Studio extension package which provides a tool window to display contributors to a particualr work item and lets you collaborate with them.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h3>Project Description</h3>\rTFS Work item collaborator&#40;WIC&#41; is a tool to help team members collaborate using Lync client right from Visual Studio 2010. WIC is a Visual Studio extension package which provides a tool window to display contributors to a particualr work item and lets you collaborate with them.<br /><br />Work Item Collaborator Tool Window displays all the contributors for a selected work item using Lync controls (Presence Indiactor with photograph).<br /><b>To display the &quot;Work Item Collaborator Tool Window&quot; in Visual Studio, go to View -&gt; Other Windows -&gt; Click &quot;Work Item Collaborator Tool Window&quot;</b><br />If you&#39;ve not selected any TFS work, It&#39;ll display some disabled controls. As soon as you select any work item (from TFS query, or Go To command (Gtrl+g)) this window will start displaying the contributors.<br />\n<h3>Features</h3>\r<ul><li>You can select the Assignee, creator or any other contributor (from the displayed Work item history list view) and start a contextual conversation with the selected contributor. </li>\n<li>To start a conversation hover your mouse over the &quot;User Presence Indicator&quot;(Photo view), it&#39;ll display the user contact card which facilitates the E-Mail, IM conversation, Lync Call, and Video call.</li>\n<li>The work item number and description will be visible on the title bar of the conversation window and a hyperlink to the work item(TFS Web access link) will be sent to the recipient once you start the conversation.</li>\n<li>The intent of this tool is to collaborate with the work item contributors, not to display the work item history. Hence the actual review comments and changed fields may not be completely visible in history item display. But, you can hover over the &quot;Review Comments&quot; and &quot;Changed Fields&quot; values to see a decent tool tip displaying the complete information.</li>\n<li>You can also filter the history items displayed by selecting work item field using the drop down provided below the history listing. The history item will only be displayed if the value of the selected field changed in that revision(History Item).</li></ul>\n<br /><b>You need to be signed in to the Lync client to start a conversation.</b><br />\n<h3>Prerequisites</h3>\r<ol><li>Microsoft Lync - Client</li>\n<li>Visual Studion 2010 with Team Explorer</li></ol>\n<h3>Installation Instructions </h3>\rDownload WorkItemCollaborator.zip file -&gt; Unzip -&gt; Double click the WorkItemCollaborator.vsix file to install the Visual Studio Extension.<br />\n<h3>FAQ</h3>\r<ul><li>Can this tool alter the state of any of the work items?\n<ul><li>Nope - This tool does not alter the state of the work item in any way, it executes only read operations using either VS automation or TFS API’s.</li></ul></li>\n<li>How do I uninstall this tool and go back to the previous TFS state?\n<ul><li>This tool does not change the state of the TFS projects or TFS connections, it just reads data. So there is not previous state. To uninstall this tool, In VS 2010, Go to Tools-&gt; Extension Manager -&gt; Select WorkItemCollaborator -&gt; Uninstall.</li></ul></li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Lync,TFS WorkItem Tools,TFS Plugin,Team Explorer,Lync Controls,",
  "LastEdited": "2012-07-08T16:47:23.56-07:00"
}