{
  "ProjectName": "throttlingsuite",
  "Title": "Throttling Suite for ASP.NET Applications",
  "Description": "The Throttling Suite provides throttling control capabilities to the ASP.NET applications. It is highly customizable; including \"log-only\" mode.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The Throttling Suite provides throttling control capabilities to the ASP.NET applications. It is highly customizable&#59; including &#34;log-only&#34; mode.<br /><br />For .NET Web API throttling please visit the <a href=\"http://throttlewebapi.codeplex.com\">Throttling Suite for Web API</a>.<br /><br />The library contains multiple controller types implementing different throttling algorithms: \n<ul><li>Linear throttling - limits the number of calls by enforcing consistent delay between consequent requests;</li>\n<li>Short Average - limits the number of calls by ensuring consistent average over period of time, but allowing to have smaller traffic bursts for shorter time spans; this type of throttling is very helpful cutting the requests floods caused by such user behaviors as multi-click or hard click on F5 button;</li>\n<li>Long Average - limits the number of calls by specified number of requests per configured duration as short-average does, but includes &quot;blocked&quot; calls into total count, penalizing client for excessive application use.</li></ul>\nEach throttling controller uniquely determines the client making requests. It does not purely rely on client IP address allowing multiple clients from the same network concurrently making requests to the IIS.<br />The Throttling Suite allows setting multiple controllers within the application and applying each to a pre-filtered traffic. The filters are also configurable.<br /><br />The Throttling Suite provides two modes: real blocking mode when request is blocked with 429 HTTP Status code and log-only mode whether it logs blocking information to IIS log, but allows request to continue. The log-only mode is very useful when there is a need to determine the most appropriate throttling configuration parameters.<br /><br />The code is highly optimized having very low memory impact and taking less than 0.3 ms to run on a regular development laptop.<br /><br />As an extra functionality it provides with real-time snapshot of current throttling status for all controllers. The snap-shot is available online as a JSON output. It requires configuration to assure authorized used as desired by an application.<br /><br />This component is also available as NuGet Package; search for &quot;ThrottlingSuite&quot; in NuGet Package Manager.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "throttling,asp.net,f5,f5 issue,multi-click,request throttling,requestfilter,throttling control,",
  "LastEdited": "2014-06-02T16:39:37.04-07:00"
}