{
  "ProjectName": "tinydeduplicator",
  "Title": "Tiny Deduplicator",
  "Description": "Tiny Deduplicator is a file deduplicator which can scan for duplicate files, and allows the user to control which duplicates they are going to keep or recycle.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br /><br />Tiny Deduplicator is a file deduplicator which can scan for duplicate files, and allows the user to control which duplicates they are going to keep, and which are going to be recycled. Tiny Deduplicator will send files to the recycle bin for you to confirm the deletion of-- assuming your recycle bin is enabled and you are not deduplicating a network drive, of course.<br /><br />In its current form, Tiny Deduplicator is a mere 27KB (including the GUI); however, it has the following features:<br />\n<ul><li>Easily browse and select which directory to recursively scan for duplicates.</li>\n<li>Ability to open the file location for one or more files.</li>\n<li>Allows the user to specify a selection strategy, which is particularly helpful when dealing with large numbers of duplicate files. Available options are &quot;None,&quot; &quot;Keep First,&quot; and &quot;Keep Last.&quot;</li>\n<li>Ability to turn on or off the &quot;Are you sure?&quot; deletion prompt.</li>\n<li>Ability to turn on or off the feature to delete directories which have been made empty by Tiny Deduplicator.</li>\n<li>Only sends files to the recycle bin, where you can then confirm the deletions.</li>\n<li>Keeps track of which files for the particular query have been recycled and highlights recycled files in red.</li>\n<li>Runs on all machines with .NET 4.0 or higher.</li>\n<li>Safely ignores files and directories which you do not have permission to access.</li>\n<li>It is tiny! The compiled executable is 27KB, and the entire solution is less than 1200 lines of code.</li></ul>\n<br /><b>License</b><br /><br />Copyright 2014 Thomas Rega<br /><br />Licensed under the Apache License, Version 2.0 (the &quot;License&quot;);<br />you may not use this file except in compliance with the License.<br />You may obtain a copy of the License at<br /><br />   http://www.apache.org/licenses/LICENSE-2.0<br /><br />Unless required by applicable law or agreed to in writing, software<br />distributed under the License is distributed on an &quot;AS IS&quot; BASIS,<br />WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.<br />See the License for the specific language governing permissions and<br />limitations under the License.<br /><br /><b>Contributor</b><br /><br />Thomas Rega</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-05-23T00:05:11.133-07:00"
}