{
  "ProjectName": "tooltipservice",
  "Title": "Silverlight Advanced ToolTips",
  "Description": "This Silverlight ToolTipService makes it easier to set tooltips on Silverlight controls with a specified delay and display duration. It's developed in C# and delivered as a Silverlight library.\nYou can set initial delay, fade-out and display duration properties of a ToolTip.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This Silverlight ToolTipService makes it easier to set tooltips on Silverlight controls with a specified delay and display duration. It&#39;s developed in C&#35; and delivered as a Silverlight library.<br />You can set initial delay, fade-out and display duration properties of a ToolTip.<br /><br /><b>Introduction</b><br />It surprised me that a simple option like setting the display time or the initial delay of a ToolTip is still not possible in Silverlight, although these properties are present in their WPF counterpart.<br /><br />Sometimes, you want some custom ToolTip behavior: <br />for instance, some ToolTips need to persist as long as the control has focus, or others need a specific display duration (for example 10 seconds), or should only show up after an initial delay of 3 seconds.<br />The default Silverlight setting is a display time of 5 seconds, and then it’s gone until you mouse out and mouse over the control again.<br /><br />Optionally, you can also set a custom Storyboard that is triggered when a ToolTips opens or closes, using the OpenAnimation and CloseAnimation properties.<br /><br />Since Silverlight already provides us with a static ToolTipService class that takes care of the basic ToolTip functionality, I thought it was a good idea to extend its behavior a bit. <br />Initially. <br />It didn&#39;t take me long until I hit some MS internal exceptions.<br /><br /><b>Features</b><br />That’s how I ended up creating the following <u>custom ToolTipService</u> and <u>custom ToolTip</u> class.<br />It provides <b>new ToolTip behaviors</b>: \n<ol><li>you can set <i>persistent ToolTips</i>: duration = until mouse out (<i>DisplayTime</i> = int.MaxValue)</li>\n<li>you can specify the amount of seconds the ToolTip should display (<i>DisplayTime</i> property)</li>\n<li>you can specify a Storyboard to be triggered when a ToolTip opens (<i>OpenAnimation</i> property)</li>\n<li>you can specify a Storyboard to be triggered when a ToolTip closes (<i>CloseAnimation</i> property)</li>\n<li>you can specify an initial delay for the ToolTip (<i>InitialDelay</i> property)</li>\n<li>you can <i>databind the ToolTip content</i></li></ol>\n<br /><b>Release</b><br />Latest release: \t<a href=\"https://tooltipservice.codeplex.com/releases/view/60867\">Silverlight Advanced ToolTips v2.2.0</a><br />Release notes:   <a href=\"https://tooltipservice.codeplex.com/wikipage?title=Changelog&referringTitle=Home\">Changelog</a><br /><br /><b>How to use</b><br />If you download the source code (<a href=\"https://tooltipservice.codeplex.com/releases/view/60867\">Silverlight Advanced ToolTips v2.2.0</a>), you&#39;ll have a demo Silverlight application that explains the use of of this library, both from within XAML and in C# code.<br />Take a look at the sample application <a href=\"http://projects.xavierdecoster.com/tooltips/\">here</a>).<br /><br />There is also a great video tutorial to be found <a href=\"http://windowspresentationfoundation.com/Tutorials/ToolTip/\">here</a>.<br />For more documentation on this library, please visit the <a href=\"https://tooltipservice.codeplex.com/documentation?referringTitle=Home\">Documentation</a> tab, or visit my <a href=\"http://www.xavierdecoster.com\">blog</a> for the latest news.<br /><br />For the moment being, this solution fit’s to provide this behavior. <br />Ofcourse, if anyone has a better solution for this, please feel free to point us in the right direction with your suggestions and/or remarks.<br /><br />If you like it, please vote for it on <a href=\"http://silverlight.uservoice.com/pages/4325-runtime-feature-suggestions/suggestions/387214-enhanced-tooltips?ref=title\">Silverlight Uservoice</a>.<br /><br />Above all, have fun with Silverlight and I wish you impactful developments!</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,Silverlight,Silverlight Controls,tooltip,Silverlight NPE,",
  "LastEdited": "2011-06-22T12:31:06.093-07:00"
}