{
  "ProjectName": "TouchRC",
  "Title": "TouchRC",
  "Description": "Controlling Vista Media Center/ Windows 7 Media Center from your windows mobile device.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Controlling Vista Media Center&#47; Windows 7 Media Center from your windows mobile device.<br /><br />TouchRC is a WM application to control VMC/7MC via your phone. It uses the VmcController <a href=\"http://vmccontroller.codeplex.com\">http://vmccontroller.codeplex.com</a> on the host PC, which needs to be installed. If you are installing on Windows 7, then there are instructions in one of the discussions of the project.<br /><br />Also, I dont really have any nice icons, which is a bit of a downer. Though if you want to add your own, then feel free and just replace the files in the gfx folder in the program files dir. If you wat to share, then please send them to me, I&#39;m looking for some good default ones!<br /><br />Brief instructions...<br /><br />It should be self explanitory on how to add a computer. You can use either an IP address or the computer name.<br />To edit/remove a computer from the list, press and hold the computer for longer than one second.<br /><br />In any screen (once you have selected a computer):\n<ul><li>a swipe from left to right brings up the keyboard. To exit screen, swipe from left to right.</li>\n<li>a swipe from right to left brings up the &#39;Now Playing&#39; screen. To exit screen, swipe from right to left.</li></ul>\n<br />If you have a server of media that uses the MyMovies metadata, then you can cache the information on the phone!!<br />In the Settings.xml file, include the cache directory path within &#39;MetadataCacheDir&#39; tags in each computer. In this directory you should place some virtual folder .vf files as per MediaBrowser. (ie, a .vf file containing a list of locations e.g., &#39;folder:\\\\SERVER\\Films&#39;, but only one folder per line).<br />In the Main Menu screen for a computer, in the pull up options bar is an icon on the right. This browses and caches all the metadata from the virtual folders.<br />This is currently only used in the &#39;Now Playing&#39; screen - if it finds metadata for the currently playing media, then it will display the proper name, and poster.<br />I have now also written a metabrowser screen - from the Now Playing screen, if metadata has been located for the currently playing media, and you select it, then it will bring up a new screen with film synopsis/tv show overview.<br /><br />I&#39;ve currently had no feedback at all (don&#39;t know if this is good or bad??). Please let me know what you think of the app so I may be able to improve it.<br />The only issue I keep coming across is OutOfMemoryException, I&#39;ve tried (in vain) to locate where I have a memory leak, but so far I&#39;ve been unable to find it! Seriously, if anyone knows anything on this subject, and you want to help me locate it, I&#39;m not too proud to ask for help! :)<br /><br />Screenies...<br />Main Screen (Portrait)             <br /><img src=\"http://i655.photobucket.com/albums/uu275/evorgevol/new%20pics/Screen07.png\" /> <br />Main Screen (Landscape)<br /><img src=\"http://i655.photobucket.com/albums/uu275/evorgevol/new%20pics/Screen06.png\" /><br /><br />Remote Control (Portrait)                  <br /><img src=\"http://i655.photobucket.com/albums/uu275/evorgevol/new%20pics/Screen01.png\" /> <br />Remote Control (Landscape)<br /><img src=\"http://i655.photobucket.com/albums/uu275/evorgevol/new%20pics/Screen04.png\" /><br /><br />Metadata screen (Portrait)                  <br /><img src=\"http://i655.photobucket.com/albums/uu275/evorgevol/new%20pics/Screen03.png\" /> <br />Metadata screen (Landscape)<br /><img src=\"http://i655.photobucket.com/albums/uu275/evorgevol/new%20pics/Screen02.png\" /><br /><br />If you have any queries, don&#39;t hesitate to ask me!<br /><br />Thanks,<br /><br />~evorgevol<br /><br />If you like my work, feel free to fuel me!<br /><a href=\"https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&amp;hosted_button_id=5906996\"><img style=\"border:none;\" src=\"https://www.paypal.com/en_GB/i/btn/btn_donate_LG.gif\" alt=\"Paypal\" title=\"Paypal\" /></a></div><div class=\"ClearBoth\"></div>",
  "TagList": "Windows Media Center,windows mobile 6,remote control,7mc,",
  "LastEdited": "2009-06-04T01:14:15.377-07:00"
}