{
  "ProjectName": "TrafficMFD",
  "Title": "Orbiter Traffic MFD",
  "Description": "A module that will allow Traffic Control and dynamic traffic in Orbiter. Orbiter is a free space flight simulator by Dr. Martin Schweiger (www.orbitersim.com)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>News</h1>\r\n10 July 2009: Over 50 downloads and that for something that is not even officially released yet! Can I ask a big favor from those that have tried it out to please provide some feedback, big please. Did you get it to work? What do you think of the concept? Must I continue with its development? Your feedback will be greatly appreciated.<br /><br />23 February 2009: I have just converted the solution to use Visual Studio 2008.<br /><br />12 June 2008: Man! Already half of this year has passed without me even getting close to working on this project again. I could really do with some help...<br />The new version of Orbiter is out in Beta, so I will also have to look at what&#39;s needed to make it work with this new version. Hopefully there would not be a lot of change required. Anyway, this is just a short post to mainly inform that this project is still alive (although in hibernation. It is winter in the southern hemisphere).<br /><br />17 January 2008: Greetings of the new year to all. Just a short message to let you know that I am still working on this project. Its just that real life is eating up a lot of my spare time which means that I cannot get to working on this project as much as I would like. Hopefully this year will be little bit better than the last one.<br /><br />05 July 2007: There is an <a href=\"https://trafficmfd.codeplex.com/releases/view/5486\">Alpha 2</a> release out. The zip file contains two dll&#39;s and a new base on the Moon (Outpost Steyn) and a few Traffic Configuration files. You should be able to just extract to your Orbiter directory. Please note that this is still an Alpha release, so its adviseable to extract to a fresh install of Orbiter.<br />You should be able to use it straight away if you choose the Deltaglider (standard default) / Brighton scenario. Currently there are not a lot of ATC procedures and there are still no dynamic traffic.<br /><br />There is currently no documentation, but you should be able to find your way around the Traffic MFD and the COMMS MFD. Also check out the Info page on the MFD. You should find a lot of usefull functionality there.<br /><br />22 June 2007: Real life is taking its toll! I am currently moving too slow with this. I am in the process of doing some final testing, so it will not be long now before an Alpha release. Please keep on checking this space.<br /><br />07 May 2007: The project as undergone some major architectural changes to allow it to function as an MFD as well as provide SDK capabilities.  I am preparing for a next Alpha release before the end of May 2007 and then soon after that a Beta Release. After that I will start on the documentation for the SDK.<br /><br />19 Jan 2007: Added a <a href=\"https://trafficmfd.codeplex.com/wikipage?title=Design&referringTitle=Home\">Design</a> Page to show the main components of the design.<br /><br />4 Nov 2006: A first Alpha version was released today. Please check out the <b>Releases</b> page. Remember, this is not even a Test version, so please use at your own risk. It currently does not do much actual Traffic Control, but it does provided a lot of information and you can at least tune your NAV radios to Pad frequencies.<br /><br />\n<h1>About Orbiter Space Flight Simulator!</h1>\rOrbiter is a free Space Flight Simulator by Dr. Martin Schweiger. Please check it out at <a href=\"http://www.orbitersim.com\">Orbiter</a>.<br /><br /><b>Traffic MFD</b><br />Orbiter currently lacks any Traffic Control and dynamic traffic. This means that its only ships you control directly, that will move around in space. This module will try to provide a more dynamic environment for you to fly in.<br /><br />The project will be split in two major parts: &quot;ATC - Air Traffic Control&quot; will allow for Traffic Control on the ground, in the airspace around a base, and the space around a planet and then secondly: Dynamic Traffic will provide automated traffic on the base, like busses, etc. as well as other craft taking off, landing and going places.<br /><br /><b>Traffic SDK</b><br />The project will also provide an SDK for other developers to extend the environment. Other developers will, for instance, be able to create other dynamic vehicles like refeuling trucks, etc. It might even be possible to create a module to allow space stations to control docking procedures, etc.<br /><br /><b>Quick Links</b><br /><a href=\"https://trafficmfd.codeplex.com/wikipage?title=Design&referringTitle=Home\">Design</a> Page: Contains an overview of the Design of the system.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Orbiter,",
  "LastEdited": "2009-07-10T13:09:25-07:00"
}