{
  "ProjectName": "Triad",
  "Title": "Triad - The Rich Intranet Architecture for Developers",
  "Description": "Triad is an application framework for ASP.Net MVC.  Based on many of the most highly used jQuery controls on the Net today.\n\nN-Layered Architecture with LINQ to SQL, or Telerik ORM, or Entities Framework, etc.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Triad is an application framework for ASP.Net MVC.  Based on many of the most highly used jQuery controls on the Net today.<br /><br />N-Layered Architecture with LINQ to SQL, or Telerik ORM, or Entities Framework, etc.<br /><br />This is a very large project that enables one to instantly create a web application framework based on standard ASP.Net MVC 1.0 and custom controls.  It is <b>not</b> a portal application or CMS. It has been written from the start as a reusable framework for intranet/internet applications to include cohesive notifications, dialog boxes, grids, combo boxes, menuing and more with major amounts of ajax vs. postbacks to the server.  A lot of effort was put in to ensure as small ammount of traffic hits the network as possible while efficiently using client side memory and server-side caching.<br /><br />The included controls are a combination of &quot;best-of&quot; found on the net, based on jQuery, and custom controls/modifications to ensure a seamless integration into the framework..  Bloated code is constantly reworked and if a control isn&#39;t good enough/fast enough/or standardized enough, it gets ejected/rewritten.<br /><br />The VSI and code will be uploaded in the next couple of weeks and will install as a &quot;Template&quot; for C#.  Below are some of the major features that are included:<br /><br />Tim<br /><a href=\"https://triad.codeplex.com/wikipage?title=Updated%3a%20%20Jan%2028%2c%202010&referringTitle=Home\">Updated&#58;  Jan 28, 2010</a><br /><br />All functionality of these controls is at your disposal, but html “Helpers” were added to the framework, so that the required JavaScript, html, etc is rendered, but you don’t need to worry about all of the nuances for each control.  (I.e., a single html.helper method is all that is necessary to code.)<br /><br /> <br />\n<ul><li><b>jQuery</b> – http://jquery.com/\n<ul><li>  the core library that handles ALL DOM (document object model) manipulation.  All controls used in the framework use this library in order to minimize downloaded code to the client</li>\n<li>  jQuery may look complex at first, but when used for awhile, virtually only one/two commands are needed.  This library is as powerful as Linq is to Managed Code.</li>\n<li>  Tutorials: http://docs.jquery.com/Tutorials</li></ul></li></ul>\n\n<ul><li><b>Grid</b> – jqGrid at: http://www.trirand.com/blog/\n<ul><li> It has been updated to every new version that has come out as long as it doesn’t have breaking changes, so the latest control code is in the jsCore.min.js file.</li>\n<li> Demos located here:  http://trirand.com/jqgrid/jqgrid.html - which are in PHP/Mysql.  All functionality for data handling has been converted for ASP.Net/MVC so the demos help with client side configuration/development.  Very useful, but don’t worry about the PHP stuff.</li>\n<li> There are also some MVC integration samples here: http://www.trirand.com/blog/?page_id=247</li></ul></li></ul>\n\n<ul><li><b>Modal Dialog</b>– jqModal: http://dev.iceburg.net/jquery/jqModal/\n<ul><li> Very lightweight - does most anything needed.  Easily modifiable.</li>\n<li><b>slighlty</b> modified standalone version for integration and jQuery 1.4 updates</li>\n<li> Demos located here:  http://dev.iceburg.net/jquery/jqModal/</li></ul></li></ul>\n\n<ul><li>  <b>Notifications Dialog</b> – jGrowl:  OS X Type notifications http://stanlemon.net/projects/jgrowl.html\n<ul><li> Very lightweight - used with return Values from form submit, etc.  Can be easily called directly.</li>\n<li> Demos located here:  http://stanlemon.net/projects/jgrowl.html</li></ul></li></ul>\n\n<ul><li> <b>ComboBox</b> – Sexy Combo:  http://phone.witamean.net/sexy-combo/\n<ul><li> Unfortunate name – Renamed it to MVCCombo in the jsCore.min.js file</li>\n<li> This one required some tweaking as it didn’t handle “tabs” all that well, but it does have the latest code.</li>\n<li><b>largely</b> modified standalone version for integration and jQuery 1.4 updates</li>\n<li> The only control with, IMO, issues in its rendering as it just doesn’t handle large amounts of data;.</li>\n<li> Demos located here: http://phone.witamean.net/sexy-combo/examples/index.html</li></ul></li></ul>\n\n<ul><li>  <b>DatePicker</b> - http://www.kelvinluck.com/assets/jquery/datePicker/v2/demo/\n<ul><li> Can use it directly, but a html helper method has been added to the html.TextBox so it will automatically generate the icon/picker based on your selected input type.</li>\n<li> Demos are located on that page.  VERY small/compact in size (18k)  comparable Datepicker from JQuery UI required at least 160k of JavaScript</li></ul></li></ul>\n\n<ul><li> <b>TextInput MASK</b> Functions: http://www.meiocodigo.com/projects/meiomask/\n<ul><li> Very powerful and extensible masking library and small footprint when compressed.</li>\n<li>  Standard masks are defined in jsCore.min.js and are readily available via the Html.TextBox helper method, however, individual masks, etc can be constructed using the documentation from the link above.</li></ul></li></ul>\n\n<ul><li>   <b>Accordion</b> - http://bassistance.de/jquery-plugins/jquery-plugin-accordion/\n<ul><li>  This is the LAST standalone release of this accordion, but it was used because it didn’t rely on the jQuery UI library (the 160k unneeded ui code).</li>\n<li><b>slighlty</b> modified standalone version for integration and jQuery 1.4 updates</li>\n<li>  Basic accordion, but it was modified a bit to handle a treeview inside so the menu on the left of the framework is very extensible and can hold hundreds of items in a nice hierarchical manner.</li></ul></li></ul>\n\n<ul><li> <b>TreeView</b> - http://bassistance.de/jquery-plugins/jquery-plugin-treeview/\n<ul><li> Small Footprint and handles large data and asynchronous filling.</li>\n<li> Demos: http://jquery.bassistance.de/treeview/demo/</li></ul></li></ul>\n\n<ul><li> <b>ToolTips</b> - http://plugins.learningjquery.com/cluetip/\n<ul><li> Small/medium footprint, but allows for Ajax calls to populate the tooltip with HTML/Text, etc.</li>\n<li> Can be used manually, but the framework automatically populates tooltips throughout a page if they exist in the database table “MVCToolTips”.  By managing the tooltips in this manner, someone other than the developer can “fill them in”.</li>\n<li>  Demos: http://plugins.learningjquery.com/cluetip/demo/</li></ul></li></ul>\n\n<ul><li> <b>AJAX Form Posting</b> - http://malsup.com/jquery/form/\n<ul><li> All functionality required is taken care of via the framework, but if you needed to override it’s behavior, the documentation for using it is here.</li>\n<li> The framework also takes care of validation routines if defined via HTML Helpers or manually using the jQuery validate functions below.</li></ul></li></ul>\n\n<ul><li> <b>Form Validation</b> - http://docs.jquery.com/Plugins/Validation\n<ul><li> Basic form validation is handled via Html.Textbox helper methods based on the type of input field defined.  </li>\n<li> Easily implement own validation using the documentation at this site though.</li></ul></li></ul>\n\n<ul><li><b>Collapsible Panels</b></li>\n<li><b>Top Page menus</b></li>\n<li><b>Themes</b> (framework adheres to the jQuery UI Theme CSS standards.</li></ul>\n<br />Other controls were looked at/tested (such as jqTemplates, which is VERY powerful), but  weren’t readily required.  The controls above are <b>replaceable</b> within the framework if something better is found – some helper functions would need rewriting, but nothing serious.  When you can get to the code – look in the “Helpers\\Html” directory and you will see the helper methods that were created.  Not much to them at all after data manipulation issues were fixed.<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.Net,Architecture,Framework,ASP.NET Control,GridView,ComboBox,Modal Dialogs,N-Tier,LINQ TO SQL,",
  "LastEdited": "2010-01-28T12:10:50.86-08:00"
}