{
  "ProjectName": "turbo",
  "Title": "Turbo framework for ASP.NET",
  "Description": "Turbo framework is an extension for ASP.NET which solves most problems associated with WebForms (ViewState, performance, client-side scripting, resource optimization), while utilizing its advantages (component design, RAD), and comes with a set of advanced, rich UI controls.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Turbo framework is an extension for ASP.NET which solves most problems associated with WebForms &#40;ViewState, performance, client-side scripting, resource optimization&#41;, while utilizing its advantages &#40;component design, RAD&#41;, and comes with a set of advanced, rich UI controls.<br /><br />In addition to offering a number of advanced features, the Turbo framework promotes &quot;clean&quot; coding techniques: class based JavaScript libraries; sophisticated class tree of controls and supporting components on the server; strong typing and explicit style of coding; almost no use of reflection; and avoiding other unreliable and low performance techniques whenever possible.<br /><br />Turbo doesn&#39;t require the whole project to be changed/redeveloped to use it; pages using Turbo can be added one at a time, whenever needed. This makes it much easier to transition from the existing model to Turbo; no large upfront development effort is required. By making use of Visual Studio editor and designer, highest productivity is ensured by allowing developers to re-use their existing knowledge about ASP.NET in general and WebForms in particular.<br /><br />Check out the functionality it offers by downloading the binaries and the samples.<br /><br />Feedback is greatly appreciated! Please write back using Discussions and/or Issue Tracker (as appropriate), to ensure continued improvement.</div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,Framework,Controls,Viewstate,javascript,WebForms,MVC,rich UI,Optimization,C#,JScript,JSON,Performance,Scalability,Testing,",
  "LastEdited": "2010-08-18T08:49:43.15-07:00"
}