{
  "ProjectName": "UIAutomationVerify",
  "Title": "UI Automation Verify (UIA Verify) Test Automation Framework",
  "Description": "UIA Verify is a test automation framework that features the User Interface Automation Test Library (UIA Test Library) and Visual UI Automation Verify (Visual UIA Verify), the graphical user interface tool. The framework facilitates manual and automated testing of the Microsoft (R) User Interface (UI) Automation Provider implementation of a control or application. The majority of the UIA Verify functionality is provided through a dynamic link library (e.g., UIATestLibrary.dll) that contains the code for testing specific UI Automation functionality and supports logging of the test results.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>UI Automation Verify (UIA Verify) Test Automation Framework</strong><br>\r\n<br>\r\nUIA Verify is a test automation framework that features the User Interface Automation Test Library (UIA Test Library) and Visual UI Automation Verify (Visual UIA Verify), the graphical user interface tool. The framework facilitates manual and automated testing\r\n of the Microsoft (R) User Interface (UI) Automation Provider implementation of a control or application. The majority of the UIA Verify functionality is provided through a dynamic link library (e.g., UIATestLibrary.dll) that contains the code for testing specific\r\n UI Automation functionality and supports logging of the test results.<br>\r\n<br>\r\n<br>\r\n<strong>Latest version: </strong>For the latest information and releases of accessibility tools, please refer to the\r\n<a href=\"http://msdn.microsoft.com/en-US/windows/desktop/bg162891\">Windows Software Development Kit</a> and the\r\n<a href=\"http://msdn.microsoft.com/en-us/windows/bb735024.aspx\">documentation.</a><br>\r\n<br>\r\n<strong>Resources:</strong></p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/windows/apps/dn263101.aspx\">Creating Accessible Windows Apps</a>\r\n</li><li><a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/ff486375(v=vs.85).aspx\">MSDN Reference for Windows Automation API</a>\r\n</li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Testing,automation,UI,UI Automation,*,UIA Verify,why no access?,",
  "LastEdited": "2013-09-13T16:23:30.34-07:00"
}