{
  "ProjectName": "umbracoscdatatypes",
  "Title": "Umbraco: Inspired DataTypes",
  "Description": "New datatypes that are not in the default install to make Umbraco have some new controls such as Content/Media Treeview, Content/Media Drop Down List with Treeview. Controls have options to restrict DocumentTypes or MediaType and the start location to retreive from",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nNew datatypes that are not in the default install to make Umbraco have some new controls&nbsp; such as</p>\r\n<p>Content/Media Treeview, Content/Media Drop Down List with Treeview. Controls have options to restrict DocumentTypes or MediaType and the start location to retreive from</p>\r\n<p><strong>Treeview Controls</strong><br>\r\n<br>\r\nContent Treeview: allowing multiple content to be added to the data type and also has the options for start location and only allowing certain DocumentTypes.<br>\r\n<br>\r\nMedia Treeview: allowing multiple media to be added to the data type and also has the options for start location and only allowing certain MediaTypes.<br>\r\n<br>\r\n<strong>Drop Down List Controls</strong><br>\r\n<br>\r\nContent Drop Down List Treeview: allowing single content to be added to the data type and also has the options for start location and only allowing certain DocumentTypes.<br>\r\n<br>\r\nMedia Drop Down List Treeview: allowing single media to be added to the data type and also has the options for start location and only allowing certain MediaTypes.</p>\r\n<p>Example usage of the Content Treeview and the Media Drop Down list Treeview</p>\r\n<p><img src=\"http://www.codeplex.com/download?ProjectName=umbracoscdatatypes&DownloadId=213871\" alt=\"\"></p>\r\n<ul>\r\n</ul>\r\n<p>Release 0.91 changes:</p>\r\n<ul>\r\n<li>Added Location by named path. </li><li>Added show child nodes in treeview flag </li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "umbraco,datatypes,sitecore,treeview,",
  "LastEdited": "2011-03-11T13:12:19.163-08:00"
}