{
  "ProjectName": "umbracoacsextensions",
  "Title": "Access Control Service Extensions for Umbraco",
  "Description": "An extensions to Umbraco 4.7 which enables you to authenticate users from Facebook, Windows  Live ID, Google, Yahoo, Active Directory and other identity providers.\r\nSetup, user management and handling of authorization policies are all seamlessly integrated in the Umbraco UI.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h2><a href=\"http://download.codeplex.com/download?ProjectName=umbracoacsextensions&DownloadId=227326\"><img title=\"ACSEXtensionsscreens\" border=\"0\" alt=\"ACSEXtensionsscreens\" src=\"http://download.codeplex.com/download?ProjectName=umbracoacsextensions&DownloadId=227327\" width=\"300\" height=\"163\" style=\"border-bottom:0px; border-left:0px; padding-left:0px; padding-right:0px; display:inline; border-top:0px; border-right:0px; padding-top:0px\"></a></h2>\r\n<h2>Welcome!</h2>\r\n<p>Welcome to the home page of the Access Control Service (ACS) Extensions for Umbraco. The ACS Extensions augment your web site with powerful identity and access management capabilities:</p>\r\n<ul>\r\n<li>Authenticate users from social identity providers such as Facebook, Windows Live ID, Google and Yahoo.\r\n</li><li>Manage those users and access policies though the familiar Umbraco management UI, without the hassle of maintaining passwords for them!\r\n</li><li>Make your web site available to business federated partners from Active Directory or any other identity provider with federation capabilities. Apply fine-grained access policies mapping claims to your existing Member Groups.\r\n</li><li>Handle user invitations via a powerful email invitation &amp; verification system.\r\n</li></ul>\r\n<p>All those capabilities are implemented by integrating Umbraco with the Windows Azure AppFabric Access Control Service. The ACS Extensions are designed to blend into the normal workflow you follow when managing your Umbraco instance.</p>\r\n<p>You can either install the ACS Extensions via the provided NuGet package (the preferred method), or you can follow the step by step document which details how to modify the Umbraco source. In both cases, the final result will be an enhanced Umbraco management\r\n UI which supports the new capabilities and guide you through the various configurations.\r\n<br>\r\nThe simplest way of installing the ACS Extension is using the NuGet package directly from Visual Studio via Library Package Manager (see the\r\n<a href=\"http://nuget.org/\">NuGet web site</a> for more info), or downloaded from the ACS Extensions home on Codeplex. Alternatively, you can\r\n<a href=\"http://umbracoacsextensions.codeplex.com/\">download the ACS Extensions source code package</a> and refer to the manual installation document it provides.</p>\r\n<p><u><strong>IMPORTANT: The ACS Extensions code sample has been designed with the intent to demonstrate how to take advantage of the Windows Azure Access Control Service and the Umbraco extensibility model, and is not meant to be used in production as is.</strong></u></p>\r\n<h2>Getting Started</h2>\r\n<p>We have documents and video that will help you to hit the ground running, by walking you through the process of setting up and using the ACS Extensions for common authentication and authorization tasks in your Umbraco web site.</p>\r\n<ul>\r\n<li><a href=\"http://umbracoacsextensions.codeplex.com/wikipage?title=Setup\">Setting up Umbraco and the ACS Extensions</a>\r\n</li><li><a href=\"http://umbracoacsextensions.codeplex.com/wikipage?title=Social%20Providers\">Provisioning, Authenticating and Authorizing Members from Social Providers</a>\r\n</li><li><a href=\"http://umbracoacsextensions.codeplex.com/wikipage?title=ADFS%20Integration\">Integrating with ADFS and Any Other WS-Federation Provider</a>\r\n</li></ul>\r\n<p>If you want to keep a version of those documents on your local environment, you can download the source code package: you will find the same tutorials in HTML and DOCX format.</p>\r\n<h2>About Windows Azure AppFabric Access Control Service</h2>\r\n<p>Windows Azure AppFabric Access Control Service (ACS) is part of the Windows Azure Platform: it provides you a convenient way of brokering authentication between your application and the identity providers you want to target, decoupling your solutions form\r\n the complexities of implementing specific protocls, handling trust relationships and expressing access policies. The ACS Extensions augment Umbraco with identity and access control capabilities offered by ACS.\r\n<br>\r\nIf you want to know more about ACS, please refer to the Service Bus, Access Control &amp; Caching section in the\r\n<a href=\"http://windows.azure.com\">Windows Azure Portal</a>.</p>\r\n<h2>Requirements</h2>\r\n<ul>\r\n<li><a href=\"http://umbraco.codeplex.com/releases/view/62573\">Umbraco 4.7.0</a> </li></ul>\r\n<ul>\r\n<li><a href=\"http://www.microsoft.com/downloads/en/details.aspx?FamilyID=0a391abd-25c1-4fc0-919f-b21f31ab88b7\">Microsoft .NET Framework 4</a>\r\n</li></ul>\r\n<ul>\r\n<li>Internet Information Services 7.x </li></ul>\r\n<ul>\r\n<li><a href=\"http://www.microsoft.com/express/Database/Default.aspx\">SQL Server 2008 Express</a> (or later)\r\n</li></ul>\r\n<ul>\r\n<li><a href=\"http://visualstudiogallery.msdn.microsoft.com/en-us/27077b70-9dad-4c64-adcf-c7cf6bc9970c/file/37502/5/NuGet.Tools.vsix\">NuGet 1.2</a>\r\n</li></ul>\r\n<ul>\r\n<li><a href=\"http://www.microsoft.com/downloads/en/details.aspx?FamilyID=eb9c345f-e830-40b8-a5fe-ae7a864c4d76\">Windows Identity Foundation</a>\r\n</li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-04-11T10:19:15.36-07:00"
}