{
  "ProjectName": "UnderscoreSC",
  "Title": "__SC: Native Source Control For SQL Server Objects",
  "Description": "__SC is a lightweight native source control system for database schema objects such as Stored Procedures.  It provides checkout/checkin and versioning functionality",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong> <br>\r\n__SC is a lightweight native source control system for database schema objects such as Stored Procedures. It provides checkout/checkin and versioning functionality.</p>\r\n<p><em>This is a brief technical overview - for a fuller functional walkthru see the\r\n<a href=\"http://underscoresc.codeplex.com/documentation\">documentation</a></em> <br>\r\n<br>\r\n</p>\r\n<p><br>\r\n<em>&#160;</em>__SC resides in sql server (it does not rely on an external Source control system) and controls versioning of database schema programmable objects (Stored Procedures ,Triggers ,Functions) using sqlserver DDL triggers.\r\n<br>\r\nObjects can be checked out and checkedin so that there is versioning history and that users don't overwrite each others changes.</p>\r\n<p>The heart of __SC lies in a stored Procedure called __SC, this sproc is the &quot;Command Line&quot; into __SC</p>\r\n<p>When you run the __SC procedure without any parameters from SqlServer Management Studio, you get the following help list of available commands.</p>\r\n<p><strong>Security</strong></p>\r\n<p>__SC was designed to work in a full trust environment, user names are the user sql login (includeing the domain name if windows authentication is used)\r\n<strong><br>\r\n</strong></p>\r\n<p>&#160;</p>\r\n<p>&#160;</p>\r\n<pre>SC Syntax:<br>\tCHECKOUT objname \tWill try to give you a lock on that specific object - This happens<br>\t\t\t\t\t\tautomaticlly if you do a create/alter/drop on an object. This lock<br>\t\t\t\t\t\tonly valid for 24 hours since the last checkout<br><br>\tFORCECHECKOUT obj\tWill try to check out an item similiar to CHECKOUT however it will<br>\t\t\t\t\t\tnot check to see if the statement matches the latest definition<br><br>\tCHECKIN objname\t\tWill checkin the objname object if it has been checked out to you<br>\t*CHECKIN ALL\t\t\tWill checkin all of you checked out items --Not Working yet--<br>\t<br>\tGRAB objname\t\tWill grab the checkout from the current user and assign it to you<br><br>\t*STATUS objname\t\tDisplays the status of of objName<br><br>\t*GENERATE datetime\tGenerates a runable SQL script of all objects that were checkedin on<br>\t\t\t\t\t\tor after datetime<br>\t<br>\tHISTORY objname\t\tRetreives the checkin history for this object<br> <br>\tSNAPSHOT datetime\tRetreives a list and definiton of checked in objects after date time<br><br>\tVERSION\tobjname     Retreives the definition of objname at datetime<br>\t\tdatetime\t<br> \t<br>\tLIST ALL\t\t\tRetreives the list of all objects currently managed and their current status<br>\t\t\t\t\t\tlast change date and status user<br>\t<br>\tLIST username\t\tRetreives the list of all objects currently checked out by user <br><br>\t* These items do not yet work<br><br>\tNote: if you omit a operation parameter the CHECKIN is the default, <br>\t\tso for example you can eaasly check in a object like this:<br>\t\t\t\t__SC objectname<br>\t\tthis would have the same effect as the more verbose<br>\t\t\t\t__SC CHECKIN objectname   <br></pre>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "sql source control,",
  "LastEdited": "2011-05-02T21:41:40.14-07:00"
}