{
  "ProjectName": "VCCA",
  "Title": "Video, Chat and Collaboration Application",
  "Description": "Ucentrik’s Collaborative Video Service & Support Web Application enables a live, online interaction with 2-way video, VoIP, chat and robust collaboration (desktop share & control). \r\n\r\nThe application includes a complete call center component with intelligent call routing, call transfer, data tracking & reporting; and enables calls from websites, kiosks, digital signage, websites & applications.\r\n\r\nThis software only, low bandwidth solution carries video and audio through affordable USB webcams and headsets making it practical and affordable to offer online customer service & support. \r\n \r\nWe’re releasing this turnkey application as an open-source solution so you can brand & customize according to your needs and workflow, including only the components required for your use case.\r\n\r\nThe C# application has integrated Ucentrik’s CTX - a software-only,  application development platform for complex collaborative video solutions. CTX is \r\nmarket-proven; it’s been the engine of multiple deployments for over 6 years & was released as a free SDK in the summer of 2011. \r\n\r\nREQUIREMENTS\r\n•Ucentrik’s Free CTX SDK API ; fill out a request form here: http://www.ucentrik.com/webscripts/c6003.aspx\r\n•Ucentrik's CTX Conference Server License (Note: you can prototype & test your application on Ucentrik's CTX Conferencing Server free for 30 days)\r\n•USB Webcams and headsets for video conferencing\r\n•Internet Explorer\r\n\r\nCheck out examples and use cases at www.ucentrik.com\r\n\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nThis Collaborative Video 'Live Consultant' Web Application for Service &amp; Support enables a live, online interaction with 2-way video, VoIP, chat and robust collaboration (desktop share &amp; remote control). The application includes a complete call center\r\n component with intelligent call routing, call transfer, data tracking &amp; reporting; and enables calls from websites, kiosks, digital signage, websites &amp; applications.<br>\r\n<br>\r\nThis software only, low bandwidth solution carries video and audio through affordable USB webcams and headsets making it practical and affordable to offer online customer service &amp; support.</p>\r\n<p style=\"text-align:justify\">The turnkey application enables you to offer an online collaborative video chat service almost instantly, but we&rsquo;ve made this available as an open-source solution so you can brand &amp; customize&nbsp;according to your needs\r\n and workflow, including only the components required for your use case. Even if your use case doesn&rsquo;t require a &lsquo;call center like application&rsquo;, you will still find the the code useful for features like intelligent call routing, user account\r\n management and tracking, call recording etc. that you can use to jump start development of your own solutions.</p>\r\n<p>The C# application has integrated CTX - a software-only, application development platform for complex collaborative video solutions. CTX is market-proven; it&rsquo;s been the engine of multiple deployments for over 7 years &amp; was released as a free SDK\r\n in the summer of 2011; version 2.0 was just released February 8th.</p>\r\n<p>KEY FEATURES:</p>\r\n<p><strong>- </strong><span style=\"color:#225884\">Video <span style=\"color:#225884\">\r\nChat</span></span>: high-quality, real-time video and audio conferencing<br>\r\n<strong>- </strong><span style=\"color:#225884\">Collaboration</span>: via screen /desktop sharing &amp; remote control technology<br>\r\n<strong>- </strong><span style=\"color:#225884\">Intelligent Call Routing</span>: for on-demand, multilingual, multi-product support and outbound calling<br>\r\n<strong>- </strong><span style=\"color:#225884\">Flexible</span>: secure web-based application is accessible from any computer with internet access<br>\r\n<strong>- </strong><span style=\"color:#225884\">Customizable</span>: brand and white label, integrate with existing functionality or build on top for your own specific use cases through open-source<br>\r\n<strong>- </strong><span style=\"color:#225884\">Easily Deployed Solution:</span> firewall-friendly, low bandwidth, free trial hosted on our servers; with a server component available for your own behind the firewall deployment</p>\r\n<p>REQUIREMENTS</p>\r\n<p>&bull; CTX SDK API&nbsp;<br>\r\n&bull; CTX Conference Server<br>\r\n<br>\r\nBoth CTX SDK and the CTX Conference Server is both available here:<br>\r\nhttp://http://ucentrik.com/developer-info/ (follow the link &quot;Get CTX SDK and Server Now!)</p>\r\n<p><br>\r\n&bull; USB Webcams and headsets for video conferencing<br>\r\n&bull; Internet Explorer<br>\r\n<br>\r\nCheck out more use cases and examples at www.ucentrik.com</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2016-01-13T07:23:00.143-08:00"
}