{
  "ProjectName": "VerilogHDLexe",
  "Title": "Verilog HDL OOP  Simulation/IDE",
  "Description": "Simulate Verilog HDL without compiling to RTL.    Instead, instantiate objects that run the HDL directly.  A debugger that can then set breakpoints. single step, set watches, etc. then becomes feasable.\n\nC# makes it easy to parse HDL and simulate.  Prototype code and two simple testcases can be downloaded, but there is a lot  more work to get to the final  result.  \n\nIThe prototype is very basic, but I think it shows the feasibility of  an IDE for hardware development that is analogous to  a software IDE.  Altera has Quartus II which is a start, but\nleaves much manual checking up to the lead designer.  I feel that the necessity to get the design to the RTL is what makes building the model as difficult as doing the design.\nIt is obvious that a computer can do a lot of things to reduce human error and effort.  The problem is in identifying them.\n\nMy approach allows the very first module to be read in along with the initial statements to run a test case at day one of the design.\n\nModule instantiation, conditional assignment, and concatination need to be added.\n\nA user interface needs to be defined for module connectivity.\n\nA method of design control/project management  (IDE?) is needed.\n\nDesign coding guidelines checking is needed.  VSome very good guidelines  exist  and  should be integrated into a design tool.\n\nA debugger is needed. (The F9, F10, F11 and watch functions)\n\nIn short, all of the software development issues addressed by the IDE have analogs in hardware design.  \n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">This project is for a hardware design tool that executes directly from the HDL.<br /><br />The final objective is a n IDE where a design can be debugged by running testcases directly against the HDL.  <br /><br />There would also be a gui to setup module connections and maintain the cross reference of ports.<br /><br />It is based on the observation that analogous reasons exist for an IDE in both the hardware and software communities.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Vsim,",
  "LastEdited": "2008-08-07T14:06:32.357-07:00"
}