{
  "ProjectName": "visualjs",
  "Title": "VisualJS.NET Controls",
  "Description": "Open source UI components for VisualJS.NET",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>What is <a href=\"http://www.visualjs.net\">VisualJS.NET</a></b><br /><b>Rapid Web Application Development for C# and VB.NET developers</b><br /><br />Lets assume that you have a project requirement that (probably) leads you to development of many different UI rich forms, routines and application parts. Consider yourself trying to find best JS UI library and then designing the user interface &#39;eyes wide shut&#39;. Probably, you will need to find one more library or use another version of the same JS library to target mobile. Also, you will need to develop client server communication routines and then finally the application. Although this order may change, somehow these are the very small list of the things you need to handle during the project development lifecycle.<br /><br />VisualJS.NET saves you from all these troubles. Just Drag and Drop in order to create the user interface of your application and start coding instantly without thinking about the browser compatibility, mobile/desktop differences, and server-client communications. Imagine, how fast you can produce?<br /><br /><b>Cloud Friendly</b><br />VisualJS.NET is a Cloud and Hosting compatible solution. Despite the other solutions or platforms, it doesn&#39;t need any special configuration in order to work and scale. It designed internally to handle the operations in a most efficient way.<br /><br /><b>Real CrossPlatform</b><br />VisualJS.NET can target multiple devices with their unique designs in a single application. All the built-in UI controls are tested under touch devices hence you don&#39;t need to use a separate library to target mobile &amp; touch devices.<br /><br /><b>Develop your own UI controls for VisualJS.NET using the sample project under the package</b></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-04-23T05:34:35.563-07:00"
}