{
  "ProjectName": "VisualHG",
  "Title": "VisualHG",
  "Description": "Mercurial source control provider plugin for MS Visual Studio 2005, MS Visual Studio 2008 and MS Visual Studio 2010.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Mercurial Source Control Plugin for MS Visual Studio</h1>\r\n<ul><li>VisualHG indicates file status within the project files tree of MSVC</li>\n<li>Tracks adding, moving and renaming of file actions</li>\n<li>Give you dialogs for committing changes, viewing detailed status of files and history and many more. Using TortoiseHG as its backend</li>\n<li>Everything directly from your workspace via context menu and a toolbar</li>\n<li>Version 1.1.5 is compatible with MSVS 2005, MSVS 2008</li>\n<li>Version 1.1.7 is compatible with MSVS 2010, MSVS 2011, MSVS 2013 and MSVS 2015</li>\n<li>Support for Mercurial Subrepositories</li>\n<li>Recogonize projects under version control that are not in the same folder as the solution</li>\n<li>File status icon for renamed files</li>\n<li>File state indicating tooltips</li>\n<li>View per file branch label in file tooltip</li></ul>\n<br />See some <a href=\"http://visualhg.codeplex.com/documentation\">screenshots</a><br /><br />To learn more about Mercurial, TortoiseHG and VisualHG watch Rob Conery&#39;s excellent <a href=\"http://tekpub.com/codeplex\">video tutorial</a><br /><br /><b>Contributions are most welcome! Contact me at VisualHG@Live.de.</b><br />\n<h2>To get started working with VisualHG is very simple.</h2>\r\n<ol><li>(Deinstall prev Version of VisualHG).</li>\n<li>Download and install TortoiseHg and VisualHG. Or load from Visual Studio Extension Manager / Online Gallery.</li>\n<li>Open Visual Studio and go to Tools -&gt; Options.</li>\n<li>In the options tree view, select Source Control. (You may need to click the Show all Settings checkbox)</li>\n<li>Select VisualHG from the drop down list, and click OK.</li>\n<li>Open your Mercurial based solution to see the plugin installed and determining your files&#39; statuses.</li></ol>\n\n<h2>Version History</h2>\r\n<b>1.1.7</b>\n<ul><li>Support for Visual Studio 2015</li></ul>\n<br /><b>1.1.6</b>\n<ul><li>Support for Visual Studio 2010, 2011 and 2013</li>\n<li>Switched to new installer format &#39;vsix&#39;.</li></ul>\n<br /><b>1.1.5</b> <br />New Features\n<ul><li>Display current branch name(s) in MSVS Main Frame</li>\n<li>New option to disable context sensitive menues – becomes a bit slow in very huge projects</li>\n<li>New option to disable out of studio file tracking (beta) </li>\n<li>Track files which was moved across projects and mark as renamed</li>\n<li>Support for Visual Studio 2011 Developer Preview</li></ul>\n<br />Bugfixes\n<ul><li>Diff compares to wrong version under some conditions</li>\n<li>PendingChangesList - restore selection fixed</li>\n<li>Track readded  files</li>\n<li>Adding selected files for Visual Studio 2010 SP1 throws an exception</li>\n<li>Attempting to launch Repo Browser in VS causes Null Reference Exception</li>\n<li>Add Selected Files&quot; crashs Visual Studio 2010 SP1</li>\n<li>Check Diff-Tool before running it, otherwise VS2010 crashes </li></ul>\n<br /><b>1.1.2 + </b>1.1.3**<br />Compatibility update for TortoiseHG 2.0<br /><br /><b>1.1.1</b><br />New Features\n<ul><li>Revert file command added</li>\n<li>Annotate file command added</li>\n<li>New Menus in CodeTab and CodeWindow</li>\n<li>Menu structure reordered  - seperate VisualHG popup menu added</li>\n<li>External DiffTool option with Mask and variables for $(ProgramFiles),$(ProgramFiles (x86)),$(Base),$(Mine),$(BaseName) and $(MineName). </li>\n<li>New Options page added for autoAddFiles and autoActivatePlugin and DiffTool Mask</li>\n<li>New Commit command react on current selection and child files of selection.</li></ul>\nBugfixes\n<ul><li>Determine HG.exe directory from registry - no warstart required anymore</li>\n<li>Setup improved - deinstalls previous version automatically</li>\n<li>Some Subrepo bugs</li></ul>\n<br /><b>1.1.0</b><br />(Uninstall previous version first)<br />New Features\n<ul><li>SSC Binding : Make VisualHG automatically the active SCC controler for Mercurial solutions</li>\n<li>Store solutions and open documents before invoke ssc commands like commit.</li>\n<li>Direct &#39;File Diff&#39; command added</li>\n<li>Make files on QuerySaveFile writable to allow save </li>\n<li>Determine copied files and display associated tool tip.</li></ul>\nBugfixes\n<ul><li>State icons for Website project files in 2010</li>\n<li>File History command selection for special files fixed </li>\n<li>Subrepo detection improved</li></ul>\n<br /><b>1.0.9 bug fix release</b>\n<ul><li>2010 specific only - VisualHG crashing on special files like Web References</li>\n<li>VS2010 crashes with multiple repositories </li></ul>\n<br /><b>1.0.8e </b>\n<ul><li>View Branch Label in VS Solution Explorer</li>\n<li>BugFix: root directory sorter returns 0 if lengths are equal to prevent ArgumentException </li></ul>\n<br /><b>1.0.8d Compatibillity update</b>\n<ul><li>Solution not under Mercurial Source Control</li>\n<li>Icons don&#39;t get updated on commit</li></ul>\n<br /><b>1.0.8c bug fix release</b>\n<ul><li>#5 Behavior change - Removing versioned project link is no longer tracked as file delete event.</li>\n<li>#7 Behavior change - &#39;Excluding&#39; versioned file from Project is no longer tracked as file delete event.</li>\n<li>#1 Fix: HG.exe frequently locked. Limited number of bytes of the command line parameter to max 2048.</li>\n<li>Introduced a new threading terminology to get rid of spawning hg.exe processes in some cases.</li></ul>\n<br />1.0.8b next tiny bug fix release*\n<ul><li>  Fix: does not found hg root directory in some cases</li></ul>\n<br /><b>1.0.8a tiny bug fix release</b>\n<ul><li>VisualStudio temp files disabled from tracking (<b>~RFxxxxx.TMP</b> and <b>ve-xxxx.tmp</b>). These files may lock HG.exe under some conditions. (e.g. if status query is running and MSCV removes files at the same moment).</li>\n<li>Fixed multiple hg.exe processes spawning after opening project.</li></ul>\n<br /><b>1.0.8 Subrepositories</b><br />\n<ul><li>Support for Mercurial Subrepositories implemented</li>\n<li>Recogonize projects under version control that are not in the same folder as the solution</li>\n<li>File status icon for renamed files implemented</li>\n<li>File state indicating tooltips implemented</li></ul>\n<br /><b>1.0.7 is a bug fix release. Upgrading from previous versions is recommended</b><br />\n<ul><li>Thread eating callback-routine fixed. Performance improvements whilst solution build task realized by suspending status updates.</li>\n<li>Folder rename tracking was incomplete because the watcher was disabled for build performance stuff. Now I changed this behavior by suspending the status updates whilst rebuilding process.</li></ul>\n<br /><b>Moved the project from <i>http://sharesource.org</i> to here.</b> If you are looking for previous versions or BugTracker entries you will find it here.<br /><br /><b>1.0.6</b><br />Changes<br /><br />    * 338 &#39;Case folding&#39; tracking and handling removed from VisualHG. This is because Mercurial for Windows is no longer case sensitive.<br /><br /><b>1.0.5</b><br />New Features<br />\n<ul><li>332 View history for a single file.</li></ul>\n<br />Fixes<br />\n<ul><li>338 visualhg-1.05.msi does not install (use 1.0.5a link)</li>\n<li>337 VS2008 Open Web Site - VisualHG functions do not work anymore</li>\n<li>336 Files added to project but ignored by .hgignore gets added to VCS</li>\n<li>335 No password prompt when doing a pull from synchronize command</li>\n<li>313 When opening a repository with Visual Studio, all files in this folder are being added to it automatically. (use ignore file to prevent files from automatically adding)</li></ul>\n<br /><b>1.0.4</b><br /><br />    * Added Visual Studio 2005 support<br /><br /><b>1.0.3</b><br />\n<ul><li>Improved setup with some dialog elements</li>\n<li>Glyph updates works now for all project types (not only C# and CPP)</li>\n<li>Vista 64 Bit secured</li></ul>\n<br /><b>1.0.2</b><br />\n<ul><li>Smarter icons for popup menus and glyphs</li>\n<li>Status tracking and glyph updating improvements (internal).</li></ul>\n<br /><b>1.0</b><br />\n<ul><li>Initial Version</li></ul>\n<br /><b>Hi folks</b><br /><br />I&#39;m a fan of Mercurial source control system I want to use it for my own develoments. Unfortunately there was no MSVS Plugin found which works to my needs. So I decided to create my own one. It is based on Mercurial and TortoiseHg&#39;s HGTK library, which covers many of the UI components - thx for that cool stuff!! So, if you want to check out VisualHG, you have to install TortoiseHg first and then VisualHG. After that you will have a well working solution integrated into Windows Explorer and MSVS 2008.<br /><br />Good Luck!<br />Bernd</div><div class=\"ClearBoth\"></div>",
  "TagList": "Source Control,Tools,Visual Studio,SCM,devtools,vs add-in,VisualStudio,Mercurial,Hg,TortoiseHg,wanda,",
  "LastEdited": "2015-07-27T02:53:32.663-07:00"
}