{
  "ProjectName": "visualagile",
  "Title": "Visual Agile",
  "Description": "Visual Agile is a simplified agile project management tool, which is done using the concepts of \"Kanban Boards\" (a Just-In-Time pull control method in Toyota Production System), for getting things done by Team. It's combination of Asp.net MVC, MVCnExt, Spring.Net and NHibernate.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Visual Agile is a simplified agile project management tool, which is done using the concepts of &#34;Kanban Boards&#34; &#40;a Just-In-Time pull control method in Toyota Production System&#41;, for getting things done by Team. It&#39;s combination of Asp.net MVC, MVCnExt, Spring.Net and NHibernate.<br /><br /><b>Visual Agile 1.0</b> is a free, non-profit, ethical open source project use latest web technologies to provide simplified way of managing agile projects using Kanban board, focused to play role in <b>“Shaping world&#39;s thinking about how best to combat social problems”</b>. <br /><br />Visuagile focused more on Agile approach and more on providing <i>speed and simplicity</i>.<br /><br />Find updates to the Visual Agile on my blog:  <a href=\"http://yogsbreath.net\">http://yogsbreath.net</a> <br />Or try out the app for yourself.  <a href=\"http://www.visuagile.com\">http://www.visuagile.com</a><br /><br />Below are the mainly focused features.\n<ul><li><b>Visual Kanban Board</b> for visualized project&#39;s task status intuitively, like cards on a wall. </li>\n<li><b>Visual Burndown Chart</b> for visualized amount of remaining tasks and the project&#39;s velocity,. </li>\n<li><b>Visual Smiley Calendar</b> for visualized team&#39;s mood, as it grows, new features and tools will be added.</li></ul>\n<br />Planned features.\n<ul><li>Email notification/report.</li>\n<li>Serach functionality (based on  Card, Name or Observations).</li>\n<li>List view, default will be Card view.</li>\n<li>Visual Team Foundation Server (VSTS) integration.</li>\n<li>Scrum  dashboard i.e. ability to hide Releases , Iterations and providing more space for Stories and Tasks.</li>\n<li>Implementing other Agile Metrics like Burn rate, Defects, Delivered functionality etc...</li></ul>\n<br />Visual Agile is done using combination of below technologies.<br /><b>Asp.net MVC (V1.0) &amp; MVCnExt</b> – Presentation layer and Business layer<br /><b>Spring.Net</b>–Dependency injection<br /><b>NHibernate</b> –Database layer<br /><br />Visuagile is not just a software project - it is a prime example of responsible usage of OpenSource software to benefit others. Please tell others and help spread the word about ethical-based software development.<br /><br />Here are a few examples of how you can help:\n<ol><li>Download Visuagile banner and place it on your website or blog.</li>\n<li>Send a link to Visuagile.com to your IT department or your project manager.</li></ol>\n<br />Feel free to explore yourself and let me know how I can make it better! <br /><br />Website: <b><a href=\"http://www.visuagile.com\">http://www.visuagile.com</a></b></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-08-03T23:19:14.287-07:00"
}