{
  "ProjectName": "VLH2005",
  "Title": "Visual Local History 2005",
  "Description": "Visual Studio 2005 and 2008 add-in which provides the IDE with a local file history à la Eclipse, with a convenient and configurable way to view, restore, delete, and compare differents versions.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Visual Studio 2005 and 2008 add-in which provides the IDE with a local file history &#224; la Eclipse, with a convenient and configurable way to view, restore, delete, and compare differents versions.<br /><br /><br /><b>This project is discontinued, but main features are functional.</b><br /><a href=\"http://connect.microsoft.com/VisualStudio/feedback/ViewFeedback.aspx?FeedbackID=380301\">Click here</a> to see the request made by MatthieuGD on Microsoft Connect to get a built-in feature for local history in Visual Studio.<br /><br /><img src=\"/projects/VLH2005/50f76a7a-5329-4b54-bf23-8bfa4c674f7b\" alt=\"screen.PNG\" title=\"screen.PNG\" /><br /><br /><b>Features</b>\n<ul><li>When you save a file in Visual Studio which belongs to the main solution (i.e. is not a misc file), this add-in copies a backup of the file in a database local to the solution. There is one history database per solution (not per project). This database can be found in the same directory as the solution file (.sln), it&#39;s stored in a hidden directory whose name begins with &quot;.VLH2005.&quot;. You can have as many solutions as you want in the same directory.</li>\n<li>When you are viewing a file which has a history, the history window shows all revisions of this file, and you can open, delete, restore, and compare those revisions the easy way.</li>\n<li>You can configure the tool used for file comparison, the number of days to keep a backup in the history, the minimum time between two backups, and a list of extensions to ignore.</li>\n<li>Several file comparison tools are automatically detected and preconfigured (see below for the list). If your favorite tool is not on the list, you can easily configure VLH2005 to use it with command-line options.</li>\n<li>It tracks renamed files, so you won&#39;t loose the history of a file when you rename it inside Visual Studio.</li>\n<li>It tracks renamed solutions too, so you won&#39;t loose the history of a solution, even if you rename it outside Visual Studio.</li>\n<li>When you save the main solution in a new folder within Visual Studio, the history database is automatically moved in the same folder.</li>\n<li>It always maintains a clean database: whatever you do, the .history folder will never store unused data, since it&#39;s cleaned up when you open or close a solution.</li></ul>\n<br /><b>Announcements</b>\n<ul><li>30 jan. 2008: <a href=\"http://www.codeplex.com/VLH2005/Release/ProjectReleases.aspx?ReleaseId=9464\">Beta 3.0.0 (current version)</a> released</li>\n<li>16 nov. 2007: <a href=\"http://www.codeplex.com/VLH2005/Release/ProjectReleases.aspx?ReleaseId=7938\">Beta 2.0.0</a> released</li>\n<li>2 nov. 2007: <a href=\"http://www.codeplex.com/VLH2005/Release/ProjectReleases.aspx?ReleaseId=8119\">Beta 1.1.1</a> released</li>\n<li>24 oct. 2007: <a href=\"https://www.codeplex.com/Release/ProjectReleases.aspx?ProjectName=VLH2005&amp;ReleaseId=7935\">Beta 1.1.0</a> released</li></ul>\n<br /><b>Auto-detected and preconfigured file comparison tools</b>\n<ul><li><a href=\"http://www.araxis.com/merge\">Araxis Merge</a></li>\n<li><a href=\"http://www.scootersoftware.com\">Beyond Compare</a></li>\n<li>Microsoft Diff and Merge (DiffMerge.Exe), the TFS comparison tool</li>\n<li><a href=\"http://winmerge.org\">WinMerge</a></li>\n<li>TortoiseMerge, the comparison tool that comes with <a href=\"http://tortoisesvn.tigris.org/\">TortoiseSVN</a></li></ul>\n<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "addin,vs2005,add in,visual studio 2005,Visual Studio,add-in,History,Visual Studio 2008,visual studio addin,vs2008,backup,Developer Tools,Version Control,",
  "LastEdited": "2014-02-26T13:41:30.757-08:00"
}