{
  "ProjectName": "VmcController",
  "Title": "Windows Media Center TCP/IP Controller",
  "Description": "Provides a way to monitor state and control Windows Media Center (and extenders) through a standard TCP/IP socket port and/or simple HTTP server.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Provides a way to monitor state and control Windows Media Center &#40;and extenders&#41; through a standard TCP&#47;IP socket port and&#47;or simple HTTP server.<br /><br /><b><a href=\"http://poll.fm/1adou\">Please answer 1 question about your usage of this controller by clicking this link. Thank you!</a></b><br /><br /><b>I am looking for developers who wish to continue the work on this code, please contact me if you are experienced using the Media Center SDK and would like to contribute.</b><br /><br /><i>The solution consists of two major components:</i><br />\n<ul><li>The first is an add-in for Vista Media Center that provides an IP control on TCP port 40500 (by default). You can use TELNET or any other socket client to connect and control (type HELP for a list of commands). For extenders, the port number is incremented so for the first extender the control port is 40501 etc. </li></ul>\n\n<ul><li>Beta  2 adds an http server on 40510 (40511, etc for extenders) access via the web http://youserver:40510</li></ul>\n\n<ul><li>The second component is an event sink for Vista Media Center. It provides a stream of event information over a TCP port for consumption by a client. You can TELNET or use any socket client to connect to port 40400. For extenders, the port number is incremented so for the first extender the stream is on port 40401 etc.</li></ul>\n<br /><b><a href=\"https://vmccontroller.codeplex.com/documentation?referringTitle=Home\">Documentation</a></b>\n<ul><li><a href=\"https://vmccontroller.codeplex.com/wikipage?title=Commands&referringTitle=Home\">Commands</a></li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "Media Center,Vista Media Center,home automation,automation,remote control,.NET 2.0,C#,MCE,VMCE,vmc,",
  "LastEdited": "2009-10-24T14:19:58.347-07:00"
}