{
  "ProjectName": "vmcremote",
  "Title": "VMC Remote",
  "Description": "Working towards allowing you to control a Media Center PC using any device.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Working towards allowing you to control a Media Center PC using any device.<br /><br /><br /><b>What&#39;s this all about?</b><br />A PC next to your TV is almost essential now days. I have a couple of perfectly good Windows devices sitting around the house. I thought that these would make perfect candidates for remotes. Having searched and found nothing, I created a Windows Mobile client that simply controls your PC&#39;s Media Center. Now I&#39;m sharing it with the world.<br /><br /><br /><b>How does it work?</b><br />Once you&#39;ve installed <a href=\"http://sourceforge.net/projects/mcecontroller\">MCE Controller</a> or <a href=\"http://www.codeplex.com/vmccontroller\">VMC Controller</a> on your Vista Media Center PC, the application can be easily installed onto your mobile device and is used to talk to you PC using a simple TCP socket connection.<br /><br />The easiest way to connect your device to your PC is through a wireless network. Connect your PCs/devices, set up the remote and you&#39;re ready to role!<br /><br />The client is simple, efficient and easy to use... IMO :-)<br /><br /><b>See it for yourself!</b><br />Check out my video <a href=\"http://www.youtube.com/watch?v=C8nY-tM2P6g\">VMC Remote Introduction on youtube</a>.<br /><br /><b>Updates...</b><br /><u>Yes!</u> VMC Remote is now compatible with <a href=\"http://www.codeplex.com/vmccontroller\">VMC Controller</a>!<br /><br /><b>Enjoy!</b><br />This has been fun for me to create, so I hope you enjoy using it. If you want to keep up to date with me, check out my <a href=\"http://ducasfrancis.com/blogs/myworld\">blog</a> or follow my <a href=\"http://www.twitter.com/ducas\">twitter feed</a>.<br /><br /><b>Gotchas...</b><br />There are a couple of minor things you need to look out for.<br /><br />Firstly, this is only tested on PPC 2003 and is only for touchscreen Windows Mobile devices. I have started a WM6 Standard version, but I&#39;m running a little behind on it. Hopefully the next release will include it.<br /><br />Secondly, there is a bit of an issue with PPC devices in that the sockets aren&#39;t closed properly when the device is suspended. To overcome this, I&#39;ve implemented a 5 second sliding window that keeps the connection open while the remote is being used. At the top of the remote screen, the status of the connection is displayed at the top of the screen. As long as the word &quot;Connected&quot; appears, hitting the suspend button will cause the MCE Controller server process to hang on an open connection. The only way to fix this is to restart the server process.<br /><br />VMC Controller looks like it will overcome this issue because it seems to allow multiple connections. I haven&#39;t been able to test this, so selecting it will act the same as MCE Controller in that it uses an inactivity timeout to close the connection when it&#39;s not in use. I really hope to get rid of this one day...</div><div class=\"ClearBoth\"></div>",
  "TagList": "Vista,vista media center,Media Center,mobile,remote control,",
  "LastEdited": "2008-07-31T00:13:17.7-07:00"
}