{
  "ProjectName": "VSS2SVN",
  "Title": "VSS2SVN",
  "Description": "VSS2SVN is a simple utility project that aims to help migrate the contents of a source safe database to subversion.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />VSS2SVN is a simple utility project that aims to help migrate the contents of a source safe database to subversion. To do that, VSS2SVN uses two key assemblies:<br />\n<ul><li>The Microsoft sourcesafe interop assembly, which allows for fast access to VSS, version 5.2.0.0.</li>\n<li><a href=\"http://sharpsvn.open.collab.net/\">SharpSVN</a>. This is statically compiled with support for SVN 1.5.5.</li></ul>\n<br />VSS2SVN migrates the complete contents of a VSS project, including the various versions of the project files. It works like this:<br />\n<ul><li>The VSS project contents are being scanned to determine the maximum number of versions in all included files.</li>\n<li>The initial version of the VSS contents is downloaded to a temporary location and is imported to SVN.</li>\n<li>Subsequent VSS versions are repeatedly dowloaded to the temporary location and SVN is updated with these contents via a commit.</li></ul>\n<br />VSS2SVN has been tested in the following environment:\n<ul><li>VSS 2005, client version 8.0.50727.1551. If you don&#39;t have <a href=\"http://www.microsoft.com/downloads/details.aspx?familyid=8A1A68D8-DB11-417C-91AD-02AAB484776B&amp;displaylang=en\">this</a> update, you should probably get it.</li>\n<li>SVN server used is VisualSVN, version 1.6.3.</li>\n<li>SVN windows client used is TortoiseSVN vesion 1.5.6, build 14908.</li>\n<li>SharpSVN version is 1.5005.984.35067.</li>\n<li>Sourcesafe interop assembly version is 5.2.0.0.</li></ul>\n<br />Currently, VSS2SVN does not implement any SVN dialogue functionality. That means that you should use TortoiseSVN to log on to the SVN repository and then use VSS2SVN.</div><div class=\"ClearBoth\"></div>",
  "TagList": "VB.Net,SVN,SubVersion,Source Control,VSS2SVN,vss svn,",
  "LastEdited": "2009-01-17T10:17:14.26-08:00"
}