{
  "ProjectName": "vsstosvn",
  "Title": "SourceSafe to SVN Import and Migration",
  "Description": "Visual SourceSafe to Subversion allows VSS databases to be imported into new or existing SVN repositories using a user friendly GUI or command line client.",
  "MovedLink": "https://github.com/cyotek/vsstosvn",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h3>Project Description</h3>\r\n<p>Visual SourceSafe to Subversion allows VSS databases to be imported into new or existing SVN repositories.</p>\r\n<p>You can use a user friendly GUI to configure the migration, or use the command line.</p>\r\n<p>Using VSS2SVN you can select which projects to include, allowing a partial import of a database. VSS2SVN can work with new repositories or existing repositories, making it easy to merge multiple VSS databases into a single SVN repository. The tool can also\r\n handle limited SourceSafe database corruption if versions of a given file cannot be accessed.</p>\r\n<p>This tool came about due to the limitations of a <a href=\"http://www.poweradmin.com/SOURCECODE/VSSMIGRATE.ASPX\">\r\nthird party tool</a> I was using to migrate a database. While this worked after a fashion (my initial experiences are\r\n<a href=\"http://cyotek.com/blog/migrating-from-visual-sourcesafe-to-subversion\">detailed here</a>) it did require&nbsp;a number of modifications. Despite these it still didn't serve the purposed I needed it for (mainly the ability to import multiple VSS databases\r\n with the same project structures into a single repository) and so this tool was created, reusing much of the the original code.</p>\r\n<p>Many thanks to <a href=\"http://www.codeplex.com/site/users/view/DamirValiulin\">\r\nDamir Valiulin</a> who has updated the project to include a bunch of extra features (such as no longer needing physical file access to the repository in order to change revision props) and some welcome bug fixes.</p>\r\n<h3>Usage</h3>\r\n<p>Both a command line and GUI version is provided, both of which call the same back end class library which could be used&nbsp;independently&nbsp;of either front end. See the documentation topic for more information.</p>\r\n<p>In order to use this tool, Visual SourceSafe must be installed in order to access the SourceSafe API library. I recommend you use Visual SourceSafe 2005 with the latest bug fix roll up. Some code changes may be required if using Visual SoourceSafe 6.0d.</p>\r\n<p>If you download the source code, then you will need the latest SharpSVN package.</p>\r\n<p><span>You&nbsp;</span><strong>must</strong><span>&nbsp;have a pre-revision property change hook on your repository. If this hook is not present, revision information cannot be updated and your migration will halt.</span></p>\r\n<p><strong>Important: I used this tool to create a brand new repository, import a VSS database into it, then import a second VSS database. This tool has not been extensively tested, please ensure you have backups of your repositories and files before using\r\n this tool.</strong></p>\r\n<h3>Screenshots</h3>\r\n<p>The screenshots below show the GUI in use, and when it has completed.</p>\r\n<p><img src=\"http://cyotek.com/files/vsstosvn/vsstosvn1.png\" alt=\"During the conversion of a database containing some corruption\" width=\"872\" height=\"719\" style=\"vertical-align:middle\"></p>\r\n<p><img src=\"http://cyotek.com/files/vsstosvn/vsstosvn2.png\" alt=\"After a successful migration\" width=\"872\" height=\"719\" style=\"vertical-align:middle\"></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "svn,SubVersion,VSS,SourceSafe,Source Control,c#,",
  "LastEdited": "2013-02-23T00:10:35.067-08:00"
}