{
  "ProjectName": "vstudiotoolbox",
  "Title": "Visual Studio Toolbox Manager",
  "Description": "This project is a command-line utility designed for .NET component developers.  With it, you can add or remove controls to a toolbox tab inside of Visual Studio 2005 or Visual Studio 2008, for both desktop and mobile device projects of any kind.  ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h4>Introduction</h4>\rThis project is a command-line utility designed for .NET component developers.  With it, you can add or remove controls to a toolbox tab inside of Visual Studio 2005 or Visual Studio 2008, for both desktop and mobile device projects of any kind.  <br /><br />Version 1.0 of this project has been in production use since April 2006; a newer version is under development to add support for VS2008.  This utility was originally developed by <a href=\"mailto:jperson@geoframeworks.com\">Jon Person</a> of <a href=\"http://www.GeoFrameworks.com\">GeoFrameworks</a> with additional support by Bill Bither of <a href=\"http://www.atalasoft.com\">Atalasoft</a>.  Special thanks to Chetan Chudasama for <a href=\"http://blogs.msdn.com/chetanc/archive/2006/01/19/515016.aspx\">his original blog post</a> about this approach.<br />\n<h4>How It Works</h4>\rThis utility will create an instance of the Visual Studio IDE using COM.  Then, it will open a project template in order to gain access to the toolbox for a specific device platform.  Remember, Visual Studio maintains a separate toolbox for desktop projects, PocketPC projects, Smartphone projects, and etc.  Finally, the utility will search toolbox tabs and modify them as necessary to add or remove controls.  Since this approach triggers a silent launch of <span class=\"codeInline\">devenv.exe</span> it requires several seconds to warm up.  However, the utility is designed to recycle instances of the IDE as much as possible to optimize performance and reduce memory use.  \n<h4>Usage </h4>\rThe Visual Studio Toolbox Manager is designed to be executed from the command line, making the utility useful during Windows Installer Packages.  To use this utility, make a call to <span class=\"codeInline\">TOOLBOX.EXE</span> with one or more of the following switches:<br /><br /><span class=\"codeInline\">TOOLBOX.EXE [/vs2005] [/vs2008] [/silent] [command [...]]</span><br /><br /><span class=\"codeInline\">/silent</span>                  Causes the utility to run without any user interface.<br /><span class=\"codeInline\">/vs2005</span>               Causes the utility to make changes to the Visual Studio 2005 toolbox if it is installed.<br /><span class=\"codeInline\">/vs2008</span>               Causes the utility to make changes to the Visual Studio 2008 toolbox if it is installed.<br /><span class=\"codeInline\">/installdesktop assembly tabname</span>   Installs all of the user controls in the specified assembly to a new toolbox tab with the specified name.<br /><span class=\"codeInline\">/installpocketpc assembly tabname</span>    Installs all of the user controls in the specified assembly to the Compact Framework toolbox using the specified toolbox tab name.<br /><span class=\"codeInline\">/installcustom assembly tabname</span>    Installs all of the user controls in the specified assembly to a custom project template (usually some mobile device platform) using the specified toolbox tab name.<br /><br /><span class=\"codeInline\">tabname</span> Represents the title text used to label a toolbox tab.<br /><span class=\"codeInline\">assembly</span> Represents the path and filename of a .NET assembly containing one or more user controls to install.<br />\n<h5>Installing User Controls </h5>\rThis example will install controls into both Visual Studio 2005 and Visual Studio 2008 under a tab named &quot;GPS&quot; for desktop applications.<br /><br /><span class=\"codeInline\">Toolbox.exe /vs2005 /vs2008 /installdesktop GeoFramework.Gps.dll &quot;Global Positioning System&quot;</span><br /><br />This example will install controls into both Visual Studio 2005 and Visual Studio 2008 under a tab named &quot;GPS&quot; for Compact Framework applications.<br /><br /><span class=\"codeInline\">Toolbox.exe /vs2005 /vs2008 /installpocketpc GeoFramework.Gps.dll &quot;Global Positioning System&quot;</span><br /><br />This example will use a custom project template to install controls targeting the Smartphone 2003 mobile device platform.<br /><br /><span class=\"codeInline\">Toolbox.exe /vs2005 /vs2008 /installcustom &quot;Smartphone2003-WindowsApplication.zip&quot; GeoFramework.Gps.PocketPC.dll &quot;Global Positioning System&quot;</span><br />\n<h5>Uninstalling Controls</h5>\rThis example will remove all of the controls installed under the &quot;Global Positioning System&quot; toolbox tab for both Visual Studio 2005 and Visual Studio 2008.<br /><br /><span class=\"codeInline\">Toolbox.exe /vs2005 /vs2008 /uninstall &quot;Global Positioning System&quot;</span><br />\n<h5>Silent Operation</h5>\rThis example will perform an installation of an assembly to the Visual Studio 2005 toolbox, but no user interface will be displayed.<br /><br /><span class=\"codeInline\">Toolbox.exe /vs2005 /silent /installdesktop GeoFramework.Gps.dll &quot;Global Positioning System&quot;</span><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "utility,Visual Studio 2008,toolbox,modify,toolbox tab,Visual Studio 2005,Command-line,Command Line,User Controls,RETURN 2010,",
  "LastEdited": "2008-02-08T11:36:05.803-08:00"
}