{
  "ProjectName": "WebCommands",
  "Title": "WebShell, Web application Framework",
  "Description": "WebShell is a new web framework facilitate the way of building web application with respect to re-usability, inversion of control, reach UI, integration with other applications and scalability.\nFramework built using .net 4 and C# as primary  language.",
  "MovedLink": "",
  "HomeWiki": "\r\n<div class=\"wikidoc\"><strong>Project Description</strong></div>\r\n<div class=\"wikidoc\"><strong><br>\r\n</strong></div>\r\n<div class=\"wikidoc\">WebShell is an MVP restful web applications framework which provides full layers separation that helps in separate layer development and reusability, The framework aims to accelerate development process by facilitating the way of component\r\n development in manner of separation and re-usability also the frame work introduce new way to rendering HTML pages by providing so easy and innovative HTML Template quoted from Django framework; UI template depends only on native HTML and JQuary so that it\r\n provide a way to reuse it with other technologies like php, java and python.</div>\r\n<div class=\"wikidoc\"><strong>Note</strong>: the current UI template can be used with Django framework without any changes.</div>\r\n<div class=\"wikidoc\">&nbsp;</div>\r\n<div class=\"wikidoc\"><img src=\"http://download.codeplex.com/download?ProjectName=WebCommands&DownloadId=164497\" alt=\"WebShell Framework\"></div>\r\n<div class=\"wikidoc\">\r\n<div class=\"wikidoc\"><strong>The idea behind WebShell </strong>is to translate HTTP requests to commands each command or more than one command represented by DLL, Command class that implements ICommand interface will include methods that ends with one of\r\n these suffixes (_POST, _GET, _PUT and _DELET) and according to HTTP request method these methodes inside Command class will be invoked dynamically.</div>\r\n<div class=\"wikidoc\">For more information,<strong> Check this link to learn <a title=\"How to use WebShell\" href=\"http://webcommands.codeplex.com/wikipage?title=How to use WebShell?\">\r\nHow to use WebShell?</a></strong></div>\r\n</div>\r\n<div class=\"wikidoc\"><strong>Stages of Development </strong></div>\r\n<div class=\"wikidoc\"><strong>stage 1,</strong> this stage considered to be proof of concept stage not more which represented by version 1.0 Beat (issued) .</div>\r\n<div class=\"wikidoc\"><strong>stage 2,</strong> will intend to refine commands structure, presenter, cashing, and asynchronous processing to improve framework performance; this stage will be represented by coming version 1.0 stable release.</div>\r\n<div class=\"wikidoc\"><strong>stage 3,</strong> WebShell Framework aim to be cross technologies and cross platforms which will provide wide base for re-usability so this stage will have the role of operating WebShell under other technologies that will starting\r\n with MONO whilst the current framework language is C# so it will be easy to be used under MONO, not only mono technology bu also other technologies like PHP and JAVA.</div>\r\n<div class=\"wikidoc\"><strong>stage 4,</strong> adding ms visual studio plug-ins to support the framework.</div>\r\n<div class=\"wikidoc\"><span style=\"color:#008000\"><strong>Volunteers</strong></span></div>\r\n<div class=\"wikidoc\">if you have the time and the effort join WebShell team and share us improving WebShell to be used in realistic world.</div>\r\n",
  "TagList": "",
  "LastEdited": "2010-11-06T09:37:30.473-07:00"
}