{
  "ProjectName": "weblight",
  "Title": "WebLight",
  "Description": "WebLight is an Asp.Net Control library developed to leverage the power of jQuery. The library currently provides 8 controls, and more are on the way. The library is developed in C#.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Welcome to the WebLight Library Home</h2>\r\n<b>Description :</b> WebLight is an Asp.Net Control library developed to leverage the power of jQuery. The library currently provides 8 controls, and more are on the way. The library is developed in C&#35;.<br /><br /><b>Controls :</b><br />\n<ul><li><b>Auto Complete</b>  : Autocomplete is an input field to enable users to quickly find and select some value, leveraging searching and filtering.</li></ul>\n\n<ul><li><b>Collapsible Panel</b> : Collapsible Panel allows the user to easily add collapsible sections in their web pages. The controls also provides various animation effects.</li></ul>\n\n<ul><li><b>Filter Text Box</b> : The control filters the user input based on the required data type. The control supports filtering of UpperCase, LowerCase and Numeric characters. The control also provides flexible options to specify additional valid characters.</li></ul>\n\n<ul><li><b>Hijri Calendar</b> : The Hijri Calendar is an excellent counterpart of the Asp.Net Gregorian Calendar control. The control provides various customization options and can easily be used in an application supporting localization.</li></ul>\n\n<ul><li><b>Live Validator</b> : The Live Validator control validates the user input as it is typed. The control supports Composite Validators thus allowing the user to group virtually any of the available validators, making it suitable for any Business Requirement.</li></ul>\n\n<ul><li><b>Message Box</b> : A useful control to display information to the user, contextually styled on the basis of the information type.</li></ul>\n\n<ul><li><b>Numeric Text Box</b> : Restricts user input to accept only Numeric values. The control is an enhanced version of the Filter Text Box control specifically developed for Numeric data fields providing additional customizable options.</li></ul>\n\n<ul><li><b>Value Rotator</b> : The control provides the user to select an option from an input list. Compared to the Combo Box control, the Value Rotator occupies less space on the web page.</li></ul>\n<br />\n<h3>Special Thanks</h3>\r\n<ul><li><b>John Resig</b> <a href=\"http://ejohn.org/\">http://ejohn.org/</a> (and the jQuery community) for the wonderful JavaScript framework. <a href=\"http://jquery.com/\">http://jquery.com/</a></li></ul>\n\n<ul><li><b>Janko Jovanovic</b> <a href=\"http://www.jankoatwarpspeed.com\">http://www.jankoatwarpspeed.com</a> for sharing his original Message Box control.</li></ul>\n\n<ul><li><b>J&#246;rn Zaefferer</b> for developing one of the most popular Autocomplete plug-ins in the community. <a href=\"http://bassistance.de/jquery-plugins/jquery-plugin-autocomplete/\">http://bassistance.de/jquery-plugins/jquery-plugin-autocomplete/</a></li></ul>\n\n<ul><li><b>Alec Hill</b> for a very innovative validation library called LiveValidation. <a href=\"http://www.livevalidation.com/contactthanks\">http://www.livevalidation.com/contactthanks</a></li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET 2.0,Ajax,C#,Controls,javascript,jQuery,JSON,validation,Controllo Asp,",
  "LastEdited": "2009-08-26T08:16:30.06-07:00"
}