{
  "ProjectName": "webpropertycreator",
  "Title": "Web Property Creator",
  "Description": "Web Property Creator is a tool for exposing properties on web pages or web user controls. Create properties that use Session, ViewState or object sources.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">By Data Juggler Software www.datajuggler.com .<br /><br />If you like this project, please donate it keeps us going!<br /><br /><a href=\"http://www.pledgie.com/campaigns/24373\"><img style=\"border:none;\" src=\"http://www.pledgie.com/campaigns/24373.png?skin_name=chrome\" alt=\"Donate to Data Juggler\" title=\"Donate to Data Juggler\" /></a><br /><br />Project Description<br />Web Property Creator is a tool for exposing properties on web pages or web user controls. Create properties that use Session, ViewState or object sources.<br /><br />Web Property Creator is a tool used to create properties for web pages and web user controls.<br /><br />You can watch a video on YouTube: http://www.youtube.com/watch?v=Na6JiV508Yk&amp;feature=youtu.be<br /><br />There are three types of properties you can create; Session, ViewState and Object.<br /><br />Session<br /><br />This will create a property that the value will be available to the web application for the lifetime of the session of the current web visit.<br /><br />ViewState<br /><br />This will create a property that is available only to the current control or page that this property belongs to.<br /><br />Object<br /><br />This will create a property that the value comes from another object. An example of using object is a page or control that has a child control you want to expose the value of.<br /><br />Object behaves differently than ViewState or Session in that the object type of properties check for the existence of the object before setting the value. ViewState and Session always set the value in the setter.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,Web Properties,Asp.Net,Web Development,Properties,Web,Web Property,Web Property Creator,Web Controls,Web Pages,",
  "LastEdited": "2014-03-04T06:25:00.647-08:00"
}