{
  "ProjectName": "webtoolsui",
  "Title": "WebTools.UI",
  "Description": "A library of ASP.NET server controls including the Rollover Image Button and Hyperlink controls that provide a simple way to implement rollover images without having to write JavaScript code, just drag and drop, and the Alert control which can display both success and error messages to users and display output from server validators.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A library of ASP.NET server controls including the Rollover Image Button and Hyperlink controls that provide a simple way to implement rollover images without having to write JavaScript code, just drag and drop, and the Alert control which can display both success and error messages to users and display output from server validators.<br /><br /><b>WebTools.UI Contents</b><br />Controls that are complete:\n<ul><li>RolloverImageButton/RolloverImageHyperlink - A button and hyperlink that incorporate JavaScript rollover funtionality. The script is embedded in the DLL so there is no need to write the JavaScript, you just set the control properties and the script will be generated.</li>\n<li>Alert - A control for displaying messages to users with two types of rendering options, Success and Error. The control will also display output from the server validators.</li></ul>\n<br />Controls in the works:\n<ul><li>ImageLiteral - Adds an ImageUrl property to a literal control so you can place an image next to your literal text in one control.</li>\n<li>WebControlLabel - A base class for creating WebControls that can either render the WebControl or Label. Useful for swapping out Textboxes, etc. when a page is in print mode.</li>\n<li>TextboxLabel - Derived from WebControlLabel, the TextboxLabel will present a Textbox or Label based on the value of the LabelMode property.</li>\n<li>DropDownListLabel - Derived from WebControlLabel, the DropDownListLabel will present a DropDownList or Label based on the value of the LabelMode property.</li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,Controls,.NET 2.0,UserControls,Library,Server Controls,webcontrols,Rollover Image,",
  "LastEdited": "2007-05-11T06:13:13.707-07:00"
}