{
  "ProjectName": "wowvoicebox",
  "Title": "WoW VoiceBox",
  "Description": "A voice recognition program for World of Warcraft that allows for key presses and macros to be mapped to voice commands as well as allowing voice control of in-game chat channels.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>WoW VoiceBox</b><br />A voice recognition program for World of Warcraft that allows for key presses and macros to be mapped to voice commands as well as allowing voice control of in-game chat channels.<br /><br /><b>About</b><br />WoW VoiceBox is deisgned to allow for key presses and macros to be mapped to voice commands. It also allows voice control of in-game chat channels, so you can chat directly without having to pause what you&#39;re doing. All commands can be either broadcast to all copies of WoW on the local machine or sent only to the focused window.<br /><br /><b>Requirements</b>\n<ul><li>Windows Vista or Windows 7 (32 or 64 bit)</li></ul>\n\n<ul><li>Microphone</li></ul>\n\n<ul><li>World of Warcraft</li></ul>\n<br /><b>Basic Usage</b><br />When you first start up the program, you should see a very faint window. This is designed to lay over the game screen in an area that you don&#39;t have to click on. When you mouse over the window or it is accepting dictation, it will become less transparent. <br /><br />To use the program, all you have to do is say a valid command. For now, you&#39;ll have to refer to the list of commands in the command editor to see what commands are available. If you say a command that does not require dictation, the program will immediately enter that command to the game as soon as it is recognized. <br /><br />If the command given allows for dictation, such as using a chat channel, then the program&#39;s window will appear and the program will begin accepting dictation. When you are done dictating, pause briefly to allow the program to process your message, then say “Send”. If the dictation was recognized incorrectly, you can say “Clear” to erase it.<br /><br />To quit the program, simply hit the quit button or say “Quit”. <br /><br /><br /><br /><br /><br /><b>Using the command editor</b><br />To open the command editor, simply say “Options”. The options dialog should appear. Choose the &quot;Commands&quot; tab.  On the left is a list of all the commands currently loaded. You can add or delete commands with the buttons below the list. To view the details of a command, select it in the list. <br /><br />The first drop down box allows you to choose whether a command is a macro command or a single key command. A single key command represents a single key press which can be modified by the modifier keys control, alt and shift. A macro command is a command of several characters that will be entered at the same time. Macro commands can also contain a dictation tag that allows the user to dictate text for talking in chat channels. Both types of commands can either be sent to the window with focus or broadcast to all WoW windows.<br /><br />Next comes the Voice Command box. This is where you enter what you will say to trigger this command. Following that is the Broadcast checkbox. This determines if this command will be sent to all instances of WoW or only the one with focus.<br /><br />Finally, you will see one of two text boxes, depending on the type of command. For a macro command, there is a box for you to enter the macro that will be sent to the game. To allow for dictation in a macro command, put {0} somewhere in the macro. Now when you trigger that command, the program will go into dictation mode as described above, and the {0} will be replaced with the dictated text. <br /><br />If you are looking at a single key command, the text box will show the windows key code for this command along with any modifier keys. To change the key, simply click in the box and hit the key you want. Note that sometimes the keys may have weird names. For example, the standard number keys 0-9 show up as D0-D9. Don&#39;t worry about it, it should still work.<br /><br />When you are done making changes, hit OK and all the changes you have made will be saved to the configuration file. You can also hit cancel to undo any changes.<br /><br /><br /><br /><br /><br /><b>Setting up the XML commands file – Advanced users only</b><br />This part is now outdated with the introduction of the commands editor. It is kept for reference and advanced users only.  Settings for the application are stored in the following path:<br /><br />C:\\Users\\(username)\\AppData\\Local\\WowVoiceBox<br /><br />WoW VoiceBox uses an XML file to store all of its commands which can be edited in Wordpad. There are two basic types of commands, commandkey and commandstring. The commandkey represents a single key press which can be modified by the modifier keys control, alt and shift. The commandstring represents a macro style command of several characters that will be entered at the same time. commandstring can also contain a dictation tag that allows the user to dictate text for talking in chat channels. Both types of commands can either be sent to the window with focus or broadcast to all WoW windows.<br /><br />The setup of a commandkey looks like this:<br /><br />&lt;command voice=&quot;Thorns&quot;&gt;<br /><br />&lt;commandKey&gt;30&lt;/commandKey&gt;<br /><br />&lt;modifier&gt;Ctrl&lt;/modifier&gt;<br /><br />&lt;modifier&gt;Alt&lt;/modifier&gt;<br /><br />&lt;/command&gt;<br /><br /><br /><br /><br /><br />The attribute voice in the command tag is used to set what you have to say to activate this command. The commandkey node identifies this as a single key command. Note that commandkey and commandstring are mutually exclusive. The inner text of the commandkey node represents the Windows key code in hexadecimal format. This one happens to be the ‘0’ key. The modifier nodes indicate which modifier keys should be pressed in addition to the main key, in this case, Ctrl and Alt. So now when you say “Thorns”, the program will send Crtl<u>Alt</u>0 to the focused window. In game, you would map this key combination to Thorns. A list of the key code values can be found here: http://msdn.microsoft.com/en-us/library/ms927178.aspx. Use the value in the “Hexadecimal value” column.<br /><br />Setting up a commandstring is similar, but a little bit different. Here is the basic command for yelling something in chat via the dictation.<br /><br />&lt;command voice=&quot;Yell&quot;&gt;<br /><br />&lt;commandString&gt;/y {0}&lt;/commandString&gt;<br /><br />&lt;displayString&gt;Yell:&lt;/displayString&gt;<br /><br />&lt;/command&gt;<br /><br /><br /><br /><br /><br />Again, the voice command you actually say is “Yell”, as indicated by the voice attribute. The displaystring tag contains what will be displayed on the user interface while the program is accepting dictation. The commandstring tag contains the actual command that will be sent to the game, where “{0}” is replaced with the dictated text. <br /><br />For simpler commands like a standard macro, it’s pretty much the same. Here’s one that will make all your guys dance.<br /><br />&lt;command voice=&quot;Dance&quot; broadcast=”1”&gt;<br /><br />&lt;commandString&gt;/dance&lt;/commandString&gt;<br /><br />&lt;/command&gt;<br /><br /><br /><br /><br /><br />The only thing new there is the broadcast attribute, which tells it to send the command to all windows. Broadcast can be applied to either type of command.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-07-16T20:55:46.793-07:00"
}