{
  "ProjectName": "WPFMineSweeper",
  "Title": "WPF MineSweeper",
  "Description": "An attempt to emulate the Windows 7 minesweeper game using WPF. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>WPF Minesweeper</strong><br>\r\nThis project started out as a friendly competition between friends to see who could come up with a minesweeper implementation faster. While the initial version of this project was whipped up in a few hours, the more we looked at it, the more intricacies we\r\n wanted to emulate, and emulate as close to the real thing as possible. What we’ve realized is that while the game itself might not be that complicated, making sure it looks right, and emulates the full Minesweeper feature set is a little more involved.</p>\r\n<p>For example, most implementations done in WPF and Windows Forms use buttons for the tiles, this doesn’t really work as the buttons trap focus on mouse down until the user releases the mouse button. You’ll see that in the real minesweeper game, you can hold\r\n the mouse button down and roll over tiles, we have this working as well using the Behavior pattern and creating an IsMouseDown attached property.</p>\r\n<p>To minimize the boiler plate code in this application we factored out the implementation of INotifyPropertyChanged into initially a base class (not that fast, and had issues with refactoring), and then into a proxy class generator. As the proxy generator\r\n matured we moved it into a new project called <a href=\"http://swiftmvvm.codeplex.com/\">\r\nSwiftMVVM</a> since we feel there is a lot of value in our implementation that can be used elsewhere in other WPF projects.</p>\r\n<p>So, where have we gotten so far? The game is modeled after the Minesweeper game that ships with Windows 7. We have a full game implementation, the ability to customize the map, and choose themes. We also have user based statistics. At this point our goal\r\n is to put the icing on the cake so to speak, we just added keyboard support to the game board, as well as some sounds.</p>\r\n<p>On the horizon we’re going to be working on animating the mines when they’re uncovered and board animations as a whole which should be interesting.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,minesweeper,",
  "LastEdited": "2012-07-17T21:45:21.867-07:00"
}