{
  "ProjectName": "WPFTaskmanager",
  "Title": "WPF Taskmanager",
  "Description": "The application is a task manager. You can create tasks an attach it to a person, project, software package or Hardware configuration \n\nThe goal of this project is to see how easy it is to build a business application in WPF. What are the advantages? ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The application is a task manager. You can create tasks an attach it to a person, project, software package or Hardware configuration <br /><br />The goal of this project is to see how easy it is to build a business application in WPF. What are the advantages&#63; <br /><br />Lonely Business, Open source software. This project  is already a few months on codeplex. Many downloads but until know I’ve no response at all.<br />, <br />I want to post a new one, a full web browser written in WPF <br /><br />http://www.aptools.net/Clouds.aspx  If somebody is interested let me know<br /><br /><br /><br /><img src=\"/projects/WPFTaskmanager/7abdde6e-d446-47fc-8ba5-036c78c08281\" alt=\"application.png\" title=\"application.png\" /><br /><br />Lonely Business, Open source software. This project  is already a few months on codeplex. Many downloads but until know I’ve no response at all.<br />, <br />I want to post a new one, a full web browser written in WPF <br /><br />http://www.aptools.net/Clouds.aspx  If somebody is interested let me know<br /><br /><br />\n<h1>Introduction</h1>\r\nFor this article I want to present a business application in WPF<br /><br />The goal of this project is to see how easy it is to build a business application in WPF.  What are the advantages? Is it a real alternative for the classic Winform Application?<br /><br />I many articles you can see specific problems solved. In this project I want to bundle everything in one project.  Some element from this application can be a starting point for your first WPF business application.<br /> <br />I read many articles about WPF on the code project. Special thanks to Sacha  Barber, Karl Shifflett and Josh Smith  for their interesting articles<br />    \n<h1>The application</h1>\r\nThe application is   a task manager. You can create tasks an attach it to a person, project, software package or Hardware configuration<br /><br />Visual studio 2008 is required to run this application<br /><br />To open the solution go to the folder&lt;b&gt;Crm\\Code\\FrontEnd\\&lt;/b&gt; and open the solution&lt;b&gt; FrontEnd.sln <br /><br />The basic from all the screens are made with User Controls (Detail and Grid Screen) it’s an interesting approach. It makes it possible to re-use detail and grid views in different screens.   <br />( Project UserControls)<br /><br />The Data Access Layer is Classic ADO.Net for an MS Access database. It’s easier to deploy an application like this with MS Access ( Project Data Access ) )<br /><br /><img src=\"/projects/WPFTaskmanager/ad5f81c4-5fa5-4b22-ac3e-bcfe1829ee47\" alt=\"detail.png\" title=\"detail.png\" /><br />\n<h1>What can you see in the application?</h1>\r\n<h2>Working with a Listview</h2>\r\nIn the application you can see how you can customize a listview in WPF   (You can also work with a data grid in the new service pack 1. The code to do this is almost the same) Layout from a Listview,<br />Adding Specific controls in Listview  (Hyperlink), Sorting, Value Converter (date) , Adding a  flexible search engine to the a grid. You can also see the implementation from a master detail screen.<br />   \n<h2>Speech support</h2>\r\nThe application gives an introduction to the screens and speaks to you when a required field is not filled in.<br />\n<h2>Spell checker</h2>\r\nThe spell checker is a cool future from WPF interesting to use in Memo fields<br /><br /><img src=\"/projects/WPFTaskmanager/64cdb5d7-00a2-4470-beb3-ef1c63d9c4e6\" alt=\"spellchecker.png\" title=\"spellchecker.png\" /><br />\n<h2>Customised Tool tips</h2>\r\nYou can build your own tooltip layout in WPF. Very interesting<br /><br /><img src=\"/projects/WPFTaskmanager/082e0f48-a6ac-4dc2-bfc4-40397a62a418\" alt=\"tooltip.png\" title=\"tooltip.png\" /><br />\n<h2>Animations</h2>\r\nIn the application I build a little colour animation when a field is not filled-in <br />\n<h2>Building screens in code</h2>\r\nIn WPF it&#39;s also possible to build very flexibile screens in the code. An example you can see in the search screen, the screen where you can make a selection for the grid. <br /><br /><img src=\"/projects/WPFTaskmanager/985a5954-4f51-4a52-9a29-e65563a39361\" alt=\"Criteria.png\" title=\"Criteria.png\" /><br />\n<h2>DataBinding</h2>\r\nHow you can bind data to grid or combobox?<br />\n<h2>Other things</h2>\r\nYou can see also the implementation of scroll viewers, grid, background colours, customised buttons, tab pages etc.<br />\n<h1>Conclusion</h1>\r\nThe general look of WPF application is nicer. We have more possibilities. <br />The layout is much more flexible in WPF. Problems like, customize tool tips, add special controls on a grid, customize the tab items from a tab control are very easy to solve in WPF<br /><br />Also the data binding is better in WPF<br /><br />At some points it takes more time to build screens. To solve this problem I used a code generator to build the screens and grids<br /><br />If you see WPF in global perspective ( Web development with silverlight based on the same XAML ) you can only believe. I was sceptical about WPF, The only thing I can say now is I love it.<br />\n<h1>The future.</h1>\r\nI want to extend the application with other futures from WPF ( Flow documents, XPS documents , graphics’ etc.-) <br /><br />I you have a nice idea to extend this application with new possibilities form WPF. Don’t hesitate to contact me.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "TaskMan,",
  "LastEdited": "2009-08-04T15:12:31.073-07:00"
}