{
  "ProjectName": "WUCMaker",
  "Title": "Web UserControl Library Maker",
  "Description": "This little project was at first designed to publish Web Projects done with the Express version of Visual Studio.\n\nRecently i wanted to create a library(dll) containing User Controls. Well, this seems to be incompatible with the way VS and the .Net Framework works.\nThe only way to create such a library is to create a Web Application and publish it. This seems not to be very hard. \nNonetheless, when you publish a web site with Visual Studio, you do not have the choice of the output file's names. The consequence is that the reference changes as often as you create a new instance of Visual Studio. But you have also to change the registry tag on each page you use a custom control form the library.\n\nI decided to enchance a bit the original application and add the possibility to build a Web User Control Library with a fixed name (thanks to ILMerge). The tool generate also a batch file from which you can easily make a shortcut in Visuam Studio Tools menu.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This little project was at first designed to publish Web Projects done with the Express version of Visual Studio.<br /><br />Recently i wanted to create a library&#40;dll&#41; containing User Controls. Well, this seems to be incompatible with the way VS and the .Net Framework works.<br />The only way to create such a library is to create a Web Application and publish it. This seems not to be very hard. <br />Nonetheless, when you publish a web site with Visual Studio, you do not have the choice of the output file&#39;s names. The consequence is that the reference changes as often as you create a new instance of Visual Studio. But you have also to change the registry tag on each page you use a custom control form the library.<br /><br />I decided to enchance a bit the original application and add the possibility to build a Web User Control Library with a fixed name &#40;thanks to ILMerge&#41;. The tool generate also a batch file from which you can easily make a shortcut in Visuam Studio Tools menu.<br /><br />The UI is very simple:<br /><br /><img src=\"/projects/WUCMaker/9e21c316-f01f-4475-819c-3c40225998f9\" alt=\"UI1.png\" title=\"UI1.png\" /><br /><br /><b>The Output type</b> allows you to choose if you want the output to be a WebSite or a WebUserControl Library. In fact it does not make much difference. If you choose WebUserControl Library output type the options will be checked automatically. You can have the same result if you choose the Web Site output. The WebUserControl Library output type is just a predefined configuration.<br /><br /><b>Application to build</b> allows you to choose the WebApp to compile. Either choose an IIS site or a folder containing a WebApp with the command buttons on the right.<br /><br /><b>The Output Path</b> allows you to choose where the files will be build.<br /><br /><b>Allow aspx files to be modified after publication</b> will compile only the code behind so that the &quot;XHTML&quot; code will be editable.<br /><br /><b>Generate an assembly for each page or control</b> will output, as it says, one assembly for each aspx and ascx files.<br /><br /><b>Merge all assemblies into one</b> allows you to choose the name of the output assembly. This option uses ILMerge to merge all generated assemblies. The name of the file should have dll extension mentioned.<br /><br /><b>Create a batch file</b> allows you to have a ready to use batch file to run the process without using the application.<br /><br />When you are ready click on generate. Reference the generated dll in a WebApp application and use your user controls at will.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,ASP.NET 2.0,asp.net controls,webcontrols,web,UserControls,User Controls,tool,Tools,visual studio 2005,Visual Studio,",
  "LastEdited": "2008-01-17T14:29:40.57-08:00"
}