{
  "ProjectName": "xmlmapping",
  "Title": "XML Mapping Task Pane for Word 2007/2010",
  "Description": "The XML Mapping Task Pane for Word can be used to build templates that utilize content controls and XML mapping in Word 2007/2010. \r\n\r\nYou can use the task pane to add XML parts to Word documents, view a part's XML structure, and drag and drop XML nodes into the document to create mapped content controls, making it easy and quick to create structured document templates.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>XML Mapping Task Pane for Word 2007/2010</h2>\rThe XML Mapping Task Pane for Word can be used to build templates that utilize content controls and XML mapping in Word 2007&#47;2010. <br /><br />You can use the task pane to add XML parts to Word documents, view a part&#39;s XML structure, and drag and drop XML nodes into the document to create mapped content controls, making it easy and quick to create structured document templates.\n<h3>Details</h3>\rThis add-in adds a Mapping group to Word 2007 and 2010&#39;s Developer tab. When opened, the task pane displays all of the XML parts in the current document in a tree view:<br /><br /><img src=\"/projects/xmlmapping/7db88884-4e39-4f12-a652-119a3b607265\" alt=\"XmlMappingPane.png\" title=\"XmlMappingPane.png\" /><br /><br />From the task pane, you can perform all tasks necessary to set up a document with mapped content controls:\n<ul><li>Add XML parts to the document, both from an existing XML file, or by directly entering its content</li>\n<li>See the list of XML parts available in the document</li>\n<li>View the contents of each part as a tree</li>\n<li>Drag and drop XML nodes into the document to create mapped content controls</li>\n<li>Map existing content controls to a specific XML node via a right-click menu</li>\n<li>etc.</li></ul>\nFor more information, please consult the documentation on the <a href=\"http://xmlmapping.codeplex.com/documentation\">Documentation</a> tab.\n<h4>Important Note</h4>\r<ul><li><b><u>This add-in is not supported by Microsoft</u></b>; however, the source code is available so it can be viewed and modified (please consult the <a href=\"http://www.codeplex.com/xmlmapping/license\">License</a> tab if you have any questions on licensing).</li></ul>\n<br />As well, if you have cheers/jeers/feature requests, please submit them on the Discussions page - I&#39;d love to hear from you.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Office,Word,Content Controls,Mapping XML's,",
  "LastEdited": "2011-09-14T21:47:20.26-07:00"
}