{
  "ProjectName": "xmlsearchreplace",
  "Title": "Xml search and replace",
  "Description": "XmlSearchReplace is a free commandline utility to replace text inside an xml document. It gives the user control over where in the xml document the search should be done. The tool allows users to search and replace texts only inside xml element/attribute name and/or value.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />XmlSearchReplace is a free commandline utility to replace text inside an xml document. It gives the user control over where in the xml document the search should be done. The tool allows users to search and replace texts only inside xml element&#47;attribute name and&#47;or value.<br /><br /><b>Project Details</b><br /><br />XmlSearchReplace is a command line tool to search and replace text from an Xml document. You can also achieve this by doing a regular text search and replace in the xml file. However, you don&#39;t have much control over where in the Xml you want to perform the search on. It might be, you want only the texts inside elements to be renamed - but a text search cannot distinguish between an Xml tag or a value.<br /><br />XmlSearchReplace tries to overcome this by allowing users to specify where they want to perform the search. Also, it&#39;s a command line utility and supports wild cards - which means you can perform the search in multiple files and from a batch file.<br /><br />I started working with the tool when I sometimes needed to change some reference from .csproj files of Visual Studio and it was getting tiresome to try and change 20-30 project references manually. I also wanted to practice some TDD - and started the development with a TDD approach.<br /><br />I believe, apart from being a tool to replace texts from within xmls, the search replace engine can also be used by developers as an independent library in their projects where they needs such features.<br /><br />Please care to provide feedback if you find the tool helpful and also let me know any features you&#39;d like to see/bug reports etc.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Xml,xml search,command line,commandline,xml search replace,xml replace,free tool,free xml,C#,TDD,",
  "LastEdited": "2009-12-10T04:35:22.11-08:00"
}