{
  "ProjectName": "xmlwebpad",
  "Title": "XML Editor - A Framework and Developer Toolkit",
  "Description": "XML Webpad is a framework to view and edit XML files that can also be integrated embedded with any ASP.Net web application. It is developed using C#, .Net 3.5, JavaScript. It has web based GUI xml editor and implements tree correction and XML to JS DOM mapping algorithm.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />XML Webpad is a framework to view and edit XML files that can also be integrated embedded with any ASP.Net web application. It is developed using C&#35;, .Net 3.5, JavaScript. It has web based GUI xml editor and implements tree correction and XML to JS DOM mapping algorithm.<br /><br /><b>Background</b><br />All web applications maintain some form of XML based configuration file e.g. web.config, which then invariably needs to be updated specially after the application has been deployed to production. Search the web for <b><i>modify web.config programmatically at runtime</i></b> and we get millions of result. Even though the techniques described in each works okay but they does not scale or are easily reusable. There are many XML viewer, explorer and editor out there but very few of them are web based. The ones which are web based, are indeed heavy weight and full fledged stand alone content management system meant for content editors. Right now, there is no light weight framework or API or something available, that a web developer can easily use and integrate with his own existing application. This is where XML Webpad (a web based xml editor viewer) comes in.<br /><br /><b>XML Webpad Advantage</b><br />Unlike other control, tools and editors, XML Webpad at its heart is not just a stand alone web application but rather <b>provides the framework</b> (the XMLWebPad.dll and xmlwebpad.js) to create your own viewer and editor that can be integrated with any ASP.Net applications. Also unlike others, <u>XML Webpad is not a ASP.NET server control</u> and thus provides the user with <b>full control over UI look and feel</b>. <br />Best part of all is the fact that the <b>viewing and editing functionality are available out of the box</b>. Even better, not only it allows you <b>data modification</b> but you can <b>change the XML structure</b> as well. All that is needed is to make the right calls to the server engine (the demo project shows how to do it).<br /><br /><br /><b>Features</b>\n<ol><li>Out-of-box viewing and editing capabilities of XML files</li>\n<li>Lightweight and easy to integrate with any ASP.Net web application.</li>\n<li>Its a framework so that one can build their own custom UI around it.</li>\n<li>GUI based with hot-key intergation for add, deleete, rename, search functionalities</li>\n<li>Drag-n-Drop feature to move XML elements</li>\n<li>Search the XML tree</li>\n<li>Allows you to change the structure of the XML file</li>\n<li>A library to do programatic windows domain account impersonation (IdentityManager)</li>\n<li><b>COMING SOON!</b> - <b>Node level authorization and role-based security feature</b></li></ol>\n<br /><b>ScreenShots</b><br />Check out some more screenshots here - <a href=\"https://xmlwebpad.codeplex.com/wikipage?title=ScreenShots&referringTitle=Home\">ScreenShots</a>. Here&#39;s a sample:<br /><br /><img src=\"/projects/xmlwebpad/46b2d15e-74f2-4ad1-82f4-477566aabe72\" alt=\"XMLWebPadImg4.PNG\" title=\"XMLWebPadImg4.PNG\" /><br /><br /><b>Quick Start Guide</b><br />Let&#39;s assume you already have an existing ASP.Net web application. If not, you can create a new web application and follow the steps to quickly get up and running with XML Webpad (The Demo project is actually very self-explanatory. Unpack the project and run it). <br />\n<ol><li>Unzip the &#39;XMLWebpadDemo.zip&#39;</li>\n<li>Copy the folder &#39;ScriptLib&#39;, &#39;Images&#39; and &#39;Styles&#39; into your web application project directory and include it in your project</li>\n<li>Then add assembly references to the XMLWebpad.dll and IdentityManager.dll to your project</li>\n<li>Now add the web service &#39;XMLEditorService.asmx&#39; to your project</li>\n<li>Create webform .aspx page or include the ConfigEditor.aspx in your project</li>\n<li>Add all the requried JavaScript file reference (main one being xmlwebpad.js) in the ConfigEditor.aspx (refer the demo)</li>\n<li>Modify the ConfigEditor.aspx.cs code behind as shown in the demo</li>\n<li>Do the same with the Edit.aspx (as shown in the demo)</li>\n<li>Run your web application and view the ConfigEditor.aspx and Edit.aspx page</li></ol>\n<br /><b>Frequently Asked Questions</b><br />Here&#39;s a list of <a href=\"https://xmlwebpad.codeplex.com/wikipage?title=FAQ&referringTitle=Home\">FAQ</a></div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,Framework,Xml Editor,Web Based,xml viewer,C#,jQuery,jsTree,plugin,xml,Configuration,web.config,modify,xml configuration,Toolkit,ASP.Net,xml editor control,xml editor plugin,",
  "LastEdited": "2011-01-05T05:56:05.813-08:00"
}