{
  "ProjectName": "xpcc",
  "Title": "XP Common Controls",
  "Description": "a collection of vb.net 2.0 controls",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>XPCC / XP Common Controls</h1>\r{project:XPCC / XP Common Controls}<br /><br />(You will find more info on my original website at <a href=\"http://www.steepvalley.net\">http://www.steepvalley.net</a>)<br /><br />When I was starting to develop in VS.net I wanted that nice XP-Look for all of my programs. The problem is, that Visual Studio shipped without most of them. The most missed controls where the Taskbox/Taskbar control and the Grouped ListView Contol. <br /><br />I ran into implementations of some of the controls on the internet (namely vbAccelerator and the TaskVision Sample on <a href=\"http://www.windowsforms.net\">http://www.windowsforms.net</a>) and into a document provided by Microsoft named &quot;Windows XP Design Guidelines&quot;. This document provides detailed information on some of the new controls and I started to recreate some of these controls for VS.net (with hints and help from the sites mentioned above - thank you again!)<br /><br />The one feature I wanted to have with the XP Controls was theming. But since it always needed some direct dll calls to uxtheme.dll I wrote my own theming dll. This has some positive and some negative effects. <br /><br /><u>Positive:</u> <br />It runs on any OS that supports the .net-Framework; means it will run on non-XP Systems like Win95 and Win2000. That said, I must also tell you that the theme listener and the grouping and tiling of the XPListGroup won’t work without Win XP. <br />I didn’t have to write a lot of API-calls ;-) <br /><br /><u>Negative:</u> <br />If Microsoft introduces a new theme or you download one from the internet, the controls will not support this one until it’s hardwired into the code. <br />As a workaround for the negative part I have exposed all properties of the theming formats to the IDE so you can define any combination of formats you want. <br /><br />The collection of controls grew over time and include now balloon tips, cue banners, a textbox provider, panes, ... <br />The newest addition are the <b>Windows Forms Stylesheet</b> (a separate project before) that will allow you change properties of your forms and controls at runtime, based on a xml definition file (similar to CSS in HTML).<br /><br />\n<h2>New Book &quot;Windows Developer Power Tools&quot; Out Now</h2>\r\nI&#39;m proud to anounce that the XP Common Controls are part of the newly released book &quot;Windows Developer Power Tool&quot; by James Avery and Jim Holmes. This book contains references to <i>over 170 free and open source tools, components and frameworks</i>, all of them coming with a mini user&#39;s guide. <br /><br />Please check out their homepage at <a href=\"http://www.windevpowertools.com\">http://www.windevpowertools.com</a> or buy the book here: <a href=\"http://www.amazon.com/exec/obidos/ASIN/0596527543/infozerk-20\">http://www.amazon.com/exec/obidos/ASIN/0596527543/infozerk-20</a> - it will save you a lot of time and money when creating your next .net project. <br /><br />My thanks to Jim and James for asking me to contribute to this book.<br /><br />\n<h2><a href=\"https://xpcc.codeplex.com/releases/view/3857\">Release 2.0.0.1</a> </h2>\r\nThe new interim release includes the new namespace Steepvalley.Windows.Forms.Login that mimics some Login Features of Windows XP. The namespace includes a Login Control and a LoginList Control. While the single Login Control supports Authenticating and Authenticated Events for one user, you can use the Listcontrols for managing a group of users. You will receive the currently selected user, password and other info in the related Authenticating and Authenticated events. There is a small sample code included but I will publish a detailed documentation shortly.</div><div class=\"ClearBoth\"></div>",
  "TagList": "winforms,watch,Controls,VB.NET,.NET 2.0,Windows Forms,UI Controls,Style,Controlli,",
  "LastEdited": "2007-05-07T23:56:06.347-07:00"
}