{
  "ProjectName": "YABE",
  "Title": "YABE :: Yet Another Blogging Engine",
  "Description": "The objective of this project is to iteratively build a very lightweight MVC based asp.net blog engine. The first version of this engine will only have a very limited functionality to display, add, and edit posts, and comments. In addition there should be support for atom and rss. Additional versions will have a richer feature set.\n\nThe basic architecture will be based on the following technologies, MVC, Linq to Sql, the asp.net membership model, and WCF. Memberships will be used to control who can do what on the blog. Linq to Sql will be used to generate the object model from the data design and MVC will be the technology of the front end and controller, which will allow us to easily expose posts and content with seo urls.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Latest</b>: YABE now supports asp.net MVC Release 1.0, Rhino Mock, and jquery for Ajax and is available now for download. Please see Releases section.<br /><br /><b>Project Description</b><br />YABE is a very lightweight MVC based ASP.NET blog engine intended to promote the MVC design principles in practice. It emphasizes on simplicity in design of MVC based web applications.<br /><br /><a href=\"https://yabe.codeplex.com/wikipage?title=Screenshots&referringTitle=Home\">Screenshots</a><br /><br />The basic architecture will be based on the following technologies, MVC, Linq to Sql, the asp.net membership model, jQuery, Json, Rhino.Mocks, and WCF. Memberships will be used to control who can do what on the blog. Linq to Sql will be used to generate the object model from the data design and MVC will be the technology of the front end and controller, which will allow us to easily expose posts and content with seo urls.  Rhino.Mocks is used for the unit testing of YABE and Json and jQuery are used to support an Ajax based admin interface.<br /><br /><br /><b>Status</b><br /><br />YABE currently has one functioning theme called &quot;Self&quot;.  <br /><br />You can see the YABE blogging engine live at <a href=\"http://www.jeffbergman.com/yabe/\">http://www.jeffbergman.com/yabe/</a>.<br />  <br />There is support for tags and a tag cloud, a blog roll, links, rss2.0, and atom.  We have completed a basic admin console<br />with the ability to add posts, editing, and deleting of posts.<br /><br />The to-do list includes the following.<br /><br />Add support for comments - This is 50% complete<br />Add captcha support also for comments<br />Add Akisment spam filter<br />Add more themes<br />Add site stats<br />Paging Support<br />Clean up of Views and Controllers and Routing. <br /><br /><br /><b>Routes</b><br /><br />This is a list of some of the routes and the priority of them.<br />\n<ul><li>http://domain/Posts </li>\n<li>http://domain/Feeds/rss20 </li>\n<li>http://domain/Feeds/atom</li>\n<li>http://domain/Login</li>\n<li>http://domain/Admin</li>\n<li>http://domain/Admin/List</li>\n<li>http://domain/tag/{tag}</li>\n<li>http://domain/{year}</li>\n<li>http://domain/{year}/{month}</li>\n<li>http://domain/{year}/{month}/{day}</li>\n<li>http://domain/{year}/{month}/{day}/{title}</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "Ajax,ASP.NET,blog,MVC,blog engine,LINQ TO SQL,jQuery,ASP.NET MVC,mock,JSON,",
  "LastEdited": "2009-03-21T10:15:47.237-07:00"
}