{
  "ProjectName": "YouPrivateNet",
  "Title": "You Private Social Network",
  "Description": "YourPrivateNet is for all people who are unsatisfied with how social networking giants, namely facebook, are dealing with privacy and the users data on their servers.\r\n\r\nThis project gives users total control over their own personal data and who has access to it.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />YourPrivateNet is for all people who are unsatisfied with how social networking giants, namely facebook, are dealing with privacy and the users data on their servers.<br /><br />This project gives users total control over their own personal data and who has access to it.<br /><br /><br /><b>**Looking for volunteers**</b><br /><br />We are currently looking for people who would like to step into this project provided that they have enough skills in programming mainly in .Net<br />The process will goes like the following:\n<ul><li>First 3 to 4 weeks are to receive demands from people who are interested in joining in</li>\n<li>Next 3 to 4 weeks are for brainstorming and discuss the initial idea and the best features to include</li>\n<li>Then the development starts. The first alpha version should be released in the following 3 months</li></ul>\n<br />PS. The initial plan will be delivered to people whose application was accepted.<br />If you are interested please think about these following issues before submitting your application:\n<ul><li>Do you have enough expertise in .Net or C++?</li>\n<li>Have you ever lead or worked on distributed appications?</li>\n<li>Do you have good english? You don&#39;t have to be Shakespear, just be able to convey in writings your ideas.</li>\n<li>Do you have enough time to work on the project? If you can work on average 3 hours a day or 20 hours a week than you are a good candidate</li>\n<li>Are you able to commit yourself to this project for at least 6months?</li></ul>\n<br />To apply to join the project you can either submit your wish to the discussion <a href=\"http://youprivatenet.codeplex.com/Thread/View.aspx?ThreadId=213568\">http://youprivatenet.codeplex.com/Thread/View.aspx?ThreadId=213568</a> or if you prefer to make it in private you can send us an email to <a href=\"mailto:YourPrivateSocialNet@gmail.com\">YourPrivateSocialNet@gmail.com</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "social networking,privacy,private network,",
  "LastEdited": "2010-05-23T08:18:04.77-07:00"
}