{
  "ProjectName": "7zbackup",
  "Title": "7zbackup - PowerShell Script to Backup Files with 7zip",
  "Description": "7zbackup is a PowerShell script aimed to help you automate your backup tasks. 7zbackup leverages the great compression performances offered by 7zip.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1><strong>We have moved to GitHub :&nbsp;<a title=\"7zBackup on GitHub\" href=\"https://github.com/Isiweb/7zBackup\">https://github.com/Isiweb/7zBackup</a></strong></h1>\r\n<p><strong>Project Description</strong><br>\r\n7zbackup is a PowerShell script aimed to help you automate your backup on-file tasks. 7zbackup leverages the great compression performances offered by 7zip while offering the great option to have different file sources stored in a single compressed archive.<br>\r\n<br>\r\n<strong><br>\r\n<a href=\"https://www.paypal.com/cgi-bin/webscr?cmd=_donations&business=473SN4CFERKKS&lc=US&item_name=7zBackup%20Support%20Development&currency_code=USD&bn=PP%2dDonationsBF%3abtn_donate_SM%2egif%3aNonHosted\" target=\"_blank\"><img src=\"https://www.paypalobjects.com/en_US/i/btn/btn_donate_SM.gif\" alt=\"Please Donate\" width=\"74\" height=\"21\"></a><br>\r\n</strong></p>\r\n<p><strong>Do you like this piece of software ? Why not consider <a href=\"https://www.paypal.com/cgi-bin/webscr?cmd=_donations&business=473SN4CFERKKS&lc=US&item_name=Support%207zBackup%2eps1%20Development&currency_code=USD&bn=PP%2dDonationsBF%3abtn_donate_LG%2egif%3aNonHosted\">\r\nhelping me with a Donation</a> ?</strong></p>\r\n<p><br>\r\n<strong>Abstract</strong><br>\r\n<em>Backup, Backup and again Backup</em>. How many times have you heard this ? A good backup strategy is vital for any IT Infrastructure regardless their dimensions. Off-site backups are, without any doubt, the corner stone of those strategies but nowadays,\r\n the increased availability of on-disk space (larger disks, NAS, SANs), is a great help if you want to\r\n<strong>increase your backup frequencies</strong> using on-line attached media.<br>\r\nThat's why, in my personal experience, I make intensive usage of the &quot;old pal&quot; NtBackup to keep on disk different copies of Full/Incremental/Differential backups of my data and, of course, data from my customers. But while NtBackup is a good companion it lacks\r\n in one particular aspect: it waste a huge amount of bytes. Every .bkf file is plus the sum of all the data backed up.\r\n<br>\r\nSo ... if you have space ... why waste space ? There comes in mind the obvious answer:\r\n<strong>use compression</strong>. <br>\r\nThere are a lot of compression tools out there but none of them have succeded in my very personal expectations, till I found\r\n<a href=\"http://www.7-zip.org\">7-zip</a>: it's free, it's small, it's fast, it's effective.<br>\r\nThere are a few drawbacks though: mainly the unability by 7zip to select files on specific criteria and to bind several sources in one archive unless you do it manually (many have encountered the &quot;Duplicated File Name&quot; problem).<br>\r\nSo I decided to write this small script which acts, substantially, as a selection wrapper for 7zip.<br>\r\n<br>\r\n<strong>What 7zbackup.ps1 IS</strong></p>\r\n<ul>\r\n<li>It allows you to select files to backup using mostly the criteria of their &quot;Archive&quot; attribute which helps in building up catalogs to backup for Full, Differential and Incremental strategy\r\n</li><li>It extends the selection criteria with several regular expression directives. You can fine tune the directories to dig into and file types/names to include or exclude.\r\n</li><li>It prepares a&nbsp;list of files from which 7-zip reads which files are to insert into archive\r\n</li><li>It resolves the oddity of &quot;Duplicate File Name&quot; of 7-zip: with the proper usage of Junction points on NTFS file system the whole selection stays under one single root and all files in the list catalog report a relative path\r\n</li><li>It resets &quot;Archive&quot; attribute of archived files only if they're properly processed. This is relevant if you backup using differential and or incremental methods.\r\n</li><li>It keeps your backup archives in order eliminating the &quot;older&quot; ones. </li><li>It can help you cleaning up your directory structure from unwanted files </li><li><strong>... in few words a small and free backup on-file solution</strong> </li></ul>\r\n<p><br>\r\n<strong>What 7zbackup.ps1 IS NOT and what it can't do</strong></p>\r\n<ul>\r\n<li>It's NOT a disaster recovery tool. </li><li>It can't save <em>the state</em> of your running machine. </li><li>It can't save ACLs of files into archives </li><li><span style=\"text-decoration:line-through\">It can't save the complete directory tree of your sources. Empty directories are not considered.</span> It now can save empty directories (since version 1.9.9) by the usage of dummy .7zdir files.\r\n</li><li>It can't perform any restore operation. If you need to restore any file simply use 7-zip File Manager to open the generated archive and extract files you need.\r\n</li><li>It can't replace any of your off-site backup strategies. </li></ul>\r\n<p><br>\r\n<strong>Please read. Please ...</strong><br>\r\n<strong>This script makes use of Junction points (or Symbolic Links for Windows Vista/7/2008) typically placed in C: drive (root). These NTFS objects are displayed as folders in your Explorer interface. If, for any reason, the script should interrupt abnormally,\r\n it's generated junction points or symbolic links, &nbsp;may remain on disk. DO NOT USE WINDOWS EXPLORER TO DELETE JUNCTIONS OR SYMBOLIC LINKS AS IT TRAVERSES THE LINK AND MAY REMOVE YOUR REAL FILES AND FOLDERS.\r\n<br>\r\n<br>\r\nTo remove a junction point use junction.exe with the -d switch. <br>\r\nTo remove a symbolic link use the RD command line.<br>\r\n</strong><br>\r\n<br>\r\n<strong>System Requirements</strong></p>\r\n<ul>\r\n<li>Windows XP, Windows Vista or better, Windows 2003 or better. (<em>Might also work on Windows 2000 but there is some work to do for having PowerShell running on that platform</em>)\r\n</li><li>NTFS File System </li><li><a href=\"http://www.microsoft.com/windowsserver2003/technologies/management/powershell/download.mspx\">PowerShell 2.0</a>&nbsp;or better\r\n</li><li><a href=\"http://www.7-zip.org\">7-zip 9.2.0</a>&nbsp;or&nbsp;newest </li><li><a href=\"http://technet.microsoft.com/en-us/sysinternals/bb896768.aspx\">SysInternals' Junction Tool v. 1.0.5</a>&nbsp;( not required if running Windows Vista / 7 / 2008)\r\n</li></ul>\r\n<p><br>\r\n<strong>Features</strong></p>\r\n<ul>\r\n<li>Backup your files in compressed archives by 7-zip </li><li>Full, Differential, Incremental and Copy Backups </li><li>Option to move files into archives </li><li>Flexible selection of files and paths using regular expressions </li><li>Automatic removal of &quot;old&quot; backup archives (rotation) </li><li>Can remove unwanted files during the scan process </li><li>Send log of operations via email </li><li>Pre and Post operations can help back up databases and / or upload backup archive to external destinations\r\n</li><li>Easily manageable like a script is </li><li>Easily schedule your backup operations (using task scheduler) </li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "powershell,Backup,7zip,Command Line,7-zip,7z,scripting,Backup Automation,Backup Compression,backup files,backup utility,",
  "LastEdited": "2017-11-02T08:59:28.49-07:00"
}