{
  "ProjectName": "amarok",
  "Title": "Amarok Framework Library",
  "Description": "This framework library is an attempt to take advantage of the actor/agent programming model for standalone desktop applications. Most of the concepts are inspired by the actor model, Microsoft Robotics CCR and the TPL Dataflow library.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>About</h1>\r\nThe Amarok Framework Library is my pet project that I work on in my spare time. It’s a collection of .NET libraries for building Windows desktop applications in a little unusual way. It is used in one of my own home projects and recently another project group at my full-time employer picked it up. It is far from complete, but most parts should be pretty stable. I’m just not happy with all the API and design decisions, so expect some breaking changes.<br /><br />So, what’s &quot;unusual&quot; about this library? Since many years I’m interested in messaging and messaging patterns in general. Messaging is great not just for connecting distributed services and applications. We can use it too inside of an application process to build loosely-coupled and reactive applications. I’m talking here about standard Windows desktop applications that can be fast, responsive and can automatically utilize all available processor cores.<br /><br />Sounds familiar? Yes, the actor model is all about this: small reactive objects that use messaging as communication between actors. It is powerful, but it requires to think in different patterns and to design applications a little bit different than usual.<br /><br />This framework library is an attempt to take advantage of the actor/agent programming model for standalone desktop applications. Most of the concepts are inspired by the actor model, Microsoft Robotics CCR and the TPL Dataflow library.<br />\n<h1>News</h1>\r\n<b>Version 2.2.0 released</b><br /><br />For a full list of changes refer to <a href=\"https://amarok.codeplex.com/wikipage?title=releasenotes%3a2.2.0&referringTitle=Home\">Release Notes</a>.<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET 4.0,.NET 4.5,Actor Model,Agents,Messaging,Dataflow,TPL,Framework,WPF,MVVM,",
  "LastEdited": "2013-09-03T11:30:38.243-07:00"
}