{
  "ProjectName": "AmazonS3FileSync",
  "Title": "Amazon S3 FileSync",
  "Description": "Syncronise all files in a local folder with another drive, or with an Amazon S3 bucket. Can easily extend to support other Cloud storage providers (such as Google).",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Syncronise all files in a local folder with another drive, or with an Amazon S3 bucket. Can easily extend to support other Cloud storage providers &#40;such as Google&#41;.<br /><br /><b>Motivation </b><br />Problem: 6years worth of photos and videos that we don&#39;t want to lose, so 75+Gb of data to backup securely, adding to regularly. Might need them one day if there&#39;s a 21st or funeral (served with mozarella cheese and son-died tomatoes).<br /><br /><b>Option #1:</b> Burn 20+ DVDs, then do it again to be sure. Plus 2 more for every 4Gb of new data, careful not to miss any files.<br /><b>Option #2:</b> Write to portable hard-drive (x2). Add new files to both drives when you upload from the camera.<br /><br />*These options both get stored in the bolted-down fireproof-grade gun safe (which looks like something worth stealing), and hopefully it doesn&#39;t get flooded (e.g. by heavy rain or the firemen). Or you can bury it in a watertight container (separately from any contraband), noting the GPS coordinates and any planned real estate developments.<br /><br /><b>Option #3:</b> <u>Cloud storage...</u> <br />I wrote this tiny application (70kB)  to regularly sync all my files to/from Amazon S3 cloud storage. Amazon keep 600+ copies distributed around the globe, so the files won&#39;t get lost or stolen. It&#39;s like storing your treasure in heaven, but you have to pay Amazon (or Google?). At around $15/month, over 10years it will cost about the same as that fireproof gun safe. I can sync all files between all our computers/laptops and Amazon (like Dropbox but bigger), and can make a file public if I need to share it. Initial upload takes about a week, after that about an hour.<br /><br /><b>Notes:</b><br />The same application can also be used for option #2, i.e. syncing directly between 2 drives to make sure nothing is missing.<br /><br />It can be pre-configured with the Amazon settings, so user only needs to browse to the folder and hit go. I plan to add custom encryption options (Amazon also provide encryption, if you trust them with the keys). Similar apps exist, but this one is simple to use, and adds some basic metadata (computer/user name and file date) for more complex syncing.<br /><br />I have released it on Codeplex as open source (GNU) freeware for transparency, and can also provide custom features to commercial users.<br /><br /><b>Screenshot</b> This screenshot shows the use of config settings to lock down and hide the amazon keys, so user just needs to browse to a folder. Note also that the logic currently does the copy in 2 passes, uploading small files first (&lt;5mb e.g. photos), then does the bigger files (video clips etc) in a second pass.<br /><img src=\"/projects/AmazonS3FileSync/b1956052-94d7-48c5-a882-076cfb54aa68\" alt=\"screenshot.png\" title=\"screenshot.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Amazon,amazon s3,Amazon Web Services,sync,Syncronization,aws,file synchronization,File Copy,FIle Storage,Backup,BACKUP AUTOMATION,Cloud,Cloud Storage,dropbox,winforms,",
  "LastEdited": "2012-01-07T03:09:45.437-08:00"
}