{
  "ProjectName": "amslogviewer",
  "Title": "Azure Mobile Service Log Viewer",
  "Description": "Azure Mobile Service Log Viewer is an application that allow you to download (for offline viewing), read, filter and query the Azure Mobile Log.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\r\nAzure Mobile Service Log Viewer is an application that allow you to download (for offline viewing), read, filter and query the Azure Mobile Log.<br /><br />\n<h1>Getting Started</h1>\r\nOnce the application is installed, you will have : \n<ul><li>a GUI that allows you to select subscription, mobile service and query log</li>\n<li>a mdf Data that save the log data locally</li></ul>\n<br /><img src=\"/projects/amslogviewer/36e7b8e2-3820-47fc-b299-5a60b6e287b0\" alt=\"amslogviewer.png\" title=\"amslogviewer.png\" /><br /><br />The application consist of 4 parts :<br />\n<ul><li>First part : the toolbar</li></ul>\n<img src=\"/projects/amslogviewer/94478a46-bf61-4760-a31b-9fd27432107f\" alt=\"amslogviewer_import.png\" title=\"amslogviewer_import.png\" /><br /><br />The toolbar allow you to import Publish Profile Settings in the application. This will save the Id, Name and Cert use for manage the subscription.<br /><br /><i>NB: This is the Subscription Profile Settings, not a publish profile from Azure Web Site</i><br /><br />\n<ul><li>Second part : the mobile service selector and the filters</li></ul>\n<img src=\"/projects/amslogviewer/d4b66307-88b6-4a38-abf1-6e027d42ba11\" alt=\"amslogviewer_filter.png\" title=\"amslogviewer_filter.png\" /><br /><br />In this part, you will : <br /><br />#select the subscription, this will update the Mobile Service Name available for this subscription<br />#Select the Mobile Service Name, this will call the API to get the log and download them in the Db. If Refresh is activated, the call will be done every minutes to update the view. If not, you have to use the Load Button to refresh the data<br />#Filter the data using the Date Filter or the Type. These two filters will automatically apply when selected<br />#You can enter a string in the Text Box and then click on search to apply on the text attribute.<br />#The number of rows that result for the filter is displayed.<br />#The button reset allow you to reset the filter Sourire<br />\n<ul><li>Third part : the log viewer</li></ul>\nIt will show you the log data. You can ordering the column as you like.<br /><br /><img src=\"/projects/amslogviewer/1471f7d2-a14f-47e7-b2f3-7cef2f583206\" alt=\"amslogviewer_logview.png\" title=\"amslogviewer_logview.png\" /><br />\n<ul><li>Fourth part : the notification bar</li></ul>\n<br />The notification bar display some progress bar and text about the different loading processes and the next update date (in case of automatic refresh)<br />\n<h1>Contributors</h1>\r\n<b>J&#233;r&#233;mie Devillard</b><br /><br />J&#233;r&#233;mie Devillard works as a consultant in France on Microsoft technology since 2008. He is mostly interested in systems integration and Software Oriented Architecture and focuses his effort on Microsoft BizTalk Server. He maintains <a href=\"http://jeremiedevillard.wordpress.com\">a blog</a> where you can read his thoughts on various Microsoft-related subjects.<br /><br />Certifications: Microsoft Certified Technology Specialist (MCTS) BizTalk Server 2006 R2<br /><br />He has received an <a href=\"https://mvp.microsoft.com/en-us/mvp/Jeremie%20Devillard-4038244\">MVP award</a> in Connected System Developer Technology in 2012 and was renew as MVP Integration in 2013</div><div class=\"ClearBoth\"></div>",
  "TagList": "azure,azure-mobile,log,wpf,microsoft,azure mobile service,",
  "LastEdited": "2013-09-18T13:37:10.897-07:00"
}