{
  "ProjectName": "appmbuild",
  "Title": "AppM Build Automation",
  "Description": "Automated software application for constructing and building projects. Open source and cross-platform",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Automated software application for constructing and building projects. Open source and cross-platform<br /><br />AppM Build Automaiton is an open source and automated software application that is used to construct and build projects on different operating systems and using different development environments.<br /><br />Benefits:\n<ul><li>Cross-platform;</li>\n<li>Open source;</li>\n<li>Easy scripting language;</li>\n<li>There is no reference to any particular programming language;</li>\n<li>Can be used inside other build systems;</li>\n<li>Building project algorithm.</li></ul>\n<br />General principles of implementation:<br />\n<ul><li>Each project must have a Build Project File, containing the necessary information on the construction of the project. For example, a unique name of the project, dependence on other projects and libraries, methods of construction, etc. Thus, the entire repository should be marked by the project description files to provide unambiguous information on the projects and their dependencies.</li>\n<li>AppM Build Automaiton must be able to perform different actions (project construction, external applications launch, file copying, etc.) which are needed to build a -product.</li>\n<li>AppM Build Automaiton should provide an opportunity to create flexible scripting actions on construction projects. In this case , all operations with projects should be carried out on the basis of information that build tool derives from the project description files.</li>\n<li>At the moment Build Project File uses am XML-file in the format described below. XML file is also used as a Job File.</li></ul>\n<br />This software is released under the MIT License (MIT).</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-08-25T04:00:46.59-07:00"
}