{
  "ProjectName": "AramaruForest",
  "Title": "Aramaru Forest",
  "Description": "This is a short and unfinished platformer game in which you play as an explorer in the mysterious dungeon beneath  Aramaru Forest. This game was coded in C# using Microsoft Visual Studio. It draws inspiration from Crusader and GR3's La Mulana. WPF version in the works!",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This is a short and unfinished platformer game in which you play as an explorer in the mysterious dungeon beneath  Aramaru Forest. This game was coded in C&#35; using Microsoft Visual Studio. It draws inspiration from Crusader and GR3&#39;s La Mulana. WPF version in the works&#33;<br /><br /><br />You will need the .NET framework 3.5.<br /><br />You will need 7-zip to decompress the game: http://www.7-zip.org/<br /><br />The goal of this platformer is to find the wooden door at the end of every level, thus escaping from the dungeon the game takes place in. The red bar at the top left is your health or hp, the blue bar is your stamina or sp. Stamina is used to cast spells and dash.<br /><br />There are many enemies which will try to stop you from reaching your goal. Guards who will charge if they see you, Ravens which will drop dark energy upon you, and Maguses who will launch fire at you if they see you. There is also a mighty sorcerer who is at the end of the dungeon. There are particular ways to defeat each of them. If you are clever, your victories can be rather... humorous. <br /><br />Use the arrow keys to move and jump.<br />Space to use your sword.<br />S to start over.<br />Z to enter/exit the menu.<br />X  to use stamina to fire a fireball<br />V in mid air to use stamina and dash<br /><br />When you use z to see the menu, you will have displayed all of your stats. Hp or hit points, Sp or stamina Xp or experience points, and Ap or attack points. There are many blue spheres hidden throughout the game. When you collect these, your xp goes up and you can gain levels. On the menu screen, if you have leveled up, you may spend that level in order to increase hp, sp or ap. Choose wisely.<br /><br />There are also red and blue potions to be found. The red ones heal you and the blue ones replenish your stamina.<br /><br />Be warned: There are many traps in this dungeon, as well as things which cannot be seen with the naked eye. Be cautious, but do not be afraid to take a <b>leap of faith</b>.<br /><br />Good Luck, and don&#39;t forget to tell me about many of the numerous bugs I&#39;m sure are lurking in the deeper corners of this ever-changing game.<br /><br />The source currently released is for the old aramaru forest game. Since the wpf version is actually a whole other project, source control is giving me a hard time switching over.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Platformer,C#,game,",
  "LastEdited": "2011-12-02T11:05:22.61-08:00"
}