{
  "ProjectName": "asposevsto",
  "Title": "Aspose for VSTO",
  "Description": "Comparison Between VSTO And Aspose",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h3>Why Aspose for VSTO?</h3>\r\n<p>The developers looking for file format&nbsp;libraries may need to walk through the features provided by the&nbsp;libraries available on the market. Mainly, two factors are considered when choosing an option:</p>\r\n<ul>\r\n<li>Features </li><li>Efforts required to use the library </li></ul>\r\n<p>If you are a .NET developer looking for faster,easy and light-weight file format library to process files, you may need to compare VSTO(Visual Studio tool for Office) with Aspose. In this case, this project will help you to compare features and code in both\r\n libraries. Please visit&nbsp;<a href=\"https://asposevsto.codeplex.com/documentation\">project documentation</a>&nbsp;for a comprehensive comparison. In addition, there are important&nbsp;<a href=\"http://www.aspose.com/docs/display/wordsnet/Why&#43;not&#43;Automation\">automation\r\n drawbacks</a> when using VSTO for server side file processing.</p>\r\n<h3>What is&nbsp;VSTO?</h3>\r\n<p>VSTO, or Visual Studio Tools for Office, or Microsoft Visual Studio Tools is part of Microsoft's Visual Studio .NET tools suite and supports the Microsoft .NET Framework. It is used by developers to write code connecting Microsoft Office Word, Excel and\r\n Outlook applications. Developers using VSTO can employ C# or Visual Basic languages. It is an alternative to Visual Basic for Applications, or VBA.</p>\r\n<h3>What is the use of Aspose .NET APIs?</h3>\r\n<p><a href=\"http://www.aspose.com\">Aspose</a>&nbsp;are file format experts and provide APIs and components for various file formats including MS Office, OpenOffice, PDF and Image formats. These APIs are available on a number of development platforms including\r\n .NET frameworks &ndash; the .NET frameworks starting from version 2.0 are supported. If you are a .NET developer, you can use Aspose&rsquo;s native .NET APIs in your .NET applications to process various file formats in just a few lines of codes. All the Aspose\r\n APIs don&rsquo;t have any dependency over any other engine. For example, you don&rsquo;t need to have MS Office installed on the server to process MS Office files ...&nbsp;<a href=\"https://asposevsto.codeplex.com/wikipage?title=What%20is%20the%20use%20of%20Aspose%20.NET%20Products%3f\">Continue\r\n reading &rarr;</a></p>\r\n<h1>&nbsp;</h1>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "VSTO,Office Automation,Documents,SpreadSheets,Presentations,Emails,Project Files,File APIs,Process Files,Visio,Diagrams,",
  "LastEdited": "2014-03-13T06:14:36.7-07:00"
}