{
  "ProjectName": "Automaton",
  "Title": "Automaton",
  "Description": "Automaton is a Continuous Integration engine optimized for Team System and Team Builds. Included is the TeamFoundationExtensions class library which includes helpers and tasks for TFS and MSBuild.\n\nTHIS PROJECT IS CLOSED, CI FEATURES WAS ADDED TO TFS 2008 AND IMPROVED IN 2010.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><a href=\"https://automaton.codeplex.com/wikipage?title=News%20Feeds&referringTitle=Home\">News Feeds</a>\n<h1>Automaton - Continuous Integration engine for TFS</h1>\r\nTHIS PROJECT IS CLOSED, CI FEATURES WAS ADDED TO TFS 2008 AND IMPROVED IN 2010.<br /><br /><b>15th March 2009:</b> As there is now widespread use of TFS 2008, which has the CI-features that Automaton made available for TFS 2005, we&#39;ve decided that this project won&#39;t receive any more attention. If someone is willing to take over the support and maintenance of Automaton, please leave a comment in the discussions forum.<br /><br /><b>20th November 2007:</b> Visual Studio 2008 is released, waiting for Team Foundation Server 2008! When TFS 2008 is out, we will progress to update Automaton to include new and addition features ontop of the new CI-features that is built into the TFS. It is undecided whether we will continue to support both 2005 and 2008, but we will probably make a code branch and do a removal of old code that has now been implemented by Microsoft.<br /><br /><b>15th April 2007:</b> New member on the team, welcome &quot;GlennHaworth&quot;!<br /><br /><b>2nd March 2007:</b> New member on the team, welcome &quot;smartway&quot;!<br /><br /><b>19th November 2006:</b> New release with filtering on changes and bug fixes.<br /><br /><b>3rd November 2006:</b> update with fixes released (1.0.10)!<br /><br /><b>11th October 2006:</b> We made video tutorials for you: <a href=\"http://www.codeplex.com/Wiki/View.aspx?ProjectName=automation&amp;title=Videos\">http://www.codeplex.com/Wiki/View.aspx?ProjectName=automation&amp;title=Videos</a><br /><br /><br />Automaton is a Continuous Integration engine for Microsoft Team Foundation Server. Automaton will monitor your source code repository and automatically run the correct team builds that you create within Visual Studio. Build reports can be view through a web site, and your development team can get notifications on e-mail or MSN Messenger when there is problem building the source code.<br /><br /><img src=\"/projects/Automaton/477969a5-ab94-431e-bc60-db8e67cabca8\" alt=\"Automaton_small.png\" title=\"Automaton_small.png\" /><br /><br /><b>Click links to read more about Automaton...</b><br />\n<ul><li><a href=\"https://automaton.codeplex.com/wikipage?title=Screenshots&referringTitle=Home\">Screenshots</a></li>\n<li><a href=\"https://automaton.codeplex.com/wikipage?title=Videos&referringTitle=Home\">Videos</a></li>\n<li><a href=\"https://automaton.codeplex.com/wikipage?title=TeamSystemAddIn&referringTitle=Home\">TeamSystemAddIn</a></li>\n<li><a href=\"https://automaton.codeplex.com/wikipage?title=ContinuousIntegration&referringTitle=Home\">ContinuousIntegration</a></li>\n<li><a href=\"https://automaton.codeplex.com/wikipage?title=KnownIssues&referringTitle=Home\">KnownIssues</a></li>\n<li><a href=\"https://automaton.codeplex.com/wikipage?title=MediaCoverage&referringTitle=Home\">MediaCoverage</a></li>\n<li><a href=\"https://automaton.codeplex.com/wikipage?title=TipsAndTricks&referringTitle=Home\">TipsAndTricks</a></li></ul>\n\n<h2>Easy Setup and Configuration</h2>\rOne of the important goals with the development of Automaton was to utilize the TFS as much as possible and make an installation and configuration that was simple and quick. After installation, there is a web based wizard that will guide you through the required settings. When these are configured and saved, the Automaton dashboard will display all your Team Build Types that you define using the Team Explorer within Visual Studio IDE.<br /><br />Automaton supports Visual Studio 2005 and Team Foundation Server. Automaton supports only the use of Team Foundation Source Control, there is currently no support for Visual Source Safe.<br />\n<h2>Smart Integration</h2>\rTFS can have multiple team projects and each project can have multiple solutions, with multiple projects, and ontop of that the team projects can have multiple team build types defined. What Automaton does when a developer checks in some code, it will be smart and choose which team build type to run. This makes sure you don&#39;t build anything unnecessary which gives you a faster and better integration.<br /><br /><b>View the Automaton blog: <a href=\"http://fanms.com/blogs/projects/archive/tags/Automaton/default.aspx\">http://fanms.com/blogs/projects/archive/tags/Automaton/default.aspx</a></b><br /><br /><br /><br />Automaton is available for free and source code is licensed under Shared Source License.<br /><br />Automaton is created and developed by Sondre Bjell&#229;s (<a href=\"http://www.fanms.com/\">http://www.fanms.com/</a>).<br /><br /><br /><b>Automaton</b><br /><i>au-tom-a-ton</i><br /><i>3. something capable of acting automatically or without an external motive force.</i><br /><a href=\"http://dictionary.reference.com/browse/Automaton\">http://dictionary.reference.com/browse/Automaton</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "TFS,Team Foundation,build,CI,Team System,automation,Automaton,Continuous Integrati,msbuid,",
  "LastEdited": "2009-08-04T13:36:13.137-07:00"
}