{
  "ProjectName": "autorun",
  "Title": "Autorun - Task Scheduler",
  "Description": "The goal of Autorun is to provide a rapid development framework and a test/production environment for running automated tasks. The task scheduler can run interactively or as a Windows NT service and the monitoring interface can connect remotely to this service.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The goal of Autorun is to provide a rapid development framework and a test&#47;production environment for running automated tasks. The task scheduler can run interactively or as a Windows NT service and the monitoring interface can connect remotely to this service.<br /><br />We often develop tasks that will be automated repeatedly. By experience, I noticed one particularity of that type of project: although the main functionality remains dramatically easy to develop, developers will spend most of their time in fixing and stabilizing the “automation” part of this project. Finally, the required functionality that should represent 80% of your project took 20% to setup although the system part (the remaining 20% of your project) of your program took 80%... <br /><br />Moreover developing Windows NT Service is a real nightmare to debug: newbies in that domain will have certainly tried to attach to a process… Although there are best practices to debug Windows services, these are not always fast enough.<br /><br /><u>Autorun can be used in several forms:</u>\n<ul><li>As an Windows NT service (start “autorun.exe”)</li>\n<li>As an interactive Windows application (start “autorun.exe /server”)</li>\n<li>Built-in in the client configuration tool (start “autorun.exe /client”)</li></ul>\n<br /><img src=\"/projects/autorun/b4768549-52d9-4d72-90fe-b9adfcde48f7\" alt=\"autorun_client.jpg\" title=\"autorun_client.jpg\" /> <img src=\"/projects/autorun/df1b5271-929b-4bb7-b395-db4bec491cdc\" alt=\"autorun_server.jpg\" title=\"autorun_server.jpg\" /><br /><br /><u>Features of the environment:</u>\n<ul><li>Integrated design- and run-time environment to develop, test and run automated tasks</li>\n<li>Configure and monitor Autorun remotely through the client configuration tool</li>\n<li>Schedule tasks at startup, at shutdown, daily, weekly or monthly</li>\n<li>Isolation: when a task crashes, it does not crash the other tasks </li>\n<li>Reports can be sent automatically\n<ul><li>Daily activity reports</li>\n<li>Task reports (when errors occur, or everytime)</li></ul></li></ul>\n<br /><img src=\"/projects/autorun/855eb9bd-7be3-4405-8d33-75a965c6ce94\" alt=\"ClassDiagram1.png\" title=\"ClassDiagram1.png\" /><br /><br /><u>Features of the development framework:</u>\n<ul><li>The base object standardizes the development of tasks</li>\n<li>Tasks can send return codes when they finish</li>\n<li>They can chain a new task when they finish</li></ul>\n<br /><img src=\"/projects/autorun/92402c45-b6a3-4e25-8613-64d8392eea43\" alt=\"Autorun.png\" title=\"Autorun.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "tool,.NET 3.5,Scheduler,task scheduler,automation,Windows Service,Developer Tools,Rapid Development,AUTORUNS,Scheduling,改进,",
  "LastEdited": "2008-11-11T11:54:02.097-08:00"
}