{
  "ProjectName": "biztalkadminhelper",
  "Title": "BizTalk Automation Helper and Reporting Tool",
  "Description": "This tool is intended to help out the monitoring of BizTalk server environment by automating the handling the BiZtalk artifacts and Suspended Messages.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">This is a stand-alone tool that can be used in any BizTalk Server Environment to track the health of the server and also to handle the messages in the server. Below are the feature included in the tool:-<br /><br />1. Monitoring Host Instances<br />2. Monitoring Receive Locations<br />3. Monitoring Orchestrations<br />4. Monitoring Send Ports<br />5. Resuming Suspended Messages Through Orchestration Name<br />6. Resuming Suspended Messages Through Send Port Name<br />7. Resuming Suspended Messages Through Error Description<br />8. Terminating Non-Resumable Messages Through Orchestration Name<br />9. Terminating Non-Resumable Messages Through Send Port Name<br />10. Terminating Non-Resumable Messages Through Error Description<br />11. Health Report<br /><br />There are two tools to help us with the above features. One tool will be running on the server as a schedules task and other tool will allow us to control and configure the tool.<br /><br />I have used WMI queries and hence the tool can be directly used without requiring any connection string to be updated but should be noted that the tool must be kept in the server where the BizTalk is installed.<br /><br />The attachment consist of the &quot;BizTalkHelperTool&quot; Folder which has the two sub-folders consisting of the tools and a guide is provided to help with the installation as well as the walk-through with the features included. Also attached the source code so that the code can be extended or optimized as required.<br /><br />I will be updating the tool with few more features and any suggestions are also welcome.<br /><br />Thank You :)<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "BizTalk Admin,BizTalk,BizTalk Health,BizTalk Server,",
  "LastEdited": "2015-10-13T02:55:39.07-07:00"
}