{
  "ProjectName": "BizTalkApplicationDeployment",
  "Title": "BizTalk Application Deployment (BADT)",
  "Description": "Automate BT application's deployment. \r\nWorks with both Biztalk built MSI and BTDF built MSI. Ease multi server deploys.\r\nBunch of extra features such as BRE, IIS",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2><b>Project Description</b></h2>\r\n <u><b><i>Multi server deployment of your BizTalk applications made easy</i></b></u><br /><br />Automating\\Silent Installation for BTDF MSI and BizTalk MSI with view on screen.<br />You start saving on resources and efforts spent on doing deployments manually or in cases via scripts. You save time and when the farm servers start growing to 8 , 10, or in cases 12 or more the tool will help streamline the deployment process and ease it for good.<br /><br />BizTalkApplicationDeployment is a windows application that is built to automate the deployment of biztalk msi.<br /><br /><u><b>Version 2.1 of tool supports both BizTalk built MSIs and BTDF built MSIs.</b></u><br /><br /><i><u>Download the zip file and copy the folder on any of the BizTalk messaging server. Run the exe as administrator</u></i><br /><br />The tool is built for automating your BizTalk applications deployments across multiple servers using the native BizTalk built MSIs that is generated from BizTalk Admin console or the BTDF generated Msi (Beta).<br /><br />The deployment tool frees you from hassles of scripting/ multiple server logons to run scripts etc. You get a single UI from where all your actions can be executed giving you a complete picture of the deployment steps.<br />The tool uses library WindowsInstaller from http://wix.codeplex.com/ to get Msi info.<br /><br />The tool is intuitive and various features in the tool are easy to use. Please use the tool and post your comments for any questions/ wishes etc..<br /><br /><img src=\"/projects/BizTalkApplicationDeployment/7f3b9129-143f-49b8-8ea4-c61bbbfe1913\" alt=\"image001&#32;&#40;1&#41;.png\" title=\"image001&#32;&#40;1&#41;.png\" /><br /><br /><br />You need to select the msi and all the relevant actions related to the deployment are listed. You just need to select the relevant actions and run those. <br /><br /><img src=\"/projects/BizTalkApplicationDeployment/adcb5302-987e-42f1-90eb-efda05a71921\" alt=\"image001&#32;&#40;2&#41;.png\" title=\"image001&#32;&#40;2&#41;.png\" /><br /><br /><u>Additionally there are a bunch to tools to faciliate your day to day activities.</u><br /><br /><img src=\"/projects/BizTalkApplicationDeployment/e031e208-6336-45cc-b974-cd9784fe8b00\" alt=\"image001&#32;&#40;3&#41;.png\" title=\"image001&#32;&#40;3&#41;.png\" /><br /><br /><br /><img src=\"/projects/BizTalkApplicationDeployment/de71993d-e76b-4e92-adb8-ee1adbe8c4fe\" alt=\"image001&#32;&#40;4&#41;.png\" title=\"image001&#32;&#40;4&#41;.png\" /><br /><br /><u><b>Features</b></u><br />BizTalk Application Deployment tool has following main features :\n<ul><li>Dependency resolve for dependent applications/artifacts</li>\n<li>Single click multi server deployment of Msi</li>\n<li>Complete view of all the actions being performed during the deployment process on screen</li>\n<li>Use the standard BizTalk generated Msi and BTDF Msi for deployments</li>\n<li>Has a bunch of productivity tools to assit during deployment and administration</li>\n<li>HostInstances feature assists you in quick host instance operations</li>\n<li>Deployment Health checks</li>\n<li>Artifact Inspector helps you deeper view of the application&#39;s artifacts such as schemas, maps etc</li>\n<li>Msi inspector helps you quicly inspect your Msi for resources info</li>\n<li>IIS deployment features are also included in the tool that would help you automate IIS related operations across multiple servers in the farm\n<ul><li>Manage Application pools : Create, Recycle, Delete</li>\n<li>Manage Applications : Create, Delete,  Change application pool</li>\n<li>Perform health checks of your biztalk web service</li></ul></li>\n<li>BRE deployment tool that would save you from the cumbersome Bre deployments </li>\n<li>Assembly Gac feature that would facilitate GAC of multiple assemblies across multiple farm servers from UI and single click.</li>\n<li>Easy to use and is intuitive</li></ul>\n<br /><b>Configuration file</b><br />The tool has minimal and simple keys<br /><br /><img src=\"/projects/BizTalkApplicationDeployment/a707eaaa-94ca-419e-8128-996f4faa27b2\" alt=\"ConfigCapture.JPG\" title=\"ConfigCapture.JPG\" /><br /><br /><br /><br /><b>Author</b> <br /><br />Ritu Raj<br /><a href=\"https://nl.linkedin.com/in/riturajsoa\">https://nl.linkedin.com/in/riturajsoa</a><br /><br />Ritu Raj has been the project owner and main developer for the BizTalk Application Deployment Tool. He has 9+ years of extensive experience in software develpment, Integration primarly focused around BizTalk and Microsoft technologies. <br /><br /><b>Partner</b> <br /><br />Arkadiusz Krynski<br /><a href=\"https://nl.linkedin.com/in/arkadiuszkrynski\">https://nl.linkedin.com/in/arkadiuszkrynski</a><br /><br />Arkadiusz has 10+ years of experience in software develpment and focused around .NET, BizTalk, SQL and other Microsoft technologies. Arkadiusz has helped the project with continuous feedback on the tool since its inception. A lot of features you will find in the tool are brain child of Arkadiusz who as an Integration professional himself wished to see in a BizTalk productivity tool.<br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "BizTalk,BizTalkDeployment,Automation,",
  "LastEdited": "2017-06-16T08:30:17.473-07:00"
}