{
  "ProjectName": "BPA",
  "Title": "Business Process Automation (BPA)",
  "Description": "BPA is a project initiative to develop an ERP which will integrate with work flow of an organization. It is build on the concept that all business process is initiated through a request and it is processed in organizational hierarchy. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><table><tr><td>! If you wish to contribute to this project YOU ARE WELCOME!!!!!!!!!</td><td> Contact <b>bpa@ebirdonline.com</b></td></tr></table>\n<h1>Business Process Automation (BPA) </h1>\r    This application is a kind of ERP which concentrates more on business process (Work Flow).\n<h2>Request&lt;-&gt;Processing Concept</h2>\r    The primary assumption which makes basic concept of the software is that ,&quot;In an organization everything is initialized through a <b><i> Request </i></b> and this request<br />traverse through the organization hierarchy  before it complete its life cycle. The traveling phase through the organizational hierarchy is called as the <br /><b><i> Processing</i></b> *phase.<br />\n<h2>Inbox</h2>\r    This is the second concept which makes it different from other ERP. Everything that needs your attention will come to your inbox. It can be a purchase request, a leave request from your college, A payment request that needs your approval, an email etc. When the user opens an inbox item it automatically renders corresponding user controls where user can process that request. The control will be capable to bring in all information you need to make a decision on the item. <br />\n<h2>Plug In Modules</h2>\r    As it consider everything as request and its processing components, addition of a new module is very easy. You just need to assign a new request ID and few entries in to the tables. Your new request and its processing mechanism is now ready to fly. Every request will contain a Request Generator, An Inbox component and a Management module.<br />\n<h2>More Details (Copy URL if click not working)</h2>\r<a href=\"https://bpa.codeplex.com/wikipage?title=http%3a%2f%2fwww.ebirdinfo.com%2fDefault.aspx%3ftabid%3d29464&referringTitle=Home\">http&#58;&#47;&#47;www.ebirdinfo.com&#47;Default.aspx&#63;tabid&#61;29464</a><br />\n<h2>Contact</h2>\r  If you want Conway any message to development team please contact us through <b>bpa@ebirdonline.com</b> \n<h2>Demo</h2>\r<a href=\"https://bpa.codeplex.com/wikipage?title=http%3a%2f%2fwww.einternship.org%2fbusinessprocessautomation%2flogin.aspx&referringTitle=Home\">http&#58;&#47;&#47;www.einternship.org&#47;businessprocessautomation&#47;login.aspx</a>\n<h2>Screen Shot</h2>\r<img src=\"/projects/BPA/4e345f11-dc1e-46eb-ae7a-313703fe9583\" alt=\"PurchaseRequestProduction.jpg\" title=\"PurchaseRequestProduction.jpg\" /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "crm,ERP,Business Process,RETURN 2010,Office Automation,Business workflow ,Purchase Automation,HR Management,Task Management,Marketing Automation,",
  "LastEdited": "2010-08-15T22:50:55.24-07:00"
}