{
  "ProjectName": "bpmtool",
  "Title": "Blood Pressure Monitoring Tool",
  "Description": "This application allows a user to keep a record of their blood pressure readings (inc heart rate). Currently this is written as a Win32/64 application using .NET Framework 3.5 or newer; however a Web version is planned. \nThis allows the user the user to export a pdf copy of their readings to that they can advise the doctor of their progress. \n\nThe program is very easy to use. \n\nCurrently it is embryonic; over time there are a lot of automation features to be added; as well as interop with selected hardware for automated measurement. \n\nAs of the Version 1.0RC release; the system can create new or edit existing blood pressure monitor data files; it can export your blood pressure readings to a PDF file that you can print and provide to doctors should you so wish.\n\nThe final 1.0 release (scheduled for late November 2008); will provide rudimentary graphing on your blood pressure data; and allow you to determine trends in your measurements; effectively providing information on whether medication is effectively controling your blood pressure or not (as the case may be); this can be useful when visiting your doctor and diagnosing your blood pressure.\n\nFor the PDF generation this project makes use of the iTextSharp library.\n\n\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This application allows a user to keep a record of their blood pressure readings &#40;inc heart rate&#41;. Currently this is written as a Win32&#47;64 application using .NET Framework 3.5 or newer&#59; however a Web version is planned. <br />This allows the user the user to export a pdf copy of their readings to that they can advise the doctor of their progress. <br /><br />The program is very easy to use. <br /><br />Currently it is embryonic&#59; over time there are a lot of automation features to be added&#59; as well as interop with selected hardware for automated measurement. <br /><br />As of the Version 1.0RC release&#59; the system can create new or edit existing blood pressure monitor data files&#59; it can export your blood pressure readings to a PDF file that you can print and provide to doctors should you so wish.<br /><br />The final 1.0 release &#40;scheduled for late November 2008&#41;&#59; will provide rudimentary graphing on your blood pressure data&#59; and allow you to determine trends in your measurements&#59; effectively providing information on whether medication is effectively controling your blood pressure or not &#40;as the case may be&#41;&#59; this can be useful when visiting your doctor and diagnosing your blood pressure.<br /><br />For the PDF generation this project makes use of the iTextSharp library.<br /><br /><br /><br /><br />Check my Blog; where I&#39;ve posted some more information about the Blood Pressure Monitoring Tool:<br /><br /><br />Post on Blood Pressure Monitor: <a href=\"http://shabbir.hassanally.net/blog/2008/10/13/blood-pressure-monitoring-tool-version-10-release-candidate-now-on-codeplex/\">http://shabbir.hassanally.net/blog/2008/10/13/blood-pressure-monitoring-tool-version-10-release-candidate-now-on-codeplex/</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-02-28T01:40:12.063-08:00"
}