{
  "ProjectName": "centraldba",
  "Title": "Central Database Administration",
  "Description": "The Central Database Administration project is a combination of a management database for all SQL instances and a central data warehouse for management and monitoring.  It uses as much built-in functionality as possible - such as MSX, SSRS, SSIS, etc.  Automate at least 1 FTE.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nThe Central Database Administration project is a combination of a management database for all SQL instances and a central data warehouse for management and monitoring. It uses as much built-in functionality as possible - such as MSX, SSRS, SSIS, etc. Automate\r\n at least 1 FTE.<br>\r\n</p>\r\n<hr>\r\n<p></p>\r\n<p>Update Oct 20, 2012</p>\r\n<p>I just wanted to give an update on where the project is going. &nbsp;As of Aug 30 (build&nbsp;<a id=\"ChangeSetLink2\" title=\"View change set 17181\" href=\"http://centraldba.codeplex.com/SourceControl/changeset/17181\">17181</a>), there has been no further\r\n work on the version 1 branch of code. &nbsp;It continues to be the version that I am using internally at work, but version 2 is the focus of all new development. &nbsp;That said, what is version 2?</p>\r\n<p>Version 2 is being built using SSDT in Visual Studio 2010. &nbsp;It is building upon the groundwork laid in version 1, but will be adding a GUI for installing and configuring the MSX environment. &nbsp;This GUI is being built with WPF in VS2010, and will\r\n be deployed as a VSIX - both as a download here and from the Visual Studio gallery. &nbsp;Hopefully I will be able to provide a VSIX for both VS2010 and VS2012 - we'll see what time allows.</p>\r\n<p>Work has progressed pretty well on version 2. &nbsp;All database objects will be getting renamed, but it will be automatically performed by the SSDT refactoring capabilities. &nbsp;(But letting you know in case you've been writing other code to work on top\r\n of these procedures.) &nbsp;The purpose of the renames is to better organize functionality and to better follow our internal naming requirements.</p>\r\n<p>If you look at the source code history you'll notice that there hasn't been any work since Oct 2. &nbsp;Another higher priority came up at work that has not given me time to get back to this. &nbsp;But that other priority has actually resulted in a new piece\r\n of code that will eventually be migrated into this project. &nbsp;I had to work on some DTS to SSIS migrations, and hated how much work I actually would be required to do for that endeavor. &nbsp;So I started instead building a framework for building tables/views/sprocs\r\n to take advantage of BULK INSERT to automate the majority of work that was being done inside of the DTS packages. &nbsp;We might still have SSIS on top of this, but it will be far smaller amount of work. &nbsp;I'll see how it works out as to integrating into\r\n this code base.</p>\r\n<p>Oh, and I also hope to add a data warehouse to the metrics that have been gathering with the existing jobs in the version 1 code. &nbsp;And from this warehouse some SSRS reports to help us be even lazier at getting to know how our environments are performing\r\n and where some work might be needed.</p>\r\n<p>Anyway, thought I would explain what has been happening and where things are going. &nbsp;And as always, if any of this sounds interesting to you to work on - just get in touch with me and we can talk about how to split things up.</p>\r\n<hr>\r\n<p>Over the last few years the number of SQL Server instances that I've worked with have only increased, and staffing - well staffing doesn't ever increase; does it? So we do as all &quot;lazy DBAs&quot; do - automate as much of our work as we can. Automate so much that\r\n the system does everything that you currently do so you have time to learn how to do better things. And then automate that to learn better things. And of course, don't forget to give the pretty visuals to show your bosses how hard you are working.<br>\r\n<br>\r\nThe goal of this project is to share as much as possible in a single location&nbsp;in an effort to help other DBAs out there if at all possible. And hopefully in return, if this project helps you any, you will be able to return the favor and help to expand\r\n on how much automation this project can do for all of us &quot;lazy DBAs&quot; out here.<br>\r\n<br>\r\nDesires from this project:<br>\r\n<br>\r\n1. Use as much built-in functionality as possible<br>\r\n2. Must be usable on standard edition and higher<br>\r\n3. Must be usable on SQL Server 2005 and higher for&nbsp;as much as possible, and 2008 and higher where necessary&nbsp;(sorry, CLR is used so 2000 is out)<br>\r\n4. Must be cognizant of security concerns and attempt to minimize security holes as much as possible (ie, no xp_cmdshell, no injection holes, minimal domain access rights)<br>\r\n5. Document code in-line, and provide URL references if code/concepts are borrowed</p>\r\n<p>&nbsp;</p>\r\n<p>Note:</p>\r\n<p>If you find this utility useful, please consider ratings and/or reviews so that new people finding this will have feedback from others to help judge if this project is worth their time to look at. &nbsp;Also feedback on desired features or irritations with\r\n the project would be helpful to help guide the &quot;next steps.&quot;</p>\r\n<p>Thanks for your interest!</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "SQL Server 2005,SQL Server 2008,SQL Server 2008 R2,Central Admin,Management Agent,CLR,Backup,Recovery,automation,MSX,",
  "LastEdited": "2012-10-20T08:12:39.207-07:00"
}