{
  "ProjectName": "citrixmobilitysdk",
  "Title": "Samples for the Citrix Mobile SDK for Windows Apps",
  "Description": "This site contains our latest prototype samples for the Citrix Mobile SDK for Windows Apps for you to play with.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong></p>\r\n<p>This site contains our latest prototype samples for the Citrix Mobile SDK for Windows Apps. This allows us to give you access to some of our latest internal development work on the SDK. Currently this project contains three .NET based samples:</p>\r\n<ol>\r\n<li>A mobilised version of a XenApp administration console. </li><li>A skinning sample that shows you how to alter the appearance of your app to mimic the native look and feel of the client device your user is using.\r\n</li><li>A legacy app sample that shows how you can modify an existing WinForms based app to better suit mobile usage. It includes some sample that shows how you can DPI scale the fonts of your controls so they are readable even on high DPI devices.\r\n</li></ol>\r\n<p>The XenApp console is an extension of the original version that was released with the first version of CMP.NET V1. The version on this site adds the following functionality on top of the version that was originally released with the .NET version of our SDK:</p>\r\n<ul>\r\n<li>Alternate layouts for phone and tablet devices. If you&rsquo;re interested in changing the layout of your app based on the form factor of a users&rsquo; mobile device, this is a great example of how to do that. On the phone layout a single page by page\r\n model is used. For the tablet layout a two column layout is used instead, allowing two pages to be displayed at once. The app will also seamlessly swap between layouts if you roam your Citrix session between phone and tablet devices.\r\n</li><li>Displays XenApp server information &ndash; previously it only displayed session state.\r\n</li><li>View the details of a session or server &ndash; previously you could only view a session summary.\r\n</li></ul>\r\n<p>&nbsp;</p>\r\n<p><a href=\"http://download-codeplex.sec.s-msft.com/Download?ProjectName=citrixmobilitysdk&DownloadId=487124\"><img title=\"XAAM tablet\" src=\"http://download.codeplex.com/download?ProjectName=citrixmobilitysdk&DownloadId=487125\" alt=\"XAAM tablet screenshot\" width=\"632\" height=\"480\" border=\"0\" style=\"padding-left:0px; padding-right:0px; display:inline; padding-top:0px; border:0; vertical-align:middle\"></a></p>\r\n<p>&nbsp;</p>\r\n<p><strong>What is the Citrix Mobile SDK for Windows Apps?</strong></p>\r\n<p>The Citrix Mobile SDK for Windows Apps allows Windows developers to create mobilized Windows apps that are run from mobile devices such as Android/iOS phones and tablets. The applications actually run on Windows based Citrix servers, and they are accessed\r\n from mobile devices using Citrix Receiver. Citrix Receiver talks to your Citrix servers using the Citrix HDX protocol. HDX transmits the graphics of the applications running on the server to the mobile device of the user so they can view and interact with\r\n the application.</p>\r\n<p>&nbsp;</p>\r\n<p><a href=\"/projects/citrixmobilitysdk/0f093f9c-58a2-4c01-8dc3-fd074143a9ff\"><img title=\"Citrix Markitecture\" src=\"http://download.codeplex.com/download?ProjectName=citrixmobilitysdk&DownloadId=487126\" alt=\"Citrix Architecture\" width=\"645\" height=\"236\" border=\"0\" style=\"padding-left:0px; padding-right:0px; display:inline; padding-top:0px; border:0; vertical-align:middle\"></a></p>\r\n<p>&nbsp;&nbsp;</p>\r\n<p>By using the Mobile SDK, Windows apps running on Citrix servers can make use of native mobile device capabilities. E.g. you can trigger phone calls to be made, take a picture using the camera, and request the device on-screen keyboard to be popped up. Using\r\n these capabilities allows you to write apps that behave like native mobile apps, when they are actually running on a remote server.</p>\r\n<p><strong>Pros and Cons of using the SDK to create mobile apps that are delivered using Citrix</strong></p>\r\n<p>With the proliferation of mobile devices, users are increasingly placing demands on IT to access their apps and data from these devices. There are various strategies for doing this with their own pros and cons. The advantages of delivering apps on Citrix\r\n that have been mobilized using the Mobile SDK are:</p>\r\n<ul>\r\n<li>No native device development skills are needed (Android/iOS), the apps can be created by Windows developers.\r\n</li><li>Multi-platform. You can write one app that runs on Android and iOS. </li><li>Since you are writing Windows apps it is easier to reuse existing legacy Windows code.\r\n</li><li>Security: the app is running in the data centre, and only the screen updates are sent to the user&rsquo;s device. So no sensitive data gets stored on the device.\r\n</li></ul>\r\n<p>The main disadvantages are:</p>\r\n<ul>\r\n<li>Requires a network connection to access the application. </li><li>Sensitive to network conditions. Laggy or high latency networks will reduce the performance of the app.\r\n</li><li>Restricted access to device resources. The SDK provides access to the most commonly used native mobile device capabilities. So you may not be able to access new or unique features of certain devices.\r\n</li></ul>\r\n<p><strong>Getting started</strong></p>\r\n<p>The official site for the SDK is available here:</p>\r\n<p><a href=\"http://www.citrix.com/mobilitysdk\">http://www.citrix.com/mobilitysdk</a></p>\r\n<p>From the main Citrix site you can download the SDK, access tutorial videos and get access to the documentation. The samples from this CodePlex site will work without the SDK being installed, however checking out the main site is highly recommended if you&rsquo;re\r\n interested in developing your own applications using the SDK.</p>\r\n<p><strong>Other resources</strong></p>\r\n<p>To run this application in Citrix environment you must have a Citrix XenApp 6.5 server with the Mobility Pack installed. Refer to the following link for instructions on how-to install the Mobility Pack:</p>\r\n<p><a href=\"http://support.citrix.com/proddocs/topic/mobility-pack/ps-mobility-pack-install.html\">http://support.citrix.com/proddocs/topic/mobility-pack/ps-mobility-pack-install.html</a></p>\r\n<p>The official forums for the Citrix Mobile SDK for Windows Apps are available here:</p>\r\n<p><a href=\"http://discussions.citrix.com/forum/1144-mobile-sdk-for-windows-apps/\">http://discussions.citrix.com/forum/1144-mobile-sdk-for-windows-apps/</a></p>\r\n<p>One of the challenges when developing mobile applications that run on Citrix servers is performing debugging. One option is to install Visual Studio directly onto XenApp. However you can also debug remotely from your workstation. Checkout this thread on\r\n how to setup remote debugging:</p>\r\n<p><a href=\"http://discussions.citrix.com/topic/300244-debugging-applications-remotely-with-visual-studio/\">http://discussions.citrix.com/topic/300244-debugging-applications-remotely-with-visual-studio/</a></p>\r\n<p>To provide a first class example of how you can create a Windows app that runs on Citrix and looks and feels like a native mobile application, we have created a mobile email client. This email client, also known as Hosted MobileMail is available as an unsupported\r\n technology concept release. It uses your Active Directory and Exchange infrastructure to auto-discover your Exchange environment to provide users with access to their email, contacts and calendar.</p>\r\n<p>You can access the MobileMail here:</p>\r\n<p><a href=\"https://www.citrix.com/go/hosted-mobilemail.html\">https://www.citrix.com/go/hosted-mobilemail.html</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "citrix,mobile,sdk,.NET,WPF,",
  "LastEdited": "2014-03-27T21:07:33.313-07:00"
}