{
  "ProjectName": "Cloudboard",
  "Title": "Wintellect Cloudboard",
  "Description": "Wintellect Cloudboard creates a clipboard that you can share across your machines and with other people.\nCloudboard is a desktop WPF application that leverages Microsoft's Live Framework for storage and synchronization and is developed in C#.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Note: It has just been announced that the Live Framework CTP will be shut down on September 8, 2009.</h1>\r<h2>Please ensure that any data you may have copied via Cloudboard has been archived. We are working on replacing the Live Framework backend in Cloudboard and will release a new version when this is in place.</h2>\r\n<img src=\"/projects/Cloudboard/552717e4-2478-406d-aa62-352ee6bd5c93\" alt=\"CloudboardDemo.png\" title=\"CloudboardDemo.png\" /><br /><br /><b>Project Description</b><br />Wintellect Cloudboard creates a clipboard that you can share across your machines and with other people.<br />Cloudboard is a desktop WPF application that leverages Microsoft&#39;s Live Framework for storage and synchronization and is developed in C&#35;.<br /><br />Ever had to rely on thumb-drives or shared folders just so you could copy and paste things between machines? Do you ever wish that you could store more than just ONE thing in the system clipboard? Wouldn&#39;t it be nice to be able to see what you have in the clipboard rather than blindly pasting and having to undo?<br /><br />Cloudboard is an easy-to-use, automatically-synchronized clipboard that does all of these things (and more!) by leveraging Microsoft&#39;s Live Mesh technology.<br /><br />System Requirements:\n<ul><li>.NET Framework v3.5 SP1 (available for installation <a href=\"http://www.microsoft.com/net\">here</a></li>\n<li>Live Framework Tech Preview (available for installation <a href=\"https://developer.mesh-ctp.com\">here</a></li></ul>\n<br />This version of Cloudboard relies on the Live Mesh Tech Preview. To develop against the Live Framework, you must request a Live Services account:<br />\n<ul><li>To provision your account:\n<ul><li>Go to https://developer.mesh-ctp.com/ </li>\n<li>Click the Join button. Follow the registration process and verify ownership of your email address if necessary.</li>\n<li>A Live Services token will be granted to you, at which point you can redeem the token to be granted access to use Live Services</li>\n<li>Sign In, select “Add Device” and then install the client Live Operating Environment.</li>\n<li>Go to https://developer.mesh-ctp.com/ again. At this point you should see the Live Mesh Devices ring.</li>\n<li>Click the &quot;Add Device&quot; icon and select the client for your computer&#39;s platform. Click the Install button.</li>\n<li>After the installation has completed, you should have a notification area icon for the Live Framework client with a small red &quot;X&quot; that indicates that you have not yet signed in.</li>\n<li>Click the notification area icon and you should be prompted for your Windows Live credentials. Once the sign-in process has completed, you will be connected to the mesh and ready to use Cloudboard!</li></ul></li></ul>\n<br />We’ve tried to make Cloudboard easy to use; we’ve provided keyboard accessibility through Windows hotkey support so that we provide as close an experience as possible to the Windows clipboard, but we’ve also provided UI accessibility so that you can manage your items using a mouse or touchscreen.<br /><br />If you click the Cloudboard icon in the notification area or hit the insertion hotkey (the default is CTRL-ALT-I but is configurable via the Options dialog), a dialog appears that displays the current ring. You can then navigate through your ring using either the arrow keys or the left/right buttons on the dialog. If you hit the insertion hotkey, all you need to do is bring the item you want to paste to the foreground and hit the Enter key; we will then tell Windows to paste that item into the application you were working in. If you brought the ring up from the UI, you can still transfer items using the Windows clipboard by clicking the copy/paste buttons (also accessible using CTRL-V/CTRL-C).<br /><br />You can have more than one Cloudboard! For instance, you can have one for managing your code snippets and another that you use to share recent photos with your family. To manage your list of Cloudboards, use the Options dialog. You can grant permission to other people using the &quot;Manage Permissions&quot; button in Options or the hyperlink when you pull up the ring dialog. From the Options dialog, you can select which Cloudboard to use as the default when the application starts, and from the Cloudboard icon&#39;s context menu you can choose which Cloudboard to want to work with at the moment.<br /><br />In order to compile (and hopefully participate in the development of Cloudboard - hint, hint), you need to install the latest version of <a href=\"http://ntrace.codeplex.com\">NTrace</a> and optionally the <a href=\"http://go.microsoft.com/fwlink/?LinkID=129650\">Live Framework Tools</a>. In addition, it&#39;s a good idea to read the guide on <a href=\"http://codeplex.codeplex.com/Wiki/View.aspx?title=CodePlex%20FAQ&amp;referringTitle=CodePlex%20Help%20Wiki#Join\">how to get involved</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Mesh,Tools,",
  "LastEdited": "2009-08-21T10:30:41.707-07:00"
}