{
  "ProjectName": "codeduiframework",
  "Title": "Coded UI Hybrid Test Automation Framework",
  "Description": "A blueprint of a Hybrid Coded UI Test Automation Framework which aims to eliminate hardships and increase its adoption across various organizations.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\n<br>\r\nThis project aims at creating a global test automation framework around Visual Studio's Coded UI Tests so that the limitations of CUIT's could be overcome.</p>\r\n<p>Some of the major disadvantages working with Record &amp; Playback feature of Coded UI based on my experience are as follows:</p>\r\n<ol>\r\n<li><strong>Large code base</strong> - Even for small recording sessions the code base generated (including all the files) is pretty huge. Larger the code base more difficult it is to manage it.\r\n</li><li><strong>UI map</strong> - The UI map which stores all the information related to UI controls of AUT (Application Under Test) is complex to understand and manage for the first timers.\r\n</li><li><strong>Playback performance</strong> - More the number of UI controls on the screen or more complex the UI is, more will be the playback time of your script. Even if you configure some of the playback settings you will not be able to achieve good performance\r\n of the likes of QTP, Selenium etc.. </li><li><strong>Object oriented concepts</strong> - Testers who are not so good at coding/scripting need to acquire knowledge of object oriented concepts and then either C# or VB.NET. This might prove to be a major turnoff factor in the process of adopting this\r\n tool. </li><li><strong>Re-usability</strong> - Personally i am not happy with the code and test data Re-usability feature Coded UI provides if we compare this with other tools i find Coded UI a bit behind.\r\n</li></ol>\r\n<p>The framework that I will be proposing addresses these issues and will help test organizations in adopting and using Coded UI in a better way. So please join me and let's make a framework.</p>\r\n<p><strong>Please not that this is just the beginning, interested people or groups are cordially invited to contribute in this initiative. Before commenting or contributing please go through the Documentation first which can be downloaded along with Source\r\n Code either from the &quot;Downloads&quot; tab or the &quot;Home&quot; tab.</strong></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Coded UI,Visual Studio,Test Automation,Automation Framework,TFS,Coded UI Framework,Visual Studio Premiu,cuite,cuite framework,cuite.codeplex,CodedUI Framework,microsoft codedui,google,google.com,codedui download,codedui automation,coded ui automation,cuit automation,cuit framework,google/#q=coded+ui,",
  "LastEdited": "2013-11-12T11:21:39.78-08:00"
}