{
  "ProjectName": "controllogixnet",
  "Title": "ControlLogixNET",
  "Description": "Library to interface with Allen-Bradley ControlLogix, CompactLogix, and MicroLogix PLC's.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>What is ControlLogixNET?</h1>\r\nControlLogixNET is a library that allows the user to communicate with Allen-Bradley(C) ControlLogix (R) PLC&#39;s, PAC&#39;s, and micro-PLC&#39;s. This library will communicate with any Ethernet/IP AB controller on the market at the time this is written. <br /><br />In more detail, ControlLogixNET is a .NET interface to a PLC. It allows you to read and write individual tags referenced by name, gather information about tags such as the data type, array size, dimensions, etc. It also allows you to create groups which allow for more efficient reads/writes (writes are not group based at the moment). In our testing we&#39;ve been able to read 40,000 tags per second from the processor without increasing the time slice over 15% (using arrays and groups). <br /><br />This library has some things that a lot of competitors don&#39;t, first of all, its FREE. It matches or beats the performance of off-the-shelf paid for systems, as well as Rockwell&#39;s own RSLinx software. It allows you to enable/disable forces and we&#39;ve even explored the possibility of uploading/downloading without using RSLogix (this is not in the software though). It also supports easy-to-use custom data types without using unsafe, unmanaged code, or marshalling. All you need to do to implement a custom type is to inherit from LogixUDT and create your appropriate fields.<br /><br /><b>Our library is also tested to work on Mono!!!!!</b> This is the only one on the market we know of that works on Linux, and we&#39;ve also had some limited testing on Android.<br />\n<h2>Prerequisites</h2>\r\nThis library depends on our other project, <a href=\"http://eipnet.codeplex.com\">EIPNET</a>. Updates to EIPNET may affect the operation of this library and we will try to keep the two as in sync as possible. Breaking changes in EIPNET will be announced in the forums here, and vice-versa.<br />\n<h2>How Can You Help?</h2>\rIf you would like to become a contributing member of this project, please email us at our CodePlex address (codeplex -at- ingeniousllc dot co). If you have a fix that you need, or have found a bug in our code, please email it to the same email address and we will work on getting it fixed, or open a bug report here on CodePlex.<br />\n<h2>So you want support?</h2>\rWe are more than happy to answer questions as they become available, please post them in the discussions area on this website. If you would like to use this library in a commercial application and need more support, please contact us at support -at- ingeniousllc dot co and we can discuss paid support programs depending on how much support you need. Our paid customers get our full attention, but we will do our best to help everybody.<br />\n<h2>How are you allowed to use this library?</h2>\r<b>You may NOT resell this library by itself, if you wish to resell this library as part of a larger product offering, please contact us (codeplex -at- ingeniousllc dot co) to make sure you aren&#39;t violating the terms of the license.</b> Using this library in a for-sale product is allowed (like in an HMI package), but repackaging it and offering it for sale as a library is not. Please read the terms of the license file located in the downloads, and the <a href=\"http://controllogixnet.codeplex.com/wikipage?title=License\">license is posted here</a>. This is an amendment to the license on the license page.</div><div class=\"ClearBoth\"></div>",
  "TagList": "EIP,CIP,Allen-Bradley,ControlLogix,CompactLogix,MicroLogix,GuardLogix,Rockwell,Rockwell Automation,PLC,PAC,",
  "LastEdited": "2012-08-01T18:17:24.657-07:00"
}