{
  "ProjectName": "crmlinkbuddy",
  "Title": "Link Buddy for Dynamics CRM",
  "Description": "Link Buddy for Dynamics CRM is a Windows (WPF) app that translates one or more CRM entity record GUIDs into CRM \"addressable\" form hyperlinks.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong><br>\r\nIf you're a Dynamics CRM developer or administrator and occasionally find yourself looking through CRM-related log files, this app will save you time and help you troubleshoot issues.<br>\r\n<br>\r\nLink Buddy for Dynamics CRM is a Windows (WPF) app that translates one or more CRM entity record GUIDs into CRM &quot;addressable&quot; form hyperlinks. It's useful for converting logging/tracing details from CRM plug-ins, custom apps, etc. into click-able links that\r\n open the CRM record for which the GUID represents.<br>\r\n<br>\r\n<strong>Features</strong><br>\r\nThis application...</p>\r\n<ul>\r\n<li>Connects to CRM Online or On-premises </li><li>Queries a CRM organization for each provided GUID and, where a record match is found, generates a hyperlink that opens the default form for the entity record\r\n</li><li>After processing all GUIDs in the input text, displays an HTML file in IE to allow you to quickly load CRM forms\r\n</li><li>Keeps track of the entities for which GUIDs are most often found and uses this information to run queries against the most common entities first\r\n</li></ul>\r\n<p><strong>Example</strong></p>\r\n<p>In the image below, the screen on the left shows Link Buddy with typical logging/tracing details. The screen on the right shows the results of clicking the Generate Hyperlinks button; each of the GUIDs in the original log text have been replaced with a hyperlink\r\n to the corresponding record in the CRM organization. The hyperlink shows the entity type and the primary name of the record.</p>\r\n<p><img src=\"http://i.imgur.com/qupwneh.png\" alt=\"Link Buddy Example\" width=\"1077\" height=\"430\"><br>\r\n<br>\r\n</p>\r\n<p><strong>Usage Tips</strong></p>\r\n<ul>\r\n<li>Link Buddy gets faster as you use it. It keeps track of the entities that yield the most GUID matches in your logging/tracing data so that it can search those entities first. An XML file is created for each CRM org you connect to; the XML file is stored\r\n in the same folder as the executable. </li><li>It is recommended that you limit the number of non-CRM GUIDs in the provided logging/tracing text. The application will query most entity types in CRM so providing GUIDs that are not related to CRM records will slow down the overall matching process.\r\n</li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Dynamics CRM,crm 2015,CRM,mscrm,crm tool,",
  "LastEdited": "2015-04-07T00:27:00.897-07:00"
}