{
  "ProjectName": "cybernanny",
  "Title": "Cyber Nanny",
  "Description": "Cyber Nanny is an application for looking after babies when dad or mom are not home. It's a Visual C++ (MFC) that utilizes the Kinect sensor. There is also a Windows Azure component (Web Role) which allows parents to submit requests to the application into a queue that's polled at certain intervals of time by calling a WCF service via WWSAPI.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Cyber Nanny is an application for looking after babies when dad or mom are not home. It&#39;s a Visual C&#43;&#43; &#40;MFC&#41; that utilizes the Kinect sensor. There is also a Windows Azure component &#40;Web Role&#41; which allows parents to submit requests to the application into a queue that&#39;s polled at certain intervals of time by calling a WCF service via WWSAPI.<br /><br /><br /><b>**CyberNanny **</b><br /><br />This project is an application that I recently wrote for my first baby girl. It’s called CyberNanny, because it allows me to remotely see my daughter. It’s been written in Visual C++ (MFC) and it comprises different technologies like Kinect and its SDK, Windows Azure, Web Services and Office Automation via Outlook.<br /><br />The CyberNanny concept is simple but it has some moving pieces, a thick-client captures frames with the Kinect sensor and it also allows taking pictures, at the same time there is a timer which spawns a thread responsible for polling a queue hosted in Windows Azure, if any message exists in the queue is processed by the application, a picture is taken, an email is composed and the picture is attached to the email before sending. The requests are inserted into the queue via an ASP.NET page.<br /><br /><img src=\"/projects/cybernanny/b380a139-19b6-40e3-b642-07fd41fb4231\" alt=\"CyberNanny_Arch.png\" title=\"CyberNanny_Arch.png\" /><br /><br />I would like to add extra features like: <br />\n<ul><li>Motion Detection</li>\n<li>Speech Recognition</li>\n<li>Sending of SMS (Text Messages) in case an event occurs (e.g.: Baby cries)</li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Kinect,Interop,Visual C++,Visual C#,WWSAPI,Office Automation,Windows,Azure,Web Service,",
  "LastEdited": "2012-05-06T22:41:43.997-07:00"
}