{
  "ProjectName": "doc2pdf",
  "Title": "Word Document to PDF Converter",
  "Description": "This Sample of application converts the .doc/.docx file to PDF document using WPF and C#. You can integrate into your application as per your requirement.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This Sample of application converts the .doc&#47;.docx file to PDF document using WPF and C&#35;. You can integrate into your application as per your requirement.<br /><br /><br />Description<br /><br />This Sample of application converts the .doc/.docx file to PDF document using WPF and C#. You can integrate into your application as per your requirement. With the help of this sample you can convert office file such as excel, presentation file into pdf in the same way.                                                                                                                   <br /><br /> Word2PDF Converter will convert any WORD document to a PDF file extension. If you have a .doc or a .docx file and you need it to be converted to a .PDF file, this program will do it simply and completely free. When you convert word to PDF free you will notice everything from images, text, columns, and anything else is included in the finished PDF file.<br /><br /> It is easy to use and easy to integrate in your application.    <br /><br />Design Process:<br /><br />If you want to build this application Take one TextBox to display Source File Path Name and One Button to open the File DialogueBox. Take another TextBox to Display the Distination Path. One Button to convert the Button. Make sure that to add reference assembly                        <br /><br />There are four requirements before you publish:<br /><br />- Upload the initial source code for your project<br />- Add your project license<br /><br />Additional information on starting a new project is available here: <a href=\"http://codeplex.codeplex.com/wikipage?title=Start%20a%20Project\">Project Startup Guide</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "doc2pdf Converter,pdf,ms office,ms word,pdf converter,document converter,wpf pdf viewer,",
  "LastEdited": "2014-01-08T01:35:32-08:00"
}