{
  "ProjectName": "docConverter",
  "Title": "MOSS Document Converter",
  "Description": "Microsoft Office SharePoint Server (MOSS) Document Converters with Word & Excel 2007 on the server.  \n\nConverting Office 2003 file-types (doc, xls) to pdf and xps.  Could easily be altered for work for docx and xlsx file-types.\n\nDesktop Automation on the Server:\nPreviously, using office 2003 on the server to print out PDF files had problems.  For example, if a dialog box pops up and no user is there to click 'ok' the instance will not close, additional conversions launch additional instances until the server grinds to a halt.\n\nI have not seen this problem with Office 2007.  I don't know why.  I would love to hear a discussion about what is different with the COM interlope assemblies for Office 2007.\n\nOther products:\nI have tried to use other 3rd party products to do document conversion.  What I found is that rich content, with lines, arrows, circles, and so on, gets all messed up in the resulting PDF.  Make sure you test with more than simple text when you build your converter on a 3rd part product!\n\nUsing Word and Excel 2007 to convert 2003 files to PDF and XPS seems to work great!\n\nTopology:\nTypically document converters are just installed on the server running sharepoint after document conversion has been turned on.  However it is possible to put document conversion on its own server by editing registry entries to point 'Document Converter Launcher Service' at the 'Document Converter Load Balencer Service' on the target machine.  \n\nhttp://technet2.microsoft.com/Office/en-us/library/f7d7b652-10cc-4c99-8c05-0cc4341d4d941033.mspx?mfr=true\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Welcome to the first Office 2003 to PDF/XPS Document Converter for MOSS!<br /><br />Author, Ben Steinwand, works as a ASP.NET and SharePoint Consultant in the Bay Area, CA.  Contact me at ben.steinwand@gmail.com for details.<br /><br />Use these converters for conversion of Office 2003 file-types (.doc, .xls) to .pdf and .xps. *Could easily be altered to work for .docx and .xlsx file-types.<br /><br /><b>Desktop Automation on the Server</b><br />These converters require Word and/or Excel 2007 to be installed on the server and utilize desktop automation to print either PDF or XPS. There are problems with this approach but it is very common because no better solution exists at this time. <br /><br /><b>Conversion by interpretation vs. conversion by printing</b><br />There are products out there that attempt to solve this problem by converting rather than printing, without launching Word or Excel, but these products have other problems. In my extensive experiments I found conversion products fail to convert accurately when any rich-content exists. Transparent circles become opaque; arrows become lines, and so on. These converters were originally developed at Stanford for QA engineers clearing parts used to build particle accelerators; in that case inaccurate conversion would have been a very bad thing. <br /><br />Topology (IMPORTANT!!!):<br />Document converters can be installed on all the front-end web servers running SharePoint, however it is possible to put document conversion on its own server by editing registry entries to point &#39;Document Converter Launcher Service&#39; at the &#39;Document Converter Load Balancer Service&#39; on a target machine.  <br /><br />My recommendation is to isolate conversion on a machine specific to that purpose.  See the artcile linked below.<br /><br />http://technet2.microsoft.com/Office/en-us/library/f7d7b652-10cc-4c99-8c05-0cc4341d4d941033.mspx?mfr=true<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Document Converter,MOSS Solution,.ddf,.wsp,Word to PDF,Excel to PDF,.xps,SharePoint ,Document Conversion,",
  "LastEdited": "2010-03-19T10:33:20.267-07:00"
}