{
  "ProjectName": "dsl4wix",
  "Title": "Deployment Software Factory",
  "Description": "The Deployment Software Factory provides an array of resources that offer many benefits for architects and developers of service-oriented applications. The Deployment Software Factory contains best practice for continues integration, automatic test running, automatic documentation, automatic installation package construction and automatic remote deployment to multi-rig environment. This VS package reference on following frameworks and practice:\r\n•Guidance Automation Toolkit and Extensions\r\n•Solution Build Framework \r\n•Software Factories Toolkit\r\n•Windows Xml Installer\r\n•Domain Specific Language\r\n•System Definition Model\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>News</b><br />New Beta 2 release is comming. It will support VS 2008 and latest version of the GAT\\GAX. First draft of documentation and some samples will be included.<br /><br /><b>Project Description</b><br />The Deployment Software Factory provides an array of resources that offer many benefits for architects and developers of service-oriented applications. The Deployment Software Factory contains best practice for continues integration, automatic test running, automatic documentation, automatic installation package construction and automatic remote deployment to multi-rig environment. This VS package reference on following frameworks and practice&#58;<br />&#8226;Guidance Automation Toolkit and Extensions<br />&#8226;Solution Build Framework <br />&#8226;Software Factories Toolkit<br />&#8226;Windows Xml Installer<br />&#8226;Domain Specific Language<br />&#8226;System Definition Model<br /><br />\n<h1>Deployment Software Factory Contents</h1>\rThe Deployment Factory contains the following:\n<ul><li><b>DSL languages.</b> The FileSystemDefinition language and WixPackageDefinition language. The FileSystemDefinition language allows to describe underling file system of deployable artifacts such as .Net assemblies, COM libraries, files and so on. This model is generated form file system based on root folder and filters.  WixPackageDefinition model defines building blocks for Wix package such as Component packages, Web Application component, Windows Service component, IIS host definition (website and pools), MSI properties configuration files replacements and more. </li>\n<li><b>T4 Text Templates.</b> There are several T4 templates which are used to transform DSL model into Wix source files.</li>\n<li><b>Setup runner.</b> This package provides Setup.exe file which could be used to run MSI package with a set of parameters which are taken from Xml configuration file. This configuration file is generated form WixPackageDefinition model based on MSI properties, App Pool and Windows Service identities.</li>\n<li><b>Guidance packages.</b> The Deployment guidance package for Visual Studio. This package simplifies the designing of WixPackageDefinition model providing context menu and wizards to create new Web Application or Windows Service. </li>\n<li><b>SDM and Wix integration.</b> In the features release this package will provide integration and synchronization with SDM model, it allows to generate the skeleton of the WixPackageDefinition model from SDM. For instance all IIS settings could be extracted from SDM model and all Web and Windows application as well.</li>\n<li><b>SDM and SBF integration.</b> In the feature release this package will allow to design remote deployment to the multi-rig environment using Logical Datacenter and Logical Datacenter deployment diagrams.</li>\n<li><b>Documentation.</b> Documentation with Getting Started section which helps to get started with this new Guidance package.</li></ul>\n<br /><img src=\"/projects/dsl4wix/00dc4204-ff16-4667-9927-8f09772dc6c2\" alt=\"WixPackageDSLDesigner.JPG\" title=\"WixPackageDSLDesigner.JPG\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "WiX,Software Factory,Guidance,Deployment,GAX,GAT,MSI,DSL,DSL editor,SDM,Deployment Factory,Wix DSL,Deployment Software ,VS 2008 Add-In,DSF,patterns & practices,",
  "LastEdited": "2008-03-05T09:20:40.517-08:00"
}