{
  "ProjectName": "GAMandelKowCharts",
  "Title": "WPF Metro UI Charts",
  "Description": "A library of WPF charts with the Modern UI (Metro) look. Line, Scatter, Pie, Column, Bar, Radial, Doughnut.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>WPF Metro UI Charts</h1>\rThis is a modification of <b><a href=\"https://modernuicharts.codeplex.com/\">Modern UI (Metro) Charts for Windows 8, WPF and Silverlight</a></b> by <i>Torsten Mandelkow</i>. It contains his original WPF code along with modifications and additions. The project adds to Torsten&#39;s charts the line and scatter charts. Multiple series types (scatter and line) are allowed on the same chart.<br /><br /><b>Many thanks to Torsten for his great chart library and his approval for me to put this project up.</b><br /><br />While there is documentation here for the new charts, Torsten has documentation on his project and there is active an active discussion section there. <b><a href=\"https://modernuicharts.codeplex.com/\">Modern UI (Metro) Charts for Windows 8, WPF and Silverlight</a></b> <br /><br /><i>It is a beta release and is presently WPF only.</i><br /><br /><img src=\"/projects/GAMandelKowCharts/5fce744a-a194-482a-8c5f-4d40efc6526c\" alt=\"MainScreen.GIF\" title=\"MainScreen.GIF\" /><br /><br /><b>Available Charts</b>\n<ul><li>MultiSeries Chart - line, scatter, column, and user defined all on the same axis.</li>\n<li>ColumnChart (ClusteredColumnChart, StackedColumnChart, StackedColumnChart100Percent)</li>\n<li>PieChart (PieChart and Dognut)</li>\n<li>BarChart (ClusteredBarChart, StackedBarChart, StackedBarChart100Percent)</li>\n<li>Doughnut Chart</li>\n<li>Radial Gauge Chart </li></ul>\n\n<h1>News!</h1>\r<h3>Release 3 is here. The line and scatter charts have now been <b>replaced</b> with a MultiSeries Chart.</h3>\r<ul><li><b>8 Oct, 2015</b> Release 3 now uploaded.</li>\n<li><b>23 Aug</b> Release 2 now uploaded - negative values supported in line, scatter and column charts</li>\n<li><b>16 Aug</b> Still some testing to do but the negative value support on the scatter/ Line and Column seems to be working nicely. Hope to have the code up next week. Also I think it fixes a minor bug in the original base code to do with maximum values of axis.</li>\n<li><b>Aug, 2015</b> Initial Gravity Apps release with small bug fix and Line and Scatter charts</li></ul>\n\n<h2>Release information</h2>\r<ul><li><b>8 Oct, 2015</b> Release 3\n<ul><li>The line and scatter charts have now been <b>replaced</b> with a MultiSeries Chart. </li>\n<li>Columns, line, scatter and user defined charts can be placed on top of each other in the one set of axis. For example, the columns could represent that actual figures while a line represents the target.</li>\n<li>You can now select a column or scatter point just as you can in the standard Mandelkow charts.</li>\n<li>Negative values are supported, and are more accurate, in the Clustered Column and MultiType Charts.</li>\n<li>Styles for the column, line, scatter (and user defined) are now defined using XAML styles (instead of just brush&#39;s) making it easier to alter the look of the chart without needing to alter the source code.</li>\n<li>The type of each series is defined with a class. This means a user can write their own code to draw a chart piece without needing the base source code. Just write the code in your application and refer to it in the XAML.</li></ul></li>\n<li><b>23 Aug, 2015</b> Release 2\n<ul><li>Negative values supported in line, scatter and column charts</li>\n<li>Animation of values in line and scatter when values changed (other charts already included this)</li>\n<li>Changes to test application to include data point changing and including other charts</li></ul></li>\n<li> <b>Aug, 2015</b>\n<ul><li>Fixes issue with multiple series column chart where the maximum value for the axis wasn&#39;t being picked up from the second or subsequent series</li>\n<li>Initial Release of GALineScatter Chart</li></ul></li></ul>\n<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "chart,charting,WPF,Metro,Modern UI,graph,",
  "LastEdited": "2015-10-07T19:39:50.577-07:00"
}