{
  "ProjectName": "gembackup",
  "Title": "GEMBackup",
  "Description": "A nifty little utility that allows you to automate the backups of sites on a daily, weekly or monthly basis.\n\nUsage: -a || -d || -w [-f <filename>]\n\nOperations and Parameters:\n -a  Create backup file for all sites\n -d  Create backup file for all sites that have been modified in the last day.\n -w  Create backup file for all sites that have been modified in the last week.\n -f  Output to this file name - default is GEBakOut.bat\n\nExamples:\nGEMBACKUP -a\nGEMBACKUP -d -f fileName.bat",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A nifty little utility that allows you to automate the backups of sites on a daily, weekly or monthly basis.<br /><br />Usage&#58; -a &#124;&#124; -d &#124;&#124; -w &#91;-f &#60;filename&#62;&#93;<br /><br />Operations and Parameters&#58;<br /> -a  Create backup file for all sites<br /> -d  Create backup file for all sites that have been modified in the last day.<br /> -w  Create backup file for all sites that have been modified in the last week.<br /> -f  Output to this file name - default is GEBakOut.bat<br /><br />Examples&#58;<br />GEMBACKUP -a<br />GEMBACKUP -d -f fileName.bat<br /><br />By default, personal sites content is contained in the site database of the portal site. You could use the SharePoint Backup and Restore utility to back up the personal sites content, but then you would not be able to restore individual personal sites. Instead, you would have to restore the entire site database. Stsadm.exe can back up and restore individual users&#39; personal sites, including all subsites, files in document libraries or lists, security and permission settings, and feature settings.<br /><br />The Stsadm.exe enumsites parameter lists all personal sites that have been created on the portal site. The enumsubwebs parameter lists all subsites within a site collection. Use the enumsites parameter to parse the list of personal sites, and then back up each personal site to a file.<br /><br />What GEMBackup does is enumerate the sites based on whether they have been changed on the day, week or month, and creates a stsadm -o backup command for each of the sites. This means that you could using a simple routine have a backup / disaster recovery plan set for your sites very quickly.<br /><br />Full information on how to use this utility is located at on my blog at:<br /><br /><a href=\"http://www.sharepointgeoff.com/gembackup/\">http://www.sharepointgeoff.com/gembackup/</a><br /><br />Am trying to build a great bunch of tools for Sharepoint automation - if you like this tool please donate something - it all goes to keeping me toiling away on those apps and makes me feel its all worthwhile! Please donate by going here: <a href=\"http://www.geoffevelyn.com/donate/donate.htm\">http://www.geoffevelyn.com/donate/donate.htm</a> and clicking the DONATE button - thanks!<br /><br />Geoff Evelyn, <a href=\"http://sharepointgeoff.com\">http://sharepointgeoff.com</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "BACKUP,AUTOMATION MOSS,GEOFF EVELYN,BACKUP AUTOMATION,",
  "LastEdited": "2011-09-01T04:14:47.02-07:00"
}