{
  "ProjectName": "gepbackup2010",
  "Title": "GEPBACKUP2010 and GEPBACKUP2013",
  "Description": "GEPBACKUP is a SharePoint 2010 and 2013 utility that creates a Powershell script based on the changes in the site.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />GEPBACKUP is a SharePoint 2010 and 2013 utility that creates a Powershell script based on the changes in the site.<br /><br />The command line looks like this:<br /><br />SharePoint 2010 Version:<br /><b>GEPBACKUP2010 <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-u%20URL%20of%20site%20to%20check&referringTitle=Home\">-u URL of site to check</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-d&referringTitle=Home\">-d</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-w&referringTitle=Home\">-w</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-a&referringTitle=Home\">-a</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-l%20%2f%2fBackupDirectoryShare&referringTitle=Home\">-l &#47;&#47;BackupDirectoryShare</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-s%20PowerShellScriptFile&referringTitle=Home\">-s PowerShellScriptFile</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-%5bf%2fx%2fw&referringTitle=Home\">-&#91;f&#47;x&#47;w</a> BackupReportFile]</b><br /><br />SharePoint 2013 Version:<br /><b>GEPBACKUP2013 <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-u%20URL%20of%20site%20to%20check&referringTitle=Home\">-u URL of site to check</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-d&referringTitle=Home\">-d</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-w&referringTitle=Home\">-w</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-a&referringTitle=Home\">-a</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-l%20%2f%2fBackupDirectoryShare&referringTitle=Home\">-l &#47;&#47;BackupDirectoryShare</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-s%20PowerShellScriptFile&referringTitle=Home\">-s PowerShellScriptFile</a> <a href=\"https://gepbackup2010.codeplex.com/wikipage?title=-%5bf%2fx%2fw&referringTitle=Home\">-&#91;f&#47;x&#47;w</a> BackupReportFile]</b><br /><br />Ok, lets go through the switches in turn:<br /><br /><i>-u</i><br />This is the URL of the site. Use this if you wish to target a specific site to backup instead of&#160;everything (i.e. all sites). If you do not use this switch all web applications and site collections will be included (i.e. will be checked)<br /><br /><i>-d</i><br />When this switch is used only sites whose content has been changed will be included in the backup. Note that as detailed in the previous, switch, if -u is not used all sites will be checked against this switch.<br /><br /><i>-w</i><br />When this switch is used only sites whose content has been checked in the week will be includd in the backup. Note that as detailed in the previous, switch, if -w is not used all sites will be checked against this switch.<br /><br /><i>-a</i><br />When this switch is used all sites will be included in the backup and will not be subject to a date comparison check - i.e. any last content date change will be ignored.<br /><br /><i>-l</i><br />When this switch is used backups will be stored in the relevant share or the drive / folder. This application makes no check to identify whether the target is valid; however, if nothing is entered as the directory then an error will be thrown and the utility will not proceed.<br /><br /><i>-s</i><br />When this switch is used the script will be generated in the relevant PowerShell backup filename submitted. If no Powershell script filename is entered and this switch is used an error will be thrown and the utility will not proceed.<br /><br /><i>-f / -x / -w</i><br />When any of these switches are used the output report file will be generated to either -f for Text File, -x for XML and -w for HTML format. Note that if there is no filename supplied with this switch an error will be thrown and the utility will not proceed.<br /><br /><b>Special note.</b><br />GEPBackup2010 and GEPBackup2013 has the ability to&#160;ignore&#160;specific sites. All you need to do is to list the sites URL you don&#39;t want backed up in a file called&#160;EXCLUSIONS.TXT&#160;stored in the same directory. When running the routine will check for the existence of EXCLUSIONS.TXT and if found will then check each URL being scanned against the URLS in EXCLUSIONS.TXT. If there is a match the URL being scanned will not be backed up.<br />This is very useful if you want to backup sites in a site collection but not all of them.<br /><br /><i>-h</i><br />If you use this switch the help screen will be displayed as above, and the help screen also displays if you run the routine without using any switches.<br /><br /><u><b>Examples of this command being used is as follows (based on the 2010 version but the descriptions are the same throughout):</b></u><br /><br /><b>GEPBACKUP2010 -d</b><br />This will create a Powershell backup script called GEPBACKUP2010.ps1 including commands to backup each site whose content has been changed today. The output report will be called GEPBACKUP2010.txt and the backup files created by the script will be stored in the same directory it was run in.<br /><br /><b>GEPBACKUP2010 -a -f mybackups.txt -l e:\\backups -s mybackupscript.ps1</b><br />This will create a Powershell backup script called mybackupscript.ps1 including commands to backup each site whose content has been changed today. The report output will be sent to mybackups.txt and the backups created by the script will be stored in the directory called e:\\backups.<br /><br /><b>GEPBACKUP2010 -u http://myspsportal -d -f mybackups.txt -l e:\\backups -s mybackupscript.ps1</b><br />This will create a Powershell backup script called mybackupscript.ps1 including commands to backup each sites from the web application http://myspsportal whose content has been changed today. The report output will be sent to mybackups.txt and the backups created by the script will be stored in the directory called called e:\\backups.<br /><br /><b>DONATIONS GRATEFULLY RECEIVED!</b><br />Am trying to build a great bunch of tools for Sharepoint automation - if you like this tool please donate something - it all goes to keeping me toiling away on those apps and makes me feel its all worthwhile! Please donate by going here: <a href=\"https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&amp;hosted_button_id=6205083\">https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&amp;hosted_button_id=6205083</a> and clicking the DONATE button - thanks!<br /><br />More information about GEPBackup2010 and my other automation tools are located at <a href=\"http://www.sharepointgeoff.com/software\">http://www.sharepointgeoff.com/software</a><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "BACKUP,BACKUP AUTOMATION,BACKUP SHAREPOINT,SHAREPOINT BACKUP,2010 BACKUP,GEOFF EVELYN,",
  "LastEdited": "2013-04-08T05:48:05.877-07:00"
}