{
  "ProjectName": "gotlyrics",
  "Title": "Got Lyrics?",
  "Description": "Utility to automatically grab lyrics from the internet for your mp3 collection. It looks in various places on the internet and give you the option to auto tag the result in the source mp3 file. By saving the song text into the mp3 they become visible in your iPhone and iPod.  ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Utility to automatically grab lyrics from the internet for your mp3 collection. It looks in various places on the internet and give you the option to auto tag the result in the source mp3 file. By saving the song text into the mp3 they become visible in your iPhone and iPod.  <br />\n<h2>What is it?</h2>\rGot Lyrics allows you to locate and auto tag lyrics for your mp3 collection. Based on the artist and songtitle tag found in a mp3, GotLyrics will search the internet on various locations for the matching lyrics. If it has found lyrics it can auto tag them into the source mp3 (so that you can see them for instance on your iphone or ipod) but you can also choose to write them in a textfile.<br />\n<h2>Where do the lyrics come from?</h2>\rThe internet. The current release checks the following sites for lyrics:\n<ul><li>Leo&#39;s Lyrics</li>\n<li>LyrDB</li>\n<li>LyricsPlugin</li>\n<li>LyricWiki</li>\n<li>WowLyrics</li></ul>\n<br />Via these sites GotLyrics located around 95% of the lyrics for my mp3 collection (which is around 40gb and isn&#39;t very mainstream).<br />Each site is checked via a so called grabber plugin, which is quite easily made if you know a little bit of .NET. So if a large part of your mp3 collection can be found on a different site and you know your way around the keyboard a little then take a look at the LyricGrabber class. Place your resulting assembly in the same folder as GotLyrics and off you go. <br />\n<h2>How does it work?</h2>\rCurrently only via a console application that does the job (maybe there will be a nice fat GUI in the future). <br />The console program is quite simple and in general it only needs one argument; the filename or directory to check.<br /><img src=\"/projects/gotlyrics/214d713d-b885-464a-a11c-06b34241a40f\" alt=\"Console-Help.png\" title=\"Console-Help.png\" /><br /><br />It will autodetect if you provided a filename or a directory. When a directory is given it will process all mp3 files found in that directory.<br />If you do not want to tag the lyrics into the mp3 file use the /Save and /test argument. (Mind the uppercase S)<br />\n<h2>It can&#39;t find lyrics for song X!</h2>\rFirst make sure the tags of the mp3 file are correct. GotLyrics can&#39;t locate lyrics if it doesn&#39;t who the artist is or what the title of the song is.</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,Tools,utility,Music,FREE,automation,mp3,tagging,Tag,cool,iphone,iPod,Song,lyrics,",
  "LastEdited": "2009-03-22T11:53:17.427-07:00"
}