{
  "ProjectName": "homecontroller",
  "Title": "HomeController",
  "Description": "A Home Automation project to interact with INSTEON devices, the idea is to have a web service accessible from multiple devices (apps) to turn on/off lights, appliances etc in a home powered by INSTEON hardware.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A Home Automation project to interact with INSTEON devices, the idea is to have a web service accessible from multiple devices &#40;apps&#41; to turn on&#47;off lights, appliances etc in a home powered by INSTEON hardware.<br /><br /><a href=\"http://www.christoc.com/Tutorials/All-Tutorials\">DNN Tutorials</a><br /><a href=\"http://www.christoc.com/DotNetNuke/Support\">DotNetNuke Support</a><br /><a href=\"http://www.christoc.com/DotNetNuke/Consulting\">DotNetNuke Consulting</a><br /><br />This project was started because I couldn&#39;t justify spending a couple hundred dollars on home automation (domotics) software that did far more than I needed, in an interface I didn&#39;t care for.<br /><br />This started off as a simple web service to turn on or off an INSTEON device, it has grown into a budding DotNetNuke module to manage Rooms and Devices. After the management of these are handled, various applications will be developed, the first being for Android, to control lights remotely.<br /><br />This code is currently setup as a DotNetNuke module, meaning you will need to have DNN (free) up and running in order to use it, to learn more about DNN check out <a href=\"http://www.dotnetnuke.com\">http://www.dotnetnuke.com</a><br /><br /><b>1/15/2010</b><br />Currently you can add and manage Rooms, Device Types and Devices, though you can&#39;t associate devices with a room or type just yet. Basic on/off functionality is added in the default display if you have added some INSTEON devices. You most likely will need to change the COM settings in the Communications class, as currently the info is hard coded for the COM Port.</div><div class=\"ClearBoth\"></div>",
  "TagList": "DotNetNuke,DotNetNuke Module,DNN,DNN Extension,home automation,insteon,smarthome,",
  "LastEdited": "2017-11-06T20:37:27.327-08:00"
}