{
  "ProjectName": "houserobot",
  "Title": "Home Automation with Microsoft Robotics Developer Studio",
  "Description": "House.Robot is an experimental project using Microsoft Robotics Studio for home automation. Check out the accompanying article at http://blogs.msdn.com/coding4fun/.\nMicrosoft Robotics Developer Studio models robots as entities that are composed of sensors and actuators. By viewing an automated house as an entity that is composed of sensors (motion detectors, contact switches, temperature sensors, etc.) and actuators (lights, door locks, HVAC, etc.) we can apply the Microsoft Robotics model to the domain of home automation. To learn more about Microsoft Robotics Developer Studio and the Decentralized Software Services Model visit: http://msdn.microsoft.com/en-us/robotics/default.aspx.\nThis project contains DSS services to monitor and control an Elk M1G security and automation controller as well as Z-Wave lights using the ControlThink Z-Wave SDK. You can also program using the SimulatedDimmer service if you don’t have Z-Wave lights, and you can run the Elk service in a simulated mode. There is also a simple EmailSender service so that the automated house can send emails or SMS messages.\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2><b>Project Description</b></h2>\rHouse.Robot is an experimental project using Microsoft Robotics Studio for home automation. Check out the accompanying article at http&#58;&#47;&#47;blogs.msdn.com&#47;coding4fun&#47;.<br />Microsoft Robotics Developer Studio models robots as entities that are composed of sensors and actuators. By viewing an automated house as an entity that is composed of sensors &#40;motion detectors, contact switches, temperature sensors, etc.&#41; and actuators &#40;lights, door locks, HVAC, etc.&#41; we can apply the Microsoft Robotics model to the domain of home automation. To learn more about Microsoft Robotics Developer Studio and the Decentralized Software Services Model visit&#58; http&#58;&#47;&#47;msdn.microsoft.com&#47;en-us&#47;robotics&#47;default.aspx.<br />This project contains DSS services to monitor and control an Elk M1G security and automation controller as well as Z-Wave lights using the ControlThink Z-Wave SDK. You can also program using the SimulatedDimmer service if you don&#8217;t have Z-Wave lights, and you can run the Elk service in a simulated mode. There is also a simple EmailSender service so that the automated house can send emails or SMS messages.<br />\n<h2>Setup</h2>\rIn order to compile the code in this project, you will need to do the following:\n<ol><li>Install Microsoft Robotics Developer Studio 2008 CTP April.</li>\n<li>Run the DssProjectMigration command line utility to convert the project paths to match your installation.</li>\n<li>For the Z-Wave service, you will need a copy of the ControlThink Z-Wave PC SDK.</li>\n<li>The Elk M1G services can be run in a simulated mode with a slight modification to the code. Look for the comment <i>//ELK: Comment out the line below to run in simulated mode</i> in the Elk.cs file.</li></ol>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "home automation,robotics,z-wave,ControlThink,VPL,DSS,Elk M1G,House.Robot,",
  "LastEdited": "2008-06-04T14:41:17.193-07:00"
}