{
  "ProjectName": "ibrewIt",
  "Title": "iBrewIt",
  "Description": "Eventual Project Goals:\r\n\r\nWeb based system for managing brew recipes, inventory, and brew-day tasks.  Eventual mobile/desktop applications, cloud sync, and hw.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Eventual Project Goals&#58;<br /><br />Web based system for managing brew recipes, inventory, and brew-day tasks.  Eventual mobile&#47;desktop applications, cloud sync, and hw.<br />\n<h1>Overall Goal</h1>\riBrewIt&#39;s goal is to provide home-brewers with a zero software cost means of managing recipes, inventory, and tracking tasks during the brewing process from brew-day to consumption.<br />\n<h2>iBrewIt.Hardware</h2>\rOver the past year our brew house has been managed by a GHI Electronics Cobra running .NETMF which is similar to the GHI Fez Panda II and very similar to most NetDuinos currently on the market.<br /><br />The iBrewIt suite will first publish the un-refactored brew-day code running on the Cobra along with the wiring diagram used to connect it to the electronics and the brewing hardware.<br /><br />Once that&#39;s complete the focus will be to abstract the functional code from the hardware in order to make it cross-package compatible.<br />\n<h2>iBrewIt.Web</h2>\rIn parallel with the development of the iBrewIt.Hardware package we plan on developing a web based system that will not only seamlessly integrate with the hardware for real-time monitoring and data logging but also strive to incorporate a modern fully functional ingredient inventory, recipe design, and competition tracking system.<br />\n<h2>Why Are We Doing This?</h2>\r\n10 Years ago brewing was a mystery to most of us, even those of us who brewed on a regular basis.  Most of our knowledge was derived from either reading books, experimenting, or brewing with friends who had more experience.<br /><br />As the homebrewing ecosystem blossomed so too did our understanding of the actual formulas involved in determining color, efficiency, bitterness, etc.  <br /><br />Unfortunately most of the homebrewing software on the market didn&#39;t change with the times.  Sure they attempt to add features like cloud based storage, brew day tasks -- heck there&#39;s even one that runs (sometimes) on my iPad.<br /><br />But not one software package does it well, does it cleanly, does it using modern development tools, or does it for free.  <b>iBrewIt</b>&#39;s challenge is to bring you the level of hardware control, data logging/monitoring, and recipe design that the big boys use with only the cost of the hardware to actually do it.... oh -- and get your GEEK on while doing it!<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "NETMF,.NETMF,Beer,Homebrew,Automation,MVC.NET,",
  "LastEdited": "2013-02-09T22:43:14.063-08:00"
}