{
  "ProjectName": "interaction",
  "Title": "Interaction",
  "Description": "This is a library to control some common home-automation hardware types to be able to build advanced application to make everyday life simpler.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This is a library to control some common home-automation hardware types to be able to build advanced application to make everyday life simpler.<br /><br />In my mind this library is the foundation for all home-management software. The library (Dasaar.Interaction) consists of the following parts:<br />\n<h1>THIS PROJECT IS ABANDONED, CODE IS HERE FOR HISTORICAL REASONS ONLY, A UPDATED PROJECT WILL BE PUBLISHED IN THE FUTURE AS DEVELOPMENT HAVE BEEN CONTINUING IN ANOTHER PROJECT (NOT CURRENTLY OPEN).</h1>\r\n<b>TellStick</b><br />Wrapper around the native telldus.dll to send commands to wireless switches on the 433mhz band via USB connected devices. Today implementing only features of TellStick, but in process of implementing support for TellstickDuo. This library is wrapping the DLL more in a object-oriented way using enums etc than the code supplied by Telldus.<br /><a href=\"http://www.telldus.se/products/tellstick\">http://www.telldus.se/products/tellstick</a><br /><br /><b>K8061</b> &amp; <b>K8055</b><br />Wrapper around the K8061 and K8055 board from Velleman that lets you control relays from the usb-port of you computer. Perfect for electric blinds and motors that you are not able to control via TellStick. The code here is to replace the K8061.Managed project I wrote a couple of years ago. No big differences in code yet, adding support for K8055 currently.<br /><a href=\"http://www.velleman.eu/products/view/?country=be&amp;lang=en&amp;id=364910\">http://www.velleman.eu/products/view/?country=be&amp;lang=en&amp;id=364910</a><br /><br /><b>Messaging</b><br />Used for the basic task of sending and receiving SMS:es from a connected phone or broadband modem (that supports sms). Due to some strangeness in broadband modem hardware a small sms-received poll have been implemented instead of relying on notification. A self contained modem communication solution have been achived with the last checkin. However still having problems reading SMS from phone.</div><div class=\"ClearBoth\"></div>",
  "TagList": "K8055,",
  "LastEdited": "2013-05-24T04:03:48.99-07:00"
}