{
  "ProjectName": "JawsVS2010",
  "Title": "Jaws For Windows vs 2010 Add-In",
  "Description": "A project for programming a Visual Studio 2010 add-in for the jaws for windows screen reader - www.freedomscientific.com - to effectively interact with the visual studio 2010 IDE. It's being developed in C#.net.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\r\nA project for programming a Visual Studio 2010 add-in for the jaws for windows screen reader - www.freedomscientific.com - to effectively interact with the visual studio 2010 IDE. It&#39;s being developed in C#.net. The addin will not work with the vs 2010 express editions. The free express editions do not permit addins to be installed and used.<br /><br />It is difficult to adequately script Jaws to work with the visual studio 2010 IDE. Jaws does support basic code editor speech, but the need for more robust VS 2010 speech support is needed. As a way to provide more speech, a vs 2010 add-in will be programmed. Jaws will interact with this add-in to help speak objects in the vs 2010 IDE to blind or visually impaired programmers. Once the add-in project is finished, people can freely download the vs 2010 add-in, install it, and then have jaws speak more information in the vs 2010 IDE. <br />\n<h2>I Want to Participate in this project, What Do I need to do?</h2>\r\nAll programmers are welcomed to help us on this project even if you are not blind or visually impaired. Please consider joining us! Here is how to become involved:<br />\n<ol><li>You need to register for a <a href=\"https://www.codeplex.com/site/register\">free code plex account</a> but only if you want to be a programmer on the project. I found it easier to sign up for a new code plex account rather than assigning my windows live id to a code plex account.</li>\n<li>Please email your code plex user name to <a href=\"mailto:jdaubenmire@gmail.com\">myself Justin Daubenmire</a> so I can add you to the list of programmers who can actually commit source code to the project. I will then reply to you when your user name has been added as a programmer to the project and provide you with some more details.</li>\n<li>If you do not have Jaws installed on your computer, please download a demo copy of the <a href=\"http://www.freedomscientific.com\">Jaws For Windows Screen reader version 12</a> and install it on your computer. The demo of Jaws will speak for 40 minutes and then you must reboot your computer to have Jaws speak for another 40 minutes.</li>\n<li>For committing source code to the project, you should download and install <a href=\"http://www.visualsvn.com/visualsvn/download/tortoisesvn/\">TortoiseSVN</a> which is a free Windows Subversion client. </li>\n<li>You may also want to download  a visual studio 2010 add-in that lets you commit source code to a subversion repository from directly within vs 2010 called <a href=\"http://www.visualsvn.com/visualsvn/download/\">Visual SVN</a>. A free open source visual svn registration code will be provided to any programmer who contributes to the project.</li></ol>\n<br />Note: you will want the visual svn add-in, not the visual svn server.<br />\n<h2>Features</h2>\rSome initial features that the add-in will support may include:\n<ul><li>Enhanced code editor and intellisense support</li>\n<li>Enhanced menu bar support</li>\n<li>Enhanced context menu support</li>\n<li>Debugger windows</li>\n<li>Error notifications in the code editor</li>\n<li>WPF designer</li>\n<li>ASP.NET designer</li>\n<li>Windows forms designer</li></ul>\n\n<h2>Learning Materials</h2>\rYou can extend Visual Studio 2010 by automating its features or by adding your own features. Visual Studio includes a rich programming model, which is known as the Automation model, for extending and automating the integrated development environment (IDE). <br /><br />Here are some great getting started resources:<br />\n<ol><li><a href=\"http://msdn.microsoft.com/en-us/library/5abkeks7.aspx\">Creating Addins and Wizards</a></li>\n<li><a href=\"http://msdn.microsoft.com/en-us/vstudio/vextend.aspx\">Extending Visual Studio 2010</a> </li>\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ms228776.aspx\">How to: Control the Code Editor (Visual C#)</a></li>\n<li><a href=\"http://msdn.microsoft.com/en-us/library/f7fb383x.aspx\">Debugging an Add-In Project</a></li></ol>\n<br />Note: the related projects section shows projects that use vs 2010 extensions. They are not related to screen readers. I list them as code samples that people can look at to gain an understanding on how to manipulate the code editor in visual studio 2010 and then use that knowledge to enhance the jaws add-in.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "jaws for windows,screen reader,visual studio,add-in,extensibility,blind,extensions,Automation,Guidance Automation,",
  "LastEdited": "2011-01-13T04:41:06.497-08:00"
}