{
  "ProjectName": "KinectSkinColor",
  "Title": "KinectSkinColor",
  "Description": "Sample Windows 8.1 and .Net WPF which shows how to use the HD Face and HD Face Builder to determine the skin and hair color of a tracked body.",
  "MovedLink": "https://github.com/dngoins/kinectskincolor",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Sample Windows 8.1 and .Net WPF which shows how to use the HD Face and HD Face Builder to determine the skin and hair color of a tracked body.<br /><br />This project displays how to utilize the Kinect for WIndows v2 HD Face and Face Builder to determine the Skin color and  Hair color of a tracked user. This solution only works with Kinect for Windows v2.<br /><br />There are three projects in the solution:<br />- Modified version of the HD Face Basics - demonstrates how to get the skin color from the Face Model builder and Face Model classes.<br />- Modified HDPanelRender - demonstrates how to  change the pixel shader to the color of the tracked persons face.<br />- WPF .Net application which shows the basics behind how to use the Face Model and Face Builder to extract the skin and hair color<br /><br />To build the projects download the source code and open with Visual Studio.Net 2013. <br />To run the projects, first copy the NuiDatabase folder and contents to the \\bin\\x64\\Debug folder, or location where your executable is copied to after building the projects.<br /><br />The NuiDatabase folder and contents can be found in the Microsoft Kinect for Windows v2 SDK installation path. By default this is C:\\Program Files\\Microsoft SDKs\\Kinect\\v2.0_1409\\Redist\\Face\\x64<br /><br />More information can be found here:<br /><a href=\"http://dgoins.wordpress.com/2015/03/21/my-kinect-told-me-i-have-dark-olive-green-skin/\">http://dgoins.wordpress.com/2015/03/21/my-kinect-told-me-i-have-dark-olive-green-skin/</a><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Kinect,HD Face,Skin Color,Hair Color,Kinect v2,K4W,Face,Face Tracking,",
  "LastEdited": "2015-03-29T08:13:41.387-07:00"
}