{
  "ProjectName": "labOfThingsAnalytics",
  "Title": "Microsoft Lab of Things Analytics Engine",
  "Description": "This is a project by students at University College London. We are creating analytics that will add value to home automation leveraging Microsoft Lab of Things.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Project Description</h2>\r\n<i>Microsoft Research</i> have introduced an open platform for research in devices and services on the cloud  called <a href=\"https://labofthings.codeplex.com/\">Lab of Things</a>. The platform includes a number of features such as remote monitoring, sample apps, support for additional devices, etc. <br /><br />We believe that there is a gap in the market when it comes to analysing data collected from devices running on platforms such as <i>Lab of Things</i> deployed in homes, hospitals, gyms, schools and other locations.<br /><br />We call for the development of an Analytics Engine (AE), which provides a solution to analyse data collected from platforms such as HomeOS or experiments/research mentioned above. The salient features of our Analytics Engine (AE) are <br />\n<ul><li>AE enables easy integration of different platforms like HomeOS, LoT and IoT which can easily send   device data to AE. </li>\n<li>AE provides data analytics for data collected from various research groups and for a wide scope of use case scenarios.</li>\n<li>AE provides HTTP based APIs which makes it easily pluggable to an internal/external client for example a Windows 8 Application.</li>\n<li>AE provides a simple interface to the user to query and analyze data. </li></ul>\n<br />The analytical models provided by the Analytics Engine allow the user to compare usage patterns of devices, compare data sets and find anomalies. Additionally we provide the capability of running custom R scripts, which allows the users to use other statistical models (provided by R) but not directly implemented in the Analytics Engine. <br /><br /><b>This is a project by students at University College London.</b></div><div class=\"ClearBoth\"></div>",
  "TagList": "Analytics,Home Automation,HomeOS,Research,UCL,Big Data,Hadoop,",
  "LastEdited": "2013-09-12T15:40:29.46-07:00"
}