{
  "ProjectName": "ltaf",
  "Title": "Lightweight Test Automation Framework",
  "Description": "The Lightweight Test Automation Framework for ASP.NET was developed and is currently used by the ASP.NET QA Team to automate regression tests for the product. It is designed to run within an ASP.NET application.\r\n\r\nTests can be written in any .NET Framework language. They use an AP",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1><b>Note!!!</b></h1>\rAfter 4 years we decided to discontinue LTAF project and are not planning any further releases or bug fixes. It will be officially discontinued starting 08/25/2014.  Nuget packages with latest version of LTAF and LTAF.Infrastructure can still be downloaded from www.nuget.org. If needed one could contact owners through nuget package web page if there any questions. <br />\n<h1><b>Intro</b></h1>\r\nThe Lightweight Test Automation Framework (LTAF) for ASP.NET is an open source project that was developed and is currently used by the ASP.NET QA Team to automate regression tests for the product. It is designed to run within an ASP.NET application.<br />Tests can be written in any .NET Framework language. Tests use an API to manipulate and verify the DOM of the browser. The Lightweight Test Automation Framework supports running tests in Microsoft Internet Explorer, Mozilla Firefox, Apple Safari, and Opera. In addition, LTAF provides an emulated UI-less version of the browser, that simplifies scenarios when LTAF tests live in some larger automated tests projects, unit tests for example.<br />\n<h1><b>Releases</b></h1>\r\n<ul><li><i><a href=\"https://aspnet.codeplex.com/releases/view/35501\">LTAF v1.0</a></i>. Was released in November 2009 at ASP.NET QA codeplex page and had pretty good audience. Please check page for <a href=\"https://aspnet.codeplex.com/releases/view/35501\">LTAF v1.0</a> for more details or small samples document displaying  simplest use cases.</li></ul>\n\t\n<ul><li><i>LTAF v2.0 (this release)</i>. Starting this release LTAF becomes fully open source (as opposed to the first version) and everyone can contribute and help this project to evolve. New features in LTAF v2.0:\n<ul><li>Refactoring of the solution structure and change of the naming convention for assemblies and namespaces. Previously <a href=\"https://aspnet.codeplex.com/releases/view/35501\">LTAF v1.0</a> was still owned my ASP.NET QA and had Microsoft.Web.Testing in assembly and  namespace names. Now, when it is completely open source, we decided that it is a good time to substitute Microsoft.Web.Testing with shorter and more convenient name LTAF.</li>\n<li>New feature BrowserEmulator was added. BrowserEmulator is a lightweight UI-less browser that is suitable for simple scenarios and is very handy for automated test execution when NO UI is a requirement.</li>\n<li>Bug fixes.</li>\n<li><a href=\"http://nuget.org/packages/ltaf/2.0.0\">LTAF NuGet package</a> was added to common NuGet feed, check this <a href=\"http://nuget.org/packages/ltaf/2.0.0\">page</a> for package details.</li></ul></li></ul>\n\t\t\n<h1><b>Get Started</b></h1>\r\nTo get started, download latest suggested release and check out SamplesWebSIte, which is similar to the samples web site of version v1.0 (in meanwhile while documentation for LTAF v2.0 is being developed, please check out samples document for <a href=\"https://aspnet.codeplex.com/releases/view/35501\">LTAF v1.0</a>).<br /><br />More detailed documentation is still being developed and will be added to codeplex project Documentation tab along the way. However contributors are very welcome to suggest any ideas or samples.<br />\n<h1><b>Get Involved</b></h1>\r\nDetailed document for contributor is under development. In meanwhile, you are welcome to pull existing sources and propose your  feature or changes. However, before anything may be checked in you change should be discussed, approved and should pass code review by one of the coordinators. Please feel free to start discussion or post your ideas!</div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,MVC,Webages,testing framework,Testing,Test,test automation,Test Case,integration test,",
  "LastEdited": "2014-08-20T08:28:07.413-07:00"
}