{
  "ProjectName": "massmailing",
  "Title": "Mass Mailing",
  "Description": "Mass Mailing is an application to allow for mailing of a single email to a large email list. It is written in c# with a WPF front end. Allows for attachments, multiple smtp servers, and burst control.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Mass Mailing is an application to allow for mailing of a single email to a large email list. It is written in c&#35; with a WPF front end. Allows for attachments, multiple smtp servers, and burst control.<br /><br /><b>Features</b>\n<ul><li>Ability to specify Smtp Server(s)</li>\n<li>Ability to specify Email Addresses in Excel 2007+ (32 bit only), Excel 97-2003, or CSV based on Linq to Excel Project</li>\n<li>Ability to add Attachments</li>\n<li>Ability to specify From email address</li>\n<li>Ability to specify Subject of email with &quot;[name]&quot; and &quot;[email]&quot; replacements from Email Address information</li>\n<li>Ability to specify Body of email with &quot;[name]&quot; and &quot;[email]&quot; replacements from Email Address information</li>\n<li>Parallel execution of emails being sent and awaiting response from smtp server</li>\n<li>Dialog to show status of emails being sent with the following:\n<ul><li>Number of emails sent and waiting for feedback from Smtp Server.</li>\n<li>Total to be sent</li>\n<li>Successfully Sent</li>\n<li>Errors generated when sent (Each email is retried 3 times before final error is displayed)</li>\n<li>Progress Bar for progress until all emails have responded from server.</li></ul></li></ul>\n<br /><b>Quick Start Walkthrough</b><br />\n<ol><li>Go to File -&gt; Settings and specify smtp server with port and credentials if needed</li>\n<li>Browse for an excel file with a column header of &quot;Email&quot; and optionally another column header of &quot;Name&quot;</li>\n<li>Click Add Attachment and browse if attachments are needed on the email</li>\n<li>Specify a From, Subject, and Body (In html... however new lines will be replaced with &lt;br/&gt; tags for you)</li>\n<li>Click Send and click yes if you are sure</li>\n<li>Wait until all emails are sent then click done unless you want to cancel in the middle of sending then close dialog with normal x on top right.</li></ol>\n<br />A more detailed walkthrough can be found under <a href=\"https://massmailing.codeplex.com/documentation?referringTitle=Home\">documentation</a>.<br /><br />*Important note:<br /><br />If you&#39;re not aware there are limits on the number of emails you can send with free accounts such as gmail, yahoo, and hotmail. Your account will be banned for a full day. However I have a google apps account and in order to send out through the smtp gmail server at the time of writing there was a 100 email max limit. I also had to adjust that only 8 emails went out at a time and there was 2 minute delay between each burst.<br /><br />Please let me know of any issues that you find.<br /><br />Also feel free to include any enhancements.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-10-27T14:34:28.11-07:00"
}