{
  "ProjectName": "Mayhem",
  "Title": "Mayhem",
  "Description": "Mayhem is an open source application with a near-zero learning curve.  Mayhem provides a collection of triggers events and reactions, allowing non-programmers to use their computers to automate… anything! What sort of things? Chase your cat off the couch automatically. Receive a text message when your physical mail arrives. Advance to the next slide in your presentation when you wave your hand. Update your Facebook status when the weather changes. The possibilities are endless.\r\n\r\nThe key to Mayhem is that it only supports a single programming construct – when an event happens, do a reaction. This is what makes it so easy for everyone to understand. Mayhem can easily tie together disparate things such as home automation devices, social networking sites, media devices, messaging, office productivity tools, webcams, musical instruments, etc. Virtually anything that can produce or receive a trigger can be easily incorporated into the Mayhem framework.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>This project is no longer active and was put into the Outercurve Project Archive on 26-09-2013. The last release of the software is still available at\r\n<a href=\"https://mayhem.codeplex.com/releases/view/82086\">https://mayhem.codeplex.com/releases/view/82086</a> and the software repositories are still readable at the following URLs:</strong></p>\r\n<ul>\r\n<li><a href=\"https://mayhem.codeplex.com/SourceControl/latest\">https://mayhem.codeplex.com/SourceControl/latest</a>\r\n</li><li><a href=\"https://mayhemlibs.codeplex.com/SourceControl/latest\">https://mayhemlibs.codeplex.com/SourceControl/latest</a>\r\n</li><li><a href=\"https://mayhemmodules.codeplex.com/SourceControl/latest\">https://mayhemmodules.codeplex.com/SourceControl/latest</a>\r\n</li><li><a href=\"https://mayhemphone.codeplex.com/SourceControl/latest\">https://mayhemphone.codeplex.com/SourceControl/latest</a>\r\n</li><li><a href=\"https://mayhemserver.codeplex.com/SourceControl/latest\">https://mayhemserver.codeplex.com/SourceControl/latest</a>\r\n</li></ul>\r\n<p><strong>However, further work has been suspended at this time. Please contact the Outercurve Foundation at\r\n<a href=\"mailto:info@outercurve.org\">info@outercurve.org</a> if you require more information.</strong></p>\r\n<hr>\r\n<h1 style=\"text-align:center; font-size:26pt; margin-bottom:-20px\">WELCOME</h1>\r\n<p><img title=\"dev-prev.jpg\" src=\"http://i3.codeplex.com/Download?ProjectName=mayhem&DownloadId=313334\" alt=\"dev-prev.jpg\" style=\"float:right; padding-left:.5em; margin-top:55px\"></p>\r\n<div>\r\n<h2 style=\"margin-bottom:0px\">Project Description</h2>\r\n<p style=\"text-align:justify; width:50%\"><a href=\"http://makemayhem.com\">Mayhem</a> is an open source application with a near-zero learning curve. Mayhem provides a collection of triggers events and reactions, allowing non-programmers to use their computers\r\n to automate&hellip; anything! What sort of things? Chase your cat off the couch automatically. Receive a text message when your physical mail arrives. Advance to the next slide in your presentation when you wave your hand. Update your Facebook status when\r\n the weather changes. The possibilities are endless.<br>\r\n<br>\r\nThe key to Mayhem is that it only supports a single programming construct &ndash; when an event happens, do a reaction. This is what makes it so easy for everyone to understand. Mayhem can easily tie together disparate things such as home automation devices,\r\n social networking sites, media devices, messaging, office productivity tools, webcams, musical instruments, etc. Virtually anything that can produce or receive a trigger can be easily incorporated into the Mayhem framework.</p>\r\n</div>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2013-10-25T13:55:13.207-07:00"
}