{
  "ProjectName": "milsym",
  "Title": "Military Symbology",
  "Description": "MilSym provides C# WPF & Silverlight 4.0, XAML-based, Bing & Esri map symbology for units, equipment, installations, tactical graphics, weather, oceanography, signals intelligence, stability ops, & emergency management. Implements MIL-STD 2525C appendices A, B, C, D, E, and G.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />MilSym provides C&#35; WPF &#38; Silverlight 4.0, XAML-based, Bing &#38; Esri map symbology for units, equipment, installations, tactical graphics, weather, oceanography, signals intelligence, stability ops, &#38; emergency management. Implements MIL-STD 2525C appendices A, B, C, D, E, and G.<br /><br />Figure 1     Sample output from BingMapTest shows single-point symbols in bounding boxes <br /><img src=\"http://milsym.codeplex.com/download?DownloadId=109904\" alt=\"BoundingBoxes\" title=\"BoundingBoxes\" /><br />The base of each bounding box remains located at the specified point as the map zooms and the symbol resizes.<br /><br />Figure 1a    Sample output from EsriMapTest shows multi-point symbols running in Esri Silverlight map with Bing background<br /><img src=\"http://download.codeplex.com/download?ProjectName=milsym&amp;DownloadId=214130\" alt=\"EsriZoom\" title=\"EsriZoom\" /><br />Figure 1b    Sample output from BingMapTest shows multi-point symbols running in Bing Silverlight map <br /><img src=\"http://download.codeplex.com/download?ProjectName=milsym&amp;DownloadId=214131\" alt=\"BingZoom\" title=\"BingZoom\" /><br /><br />The code is written in C# for WPF .NET 4.0 and Silverlight 4.0 and consists primarily of XAML files with some support code. This code drop covers all of the MIL-STD 2525C single point symbol collection. The WPF work is very new. Thus far, only the GraphicsTest program and the associated Resource Dictionaries (that exercise all single point symbology) have been ported to WPF.<br /><br />The ESRI map work is even newer. Initial ports to Silverlight and WPF are complete. There are some abstractions to preserve a common code base with Bing maps - ILocation, ILocationCollection, ILocationRect, and IMilSymLayer. A single factory with support for these types is injected - this may change in the future. <br /><br />The ESRI map work is limited to WKIDs 102113 and 102100. Otherwise the generated tactical graphics don&#39;t register properly witth their underlying vector definitions. For example, WKID 4326 compresses the latitude coordinate differently than WKID 102113. Support for other  coordinate systems would require some abstraction of the coordinate mapping. The current technique of using ScaleTransform to properly size the results also limits potential coordinate mappings.<br /><br />Multi-point symbology work is in progress. The latest drop includes some work on two-, three- and multi-point symbols (arrows, zones, lines) from Appendix B. The continuing effort will be on Appendix B&#39;s multi-point items, then Appendix C&#39;s multi-point items, then interactivity. Other potential efforts include dynamic loading of resources to reduce memory footprint.<br /><br />For reference, the official symbology appendices are:<br /><br /><table><tr><th> Appendix </th><th> Description </th><th> Status</th></tr>\n<tr><td> A </td><td> C2 Symbology for Units, Equipment, and Installations </td><td> Complete</td></tr>\n<tr><td> B </td><td> C2 Symbology for Military Operations </td><td> Point symbology and some multi-point symbology</td></tr>\n<tr><td> C </td><td> Meteorological and Oceanographic Symbology </td><td> Point symbology only</td></tr>\n<tr><td> D </td><td> Signals Intelligence Symbology </td><td> Complete</td></tr>\n<tr><td> E </td><td> Stability Operations Symbology </td><td> Complete</td></tr>\n<tr><td> F </td><td> Use of Warfighting Symbols in Pseudo-Three-Dimensional Displays </td><td> Not applicable </td></tr>\n<tr><td> G </td><td> Emergency Management Symbols </td><td> Complete</td></tr></table><br /><br />Appendices A, B, and D cover symbology that has primary applicability to military operations. <br />The symbols in appendices C, E, and G have broader applicability. <br /><br />Appendix F simply describes different ways to use or display symbols in a 2.5D or 3D display. In the case of Silverlight, adding a skew transformation to a symbol for a 2.5D display is straightforward. Only the scale and rotate transforms are exposed in the MilSymbol interface for this release. The MapTest application, as shown in Figure 1, demonstrates the use of a translate transform.<br /><br />For those interested in symbology in general, the <a href=\"http://en.wikipedia.org/wiki/APP-6a\">APP-6A Wikipedia article</a> is a good introduction to the military symbology defined by <a href=\"http://milsym.codeplex.com/download?DownloadId=99498\">MIL-STD 2525C</a>.<br /><br />The workhorse of this application is a ResourceDictionary of ControlTemplates (subject to future optimization) representing base symbols. A symbol code specifies a control template that is then rendered using either default or user-specified brushes for fills and outlines. The resulting symbol is then overlaid with label, echelon, mobility and other symbol decoration. The result is returned as a MilSymbol object whose base class is Canvas. The interesting symbology parameters are exposed as dependency properties.<br /><br />This latest release includes content bounds for many single-point symbols to support their precise placement on the map.<br /><br />Additional information is available under Documentation. The source code is not yet &quot;released&quot; but the solution builds and displays all of the available symbology via the GraphicsTest project.<br /><br />Figure 2     Sample output from Appendix G as displayed by the GraphicsTest project<br /><img src=\"http://milsym.codeplex.com/download?DownloadId=99484\" alt=\"AppendixG\" title=\"AppendixG\" /><br /><br />Figure 3     Sample output from PivotTest after PAuthor is used on generated CXML file<br /><img src=\"http://milsym.codeplex.com/download?DownloadId=140646\" alt=\"Pivot\" title=\"Pivot\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-03-10T22:02:14.873-08:00"
}