{
  "ProjectName": "mvcpat",
  "Title": "MVC Pattern Toolkit (Sample)",
  "Description": "This is a sample showcasing a pattern toolkit which helps web developers create ASP.NET MVC web applications using advanced tooling and automation.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This is a sample showcasing a pattern toolkit which helps web developers create ASP.NET MVC web applications using advanced tooling and automation.<br /><br />This pattern toolkit is provided as a <b>sample</b> soley to demonstrate how easy pattern toolkits can be created that provide custom automation and tooling in Visual Studio to speed development.<br /><br /><i>Note: Pattern toolkits are created with <a href=\"http://nupattern.codeplex.com\">NuPattern</a></i><br /><br /><b>IMPORTANT NOTE</b>: This pattern toolkit is not intended to demonstrate <i>THE</i> official way to build ASP.NET MVC applications in Visual Studio. It is intended to demonstrate <i>A</i> way to do that from the perpective of a fictional development organization that has determined that this is to be the best way for their developers to build their kind of MVC applications.<br /><br /> It is implemented this way so that the organization can achieve high levels of consistency and manitainability in building their web applications on their own projects.<br />\n<ul><li>The toolkit demonstrates integrated automation, some nice abstractions and some very interesting code generation patterns that makes the plumbing for web forms simple. </li>\n<li>The toolkit is extensible, demonstrating how this particular organization intends to provide &#39;templates&#39; for their most common types of web forms. </li>\n<li>The toolkit also includes extensive guidance to help understand the things it builds.</li></ul>\n\n<h1>Getting Started</h1>\r\n<ol><li>Download &amp; Install the Toolkit (you will need Visual Studio 2010 or Visual Studio 2012 Pro/Premium or Ultimate) </li>\n<li>Create a new &#39;MVC Application&#39; project (File | New Project)</li>\n<li>Configure your MVC application from the &#39;Solution Builder&#39; tool window</li>\n<li>Browse the provided guidance in the &#39;Guidance Explorer&#39; tool window</li>\n<li>Follow the <a href=\"https://mvcpat.codeplex.com/wikipage?title=gettingstarted&referringTitle=Home\">Getting Started</a> guidance, and walkthrough some of the features of the sample toolkit to get a feel for how it rapidly accelerates ASP.NET MVC development.</li></ol>\n<img src=\"/projects/mvcpat/9fc23979-5bcc-45fa-a47e-6e5f8e82fb02\" alt=\"Create&#32;a&#32;New&#32;MVC&#32;Project\" title=\"Create&#32;a&#32;New&#32;MVC&#32;Project\" /><br /><img src=\"/projects/mvcpat/1444874f-cef8-4d1b-a772-a1d2f509cb63\" alt=\"Read&#32;the&#32;Guidance,&#32;Build&#32;the&#32;application\" title=\"Read&#32;the&#32;Guidance,&#32;Build&#32;the&#32;application\" /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2013-05-17T02:21:58.267-07:00"
}