{
  "ProjectName": "Nunitvs",
  "Title": "Nunit Visual Studio Addin",
  "Description": "This Addin is for Visual Studio 2012 and later versions. By installing this addin, you can launch the NUnit with the selected project. It will build the project",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />An addin that allows you to run and debug NUnit projects within Visual Studio without setting a start program in the debug options or attaching manually to an external process.<br /><br /><b>How does it Work ?</b><br />After installing the plugin you&#39;ll find a new submenu under the tools menu  and one NU image button for direct GUI:<br /><img src=\"https://www.codeplex.com/Download?ProjectName=nunitvs&amp;DownloadId=1543037\" /><br /> <br /><img src=\"https://www.codeplex.com/Download?ProjectName=nunitvs&amp;DownloadId=1543038\" /><br />It currently contains only three entries:\n<ul><li>NUnit Settings</li></ul>\n      This will open the settings dialog, which allows you to specify the location of the NUnit-GUI and            NUnit-Console.\n<ul><li>Run Using NUnit GUI and NU Image Button</li></ul>\n       This will start the GUI version of NUnit and attaches the debugger to it.\n<ul><li>Run using Console</li></ul>\n       *This will start the console version of NUnit and attaches the debugger to it.<br /><br />This will build the startup project and will automatically attach the debugger to the nunit-console.exe/GUI process from where you can debug the test case.<br /><br /><b>Why?</b><br /><br />On project I&#39;m currently working on we&#39;re using NUnit on the buildserver and MSTest/NUnit combo on the workstations. Since our test projects are MSTest projects we can&#39;t specify an alternate startup program to debug NUnit and even if we could it wouldn&#39;t help very much because every workstation installation differs in the location and version of NUnit. This addin will either locate NUnit automatically or a user can specify the location, which allows us to use both MSTest and NUnit within Visual Studio.</div><div class=\"ClearBoth\"></div>",
  "TagList": "VS Addin,NUnit,Test Debug,Debug,Unit Test Debug,Automation Testing,",
  "LastEdited": "2016-01-28T08:50:17.91-08:00"
}