{
  "ProjectName": "OpenTuner",
  "Title": "OpenTuner3800",
  "Description": "OBD-II scanner for the GM 3800 Series II and III engine which implement the VPW protocol which will be capable of using hardware from AVT (838 and 84x boards), ELM, and LS1M.  Eventual goal is to add PCM editing capabilities as well.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />OBD-II scanner for the GM 3800 Series II and III engine which implement the VPW protocol which will be capable of using hardware from AVT &#40;838 and 84x boards&#41;, ELM, and LS1M.  Eventual goal is to add PCM editing capabilities as well.<br /><br /><br />Using:<br /><br /><b><u>Development Tools</u></b><br />Visual Studio 2008, should work with the Express versions.<br />WPF<br />Silverlight<br />Compact Framework<br /><br /><b><u>Hardware</u></b><br />Laptop<br />Desktop<br />PocketPC<br /><br /><b><u>PCM Interfaces</u></b><br />AVT-838<br />AVT-84x<br />Elmscan<br />LS1M<br /><br /><b><u>File Storage</u></b><br />SQLite<br /><br /><b><u>Web Interface</u></b><br />LAMP+Silverlight<br />MySQL<br /><br />WPF will serve as the GUI, generally a canvas with re-positionable and selectable gauges for scanning parameters.<br />Data will be stored in a SQLite format with various interfaces to visualize the data, including the gauges above.<br />Data can be uploaded to a web server with a Silverlight front end to replicate the gauge cluster used on the desktop.<br />GDI version for PocketPC hardware and low end desktop/laptop systems.<br />PCM interfaces will be done one at a time, currently I have the AVT-838 and LS1M, but should be able to build the AVT-84x with few changes.  The documentation for the AVT-848 is available and used for building the AVT-838 interface.<br /><br />Additional project information may periodically be published at <a href=\"http://www.opentuner3800.com\">http://www.opentuner3800.com</a> to record my thoughts during the development process.<br /><br />If this project gets to the tuner stage, the plan of action is to disassemble only the minimum number of PCM&#39;s.  This would probably be 97, 2003, and something in the 1998-2002 model years.  No real point in doing every possible OSID.<br /><br /><a href=\"https://opentuner.codeplex.com/wikipage?title=AVT-838%20initialization%20commands&referringTitle=Home\">AVT-838 initialization commands</a><br /><a href=\"https://opentuner.codeplex.com/wikipage?title=Screenshots&referringTitle=Home\">Screenshots</a><br /><a href=\"https://opentuner.codeplex.com/wikipage?title=Flash%20Videos&referringTitle=Home\">Flash Videos</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "WPF,Visual Studio 2008,PocketPC,Silverlight,mysql,SQLite,Open3800Tuner,",
  "LastEdited": "2008-02-08T20:11:01.31-08:00"
}