{
  "ProjectName": "opengax",
  "Title": "Open GAX/GAT",
  "Description": "The Guidance Automation Extensions (GAX) expands the capabilities of Visual Studio by running guidance packages, which automate key development tasks from within the Visual Studio environment.  The Guidance Automation Toolkit (GAT) allows authoring of guidance packages.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1><b>IMPORTANT NOTE: THIS PROJECT HAS MOVED</b></h1>\r\n<h1>The project is no longer maintained here but archived at <a href=\"https://github.com/MicrosoftArchive/OpenGAX\">https://github.com/MicrosoftArchive/OpenGAX</a></h1>\r\n<hr />\n\n<h1>Introduction</h1>\rThe Guidance Automation Extensions &#40;GAX&#41; expands the capabilities of Visual Studio by running guidance packages, which automate key development tasks from within the Visual Studio environment.  The Guidance Automation Toolkit &#40;GAT&#41; allows authoring of guidance packages.<br /><br /><b>Feb 15, 2012</b><br /><b>Note:</b> This is the open-sourced version of the GAX/GAT 2010 originally built by <a href=\"http://msdn.com/practices\">Microsoft patterns &amp; practices</a>. While the official binaries are still available from the <a href=\"http://visualstudiogallery.msdn.microsoft.com/25e4b5e9-65e4-4950-967d-5f1e6a9dcbeb/?lc=1033\">Visual Studio Extension gallery</a>, Microsoft no longer maintains this project and no future releases are planned. <br /><br />Any further development of the GAX/GAT assets is undertaken by the community. <br />\n<h1>Featured Projects</h1>\rBelow you can find projects that are using Open GAX/GAT. If you want to see your project listed, feel free to post a comment or discussion topic.<br />\n<h3><a href=\"http://layerguidance.codeplex.com/\">Layered Architecture Solution Guidance (LASG)</a></h3>\r\nLayered Architecture Solution Guidance (LASG) is a software factory that offers a set of tools and guidance aimed at simplifying and accelerating the development of layered applications. It extends Visual Studio (both 2010 and 2012) to provide a set of solution templates and code generators to help automate various repetitive tasks.<br /><br />LASG follows the project structure that is illustrated in <a href=\"http://layersample.codeplex.com/\">Layered Architecture Sample for .NET</a>. but enhances it further with automation tools to help beginner developers to quickly get up to speed with layering concepts.<br />\n<h3><a href=\"http://bsf.codeplex.com/\">BizTalk Software Factory</a></h3>\r\nBizTalk Software Factory can be used to develop BizTalk solutions using a consistent solution structure.<br />\n<h3><a href=\"http://spsf.codeplex.com\">SharePoint Software Factory</a></h3>\r\nThe SharePoint Software Factory is a Visual Studio Extension helping SharePoint newbies, as well as experienced developers to create, manage and deploy SharePoint solutions without having to know every tiny XML and C# secret. <br /><br />SPSF provides a huge collection of helpful recipes for development, debugging and deployment of SharePoint standard artifacts and is fully compatible with SharePoint 2007/2010/2013 and Visual Studio 2008/2010/2012.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2017-01-16T08:11:09.01-08:00"
}