{
  "ProjectName": "powerclinavigator",
  "Title": "PowerCLI Navigator",
  "Description": "PowerCLI Navigator is a PowerShell host application meant to improve system administrators' experience with VMware PowerCLI and vSphere management automation.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>What Is PowerCLI Navigator?</strong></p>\r\n<p>PowerCLI Navigator is a PowerShell host application meant to improve system administrators' experience with VMware PowerCLI and vSphere management automation. It supplements PowerCLI with GUI features, most notably an inventory tree.</p>\r\n<p><img src=\"/projects/powerclinavigator/e7e1655d-0bb3-4866-a6f9-af031bcabae7\" alt=\"Screenshot\" width=\"615\" height=\"340\"></p>\r\n<p><strong>Getting Started</strong></p>\r\n<ol>\r\n<li>You must have Microsoft .NET 2.0 installed </li><li>You must have PowerCLI installed </li><li>Download PowerCLI Navigator </li><li>Unzip to PowerCLI install folder (e.g. &quot;C:\\Program Files (x86)\\VMware\\<em>Infrastructure</em>\\vSphere\r\n<em>PowerCLI</em>&quot;). Be careful to unzip to the correct folder. PowerCLI Navigator will fail to start if run from any other folder!\r\n</li><li>Run PowerCliNavigator.exe </li><li>Use Connect-VIServer to connect as usual </li></ol>\r\n<p><strong>Reporting Issues</strong></p>\r\n<p>PowerCLI Navigator is making its first steps and surely does not lack bugs. Use the&nbsp;<a href=\"https://powerclinavigator.codeplex.com/workitem/list/basic\" target=\"_blank\">issue tracker</a> and the\r\n<a href=\"https://powerclinavigator.codeplex.com/discussions\" target=\"_blank\">discussion pages</a> to report issues. Bug reports are much appreciated so please don't be shy :)</p>\r\n<p>You have to sign in before you can post. I know it's frustrating but CodePlex - the platform hosting this website - does not seem to allow anonymous posts. If you don't have a Microsoft account, the following is the path of least resistance:</p>\r\n<p>Try to post &gt; Redirected to sign in page &gt; Register for CodePlex &gt; CodePlex Login &gt; Submit registration form &gt; Go to your mailbox and click on the account activation link</p>\r\n<p>&nbsp;<strong>More from the Author</strong></p>\r\n<p>Dear fellow scripting guy,</p>\r\n<p>PowerCLI Navigator is a PowerShell host application meant to improve your experience with VMware PowerCLI and vSphere management automation. I plan to build two versions of the the program:</p>\r\n<ul>\r\n<li>A free version which basically adds a vSphere inventory tree to the left of the PowerCLI console.\r\n</li><li>A paid version which blends GUI-based automation and scripted automation. My vision is for a tool which lets you automate as much as it is practical through a GUI, then supports convenient switch to scripting where GUI no longer suffices.\r\n</li></ul>\r\n<p>Today only the free version exists and it is quite unpolished and - I'm pretty sure - buggy. I strongly rely on your feedback, here in the project discussion pages at CodePlex. Both for bug reports and for complaints about how the current design is horrible\r\n and &quot;whoever created this thing knows nothing about building software&quot; :) Seriously. You will be using the software more than I, so you will see issues I have missed and you will sometimes have a better idea about what functionality is missing. When that happens,\r\n let me know and I'll fix things as soon as possible.</p>\r\n<p>Now, about the paid version: PowerCLI is great but I think I can make it even better by adding some GUI to it. At the end of the day, the goal is to help you do your job as easily as possible. I cannot afford to do this as a hobby but I do recon I can make\r\n the tool useful to a sufficient number of admins to keep the individual license pretty cheap. My hope is I can make it viable at about $15 per license.</p>\r\n<p>Give the free tool a try and let me know what you think about it!</p>\r\n<p>Sincerely yours,<br>\r\nScriptItGeorge</p>\r\n<p>&nbsp;</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-06-22T05:38:18.857-07:00"
}