{
  "ProjectName": "regexpress",
  "Title": "RegExpress",
  "Description": "RegExpress is a WPF application that combines interactive demos of regular expressions with slide content. This was designed for a user group presentation to minimise switching between slides and technical demos. Other potential uses would be regex prototyping and testing.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Summary</h1>\rRegExpress is a WPF application that combines interactive demos of regular expressions with slide content. This was designed for a user group presentation to minimise switching between slides and technical demos. Other potential uses would be regex prototyping and testing.<br /><br />\n<h1>Background</h1>\r\nRegExpress was originally developed to demonstrate regular expressions in a presentation to the Wellington .NET User Group. Drawing inspiration from Bea Stollnitz&#39;s presentations on WPF features (as explained in her <a href=\"http://bea.stollnitz.com/blog/?p=49\">blog post here</a>), RegExpress integrates the slide content from this presentation with the technical demos. The key advantage of this is the minimisation of the need to switch between the slides and IDE as separate applications.<br /><br />Because the demos are integrated in the slides, the presentation allows a greater degree of interactivity - other test cases are able to be easily demonstrated outside those that were &#39;part of the script&#39;.<br /><br />The solution is also flexible enough that it can be used for prototyping and testing regular expressions for other applications, whether validating input, extracting data or performing search &amp; replace.<br /><br />\n<h1>Technical Features</h1>\r\n<ul><li>Implemented using Windows Presentation Foundation (WPF) and the Model-View-ViewModel (MVVM) pattern</li>\n<li>Slides are defined in an XML file that is loaded at run-time</li>\n<li>Each slide type may potentially use several different slide templates, e.g. ImageSlide has two templates: DiagramPage and ImagePage</li>\n<li>Restarting the application displays the slide that was previously displayed</li>\n<li>Captured groups are able to be listed by both numerical and string indices</li>\n<li>Regular expressions can be configured to be case-insensitive, whitespace-insensitive, etc.</li>\n<li>Keyboard commands are defined in the ViewModel and operate on a hierarchical basis according to control context</li>\n<li>Data binding to a ViewModel works from inside pages, not just the window hosting the navigation frame.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-03-08T02:32:00.077-08:00"
}