{
  "ProjectName": "sarra",
  "Title": "Speach App Running Realtime Automation",
  "Description": "a simple text to speech interaction program, that I used at first as an alarm clock. But could be expanded to a unlimited number of projects.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />a simple text to speech interaction program, that I used at first as an alarm clock. But could be expanded to a unlimited number of projects.<br /><br />Sarra will be a stripped down version of the &quot;jarvis&quot; like app that I wrote back in 2009 as an alarm clock app. Many of the code values will be hard coded, or put in the app config. The application will be written outside of visual studio (one of my first) inside of Xamiran studio, since this app will be written with the intent of running on a raspberry pi running linux.<br /><br /><br />This app had a number of iterations from being a text to speech based music player, to a speech only alarm clock, at first using MS Agents, and then .Net&#39;s text to speech API. I really didn&#39;t know what to name it, and when the first Iron man came out I named it JARVIS, only to back down from the name. I just made up SARRA on the fly as a name, with some description as to what it does. From a directional standpoint. I wanted to create an xml language that you could program against, with plug and play DLL&#39;s that can be plugged in. If someone wants to go ahead and complete that feel free to. If there are any project I write that can be spun off a million directions, this would be it. For now, the app will stand as a standalone &quot;alarm&quot; clock, pulling data from the web, and pushing it out. It can format it as Wav file, or as a audio sound. I also plan on forking this to an app for the raspberry pi, running it on such a small low powered device I think is ideal. This app was originally written back in 2007, and some of its original source code came from open sourced projects. Since then, all of that code has been removed. Not sure what direction this project will go next. I found it fascinating though what routes you could take interact with your PC the same way you do with people. At one point, I wanted to merge it with an AOL based AI chatbot that AOL was working on to see what kinds of interaction I could create with it, but that never panned out.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2016-02-24T16:40:48.52-08:00"
}