{
  "ProjectName": "sharepointmoa",
  "Title": "SharePoint Mobile OA Platform",
  "Description": "Via mobile device, by using the SharePoint Mobile Support, Web Service, Client OM, WCF Data Service bring about mobile office.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Via mobile device, by using the SharePoint Mobile Support, Web Service, Client OM, WCF Data Service bring about mobile office.<br /><br /><br />Employees, especially the ones who in charge of management could not promise to work in the office all the time. By using a smart phone, or a Pad, you would get very thing in a short time when you need it.<br /><br /><b>Project Objectives</b><br />\n<ol><li> Realizing the mobile PC: including the usual PC operations \n<ul><li>open the document from the SharePoint Server. Through the Office Mobile to open the documents from the document library,  check the e-mail attachment, carry out the limited edit, and share the document version.</li>\n<li> through the Outlook Mobile to open  Team Contacts,  Team Schedules, the Team Tasks, Push E-mail.</li>\n<li> through the Internet Explorer Mobile to open SharePoint Mobile homepage. To handle the basic request about view and property modify.</li>\n<li>Office Communicator Mobile or Web Access support</li>\n<li>Windows Live for mobile support</li>\n<li> the Federated search of Bing Search</li>\n<li>Windows Media Player support, to open the multimedia conference materials.</li>\n<li>Windows Live Hotmail support, to handle the internal and external e-mails.</li></ul></li>\n<li> visiting the SharePoint document from the e-mail: SharePoint always is regarded as the portal website in the enterprise internal. There are many document resources being put on SharePoint. Being use of  the Exchange Server as the switching station, the users could obtain the SharePoint documents through the Mobile device. This manner could increase the access convenience  to the enterprise internal documents. and ensure that we could get the latest document version.</li>\n<li> Search Integration: the advantage of the Server-side lies in the information capacity and retrieval ability. Through assistance of SharePoint Server and Exchange Server, to appoint the inquiry property directly, and get the matching items.</li>\n<li> Outlook Calendar Integration: Calendar is an excellent time management tool. Through the calendar, the out of office assistant program,avoid conflicts.</li>\n<li> Coordinate with SharePoint meeting workspace: processing meeting invitations, reply, refuse</li>\n<li> Exchange Direct Push support: User can receive a new e-mail message immediately.</li>\n<li> Digging Microsoft.SharePoint.MobileControls potential so that it can be applied to more scenarios.\n<ul><li> custom SharePoint mobile page render process</li>\n<li> reusable control template</li>\n<li> custom  mobile home page redirect</li>\n<li> custom mobile blog home page redirect</li>\n<li> the use of browser definition file</li></ul></li>\n<li> SharePoint workflow mobile approval: to ensure the workflow process smoother</li>\n<li> knowledge sharing environment\n<ul><li> mobile phone directly record and publish to SharePoint</li>\n<li> application integration: integrate 3rd LOB systems through SharePoint platform. Then through the mobile browser to  view data and do some operations.</li></ul></li></ol>\n<br /><b>Screenshots taken from the application</b><br />*Windows Mobile 6.x (tested on 6.1 and 6.5) and SharePoint 2007.<br /><br /><img src=\"/projects/sharepointmoa/ef6700ad-baac-43e8-839b-f23faafbb5c7\" alt=\"2012-09-03_234200.jpg\" title=\"2012-09-03_234200.jpg\" /><img src=\"/projects/sharepointmoa/d660fefb-84fa-41fb-81f3-2cb9d25c2842\" alt=\"2012-09-03_234224.jpg\" title=\"2012-09-03_234224.jpg\" /><br /><img src=\"/projects/sharepointmoa/be8fcc5c-74d7-4a65-9220-d47889eb5be0\" alt=\"2012-09-03_234237.jpg\" title=\"2012-09-03_234237.jpg\" /><img src=\"/projects/sharepointmoa/8e071fa0-b68f-4514-9051-ea4baa4b6af8\" alt=\"2012-09-03_234248.jpg\" title=\"2012-09-03_234248.jpg\" /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "SharePoint,Mobile,Office Automation,",
  "LastEdited": "2012-09-03T08:48:04.267-07:00"
}