{
  "ProjectName": "sharepointonlineautomationcmdlets",
  "Title": "SharePoint Online Automation Cmdlets",
  "Description": "SharePoint Online PowerShell cmdlets to help automated deployments in SharePoint Online.\r\nUse PowerShell scripts to deploy your solutions to SharePoint Online.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Now able to add apps to webs</b><br /><br /><b>Project Description</b><br />SharePoint Online PowerShell cmdlets to help automated deployments in SharePoint Online.<br />Use PowerShell scripts to deploy your solutions to SharePoint Online.<br /><br /><br /><b>Latest Release Updates</b>\n<ul><li>PowerShell help for all cmdlets is available and help is also searchable within this site. <a href=\"https://sharepointonlineautomationcmdlets.codeplex.com/documentation?referringTitle=Home\">Documentation</a></li>\n<li>Added some Get-SPO* cmdlets</li>\n<li>Piping is now available for most cmdlets</li>\n<li>PowerShell default formats have been added to allow printing of Site/Web etc (try <a href=\"https://sharepointonlineautomationcmdlets.codeplex.com/wikipage?title=Get-SPOSubWebs&referringTitle=Home\">Get-SPOSubWebs</a>)</li>\n<li>Install/Uninstall/Update SPOSolution have all been updated to take the filename instead of the list item id.</li>\n<li>Parameters are no longer positional to make sure scripts are readable/understandable</li></ul>\n<br /><b>Note</b> (only applies to old versions)<br />If you receive &quot;The property or field &#39;FieldName&#39; has not been initialized&quot; errors, these are because not all fields are loaded by default (default output will try to print all fields). This can be prevented by assigning the result of the cmdlet to a variable instead of printing.<br /><br /><b>Idea and Direction</b><br />These cmdlets have been created to automate some of the common tasks performed in SharePoint Online. For instance publishing all files in particular folders, deleting all subwebs in a site collection and hooking up managed metadata fields to term sets. They use the SharePoint Client Side Object Model (CSOM) currently but seeing as they are just C# classes other techniques could be used to overcome the limitations of CSOM (solution activation?). They can also be used to complement the SharePoint management cmdlets <a href=\"http://www.microsoft.com/en-us/download/details.aspx?id=35588\">http://www.microsoft.com/en-us/download/details.aspx?id=35588</a>. <br /><br />The <i>dream</i> for this project is to provide scripts to help in automating deployments to SharePoint Online.<br /><br /><b>Usage</b><br />In order to use the cmdlets you must first get a context. <br />In the <b>latest release</b> add the lines below at the start of your script<br /><pre>Import-Module SPOCmdlets\n$ctx = Get-SPOContext &quot;url&quot; &quot;username&quot; &quot;password&quot;</pre><br />For <b>previous versions</b> where there was no installer you will need to enter the path to the dll as below.<br /><pre>Import-Module &quot;Path\\To\\SharePointOnlineCmdlets.dll&quot;\n$ctx = Get-SPOContext &quot;url&quot; &quot;username&quot; &quot;password&quot;</pre><br /><br /><b>Contributions</b><br />If you have something you want to automate on SharePoint Online add it to the list by submitting a patch. Be sure to add documentation about your cmdlet in the pshproj file with example usage otherwise your patch will not be accepted (plus you can put your name in there ^^). Any contribution is greatly appreciated. If you just have an idea for a great cmdlet just start a discussion.<br /><br /><b>Documentation</b> (only applies to old version, for new version see <a href=\"https://sharepointonlineautomationcmdlets.codeplex.com/documentation?referringTitle=Home\">Documentation</a>)<br />The chm file in the downloads section contains the documentation and example usage. You will need to unblock the file by right clicking the .chm file -&gt; properties -&gt; click unblock.<br /><br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "SharePoint Online,Powershell,SharePoint,automation,o365,",
  "LastEdited": "2014-07-17T21:25:31.65-07:00"
}