{
  "ProjectName": "SolidEdge",
  "Title": "Solid Edge Automation and Expansion",
  "Description": "This project is currently under development. Initial use will be used to show examples and content form the ST5 Developer Day in Nashvillle.\r\n\r\nStay tuned.... there is more to come.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>Miss Solid Edge Developer Day? We have the examples and slides here:&nbsp;<strong><a href=\"http://solidedge.codeplex.com/wikipage?title=Solid%20Edge%20Developer%20Day%202012\">Solid Edge Developer Day 2012</a></strong></p>\r\n<p>&nbsp;</p>\r\n<p><br>\r\nSolid Edge is an industry-leading mechanical design system with exceptional tools for creating and managing 3D digital prototypes. With superior core modeling and process workflows, a unique focus on the needs of specific industries, and fully integrated design\r\n management, Solid Edge guides projects toward an error free, accurate design solution. Solid Edge modeling and assembly tools enable your engineering team to easily develop a full range of products, from single parts to assemblies containing thousands of components.\r\n Tailored commands and structured workflows accelerate the design of features common in specific industries and you ensure accurate fit and function of parts by designing, analyzing and modifying them within the assembly model. With Solid Edge, your products\r\n come together right first time, every time.<br>\r\n<br>\r\nSolid Edge is a Microsoft Windows based application that contains a comprehensive API. This allows customers and third party developers to create their own apps or to integrate existing software with Solid Edge.<br>\r\n<br>\r\n<strong>Project Description</strong><br>\r\nThis project provides examples, documentation and source code needed to create your own add-on tools. We encourage you to share your own tips and tricks as part of the wiki based documentation on this site and participate in discussions around the Solid Edge\r\n API.<br>\r\n<br>\r\n<br>\r\n</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-06-18T13:51:15.64-07:00"
}