{
  "ProjectName": "SolidCopy",
  "Title": "SolidCopy",
  "Description": "Industrial grade file copier with retry, folder-to-folder sync, md5-compare and namable configs for quick-select or automation. Supports mapped and networked drives.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">2011-9-15 v2.2<br />added New,Open to popup menu<br />Altered .scc files; these should be edited/recreated or target-is-older is used for Overwrite Mode <a href=\"https://solidcopy.codeplex.com/wikipage?title=the%20default&referringTitle=Home\">the default</a><br /> - mainly released for a version isolation issue<br /><br />2011-4-27 v2.11<br />Corrected date-stamping issue<br /><br />2011-4-2 v2.1<br />Clone feature added<br />Corrects various minor issues:<br />Multiple instances allowed again<br />Win7 can return null userpath if default userpath removed; appdir used in this case<br />Users\\current\\AppData\\Local\\SolidCopy is the default data path under Windows 7<br />Reset Remaining Bytes display to zero at process end<br />Reset systray hint to Finished at process end<br />Unaddressed note: Overwrite Target if Older mode -  first-time date compare fails and a copy is unnecesarily performed; subsequent compares reflect accurately.<br /><br />2011-1-21 v2.0<br />Transitioned to open-source freeware<br />Fixed automation/launch issue with command-line params<br />Adjusted interface<br />Always pre-scan; 2-Pass option dropped<br />Added MD5 File Hash tool<br />Added Merge Configs tool<br />File/folder listviews accept dragged files from Explorer (main window, Skip List, File Hash)<br />Log detail and viewing improved; logs can also be zapped en masse<br />Discarded auto-association for .scc files (this can be done manually by double-clicking any .scc file)<br />Discarded absolute paths option<br />Rewrote documentation<br /><br />SolidCopy is an industrial-grade file copy utility with safe result previewing, extensive logging and fail-over retry mode for unstable media or network conditions. Configs (scripts) may be defined and automated.<br /><br />Syncing / Mirroring is supported - files and folders that exist in the target but not the source are deleted.<br /><br />Safety features include a preview window prior to batched overwrites, complete logging details (with stats and CurrentUser of executing machine), and a NoCopy mode where a config can be tested without actually copying.<br /><br />SolidCopy functions as a stand-alone executable, but requires SolidCopy_Documentation.rtf for F1 to work.</div><div class=\"ClearBoth\"></div>",
  "TagList": "xcopy,md5,copier,copy file,backup,automated,mirror,synchronize,folder sync,Delphi,freeware,Source Code,",
  "LastEdited": "2011-09-19T09:57:04.637-07:00"
}