{
  "ProjectName": "solzip",
  "Title": "SolZip",
  "Description": "SolZip offers 3 ways to Compress(Zip) Visual Studio 2010 C# Solutions, C# Projects and Items. A commandline, One using Guidance Automation (GAX) and one using MME (mme.codeplex.com).\r\n\r\nSolZip is written and conceived by Jesper Niedermann",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>Moved to github: https://github.com/Jeern/SolZip</h2>\r\n<h1>Project Description</h1>\r\nSolZip offers 3 ways to Compress&#40;Zip&#41; Visual Studio 2010 C&#35; Solutions, C&#35; Projects and Items. A commandline, One using Guidance Automation &#40;GAX&#41; and one using MME &#40;mme.codeplex.com&#41;.<br /><br />SolZip is written and conceived by Jesper Niedermann<br />\n<h1>Introduction</h1>\r\nUpdate: Version 1.3 finally I got around to releasing support for VS2010. It is in the 1.3 download. For VS2008 support you need to use the old 1.2 download.<br /><br />Update: The original name for this tool was SolutionZipper but it has now been changed to SolZip since I stumbled upon another tool called SolutionZipper on the internet.<br /><br />The concept of SolZip is simple - to enable Zip Compression of Visual Studio Solutions and Projects. This is not a unique idea, others have done it too. The uniqueness comes from the tools used to accomplish this, and the userinterfaces offered.<br /><br />The simple and smart thing is that SolZip doesn&#39;t compress folders but actually reads the sln file and csproj files to infer which items are to be zipped. This also means that it doesn&#39;t need special logic to keep out things like the bin and obj folder or .svn folders from subversion.<br /><br />So it is really not the compression part which makes SolZip extremely valuable. The ability to get all relevant files of the solution, excluding generated assemblies, PDB files, XML files, and other random debris, is something that every developer needs time and time again when they want to share their code with others. The ability to right click on a solution in Visual Studio, and make a Zip file of all relevant files makes this extremely easy.<br /><br />In Release 1.1 it got the added option of removing Source Control bindings from solution (sln) and project files (csproj).<br /><br />Currently SolZip offers zipping of C# Solutions and Projects in Visual Studio 2010 format. Other formats might work, but it would be pure luck, and not tested. It also supports setup projects and to some extent XNA content projects.<br /><br />SolZip contains not one, but three(!) UI&#39;s to Zip Projects, each one offers its own advantages. All three uses the same basic functionality contained in SolZipBasis.dll. The actual compression is done with the excellent framework <a href=\"http://www.icsharpcode.net/OpenSource/SharpZipLib/\">SharpZipLib</a><br />\n<h2>SolZipMME</h2>\r\nSolZipMME uses <a href=\"http://mme.codeplex.com\">MME</a> to enable Right click menus on Visual Studio Solutions, Projects and Items in the Solution Explorer. It is really the main offering of SolZip.<br />(The old version 1.2 for VS2008 uses <a href=\"http://managedmenuextension.codeplex.com\">ManagedMenuExtensions</a>)<br /><br />You can read more about <a href=\"https://solzip.codeplex.com/wikipage?title=SolZipMME&referringTitle=Home\">SolZipMME</a> on its own page.<br /><br />Screenshot:<br /><br /><img src=\"/projects/solzip/494d127c-8d41-4a74-ac6a-df4d039e6d26\" alt=\"SolZipMME1.jpg\" title=\"SolZipMME1.jpg\" /><br />\n<h2>SolZip Commandline tool</h2>\r\nSolZip.exe is a commandline tool for compressing solutions from a dos prompt. <br /><br />You can read more about <a href=\"https://solzip.codeplex.com/wikipage?title=SolZip.exe&referringTitle=Home\">SolZip.exe</a> formerly known as <a href=\"https://solzip.codeplex.com/wikipage?title=SunZip&referringTitle=Home\">SunZip</a> on its own page. <br /><br />Screenshot:<br /><br /><img src=\"/projects/solzip/8311a367-1130-4d12-90b8-ddc79629c6cb\" alt=\"Dosprompt.jpg\" title=\"Dosprompt.jpg\" /><br />\n<h2>SolZipGuidance</h2>\r\nOffers the same Visual Studio Integration as SolZipMME but using Guidance Automation instead of Managed Menu Extensions. It in this sense it is not quite as slick as SolZipMME because you need to enable the guidance package for each solution you want to Compress.<br /><br />The real point of SolZipGuidance is that you can take the recipe from the Sourcecode and use it in your own Software Factories. Don&#39;t forget to mention where you found it.<br /><br />You can read more about <a href=\"https://solzip.codeplex.com/wikipage?title=SolZipGuidance&referringTitle=Home\">SolZipGuidance</a> on its own page.<br /><br />Screenshot:<br /><br /><img src=\"/projects/solzip/4451316f-9c7d-4545-8b78-099655325a59\" alt=\"SolZipGAX1.jpg\" title=\"SolZipGAX1.jpg\" /><br />\n<h2>Behind the scenes or how it is done</h2>\r\nSolutions are zipped by iterating over the lines of the sln file and finding all relevant solution items, projects and setup projects, and zipping each of them, and finally zipping the sln file itself.<br /><br />Projects are zipped by iterating over the relevant nodes in the csproj file using LinqToXml and finding all relevant items and zipping each of them, and finally zipping the csproj file itself.<br /><br />Setup projects are zipped by iterating over the folder of the vdproj file and zipping all files in the folder including the vdproj file itself.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "Visual Studio 2008,Guidance Automation,GAX,compression,Command Line,addin,Visual Studio 2010,MME,MEF,",
  "LastEdited": "2017-11-03T15:41:26.313-07:00"
}