{
  "ProjectName": "sqlspade",
  "Title": "Scripted PowerShell Automated Deployment Engine (SPADE) for SQL Server",
  "Description": "SPADE simplifies the process of standing up a new SQL Server instance by applying standard Operating System pre-configurations, Installing SQL Server and then applying post-configurations and creating standard objects.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />SPADE simplifies the process of standing up a new SQL Server instance by applying standard Operating System pre-configurations, Installing SQL Server and then applying post-configurations and creating standard objects.<br /><br />SPADE is a tool that is designed to speed up your standard deploymets of SQL Server.  You may be saying &quot;But I can already do an unsattended install&quot;...but that&#39;s not all that&#39;s involved in most server builds.  There are Operating System configurations like Microsoft Distrubuted Transaction Coordinator (MSDTC), Local Security Policy and others.  I&#39;m sure that you also have standard SQL objects that need to be deployed like Stored Procedures, Agent Jobs, Operators, etc.  All of this can be done by SPADE automatically by running 1 simple PowerShell script.<br /><br />Every organization is different, so this tool has been built so that it can easily be customized without requiring you to be a master of PowerShell. A simple XML configuration file defines the options for your standard build.  For those non-standard, or &quot;one-off&quot; builds, the script has been defined so that you can change things for a single build without having to change the configuration file.<br /><br />The current release supports standalone installs of SQL 2005, 2008, 2008R2, and &quot;Denali&quot;.<br /><br />Imagine being able to stand up AND completely configure a new SQL Instance in under 20 minutes.  If that sounds appealing to you, then download SPADE and give it a try.</div><div class=\"ClearBoth\"></div>",
  "TagList": "SQL Sever,Installer,powershell,denali,automation,SQL,SQL Server,Deployment,install,automate,unattended,enterprise,",
  "LastEdited": "2011-10-09T20:25:43.96-07:00"
}