{
  "ProjectName": "tagflo",
  "Title": "TagFlo",
  "Description": "TagFlo is a photo management application that makes it easy to locate files using a photographic info such as aperture, date taken and ISO. It is developed using C#, WPF and LINQ.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Features:</b>\n<ul><li>Add Keyword Tags and Ratings to Photos</li>\n<li>Search your photo collection using metadata like ISO and Aperture</li>\n<li>Group photos together into sets and automatically create sets using search criteria</li></ul>\n<br /><img src=\"http://www.tagflo.com/wp-content/uploads/2009/04/mainscreen-450px.png\" /><br /><br />TagFlo designed to make it easier to find a photo your looking for. Keyword Tags and Ratings can be added to photos in your collection, making it easier to find them later. It is also possible to search photo collections using the metadata stored  when the photo was taken. You can find all photos taken with a zoom lens or with fast shutter speed. <br /><br />Once you find the photo you are looking for, they can be group together into sets. These sets makes it easy to find them again. Photo Sets can also be automatically generated using the Smart Set Feature. Smart Sets get created based upon the search criteria you pick. They also get automatically update when new photos are added.<br /><br />The website for TagFlo is: <a href=\"http://www.tagflo.com\">http://www.tagflo.com</a><br /><br /><b>Development</b><br />I have been working on TagFlo on and off for the past 2 years or so. It is programmed in C# and uses WPF. All of the data about the photos and their thumbnails get stored in an SQL CE database. The database is queried using LINQ and the Entity Framework. <br /><br />I have been playing around with all of this so I can stay current on what is out there. <br /><br /><b>Future Features</b><br />There is still a lot of stuff I need to add. Let me know what you would like to see first. Here are some ideas:\n<ul><li>Rotate photos</li>\n<li>Multiple options for editors</li>\n<li>Upload to photo sharing sites\n<ul><li>Flickr</li>\n<li>Facebook</li>\n<li>Picasa</li></ul></li>\n<li>Create some sort of automated workflow options. IE, export a photo, crop it and resize it and then tag it and move it to a given directory</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-04-15T10:10:16.37-07:00"
}