{
  "ProjectName": "tphbatchprinter",
  "Title": "TPH Batch Printer",
  "Description": "This a desktop application, written in VB.Net, that automates printing from the main Office applications, plus the full Adobe Acrobat. You can queue up a long list of files, and send them for print all at once. It is based loosely on an earlier Visual Basic 6.0 application that I wrote: that one supported automation of the Acrobat Reader as well, via Dynamic Data Exchange (DDE.) \r\n\r\nHowever, the lack of native DDE support in .NET means that support will not initially be there. I hope that it will be added.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>About TPH Batch Printer</b><br />This a desktop application, written in VB.Net, that automates printing from the main Office applications, plus the full Adobe Acrobat. You can queue up a long list of files, and send them for print all at once. It is based loosely on an earlier Visual Basic 6.0 application that I wrote&#58; that one supported automation of the Acrobat Reader as well, via Dynamic Data Exchange &#40;DDE.&#41; <br /><br />However, the lack of native DDE support in .NET means that support will not initially be there. I hope that it will be added.<br /><br />TPH developed this application initially for our own purposes. Realizing that this tool would be genuinely useful even for companies not in the printing business, we released a freeware program called &quot;TPH Office Batch Printer&quot; a few years ago. Over the years, we&#39;ve had many requests to customize the program for specific businesses. Perhaps the easiest way I could think of to allow people to meet that goal was to open source the program.<br /><br />This is not the original version of the tool, which was built in Visual Basic 6.0. This version of the program adds some logging capabilities, but lacks the ability to control Adobe Reader that its predecessor had. The reason for this lost support is that Adobe Reader only supports DDE automation, and DDE automation is not included natively in VB.Net the way it was in earlier versions of Visual Basic.<br /><br />Both the COM and DDE support that this program aims to support for PDF files are drawn from the Adobe Interapplication Communication API Reference guide. The Microsoft Office document printing is supported via the VB GetObject() call, and of course Office deeply supports automation.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2007-06-12T12:27:56.757-07:00"
}