{
  "ProjectName": "uiacomwrapper",
  "Title": "UI Automation COM-to-.NET Adapter",
  "Description": "The UI Automation COM-to-.NET Adapter makes it possible to use the new Windows Automation API 3.0 COM interfaces, with their improved reliability and performance, while still using the same System.Windows.Automation classes as in earlier versions of UI Automation.  ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rThe UI Automation COM-to-.NET Adapter makes it possible to use the new Windows Automation API 3.0 COM interfaces, with their improved reliability and performance, while still using the same System.Windows.Automation classes as in earlier versions of UI Automation.  <br /><br />This project makes it easier to re-use existing UI Automation managed applications, which use System.Windows.Automation classes, while also using the new UI Automation COM API available on Windows 7.  This is an instance of the <a href=\"http://en.wikipedia.org/wiki/Adapter_pattern\">Adapter</a> design pattern, wrapping one interface in terms of another to avoid having to change the usage pattern of existing code.  <br /><br />The System.Windows.Automation classes are documented under the <a href=\"http://msdn.microsoft.com/en-us/windows/bb892133.aspx\">UI Automation Community Promise</a>.  This implementation of those classes relies on the open specification.  The implementation is as complete as possible, although some elements of the System.Windows.Automation namespace cannot be implemented in terms of the UI Automation COM API.<br /><br />Please see the Documentation tab for more details.<br /><br />If you are looking to try this out, skip to <a href=\"http://uiacomwrapper.codeplex.com/wikipage?title=Using%20with%20a%20Real%20Project\">Using with a Real Project</a> to see how to do it.<br />\n<h1>Project Status</h1>\r\nThe project is a reasonably complete implementation of the System.Windows.Automation classes.  The client-side-provider classes are omitted, since they are relatively difficult to translate into the way that the COM API does it.  <br /><br />The next step is to validate the implementation with a real UI Automation client to make sure that the end-to-end scenarios work as expected.  The current code passes its unit test, but has not been used in a real-world way yet.</div><div class=\"ClearBoth\"></div>",
  "TagList": "Automation,",
  "LastEdited": "2010-01-03T13:03:21.677-08:00"
}