{
  "ProjectName": "USBDrivePrepTool",
  "Title": "USB Drive Preparation Tool (Wipe, Encrypt, Prepare)",
  "Description": "This is a public release of a script to assist with the task of preparing a USB drive. Useful for customer facing roles. The sample code is provided \"as-is\".",
  "MovedLink": "https://github.com/Matticusau/UsbDrivePrepTool",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This is a public release of a project I have worked on to assist with the task of preparing a USB drive. If your role is customer facing it is a useful tool to Format, Encrypt, and Prepare a USB drive before each visit. <br /><br />Currently the script provides the following functionality:\n<ul><li>Detects attached removable USB drives</li>\n<li>Formats the selected drive</li>\n<li>Encrypts the selected drive with Bitlocker2Go (Password)</li>\n<li>Backs up the Bitlocker key to a specified folder</li>\n<li>Copies the contents of a &quot;common tools&quot; directory</li>\n<li>Customisable with -Setup param to specify Bitlocker Key backup location and Common Tools directory</li></ul>\n<br />_DISCLAIMER<br />This Sample Code is provided for the purpose of illustration only and is not intended to be used in a production environment.  THIS SAMPLE CODE AND ANY RELATED INFORMATION ARE PROVIDED &quot;AS IS&quot; WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY AND/OR FITNESS FOR A PARTICULAR PURPOSE.  We grant You a nonexclusive, royalty-free right to use and modify the Sample Code and to reproduce and distribute the object code form of the Sample Code, provided that You agree: (i) to not use Our name, logo, or trademarks to market Your software product in which the Sample Code is embedded; (ii) to include a valid copyright notice on Your software product in which the Sample Code is embedded; and (iii) to indemnify, hold harmless, and defend Us and Our suppliers from and against any claims or lawsuits, including attorneys’ fees, that arise or result from the use or distribution of the Sample Code._<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "PowerShell,BitLocker,Usb,Automation,Encryption,",
  "LastEdited": "2014-07-07T05:12:14.177-07:00"
}