{
  "ProjectName": "videoshow",
  "Title": "Video.Show",
  "Description": "An end-to-end reference-quality sample for user-generated video content.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h4>Video.Show is a reference-quality blueprint for implementing a user-generated video content site. It provides everything you need to create a website for uploading, encoding, cataloguing, publishing and commenting on videos, using Silverlight, Expression Encoder and Silverlight Streaming by Windows Live.</h4>\r\nVideo websites are lots of fun, but setting up your own video community website can be a real headache. There&#39;s a lot to worry about: disk space, bandwidth, video formats and encoding... <br /><br />That&#39;s why we built a reference quality site which does all of the hard work for you. The key is Silverlight technology paired up with Silverlight Streaming&#39;s free, world class content hosting. Video.Show provides Silverlight 1.0 video controls, Silverlight Streaming hosting integration, leveraging Expression Encoder&#39;s ability to handle most popular video formats. We’ve set things up so you can be uploading videos within minutes, and we’ve added in some cool features like time-based video comments, so your comments will be synchronized with the video playback.<br /><br /><img src=\"/projects/videoshow/f9f6f095-bea7-445f-a36d-abe7073a5e4d\" alt=\"VideoShowHome.jpg\" title=\"VideoShowHome.jpg\" /> <br />\n<h4>Features</h4>\r<ul><li>Designed to get you up and running quickly with minimal setup and configuration </li>\n<li>All video is hosted at Silverlight Streaming, which gives you 4GB storage and 700 Kbps bandwidth via Microsoft&#39;s worldwide Content Delivery Network </li>\n<li>Comments are time-based and are synchronized with video playback </li>\n<li>Demonstrates a data layer built using Linq To Sql </li>\n<li>Broad media format support (avi,mp4,asf,mpeg,dvr-ms,mpg,m2v,ts,m4v,vob,mov, and wmv) via Expression Encoder </li>\n<li>Leverages the AJAX Control Toolkit to add animations and interactivity </li>\n<li>Encoding properties are configurable via standard Expression Encoder job file </li>\n<li>Cross broswer (IE 6 and 7, Firefox 2, and Safari 3) </li>\n<li>Open source and designed with a webservice architecture </li></ul>\n<br />Video.Show was developed for Microsoft by <a href=\"http://www.vertigo.com\">Vertigo Software</a>, a Microsoft Gold Certified Partner. See other cool Silverlight and WPF projects they&#39;ve developed at their <a href=\"http://www.vertigo.com/Lab.aspx\">labs page</a>. For other Windows Live applications, check out the <a href=\"http://codeplex.com/wlquickapps\">Windows Live Quick Apps Codeplex Project</a>.<br /><br /><img src=\"/projects/videoshow/9399ff4a-a7a2-42cb-8bb2-06bfd42fb3a1\" alt=\"BlueprintsLogo-HalfSize.png\" title=\"BlueprintsLogo-HalfSize.png\" /><br />Video.Show is a Microsoft Software-plus-Services Blueprint. Software-plus-Services Blueprints are a series of open source frameworks and workflow-based guidance packages designed to provide an architectural bridge and reduce the friction you experience building real-world Software-plus-Services applications. As a starting point for both architects and developers who are building real solutions, each Software-plus-Services Blueprint includes source code and/or utilities, guidance, structured step-by-step workflow-based guidance and tools delivered within Visual Studio 2008. You can also download the Blueprints Manager for Visual Studio 2008, an integrated experience that allows you to download and update Software-plus-Service blueprints from within your development environment. See <a href=\"http://channel9.msdn.com/blueprints\">http://channel9.msdn.com/blueprints</a> for more details.</div><div class=\"ClearBoth\"></div>",
  "TagList": "watch,Content Management,WPF,Expression,MOSS,video,upload,MyList,Silverlight,Vertigo,browser-based video ,movie,VideoShow,Video Show,Silverlight 2.0,.Show Family,Hits,RETURN 2010,Applications,Application,Demo,Example,ms.tinch,",
  "LastEdited": "2008-02-24T17:54:06.073-08:00"
}