{
  "ProjectName": "watinsahi",
  "Title": "WatiN Sahi .NET",
  "Description": "Sahi style wrapper APIs for WatiN. This project will help WatiN users to record their scripts in Sahi and run them in WatiN.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h3><b><a href=\"http://watin.org\">WatiN</a> is also <u><a href=\"http://sahi.co.in\">Sahi</a></u> means <i>Right</i>. This is wrapper around WatiN functions. Facilitates Sahi style of writing tests.</b></h3>\rSahi style wrapper APIs for WatiN. This project will help WatiN users to record their scripts in Sahi and run them in WatiN.<br />\n<ul><li>Web UI Automation is a booming industry. Manual Testers alone can not cope up with the ever increasing demand of testing UI components for Web Applications.</li></ul>\n\n<ul><li>Future is cloud computing which is mainly web based.</li></ul>\n\n<ul><li>Sahi is very good tool for automating web applications having a very good controller which helps recording and playback of scripts. Sahi has an Open Source version as well as Pro version which costs only 495USD which is quiet less when compared with the commercially available software tools.</li></ul>\n\n<ul><li>WatiN is too good when it comes to automating web applications on windows platform. It works excellent with Internet Explorer. <b>BUT</b> it lacks the major requirement of recording steps or say browser interactions. <i>Recorder for WatiN scripts are available in the open source community but they have limited scope.</i> WatiN is completely open source framework. Though there is no new release since years but still people are having a lot of discussion on this framework.</li></ul>\n\n<ul><li>Considering this limitation of WatiN and advantage of Sahi, this project is created. It will wrap all the WatiN APIs in style of Sahi.</li></ul>\n<br /><i><b>Thus user will be able to record his scripts on Sahi OS/Pro recorder and run them using WatiN.</b></i><br />\n<h4><b>Though this may need a little bit of tweaking but still can be very useful.</b></h4></div><div class=\"ClearBoth\"></div>",
  "TagList": "WatiN,Sahi,Web Automation,UI Automation,Automation,",
  "LastEdited": "2013-08-30T02:11:35.697-07:00"
}