{
  "ProjectName": "WMI4GAC",
  "Title": "WMI Provider for GAC'ed Assemblies",
  "Description": "This provider help the to read GAC information from remote machine using WMI in the background. Once deployed and install the data can be queried using WMI from PowerShell, Automation Scripts like javascript/VB and from 3G languages like .NET.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This provider help the to read GAC information from remote machine using WMI in the background. Once deployed and install the data can be queried using WMI from PowerShell, Automation Scripts like javascript&#47;VB and from 3G languages like .NET.<br /><br /><br />\n<hr />\n<ol><li> Problem Statement</li></ol>\nCurrently there are no tools available to retrieve properties of a GAC’ed .NET Assembly from Multiple machines. The GACUTIL tool available can only retrieve the properties of the Assemblies in the current machine and is limited in terms of extensibility and reuse to develop custom applications. <br />A practically need for this kind of tool was identified in a farm where day-to-day deployment happen and sometimes server goes out of sync either because of incorrect deployment scripts or usage of 3rd party deployments. This tool provides an entry point solution to retrieve require data validate such kind of scenario. \n<hr />\n2.\tABSTRACT<br />WMI provider helps server/farm administrator to query the farm server and retrieve the GAC’ed assemblies’ data which could later be user to verify the synchronization status of the farm. It would save tons of time where in one has to go to each server in the farm and verify the existence of the Assembly with exact properties of strong name. As to extensibility and reuse, WMI is supported by many platform like .NET, PowerShell and also be used in automation. So, it now up to the developer of the WMI provider to see how this would put in use and what could be done with the data collected.<br /><br />3.\tREUSAGE<br />Watch out for this space, soon we would be updating this space to Utility that would reuse this component and create farm difference generator tool. The tool would be targeted for sharepoint farms, hence can also compare the 12Hive folders, Gac Assemblies and software installation<br /><br />The tool (<b>Farm Difference Report Generator</b>) is now ready for use. Please check it out too at <a href=\"http://farmdiffreportgen.codeplex.com\">http://farmdiffreportgen.codeplex.com</a><br /><br />Also don&#39;t forget to post your comments <a href=\"http://wmi4gac.codeplex.com/wikipage/comments\">http://wmi4gac.codeplex.com/wikipage/comments</a><br /><br /><b>Download</b><br />Documentation <a href=\"http://wmi4gac.codeplex.com/releases/49902/download/139731\">http://wmi4gac.codeplex.com/releases/49902/download/139731</a><br />Source Code <a href=\"http://wmi4gac.codeplex.com/releases/49902/download/139730\">http://wmi4gac.codeplex.com/releases/49902/download/139730</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "WMI,Providers,Provider,GAC,gacutil,Farm,VBScript,automation,Reporting,WMI Inventory,WMIC,Syncronization,",
  "LastEdited": "2010-08-31T00:14:26.717-07:00"
}