{
  "ProjectName": "workflowdemo",
  "Title": "Windows Workflow (State Machine), Duplex WCF Service, WPF and Silverlight",
  "Description": "This Visual Studio solution demonstrates a complex implementation, which is a simple order process system, utilizing Windows Workflow (state machine), duplex WCF services(TCP duplex and Silverlight polling), WPF and Silverlight.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This Visual Studio solution demonstrates a complex implementation, which is a simple order process system, utilizing Windows Workflow &#40;state machine&#41;, duplex WCF services&#40;TCP duplex and Silverlight polling&#41;, WPF and Silverlight.<br /><br /><br />The project is a good example for developing online interactive trading systems. You can even add some more complex logics into the workflow and extend the services around the work flow design to allow bargaining among traders. <br /><br />The major features include:<br /><br />Although I haven&#39;t finished the documentation and comments of the project, I have outlined some major features on my personal website including,<br /><br />The major features of the project include:<br /><br />1. A state machine work flow design, which is working as a simplified order process system:<br /><br />  *1.1. Clients place orders<br /><br />  *1.2. Managers approve or refuse the orders<br /><br />  *1.3. Clients and Managers getting notified of each process step.<br /><br />2. A singleton instanced WCF duplex service.<br /><br />3. An external data exchange service bridging the workflow instances and the WCF service.<br /><br />4. Self hosted WCF server (WinForm, easy to change to Windows Service if needed) with duplex TCP binding and Silverlight  duplex polling binding (custom binding)<br /><br />5. Cross domain access policy file hosted on the same WCF server, working as a cross domain access policy service.<br /><br />6. A WPF client<br /><br />7. A Silverlight client <br /><br /><a href=\"http://lixin.info/post/2009/11/24/Source-code-of-a-demo-on-Windows-Workflow-(state-machine)-duplex-WCF-services(TCP-duplex-and-Silverlight-polling)-WPF-and-Silverlight.aspx\">http://lixin.info/post/2009/11/24/Source-code-of-a-demo-on-Windows-Workflow-(state-machine)-duplex-WCF-services(TCP-duplex-and-Silverlight-polling)-WPF-and-Silverlight.aspx</a><br /><br />Hope this helps if you have downloaded the source code.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "windows,workflow,state,machine,duplex,wcf,tcp,silverlight,polling,wpf,",
  "LastEdited": "2009-12-03T17:07:39.683-08:00"
}