{
  "ProjectName": "wpfandcardspace",
  "Title": "WPF and CardSpace",
  "Description": "CardSpace content is from 2009.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />CardSpace content is from 2009.<br /><br /><b>NOTE: CardSpace is now obsolete!!!</b><br /><b><a href=\"http://blogs.msdn.com/b/card/archive/2011/02/15/beyond-windows-cardspace.aspx\">http://blogs.msdn.com/b/card/archive/2011/02/15/beyond-windows-cardspace.aspx</a></b><br /><br /><br />Here are quick links to the webcasts describing various CardSpace scenarios for WPF applications:<br />\n<ul><li><b>End-User Managed Card Experience</b>\n<ul><li>This webcast gives you a brief and comparative look at the end-user experience with Windows CardSpace V1 and CardSpace &quot;Geneva&quot; (the next release of Windows CardSpace) when you employ managed cards to authenticate users to your WPF client applications.</li>\n<li><a href=\"http://wpfandcardspace.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=30435#DownloadId=76338\">Download the WMV</a></li></ul></li></ul>\n\n<ul><li><b>Working with Managed Cards</b> \n<ul><li>This webcast illustrates how to leverage managed cards for user authentication to a WPF client application, explaining relevant code and configuration for the WCF service, the STS, and the client.</li>\n<li><a href=\"http://wpfandcardspace.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=30435#DownloadId=76037\">Download the WMV</a></li></ul></li></ul>\n\n<ul><li><b>What&#39;s in a Managed Card?</b> \n<ul><li>This webcast talks about the contents of a managed card, how each section relates to the token issuange process, and how to create managed cards using Geneva Framework (Windows Identity Foundation).</li>\n<li><a href=\"http://wpfandcardspace.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=30435#DownloadId=78709\">Download the WMV</a></li></ul></li></ul>\n\n<ul><li><b>Sample Code</b>\n<ul><li>Sample code for the webcasts can be downloaded here: <a href=\"http://wpfandcardspace.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=30435#DownloadId=76079\">WPFandCardSpaceSamples.zip</a></li>\n<li>There is a sample for generating managed cards that hit different STS endpoints depending if they are username or certificate backed cards. </li>\n<li>There is a rich sample with a custom STS, WCF services, and a WPF client application configured to use managed cards issued by the STS. You must follow setup instructions carefully to get your certificates properly installed and IIS setup correctly.</li></ul></li></ul>\n <br /><b>Resources</b>\n<ul><li>Check out the <a href=\"http://blogs.msdn.com/card\">Geneva Team Blog</a> to keep up on all things Windows Identity Foundation (Geneva Framework), ADFS (Geneva Server) and CardSpace Geneva (Windows CardSpace V2).</li>\n<li><a href=\"http://blogs.msdn.com/vbertocci/\">Vittorio Bertocci&#39;s Blog</a> is a must read as well, he&#39;s just excellent at describing, well, everything he discusses which is a lot about identity and Windows Identity Foundation.</li></ul>\n<br /><b>Contact Info</b><br />Please try to use the discussion board for this project for any project-related questions and feedback. If you have a question not project-related you can email me, Michele Leroux Bustamante, at <a href=\"mailto:mlb@dasblonde.net\">mlb@dasblonde.net</a><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-04-18T09:22:47.997-07:00"
}