{
  "ProjectName": "wpfandclickonce",
  "Title": "WPF and ClickOnce",
  "Description": "This project includes a short webcast series to help Windows Presentation Foundation (WPF) developers leverage ClickOnce to manage application publishing, deployment and updates. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This project includes a short webcast series to help Windows Presentation Foundation &#40;WPF&#41; developers leverage ClickOnce to manage application publishing, deployment and updates. <br /><br /><b>Webcasts</b><br />The following series of webcasts are intended to teach WPF developers that are new to ClickOnce how to leverage the technology for publishing, deploying and updating applications from a remote web server. The first webcast is introductory, other webcasts focus on specific scenarios related to data storage, working offline, bootstrapping and security. <br /><br />NOTE: I still have other topics I would like to add here, stay tuned.<br />\n<ul><li><b>Webcast #1</b>: <a href=\"http://wpfandclickonce.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=29192#DownloadId=72783\">ClickOnce Overview</a>\n<ul><li>If you are new to ClickOnce this webcast will provide you with a quick overview of what the technology is capable of </li></ul></li></ul>\n<br />You can also go to the CodePlex release to download the webcasts in WMV format here: <a href=\"http://wpfandclickonce.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=29192\">Webcasts in WMV format</a><br /><br /><b>Contact Info</b><br />Please try to use the discussion board for this project for any project-related questions and feedback. If you have a question not project-related you can email me, Michele Leroux Bustamante, at <a href=\"mailto:mlb@dasblonde.net\">mlb@dasblonde.net</a><br /><br /><b>Acknowledgements</b><br />Many thanks to Brian Noyes, the author of <a href=\"http://www.amazon.com/Smart-Client-Deployment-ClickOnce-Applications/dp/0321197690\">Smart Client Deployment with ClickOnce</a> not to mention my good friend and colleague at IDesign for his support!<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-08-13T11:03:44.363-07:00"
}