{
  "ProjectName": "WPFCon10uum",
  "Title": "WPF Con10uum : 10/GUI Software part",
  "Description": "R. Clayton Miller posted a nice video about bringing computing to the next level with multitouch called 10/GUI\nThe goal of Con10uum projet is to continue his work.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />R. Clayton Miller posted a nice video about bringing computing to the next level with multitouch called 10&#47;GUI<br />The goal of Con10uum projet is to continue his work.<br /><br /><img src=\"http://gotactile.fr/wp-content/uploads/2009/11/dgq9krb_29c628zsf6_b-292x300.jpg\" alt=\"From GoTactile\" title=\"From GoTactile\" />\n<h1>10/GUI story</h1>\r<pre>Here it is: my crazy summer project to reinvent desktop human-computer interaction. \n\nThis video examines the benefits and limitations inherent in current mouse-based and window-oriented interfaces, \nthe problems facing other potential solutions, and visualizes\nmy proposal for a completely new way of interacting with desktop computers. \n\nThere&#39;s more information at 10gui.com\n</pre>This was written by R. Clayton Miller. To watch the original video : <a href=\"http://10gui.com\">http://10gui.com</a>\n<h1>Videos of Con10uum</h1>\r<a href=\"http://www.vimeo.com/7838039\">http://www.vimeo.com/7838039</a><br /><a href=\"http://www.vimeo.com/8138614\">http://www.vimeo.com/8138614</a><br />\n<h1>Features</h1>\r<h2>What you can do in this release :</h2>\r<ul><li>Open new windows using menu on the right. Press the touch zone with 1 finger then a button with another finger without moving the first one.</li>\n<li>Use 1 or 2 fingers for selection, zoom inside a window</li>\n<li>Move all windows with 1 finger only (need to touch in the white zone) We use 1 finger instead of 4 because lots of people fail with 4 fingers (Could be different with presure sensors)</li>\n<li>Change window size using 3 fingers pinch. (Advice : move only your thumb / Touch only the white parts).</li>\n<li>Switch to &quot;Zoom Out Mode&quot; to see all openned windows. (Same as above but with 4 fingers. Same advice : move only your thumb / Touch only the white parts)</li></ul>\n<h2>What you can&#39;t do in this release :</h2>\r<ul><li>Drag Dock windows with 3 fingers is not implemented in this release</li>\n<li>The &quot;Zoom Out&quot; feature is not working very well. There are some troubles with inertia logic</li>\n<li>Drag all windows with 4 fingers was too compicated for end users. I have enable this with 1 finger (on white parts) in this demo.</li></ul>\n<h1>Next Step</h1>\r<ul><li>At this early time, we only have multitouch screen so we can only run Con10uum part of the 10/GUI project. We plan to get a Wacom Bamboo multitouch PAD and a Stantum SlatePC (presure detection) to continue our work.</li>\n<li>Improve the user experience regarding multitouch interaction. Find the right way (intuitive) to do things.</li>\n<li>Improve how multitouch input events are handled</li></ul>\n<h1>WPF Folks</h1>\r<h2>How is organized the project :</h2>\r<ul><li>There is a Con10uum WPF Control projet and a demo project.</li>\n<li>The demo project contains all visual / graphical parts of the project. Note that Blend currently does not support WPF 4.0 beta 2. </li>\n<li>Con10uum is a true reusable WPF control with styling/templating supported.</li></ul>\n<h2>Software Design</h2>\r<ul><li>Con10uum control inherit from ItemsControl. This help me a lot : <a href=\"http://drwpf.com/blog/Home/tabid/36/EntryId/13/Default.aspx\">http://drwpf.com/blog/Home/tabid/36/EntryId/13/Default.aspx</a></li>\n<li>Con10uum control contain a ScrollViewer. This ScrollViewier use our build in Con10uumPanel as an ItemsHost (IsItemsHost=True)</li>\n<li>Con10uumPanel inherit from Panel and implement IScrollInfo</li>\n<li>Con10uumPanel manage the &quot;animated&quot; layout logic. We follow excellent advices from DevDave for this stuff <a href=\"http://scorbs.com/2008/07/17/flickrviewr-using-devdaves-animatingwrappanel\">http://scorbs.com/2008/07/17/flickrviewr-using-devdaves-animatingwrappanel</a>.</li>\n<li>IScrollInfo implementation is used to implement our build in inertia logic. This help me a lot : <a href=\"http://blogs.msdn.com/bencon/archive/2006/01/05/509991.aspx\">http://blogs.msdn.com/bencon/archive/2006/01/05/509991.aspx</a></li>\n<li>Con10uumWindow is used for the content of Con10uumPanel.</li>\n<li>Con10uumWindow inherit from HeaderedContentControl</li>\n<li>Multitouch : Con10uum rely on Touch + Manipulation events but it does not use WPF 4 build in inertia logic. We use a custom state machine to manage input events regarding the different states of the control.</li>\n<li>Inertia : The .Net 4 build in intertia logic does not feet into our needs so we add a dedicated inertia logic more addapted to Con10uum.</li></ul>\n<h1>Requirements</h1>\r<ul><li>We are using .NET 4 (beta 2) on Windows 7</li>\n<li>Tools needed to build the project : Visual Studio 2010 Beta 2. </li>\n<li>Blend does not support WPF 4 beta 2 yet. You need to use a text editor </li>\n<li>Multitouch device : We tested the application with 3M multitouch Kit and Dell Latitude XT2 (with updated driver for win7). </li></ul>\n<h1>Thanks to :</h1>\r<ul><li>R. Clayton Miller and his <a href=\"http://10gui.com\">http://10gui.com</a> project. See credits at the end of the original 10/GUI video</li>\n<li>Romain Jestin that spent some nights with me on this job</li>\n<li>Jean Michel Flamant, Claire Mounier <a href=\"http://www.idees-3com.com/\">http://www.idees-3com.com/</a></li>\n<li>Philippe Jasec <a href=\"http://www.ventealappart.fr\">www.ventealappart.fr</a></li>\n<li>Fabien Denis (model)</li>\n<li>Dominique Dillies (Photographer)</li>\n<li>Last but not least : Jos&#233;phine Ragot (support)</li></ul>\n<br />To get the source code please send me an email at max@gotactile.fr or a twit @gotactile<br /><br />Looking forward to hearing your thougths<br /><br />You can find more information on Maxence Dislaire alias GoTactile here <a href=\"http://twitter.com/gotactile\">twitter.com/gotactile</a> or here <a href=\"http://gotactile.fr\">http://gotactile.fr</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "Multitouch,<IMENU>-force=SetShl,",
  "LastEdited": "2010-02-16T08:00:38.763-08:00"
}