{
  "ProjectName": "xamlexporter",
  "Title": "XAML Exporter for Blender",
  "Description": "The XAML export script for Blender allows the popular free 3D modeler to be used to create content for WPF applications.  3D scenes created in Blender are exported to .xaml files which can be dynamically loaded or compiled into your WPF applications.\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The XAML export script for Blender allows the popular free 3D modeler to be used to create content for WPF applications.  3D scenes created in Blender are exported to .xaml files which can be dynamically loaded or compiled into your WPF applications.<br /><br /><img src=\"/projects/xamlexporter/e99f7395-9685-4051-9576-447097ba2e76\" alt=\"XamlExporter_ScreenShot.png\" title=\"XamlExporter_ScreenShot.png\" /><br /><br /><b>Installation Instructions</b>\n<ul><li>Install the version of Blender indicated in the release notes.  Blender is available from <a href=\"http://www.blender.org\">http://www.blender.org</a></li>\n<li>Copy the xaml_export.py file to Blender&#39;s scripts directory.  On Windows this is typically located at one of the following locations:</li></ul>\n<pre>\nC:\\Program Files\\Blender Foundation\\Blender\\.blender\\scripts\nC:\\Documents and Settings\\&lt;YourUserName&gt;\\Application Data\\Blender Foundation\\Blender\\.blender\\scripts\n</pre>\n<ul><li>Restart Blender.  If the installation was successful you should see a new entry under Blender&#39;s ~File~Export menu for &quot;Xaml (.xaml)...&quot;</li></ul>\n<br /><b>Usage</b><br />After composing your 3D scene is Blender choose the ~File~Export~Xaml menu.  This will display Blender&#39;s standard file dialog.  Enter the name of your scene and press the &quot;Export Xaml&quot; button.<br /><br />The exported Xaml can be viewed in the WPF Model Viewer, which is included in the <a href=\"http://codeplex.com/3dtools\">3D Tools project</a>.  Alternatively, you can dynamically load the Xaml into your WPF application using XamlReader.Load(fileStream).<br /><br /><b>Known Issues</b>\n<ul><li>The ImageSource property is exported as a fully qualified path as it appears in Blender (e.g., &quot;D:\\MyModels\\Ballmer.png&quot;). </li>\n<li>If you add a texture, you will need to go into the UV editor and add texture coordinates.  The exporter does not export the &quot;default&quot; UV coordinates that Blender displays when a mesh has no UV coordinates assigned.</li>\n<li>The Windows Presentation Foundation does not have an image codec for Targa (*.tga) files.  If you export a model which uses Targa files you will need to convert these by hand to a format supported by the WPF (e.g., PNG) and fix the exported .xaml by hand. </li>\n<li>Diffuse materials are exported as a simple texture if applicable or a solid color if no texture is available.  Other types of materials are not currently supported. </li>\n<li>Blender uses different lighting equations than the WPF.  As a result, exported lighting is approximate.  Only &quot;Sun&quot;, &quot;Lamp&quot;, and &quot;Spot&quot; light types are supported. </li>\n<li>There is currently no support for animation or support for geometry types other than meshes. The recommended workflow is to use Expression Blend to create the animations.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "wpf3d,wpf,xaml,editor,Blender to Xaml,",
  "LastEdited": "2008-06-18T14:00:49.347-07:00"
}