{
  "ProjectName": "XPathAutoSuggest",
  "Title": "XPath AutoSuggest and Evaluate",
  "Description": "Simple and easy to use, you'll develop your XPath queries faster with this tool. Can't remember the syntax? No problem, use the Suggest feature to get at least one way to fetch the node you need.\r\n\r\nFeatures:\r\n  - AutoSuggest: Paste your XML into the editor, highlight a node, click the button, get Suggested XPath queries\r\n  - Evaluate your own XPath query, or modify a suggestion: quickly see if your query returns what you expect\r\n  - Learn new XPath syntax: the suggestions may teach you new tricks!\r\n  - Format and validate your XML - to make it easier to develop with",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1><em>XPath AutoSuggest</em>: Helping You Build XPath Queries</h1>\r\n<ul>\r\n<li>Paste your XML into the App </li><li>Type and test your XPath query in a fast, convenient and crash-free environment\r\n</li><li>Forgot the syntax? No problem, use the Suggest feature </li><li>Which may suggest some XPath syntax you didn't think of </li></ul>\r\n<p>XPathTool helps you get your work done faster and smarter. XPath novice? No problem, the suggest feature gets you started. Trying a tricky query? XPath tool reduces your testing time by giving you rapid turn-around between writing your query and testing\r\n it. Meet your deadlines and impress your peers by using XPath tool to write and test your XPath queries in a hurry.</p>\r\n<h2>Sample Suggestions</h2>\r\n<p>As you know, XPath is a sophisticated query language, and this tool can make sophisticated suggestions. Now you don't need to memorize the syntax! The table below shows output from the app.</p>\r\n<table title=\"Sample XPath Queries Generated\" border=\"2\" cellpadding=\" 5\">\r\n<thead>\r\n<tr>\r\n<td><strong><span style=\"color:#000000\">Sample XPath Suggestion<br>\r\n</span></strong></td>\r\n<td><strong><span style=\"color:#000000\">Meaning</span></strong></td>\r\n</tr>\r\n</thead>\r\n<tbody>\r\n<tr>\r\n<td>/bookstore/book/title</td>\r\n<td>This basic query follows your path, it may result in multiple hits if the node has peers</td>\r\n</tr>\r\n<tr>\r\n<td>/bookstore[1]/book[2]/title[1]</td>\r\n<td>Solves the problem from above, it goes to the second book in your XML</td>\r\n</tr>\r\n<tr>\r\n<td>/bookstore/book[title=&quot;XPath for Dummies&quot;]/title</td>\r\n<td>Find the book whose title is &quot;XPath for Dummies&quot;<br>\r\n</td>\r\n</tr>\r\n<tr>\r\n<td>/bookstore/book/title[substring(., 11, 7)='Dummies']</td>\r\n<td>Find all the books that have the word 'Dummies' at position 11 in their title</td>\r\n</tr>\r\n<tr>\r\n<td>/bookstore/book[price&gt;=9.95]/price</td>\r\n<td>Find all the books whose price is greater than 9.95</td>\r\n</tr>\r\n<tr>\r\n<td>/bookstore/book/title[@lang='eng']</td>\r\n<td>Find the titles of all books whose language is English (using a tag attribute)<br>\r\n</td>\r\n</tr>\r\n</tbody>\r\n</table>\r\n<p>&nbsp;</p>\r\n<h2>Other Features</h2>\r\n<ul>\r\n<li>Format your messy XML with the built-in menu </li><li>Load/save your XML from file </li><li>Click the button to validate your XML before you save, get line-numbers of mistakes\r\n</li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "XPath,XML,Programmer Tools,WPF,",
  "LastEdited": "2012-05-11T13:37:14.513-07:00"
}