{
  "ProjectName": "xrmciframework",
  "Title": "xRM CI Framework",
  "Description": "The xRM Continuous Integration (CI) Framework is a set of tools that makes it easy and quick to automate the builds and deployment of your CRM components.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>For CRM 2015 &amp; 365 take a look at the updated framework on <a href=\"https://github.com/WaelHamze/xrm-ci-framework\">\r\nGithub</a>.</strong></p>\r\n<p><strong>The xRM Continuous Integration (CI) Framework is a set of tools that makes it easy and quick to automate builds and deployment of your CRM components.</strong></p>\r\n<p>Implementing continuous integration is always a nice to have feature on Dynamics CRM projects which in most cases gets left for various reasons even though having this setup will\r\n<strong>save</strong> lots of <strong>time</strong> long term, <strong>reduce</strong> the\r\n<strong>risk</strong> and improve <strong>productivity</strong>. Using <strong>xRM CI Framework</strong> you can quickly implement a\r\n<strong>build-&gt;deploy-&gt;test</strong> workflow with a <strong>few clicks</strong>. This is achieved by providing easy to use templates and sample scripts. These can also be easily\r\n<strong>extend </strong>to meet any complex or specific scenarios you might have.<br>\r\n<br>\r\n<img src=\"/projects/xrmciframework/6e402e58-e466-4883-a87e-dcb292def000\" alt=\"\" width=\"300\" height=\"300\"></p>\r\n<p>Below is a summary of the main components and features of the framework.</p>\r\n<h1>Custom PowerShell Cmdlets for Dynamics CRM</h1>\r\n<p><strong>PowerShell</strong> allows you to <strong>automate</strong> various processes by scripting the tasks that are normally performed manually on servers and applications.<br>\r\n<br>\r\nThe <strong>xRM CI Framework</strong>&nbsp;provides you with PowerShell &ldquo;Cmdlets&rdquo; to allow you to script some of the task that are normally executed manually during the build and/or deployment of your Dynamics CRM Solutions. The most commonly used\r\n actions would be things like exporting your CRM solutions. Below is a list of Cmdlets available now.<br>\r\n<br>\r\n<img src=\"/projects/xrmciframework/2891352c-968c-498f-bf57-06290606d005\" alt=\"\" width=\"300\" height=\"300\"></p>\r\n<p>These are the generic commands/actions that you can then combine together in PowerShell scripts to implement the right process for your project needs.</p>\r\n<h1>Custom TFS Build Template for Dynamics CRM</h1>\r\n<p>A TFS Build template is a workflow that defines the flow and steps of a&nbsp;<a href=\"http://msdn.microsoft.com/en-us/library/ms252495.aspx\">TFS Build</a>. This is normally implemented using Windows Workflow Foundation. TFS Build allows you provide&nbsp;<a href=\"http://msdn.microsoft.com/en-us/library/ms400688.aspx\">custom\r\n build templates</a>&nbsp;to suite your needs.</p>\r\n<p>The Dynamics CRM 2013 TFS build template extends the&nbsp;<a href=\"http://msdn.microsoft.com/en-us/library/dd647547.aspx\">Default TFS Build template</a>&nbsp;to provide the extra steps required to Build CRM Solutions and implement Continuous Integration.\r\n It also provides the release capabilities provided by the&nbsp;<a href=\"http://msdn.microsoft.com/en-us/library/ms181355.aspx\">Release Management Template</a>.</p>\r\n<p>Using the template you can create a Dynamics CRM Build Definition to&nbsp;&ldquo;<strong>Build &ndash;&gt; Deploy &ndash;&gt; Test</strong>&rdquo; in just a few\r\n<strong>clicks</strong>. One type of scenario would be to export your solution from your development environment, deploy that solution to your stage environment and then run a series or test to validate the deployment and functionality.</p>\r\n<p>The below workflows illustrates the flow and capabilities of the Dynamics CRM 2013 custom TFS Build Template.<br>\r\n<br>\r\n<img src=\"/projects/xrmciframework/f2cc67b2-3c1f-4b95-b760-08ddedeb3337\" alt=\"\"></p>\r\n<h1>Sample PowerShell Scripts for Dynamics CRM</h1>\r\n<p>These are sample scripts demonstrate how to use some of the PowerShell Cmdlets provided with this framework and the Dynamics CRM SDK. You can execute these scripts from your workstation, from your Build system (TFS) and from your Release Automation system\r\n (Visual Studio Release Management).</p>\r\n<p>Below is a list of some of the main sample scripts:</p>\r\n<ul>\r\n<li><a href=\"https://xrmciframework.codeplex.com/SourceControl/latest#Src/Main/CRM2013/TFS2013/Xrm.Framework.CI/Xrm.Framework.CI.PowerShell/ImportSolution.ps1\" target=\"_blank\">Import Solution</a>&nbsp;(Imports a CRM solution, including error handling, downloading\r\n import logs and checking existing versions) </li><li><a href=\"https://xrmciframework.codeplex.com/SourceControl/latest#Src/Main/CRM2013/TFS2013/Xrm.Framework.CI/Xrm.Framework.CI.PowerShell/DeployPackage.ps1\" target=\"_blank\">Deploy Package</a>&nbsp;(Deploy a Dynamics CRM Deployment Package)\r\n</li><li><a href=\"https://xrmciframework.codeplex.com/SourceControl/latest#Src/Main/CRM2013/TFS2013/Xrm.Framework.CI/Xrm.Framework.CI.PowerShell/ExtractCustomizations.ps1\" target=\"_blank\">Extract Customizations</a>&nbsp;(Export a CRM solution from your environment\r\n and extracts the contents into source control using solutionpackager.exe and the TFS API)\r\n</li></ul>\r\n<h1>Getting Started</h1>\r\n<p>Take a look at the <a href=\"https://xrmciframework.codeplex.com/documentation\">\r\ndocumentation</a>&nbsp;section for step by step instructions on how to get started.</p>\r\n<h1>Discussions</h1>\r\n<p>Take a look at&nbsp;the interesting <a href=\"https://xrmciframework.codeplex.com/discussions\">\r\ndiscussions </a>on implementing Continuous Integration for Dynamics CRM in the <a href=\"https://xrmciframework.codeplex.com/discussions\">\r\ndiscussion </a>page. This is a good forum to raise any questions you have, any topics you want to discuss or get advice on any challenges you are facing.</p>\r\n<h1>Issues</h1>\r\n<p>Take a look at the <a href=\"https://xrmciframework.codeplex.com/workitem/list/basic\">\r\nissues </a>page. This is a good forum to raise any issue you are facing with using the framework and also to request any features you would like added to future releases.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Dynamics CRM,CRM 2013,CRM 2011,CI,Continuous Delivery,TFS,Release Management,PowerShell,Deployment,Automated,Automation,XRM,Framework,Toolkit,CRM,MsDynCRM,",
  "LastEdited": "2017-01-12T14:39:44.62-08:00"
}