{
  "ProjectName": "highlighterr",
  "Title": "Highlighterr for Visual C++ 2010",
  "Description": "A simple code syntax highlighter to change the colors of classes, structs, macros, etc in the Visual C++ 2010 IDE. It is implemented as a Visual Studio 2010 Extension, and uses the new Intellisense database that gets created for VC++ solutions. Also supports HLSL GLSL syntax.",
  "MovedLink": "",
  "HomeWiki": "\r\n<div class=\"wikidoc\"><strong>Project Description</strong><br>\r\nA simple code syntax highlighter to change the colors of classes, structs, macros and typedefs in the Visual C&#43;&#43; 2010 IDE. It is implemented as a Visual Studio 2010 Extension, and uses the new Intellisense database that gets created for VC&#43;&#43; solutions. Also\r\n supports HLSL and GLSL&nbsp;syntax.<br>\r\n<br>\r\nSupports HLSL and GLSL&nbsp;syntax highlighting as a bonus, as the HLSL/GLSL files in my current main project had conspicuously black text that was annoying me. Not anymore!<br>\r\n<br>\r\nHighlighterr is a Visual C# 2010 project, which is a text classifier extension for Visual Studio 2010's C&#43;&#43; editor. Its main purpose is to use the new Intellisense database for C&#43;&#43; solutions to change the font color that is used for various different C and\r\n C&#43;&#43; code constructs, such as macros, classes, typedefs, interfaces and enums.</div>\r\n<div class=\"wikidoc\"><br>\r\nIt could also make a good starting point for a more advanced C&#43;&#43; Intellisense system, since the built-in options for Intellisense in C&#43;&#43; leave a little to be desired compared to C#. This can be frustrating at times for someone who develops in both C&#43;&#43; and C#...<br>\r\n<br>\r\nIt could also make a starting point for a HLSL/GLSL intellisense system...<br>\r\n<br>\r\n<br>\r\nHere's the &quot;before and after&quot; shot:<br>\r\n<img title=\"Highlighterr Before and After\" src=\"http://i3.codeplex.com/download?ProjectName=highlighterr&DownloadId=118505\" alt=\"Highlighterr Before and After\"><br>\r\n<br>\r\n..The user can change the colors used at any time via the standard place to change fonts and colors in the IDE.<br>\r\n<br>\r\nSince Intellisense is pretty much spot-on for C&#43;&#43; now, I often wonder why Visual Studio doesn't do this by default.</div>\r\n",
  "TagList": "Visual Studio 2010,Visual C++,C++,C#,Intellisense,code colorizer,Code Hilight,Visual Studio addin,visual studio,IDE Enhancements,syntax highlighting,HLSL,GLSL,visual c++ 2010,",
  "LastEdited": "2011-01-01T03:36:17.077-08:00"
}