{
  "ProjectName": "xGSuite",
  "Title": "xGSuite",
  "Description": "The xGSuite (Created by: X - Game Suite) is a general collection of vb.net projects ranging from DirectX Graphics, HLSL, Simple Phisics, Game Console, Scene Management, Collision Detection, UI, device input, Tools/Utilities, and Game Engine Core. As well numerous example apps, and test games that have been created to test the coherency and ease of use of the libraries. Project is still in Pre-Alpha/Brain Storming phase.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>April 5, 2008 - NOTICE: The xGSuite suite has not been updated in a VERY long time. The reason is that it is written in vb.net and am now using XNA and C#. I really have no desire at the moment to convert the code into C# and XNA. I have not exactly abandoned the project i just don&#39;t wanna have to go through all the leg work to converting it over. I&#39;m kinda waiting on Microsoft to add native vb.net support to the xna framework.</b><br /><br /><b>About</b><br />The xGSuite (Created by: X - Game Suite) is a general collection of vb.net projects ranging from DirectX Graphics, HLSL, Simple Phisics, Game Console, Scene Management, Collision Detection, UI, device input, Tools/Utilities, and Game Engine Core. As well numerous example apps, and test games that have been created to test the coherency and ease of use of the libraries. Project is still in Pre-Alpha/Brain Storming phase.<br /><br />The idea of the xGSuite is to have a collection of game related projects that could be used on there own or used in conjunction together to help make games. The xGSuite is not intended to aspire to making advanced games like a FPS, but instead tries to make it easy to create smaller casual games, like Side Scrollers, tetris, breakout type games.<br /><br />For more information about the xGSuite projects visit the <a href=\"https://xgsuite.codeplex.com/documentation?referringTitle=Home\">Documentation</a> page.<br /><br />Although I (Created by: X) am not currently looking for other team members to help in the development of the xGSuite project(s) I am providing a <a href=\"https://xgsuite.codeplex.com/wikipage?title=Team%20Rules&referringTitle=Home\">Team Rules</a> page so that cirtian rules can be laid out in writing.</div><div class=\"ClearBoth\"></div>",
  "TagList": "gaming,game,XNA,3D,MDX,VB.NET,engine,2d,DirectX,console,GUI,",
  "LastEdited": "2008-04-05T10:34:42.963-07:00"
}