{
  "ProjectName": "extensiblecodecount",
  "Title": "Code Line Counter -- counts CSharp and any other source code format",
  "Description": "CodeCounter is a command line utility program for counting lines of source code.  Currently it supports C#, SQL and XAML.  CodeCounter is easily extensible to process other source code types, such as fortran.  (see documentation download for details).",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />CodeCounter is a command line utility program for counting lines of source code.  Currently it supports C&#35;, SQL and XAML.  CodeCounter is easily extensible to process other source code types, such as fortran.  &#40;see documentation download for details&#41;.<br /><br /><b>Inception</b><br /><br />Despite google, despite all of the other code sites, I cannot seem to find a program that reliable counts the number of code lines in my projects. Given my interesting in making small flexible tools, I decided it was time to build my own program for counting lines of code.<br /><br /><br /><b>Design</b><br /><br />From the start, I wanted to build a code line counter that was flexible. So I separated the logic that tabulates the counts from the logic that determines what is “countable”. I also made the logic that determines what is countable, loaded at runtime. These two decisions make for a dynamic and flexible utility program. CodeCounter is easily extended to process other source code types, such as fortran. It is as simple as implementing a few functions defined in an interface. <br /><br />See our downloads for an example of extending CodeCounter to process VB.NET files.  The documentation download contains detailed information about extending CodeCounter. <br /><br /><br /><b>What does CodeCounter do</b><br /><br />It counts the lines of code in source files. Current source code type supported are C#, Xaml and SQL. CodeCounter can easily be extended to count source code from other file types.  Download the word .doc file for details on extending CodeCounter.<br /><br /><br />Example output<br /><img src=\"http://www.quartersforhomies.com/images/output.JPG\" /><br /><br /><br /><br /><b>Installation</b><br /><br />If you downloaded the binaries, you need to copy all of the files in the ZIP into some location. I suggest some where in your path so that the program is always accessible. In the binary zip file you should have found the following files:<br /><br />Big Woo.NET.dll<br />CodeCounter.exe<br />CodeCounter.exe.config<br />CodeCounter.Library.dll<br /><br /><br />All of the files need to be copied into the same location. For me, I copied my files to C:\\program files\\tools. You should pick what works best for you.<br /><br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": ".NET,.NET 3.5,utility,C#,c# tools,Project Management,Developer Tools,Code Review,development,",
  "LastEdited": "2009-10-28T13:26:24.03-07:00"
}