{
  "ProjectName": "micromvvm",
  "Title": "MicroMVVM",
  "Description": "MicroMVVM is a framework for WinRT applications which leverages the Model View ViewModel architectural pattern by binding the View to the ViewModel at runtime.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rMicroMVVM is a framework for WinRT XAML applications which leverages the Model View ViewModel architectural pattern by binding the View to the ViewModel at runtime. <br />\n<h2>MVVM </h2>\rMicroMVVM fetches the exportable ViewModels found within an application and attaches each ViewModel to the corresponding View. <br />\n<h2>Inversion of Control</h2>\rMicroMVVM leverages the Dependency Injection pattern, the framework fetches Transient and Singleton exportable services and injects these interfaces in the ViewModel&#39;s constructor.<br />\n<h2>Navigation</h2>\rMicroMVVM.Navigation allows an easy way to navigate from one view to another from the ViewModels. Also provides the means to pass complex objects from one view to another.<br />\n<h2>Services</h2>\rIConnectionService and ILayoutService are available in MicroMVVM.Services to notify the application when the internet connection has been lost and when the application layout has changed. IStorageFileService and IToastMessageService are available to access the files found in the roaming folder and to show toast messages.<br />\n<h2>Blendabililty</h2>\rMicroMVVM offers the facility to include designtime data which can be viewed in Blend and Visual Studio.<br />\n<h2>Future Improvements</h2>\r<ul><li>Replace the current implementation to fetch the exportable ViewModels and Services and leverage on MEF composition layer.</li>\n<li>Add more generic services to MicroMVVM.Services.</li></ul>\n<br /><br /><i>The MicroMVVM framework has been inspired by the works of Marlon Grech on the MEFedMVVM framework. <a href=\"http://mefedmvvm.codeplex.com/\">http://mefedmvvm.codeplex.com/</a></i><br /><br /><i>Disclaimer: MicroMVVM is an ongoing project, so feel free to provide feedback and report issues.</i><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,IOC,Blend,Navigation,MVVM,Metro,WinRT,VisualStateManager,XAML,Dependency Injection,",
  "LastEdited": "2013-04-05T06:50:01.547-07:00"
}