{
  "ProjectName": "mosaicsnake3d",
  "Title": "Mosaic Snake 3D",
  "Description": "A clone of the popular Snake game for Windows 8. It contains a simple 3D engine based on SharpDX and is completely written in C# and Xaml.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Screenshot</strong><img src=\"http://www.rkoenig.eu/images/custom/blog/2013-04-01-PIC-01.png\" alt=\"\" width=\"600\" height=\"375\"></p>\r\n<p><strong>Project Description<br>\r\n</strong>This is a little project I started during Windows 8 Hackathon in Nuernberg, Germany. My first intention was to experiment with the new Apis of Windows 8 and - as you see in the screenshot above - how to render 3D in Windows 8. It is a clone of the\r\n popular Snake game and meant to give the user a little alternation from other actions.</p>\r\n<p>As you can see on the Screenshot I want to create a look and feel like the start screen of Windows - the main difference is 3D, but the objects should look similar (OK, the snake itself is an exception to this sentence). By the way, this is the reason for\r\n the &quot;Mosaic&quot; within the title.</p>\r\n<p><strong>Technical details<br>\r\n</strong>Now to the topic developers are interested in. The game is completely written in C# and Xaml, no other languages are used in the whole project. The project contains a little 3D engine I have ported from some of my own Desktop (Wpf / Win.Forms) projects.\r\n The engine is using the SharpDX library to make calls to DirectX3D. For the UI on the other side Xaml is used (OK, what else..).</p>\r\n<p><strong>State of the project<br>\r\n</strong>The groundwork is done. The 3d engine works, the snake moves, touch interface should work (still waiting for Currently on the worklist:</p>\r\n<ul>\r\n<li>Finishing UI controls (GameOver screen, StartScreen, Help, ...)&nbsp; </li><li>Some kind of HighScore or at least a summary of the game </li></ul>\r\n<p><strong>Further Screenshots</strong></p>\r\n<p><img src=\"http://www.rkoenig.eu/images/custom/blog/2013-04-01-PIC-02.png\" alt=\"\" width=\"600\" height=\"375\"></p>\r\n<p><img src=\"http://www.rkoenig.eu/images/custom/blog/2013-04-01-PIC-03.png\" alt=\"\" width=\"600\" height=\"375\"></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,game,3D,Snake,WinRT,",
  "LastEdited": "2013-04-01T00:46:57.463-07:00"
}