{
  "ProjectName": "MyColorSprite",
  "Title": "MyColorSprite",
  "Description": "This Silverlight app is a color selection tool especially great for creating gredient color brushes for the xaml code.  It allows a user create/pick and save up to 44 colors in the container and use any of those colors to create linear/radial gredient brushes all in one place.  ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><br /><b>MyColorSprite</b><br /><br /><b>Updated MyColorSprite1.1 Release</b><br />This release doesn&#39;t contain any major additions to the initial release.  A few fixes have been made to improve the performance.\n<ol><li>Recompiled in VS2010 Pro</li>\n<li>Seperated code generator for Linear and Radial gradient properties to minimize any confusion.</li>\n<li>Improved performance in saving simple colors in the color container.</li></ol>\n<br /><b>MyColorSprite1.0 Release</b>\n<ol><li>Platform:* Silverlight 3.0 in .NET Framework 4</li>\n<li>Language:* C# - MS Visual Studio 2010 Beta</li>\n<li>Sample Demo:* <a href=\"http://www.dbsoup.org\">http://www.dbsoup.org</a></li></ol>\n<br /><b>Architecture/Design:</b> This application is divided into four major sections:\n<ol><li>Color Picker - this is where a user can create a new  color by using A/R/G/B color sliders.</li>\n<li>Color Container - Once a color is created, it can be saved in the container by simply clicking a sample color box.  Any color in the container also can be transferred to the main sample color box.  Once it is transferred, the container box will be available for another color.  By doing so, a user will be working with a lot more than 44 colors. </li>\n<li>Linear/Radial Gradient Creator - Up to 9 color stops are allowed for gradient brushes for different gradient types.  </li>\n<li>Linear/Radial Gradient Display and XAML Code Generator - As soon as gradient properties are ready, gradient brushes will be shown accordingly.  There are two rectangles, one for linear display and the other for radial display.  Press the &#39;xaml code&#39; button to generate the current code.   Once a code is generated, a user can also click the linear/radial display rectangle to view the code. </li></ol>\n<br /><b>Next Version:</b> The next version of MyColorSprite is planned in WPF with additional features. </div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight 3,C#,framework 4,Visual Studio 2010,Visual Studio,Framework 3.5,Visual Studio 2008,",
  "LastEdited": "2011-07-14T16:19:24.877-07:00"
}