{
  "ProjectName": "petra",
  "Title": "Petra.Gis",
  "Description": "GIS toolkit library written in C#, published as projectware, usefull with intergraph GeoMedia product suite, focused to SQLServer.\r\n - SFS geometry model\r\n - SHP, GDO data providers\r\n - TIFF, CIT image decoders\r\n - SRS transform with XAML, JSON supp.\r\n - legend driven map display components\r\n\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><strong>Project Description</strong></p>\r\n<p><strong>P</strong>lanar&nbsp;<strong>E</strong>ar<strong>T</strong>h&nbsp;<strong>RA</strong>mbled, shortly PETRA is small&nbsp;GIS toolkit (set of .NET assemblies) published as projectWare, usefull with Intergraph GeoMedia&reg; product suite, focused to\r\n SQLServer.</p>\r\n<p>Primary project purpose is to have variable/customizable projectware option to strictly commercially licensed Intergraph&reg; and ESRI&reg; products and tools. This is sometimes necessary with larger projects.</p>\r\n<p>Project is written in C# and managed by VC# Express.&nbsp;</p>\r\n<p>Some key features:</p>\r\n<ul>\r\n<li>supports OCG SFS 1.1 geometry model, extended with Arc, Text/Label and Grid/Image geometry type\r\n</li><li>SHP, GDOSQL data providers and geometry factories. </li><li>TIFF, CIT image decoders, where TIFF decoder supports full Adobe&reg; TIFF spec. (all possible image geometry and color schemes), except of GeoTiff tag, which was quite fuzzy at time of implementation.\r\n</li><li>For TIFF also image tiles are supported as specified by Intergraph&reg; </li><li>SRS and SRS transform (including precise image transforms) with XAML, JSON support for coordinate system and transform storage.\r\n</li><li>legend driven map display components </li></ul>\r\n<p>Updates:</p>\r\n<ul>\r\n<li>Geometry factory for MSSQL 10 geometry and geography data types provided, read more\r\n<a title=\"mssql server 10 in Petra.Gis\" href=\"http://petra.codeplex.com/wikipage?title=MS%20SQL%20server%2010%20%282008%29%20geometry%20and%20geography%20in%20Petra.Gis\">\r\nhere</a> </li></ul>\r\n<p>Project Petra.Gis&nbsp;has multiple licences.&nbsp;&nbsp;It contains a lot of work of other people, published under various licenses. Please read carefully license terms within source.</p>\r\n<p>Source code is still not fully clean and txt files are outdated. Rather read source code notes than txt's.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "OGC,SFS,GeoMedia,sqlserver,tiff decoder,cit,SRS,",
  "LastEdited": "2011-11-15T14:34:14.933-08:00"
}