{
  "ProjectName": "remarker",
  "Title": "Remarker",
  "Description": "Remarker is a Visual Studio 2013 extension designed to enhance comment appearance within C#, Visual Basic, Xaml and other code files.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>News</h1>\r\nI have just released version 1.3 of Remarker which fixes several multi-line comment issues. In previous versions Remarker could not handle any of these cases:<br /><br /><div style=\"color:Black;background-color:White;\"><pre>\r\n<span style=\"color:Green;\">/* +++ First line of multi-line comment\n *\n * +++ Middle lines starting with an asterisk\n *\n   +++ Last line ending with delimiter.  */</span> \r\n</pre></div><br />All of these cases now work correctly.<br /><br />Because SQL comments start with &quot;--&quot;, previous versions of Remarker would present SQL comments as a &quot;Tiny.&quot; comment, which is almost unreadable by default. For that reason Remarker is now disabled in SQL scripts. I can add SQL later, if there is enough interest in having Remarker functionality in SQL scripts.<br /><br />Finally NLog logging has been added to Remarker to make it a little easier to troubleshoot problems within Remarker. A new options page has been added to control Remarker logging.<br /><br />If you are using an earlier version of Remarker, please upgrade to version 1.3 soon.<br /><br /><b>Project Description</b><br /><br />Remarker is a Visual Studio 2013 extension designed to help programmers add remarks (comments) in their code that are easily visible and useful. Remarker uses color, boldface, typefaces and font sizes to highlight various types of remarks in the code.<br /><br />See an example below.<br /><br />This extension is primarily written for C#, but it is still able to work in any language supported by Visual Studio as long as comments start with &quot;//&quot; or exist on otherwise empty lines between multi-line comment delimiters. Visual Basic comments starting with an apostrophe are also supported. This partly depends on the way Visual Studio identifies and tags comments within its editors, so there may be cases where this does not work as expected.<br /><br />In C# comments are modified by following the double slash comment delimiter with with optional modifier and and emphasis symbols. The modifiers are &quot;!&quot; (for important comments), &quot;?&quot; (for questions), and &quot;x&quot; (to indicate lines to strike out). The emphasis symbols are &quot;-&quot; (for less emphasis) and &quot;+&quot; (for more emphasis). Only one modifier may be used per line, and up to three of either emphasis symbols may be used. Modifier and emphasis symbols must come first within a comment after optional white space, but there must be no white space among the modifier and emphasis symbols. However, the modifier and emphasis symbols must be followed by white space to be recognized.<br /><br />For example:<br /><br /><img src=\"/projects/remarker/6f8b3662-9c00-4941-852f-6521ec65f0b5\" alt=\"917417\" title=\"917417\" /><br /><br />Another feature of Remarker is its support for configurable headers called &quot;tasks.&quot; If a task is the first word on a comment line, it receives special handling and can be given its own typeface, bold style, and color. Several tasks are defined, but these can be modified in any way you wish. Up to ten tasks can be defined.<br /><br />The extension creates a Remarker section within Visual Studio&#39;s Options dialog box with two sub-pages defined. Comment Settings provides a place to modify the font used for comments, and size factors for each of the six emphasis settings. The Task Settings page provides a place to configure the tasks you want Remarker to recognize.<br /><br />You will also find several Remarker entries within the Environment/Fonts and Colors page to configure the colors for the various emphasis levels.<br /><br />There are several other extensions available to work similarly to Remarker. I have tried most, and all do a good job. The main difference between the others and Remarker is the fact that mine allows for spaces between comment delimiters and the extension&#39;s modifiers. This is important especially in Xaml when formatting tools commonly force white space there, breaking any emphasis given by such tools.<br /><br />We hope you enjoy Remarker, and that you will let us know if you have any trouble with it. We value your suggestions and other comments.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-09-30T04:51:25.893-07:00"
}