{
  "ProjectName": "silverzoom",
  "Title": "silverZoom",
  "Description": "SilverZoom is a Silverlight 1.0 control to allow fast, dynamic, interactive zooming for high resolution images. It uses a multi-level tiling algorithm to load only those tiles needed to display an image in the best quality possible. The project comes with a command-line-based/batch-enabled converter tool to produce the necessary tiles from a high resolution image.\n\nSilverZoom is supposed to be used in modern eShops and online catalogues to enhance the shopping experience.\n\nYou can find a sample here: http://neogeo.com/samples/SilverZoom/\nAlso, we have a Silverlight Streaming version running here: http://neogeo.com/samples/SilverZoomStream/\n\nFeedback is always appreciated :)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Welcome to silverZoom</h1>\rThe Silverlight Zoom Client silverZoom is a prototype for continuous zooming within specified images, developed by NeoGeo New Media GmbH <a href=\"http://www.neogeo.com/\">http://www.neogeo.com/</a>.<br /><br />Many webshops on the internet implemented a flash-based details/zoom view for images where zooming and other options are available for the visitor. In contrast to these flash-based applications the Zoom Client is the first application based completely on Silverlight 1.0 and JavaScript. It has broad functionality and implements many features that many of the current flash-applications are not supporting.<br /><br />The silverZoom Client can be placed on any website like HTML- or PHP-based applications. There really is no ASP.NET prerequisite since the silverZoom is written in XAML and JavaScript. The visitors just have to have the Silverlight plugin installed on their machine to use the Zoom Client application. A custom installer for Silverlight is included.<br /><br />With this application you will be able to dynamically load images into the XAML and interact with them. You will be able to zoom into the image to depths only limited by the source-image used in the (optional) Silverlight Image Converter, which prepares a large image by producing multi-level tiles. These tiles with higher resolutions will progressively be loaded and resulting in a constant clear view of the zoomed image.<br /><br />Using the UI, the mouse-wheel, mouse-buttons and even the keyboard, the visitor is enabled to effectively manipulate the scene and quickly navigating through the depths of the zoomed images without having any waiting periods.<br /><br /><img src=\"/projects/silverzoom/8681fe05-2fd6-4b1a-9ac1-e55d3bfe70ec\" alt=\"silverzoom.png\" title=\"silverzoom.png\" /><br /><br />While there are many kinds of detailed image applications out there, silverZoom intends to play in the upper league. As the first Silverlight based application of this kind it provides broad functionality for the convenience of the visitor. Using many ways to interact with the application speeds up the seamless experience for the user.<br /><br />A difficult integration into a customized website is no longer needed, since the structure is extremely simple to implement into any kind of webpage. Also this is a completely free application and can be obtained by everyone. Even if you do not have the necessary hosting space, you can get a free hosting service for your XAML application by using the Silverlight Streaming service, which provides up to 4GB of free image and XAML-hosting service.<br /><br />silverZoom is distributed with the image converter which is necessary to generate the specially prepared images for the client application. The image converter is a lightweigth, userfriendly and batchable console application and can easily be configured to match the users preferences. Simply set up your working folders, put in some images, and place the result in the client applications <i>/images</i> folder and your are ready to run the application.<br /><br />Interested, but not yet convinced?<br /><br />Feel free to take a look at out live demonstration of the SilverLight Zoom Client application on our live server <a href=\"http://www.neogeo.com/samples/SilverZoom/\">http://www.neogeo.com/samples/SilverZoom/</a><br /><i>Remember that you can use mouse <u>and</u> keyboard to enhance your experience with SilverZoom. Ctrl + scrolling is just one possibility. For the complete list of mappings please take a look into the documentation.</i><br /><br />Do you ask yourself if the Silveright Streaming service offered by Microsoft has a good performance for your application?<br />We set up a SilverZoom Client application to work with Silverlight Streaming. Try it here <a href=\"http://www.neogeo.com/samples/SilverZoomStream/\">http://www.neogeo.com/samples/SilverZoomStream/</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "ASP.NET,javascript,xaml,Silverlight,Silverlight control,Silverlight Controls,SilverlightStreaming,Zoom,",
  "LastEdited": "2008-02-01T01:40:31.26-08:00"
}