{
  "ProjectName": "WowGRA",
  "Title": "WoW Guild Raid Assist",
  "Description": "The WoW Guild Raid Assistant (GRA) is a comprehensive World of Warcraft add-on designed to assist Guild Masters and Raid Leaders with all aspects of building, managing, and leading raids. \n\nThe project is developed in C# and .XAML, and .LUA for the in-game interface. ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Note</b>: The GRA is currently in Alpha state, and has limited functionality both on the desktop and in-game. Gnomish software engineers are working round the clock to establish complete functionality to the project. <br /><br />In the mean time, please direct any comments or suggestions to Taskmaster Leeza or Overseer Hammerhand. \n<h2>In a world... </h2>\r...where heroes test their mettle against the forces of evil, facing off against fearsome dragons, deceitful demons, relentless swarms of undead, and even the Old Gods… there’s nothing tougher than being the one in charge. <br /><br /><b>WoW Guild Raid Assistant</b><br /><br />The WoW Guild Raid Assistant (GRA) is a comprehensive add-on designed for World of Warcraft Guild Masters and Raid Leaders. <br /><br />Capable of assisting with all aspects of raid leadership, the GRA serves as an all-in-one raid tool that streamlines the process of conquering World of Warcraft raid instances. <br /><br /><b>Project Features</b>:<br />\n<ul><li><b>Raid Builder</b> – choose raid encounters past and present and build the perfect raid with an optimized balance of tanks, healers and DPS.</li></ul>\n\n<ul><li><b>Buff/Debuff Equilibrium</b> – ensure all raid members receive the ideal buffs and debuffs to maximize their effectiveness.</li></ul>\n\n<ul><li><b>Upgrade Locator</b> – ensure loot is given to the raid members who need it, and let no useful loot be disenchanted or resigned to off-spec!</li></ul>\n\n<ul><li><b>Loot Prioritization</b> – prioritize loot to specific raid members based on preferred loot distribution method.</li></ul>\n<br /><b>Development:</b><br /><br />The GRA was developed in C# and .XAML for the desktop interface, with .LUA for the in-game interface. </div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-08-17T22:24:02.65-07:00"
}