{
  "ProjectName": "WPWidgetLibrary",
  "Title": "WpWidgetLibrary - HTML Widgets for Windows Phone",
  "Description": "This library helps you to build, deploy and update a HTML app to Windows Phone device as a native WP7 App. Library extract HTML content from application resource to isolated storage. \r\n\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>Why do you need WpWidgetLibrary?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</h1>\r\n<p><img title=\"wgpic1\" src=\"http://download.codeplex.com/Download?ProjectName=wpwidgetlibrary&DownloadId=293726\" border=\"0\" alt=\"wgpic1\" width=\"286\" height=\"484\" align=\"left\" style=\"padding-left:0px; padding-right:0px; display:inline; float:left; padding-top:0px; border:0px\"></p>\r\n<p>Do you want to implement apps for cross-browser support? Is so and if you are Windows Phone developer this is the right project for you.\r\n<br>\r\nThis project gives you ability to startup with HTML5 at Windows Phone right now. <br>\r\n<br>\r\nWindows Phone 7.1 has internet browser based on the Internet Explorer 9, and the version in WP7.1 is the almost the same build used for IE9 desktop edition.\r\n<br>\r\nThis means the WP7&#43; is able to render HTML5 content. In comparison to Chrome it is supported less HTML5 elements, but some of important features like geo-location,\r\n<br>\r\ncanvas etc. works well. Usually Widows Phone is executing the HTML5 application which is hosted on some web server, and it is not a big deal to open IE on phone\r\n<br>\r\nand to navigate to the URL of the HTML5 web application. For more information about HTML5 support at Windows Phone and other devices please take a look on\r\n<br>\r\nDamir's post &quot;<a href=\"http://developers.de/blogs/damir_dobric/archive/2011/09/12/html5-for-windows-phone-7-1-episode-i-html5-support.aspx\">HTML5 for Windows Phone 7.1&#43; - Episode</a> I&quot;</p>\r\n<p>As long you are browsing your HTML5 application in <strong>WebBrowserControl </strong>\r\nthere is no need for you to use this library. However, one app should be in general installed on device.\r\n<br>\r\nCurrently there is no way for <strong>WebBrowserControl</strong> to navigate to HTML file which is located somewhere in file system at the phone as this is supported by Android and iOS.\r\n<br>\r\nIf you want to install your HTML5 application on device like Windows Mobile 6.5 did it with widgets this is the library which will help you to do this by calling of a single line of code.\r\n<br>\r\n<br>\r\nThis library helps you to deploy a HTML app to Windows Phone 7. The library contains set of helper methods which extract web content from application resource to isolated storage.\r\n<br>\r\nOn that way it is possible to develop WP7 HTML5 app which can pass marketplace requirements as purchasing, updating, installing, works offline etc.</p>\r\n<p>Widget class library solves this problem by deploying cross platform HTML5 Widget application on Windows Phone 7 so that web content can be installed on disk.\r\n<br>\r\nWith WPWidget you can easily make Windows Phone 7 hybrid application containing of the native part written in Silverlight and web part written in HTML, JavaScript and CSS.</p>\r\n<p>If you want to know how we have been inspired to setup this project please take a look on Damir's Episode II &quot;<a href=\"http://developers.de/blogs/damir_dobric/archive/2011/09/13/html5-for-windows-phone-7-1-episode-ii-browsing-html-content.aspx\">Browsing\r\n HTML content</a>&quot;.</p>\r\n<h1>How to use the WPWidgetLibrary?</h1>\r\n<p>In only few steps you can make fully functional hybrid Windows Phone 7 application. On the picture below it is shown how to use the library.</p>\r\n<p>1. Reference <em><strong>Daenet.WidgetLibrary.dll </strong></em>in to you WP7 project.</p>\r\n<p>2. Copy your HTML (App) to some project folder and mark all files in build action as\r\n<em><strong><span style=\"color:#ff0000\">EmbededResource</span></strong></em>.</p>\r\n<p>3. From the Toolbox drag the WebBrowser Control and in PageLoaded event navigate to desired webpage. (See red rectangle in xaml file.)</p>\r\n<p>4. In the MainPage constructor append following code. This code will on start of application copy all HTML related content to isolated storage.\r\n<br>\r\n&nbsp;&nbsp; The string array (second argument of InstallHTMLContent) should contain all subfolders of your project which have to be copied to Isolated Storage\r\n<br>\r\n&nbsp;&nbsp; too. If you have very simple App with all files in one folder, then this argument is not required.</p>\r\n<p><img title=\"pic5\" src=\"http://download.codeplex.com/Download?ProjectName=wpwidgetlibrary&DownloadId=293292\" alt=\"pic5\" width=\"530\" height=\"127\" style=\"display:inline\"></p>\r\n<p>5. Set initial page to webBrowser control from the MainPage Loaded event in code-behind.\r\n<br>\r\n&nbsp;&nbsp; Following code is a common WebBrowserControl code, which starts browsing of the page.\r\n<br>\r\n&nbsp;&nbsp; Please note that navigating page (StartPage.htm) is not the page hosted online. It is the page\r\n<br>\r\n&nbsp;&nbsp; in Isolated Storage.</p>\r\n<p><span lang=\"EN-US\" style=\"color:black; font-size:10pt\"><span style=\"color:#008000\"><img title=\"pic6\" src=\"http://download.codeplex.com/Download?ProjectName=wpwidgetlibrary&DownloadId=293265\" alt=\"pic6\" width=\"536\" height=\"95\" style=\"display:inline\">&nbsp;</span></span></p>\r\n<p>Compile and run the application, and you are looking the full featured HTML Widget application.</p>\r\n<p><img title=\"pic3\" src=\"http://download.codeplex.com/Download?ProjectName=wpwidgetlibrary&DownloadId=293266\" alt=\"pic3\" width=\"614\" height=\"480\" style=\"display:inline\"></p>\r\n<p>More information will be published on demand in our blogs:</p>\r\n<p>1. <a href=\"http://developers.de/members/ddobric/default.aspx\">Damir Dobric Blog</a></p>\r\n<p>2. <a href=\"http://bhrnjica.net\">Bahrudin Hrnjica Blog</a></p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "WP7,Phone,Windows Phone 7,HTML5,html,xaml,Silverlight,Silverlight Controls,",
  "LastEdited": "2011-10-18T03:53:14.697-07:00"
}