{
  "ProjectName": "ylad",
  "Title": "Your Last About Dialog",
  "Description": "Are you tired of recreating the same about dialog logic and content for each Windows Phone app every time? \"Your Last About Dialog\" is a robust and generic, highly configurable implementation you can easily pull into your own app and set up for your needs. It is able to pull most data from your application automatically, supports fetching both text and Xaml content from remote sources (with fallback local content), and allows easy localization of the complete dialog content to all of the languages supported by your app.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<h1>YLAD - Your Last About dialog</h1>\r\nAre you tired of recreating the same about dialog logic and content for each Windows Phone app every time? &quot;Your Last About Dialog&quot; is a robust and generic, highly configurable implementation you can easily pull into your own app and set up for your needs.\r\n It is able to pull most data from your application automatically, supports fetching both text and Xaml content from remote sources (with fallback local content), and allows easy localization of the complete dialog content to all of the languages supported\r\n by your app.<br>\r\n<br>\r\nTo learn more about the project and how to use it in your own application,<br>\r\nplease go to the <a href=\"/ylad/documentation?referringTitle=Home\">documentation tab</a>.<br>\r\n<br>\r\nTo see YLAD in action, you can take a look at the <a href=\"http://www.windowsphone.com/de-DE/apps/35571846-14bc-4db2-bc58-2d592763da12\">\r\nWinPhone DevHub sample application</a> by Max Paulousky, available for free in the Marketplace.<br>\r\n<h2>Announcement</h2>\r\n<p>The YLAD project will switch to TFS shortly. Unfortunately this means that work items and source control history will be lost (more details\r\n<a href=\"http://codeplex.codeplex.com/wikipage?title=CodePlex%20FAQ#TFStoMercurial\">\r\nhere</a>). <strong><font color=\"#ff0000\">Update:</font></strong> the conversion has finished and the old Mercurial source has been restored into a main and dev branch. I also updated the releases as far as possible, to point to the correct new change set identifiers\r\n (and remove old invalid ones). Sorry for any inconvenience this may have caused.</p>\r\n<h2>Version 2.1 released on NuGet</h2>\r\n<p>Version 2.1 is now available on NuGet. It contains an improved version for Windows Phone 7.1 with small bug fixes and an improved code base, as well as a version that natively targets Windows Phone 8. The source code for the new version of course is available\r\n here on CodePlex. Enjoy!</p>\r\n<h2>Version 2.0 released</h2>\r\nThe second major release of YLAD adds styling features to the project. You are now able to define what the about page looks in great detail, including colors, fonts, and basically all the important control styles/templates that are used. Take a look at the\r\n styles resource dictionary that is created automatically when you install the package from NuGet for some samples, or use the documentation here on CodePlex for more details.</div><div class=\"ClearBoth\"></div>",
  "TagList": "WP7,Windows Phone 7,About Page,About Dialog,windows phone,Windows Phone 8,WP8,",
  "LastEdited": "2013-04-04T03:50:04.037-07:00"
}