{
  "ProjectName": "Animator2D",
  "Title": "Animator2D",
  "Description": "Animator2D is a simple animation library that allows you to string together (sequence) different animation behaviours. Sequences can be re-used for each movable object ('mob' from now on) in your scene. Mob's will always have a position (Vector2) and a heading vector (Vector2). The heading vector is a displacement so it tells you both where to and how fast.\r\n\r\nAnimator2D is designed specifically to animate mobs in scrolling shooters. Because sequences are reusable, mobs that follow each other are as easy as waiting a predefined period between assigning sequences.\r\n\r\nSequences are implemented per mob allowing special cases per mob, such as a position offset. This allows for other group formation effects.\r\n",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h2>New release - 0.0.48a</h2>\r<a href=\"https://animator2d.codeplex.com/releases/view/1578\">0.0.48a Alpha</a><br /><br /><img src=\"/projects/Animator2D/f5b0f39e-aa4e-4140-b292-00fb6bdf81a4\" alt=\"Anmator2D_0.0.48.jpg\" title=\"Anmator2D_0.0.48.jpg\" /><br /><br />Added CurveTo with help from Simon Buxton.<br />He proposed the &quot;Cubic Hermite Spline&quot; and it seems to do the job quite well.<br /><br />Still working on the BoxAround, CircleAround and sample code for mob management.<br />\n<h2>There is a release</h2>\r<i>11th Jan 07</i><br /><br />There is actually a release in the Releases under &#39;planned release&#39;.<br /><br />This release, 0.0.42a, has the nuts and bolts to sequence your animations and get you started. <br /><br />I plan to make another alpha release by the 14th with CurveTo, BoxAround and CircleAround. Also in that release I hope to have some examples of mob management in the demo code.<br />\n<h2>New Project</h2>\r<i>7th Jan 07</i><br /><br />First full version will start with behaviours for:\n<ul><li>JumpTo</li>\n<li>LineTo</li>\n<li>WaitFor</li>\n<li>WaitUntil</li>\n<li>CurveTo (Catmull-Rom I guess?)</li>\n<li>CircleAround</li>\n<li>BoxAround</li></ul>\n<br />Future implementations will include complex Bezier curves and also temporal modifiers for &#39;ease in&#39;, &#39;ease out&#39;, &#39;ease in/out&#39; etc.</div><div class=\"ClearBoth\"></div>",
  "TagList": "C#,XNA,2d,cool,Animation,",
  "LastEdited": "2009-03-04T10:20:20.803-08:00"
}