{
  "ProjectName": "arepa",
  "Title": "Arepa",
  "Description": "BDD inspector and report generator.\r\n\r\nArepa is a lightweight non-invasive tool that helps you to implement Behavior Driven Development (BDD) on .NET projects.  Arepa produces guidelines of using BDD on your current tests, and customisable and portable test reports integrating XML Documentation Comments. It's developed in C# using Scrum and BDD.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />BDD inspector and report generator.<br /><br />Arepa is a lightweight non-invasive tool that helps you to implement Behavior Driven Development &#40;BDD&#41; on .NET projects.  Arepa produces guidelines of using BDD on your current tests, and customisable and portable test reports integrating XML Documentation Comments. It&#39;s developed in C&#35; using Scrum and BDD.<br /><br />&lt;This documentation is for preview only, and is subject to change in later releases.&gt;<br />\n<ul><li>Do you want to use Behavior Driven Development (BDD) on your .NET Projects?</li>\n<li>Do you want a tool to inspect if you are doing it well?</li>\n<li>Do you want to maintain a well documented test harness?</li>\n<li>Do you want a tool to produce a test report oriented to BDD?</li></ul>\n<u>Arepa is the tool you were looking for!</u><br /><br /><b>Steps</b><br />\n<ol><li>Write your features and scenarios in plan-text using your XML documentation comments.</li>\n<li>Arepa inspects if you are following a proper BDD and it will throw a set of errors and warnings to help you to do it well.</li>\n<li>Run your tests.</li>\n<li>Arepa generates a test results report like <a href=\"http://jperez.net/ArepaReports/ArepaReport_ArepaRelease_0_1_0.html\">this one</a>, with all your features and scenarios.</li></ol>\n<br /><b>Features</b>\n<ul><li>It Inspects the XML documentation comments (/// in C# or &#39; in VB) that are embedded in the source code of your tests and throws a set of errors and warnings if you are not following proper Behavior Driven Development.</li>\n<li>It generates a portable (html) test report by combining features and scenarios found, and the MSTest results files generated by your tests. This report is BDD oriented.</li></ul>\n<br /><b>Benefits</b><br />\n<ul><li>Avoid the use of invasive BDD frameworks.</li>\n<li>Guide you on the correct use of BDD.</li>\n<li>Reuse your current test harness to be compatible with BDD (new test projects are not required)</li>\n<li>Help you to maintain a well-documented source code on your tests.</li>\n<li>Produce a <b>customisable</b> html report oriented to BDD principles and to your business.</li></ul>\n<br /><b><a href=\"http://jperez.net/arepa\">Quick guide</a></b><br /><br /><b>My Blog</b><br /><br />My blog can be found at <a href=\"http://jperez.net\">http://jperez.net</a> where I post news and updates about Arepa.</div><div class=\"ClearBoth\"></div>",
  "TagList": "BDD,xml documentation,xml,tdd,test reporting,scrum,Testing,",
  "LastEdited": "2012-03-31T22:42:17.357-07:00"
}