{
  "ProjectName": "athena",
  "Title": "Athena: Modular CAD / CAM Software for Synthetic Biology",
  "Description": "Synthetic biology is the engineering of cellular networks. It combines principles of engineering and the knowledge of biological networks to program the behavior of cells. Computational modeling techniques in conjunction with molecular biology techniques have been successful in constructing biological devices such as switches, oscillators, and gates. The ambition of synthetic biology is to construct complex systems from such fundamental devices, much in the same way electronic circuits are built from basic parts. As this ambition becomes a reality, engineering concepts such as interchangeable parts and encapsulation will find their way into biology. We realize that there is a need for computational tools that would support such engineering concepts in biology. As a solution, we have developed the software Athena that allows biological models to be constructed as modules. Modules can be connected to one another without altering the modules themselves. In addition, Athena houses various tools useful for designing synthetic networks including tools to perform simulations, automatically derive transcription rate expressions, and view and edit synthetic DNA sequences. New tools can be incorporated into Athena without modifying existing program via a plugin interface, IronPython scripts, Systems Biology Workbench interfacing and the R statistical language.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rSynthetic biology is the engineering of cellular networks. It combines principles of engineering and the knowledge of biological networks to program the behavior of cells. Computational modeling techniques in conjunction with molecular biology techniques have been successful in constructing biological devices such as switches, oscillators, and gates. The ambition of synthetic biology is to construct complex systems from such fundamental devices, much in the same way electronic circuits are built from basic parts. As this ambition becomes a reality, engineering concepts such as interchangeable parts and encapsulation will find their way into biology. We realize that there is a need for computational tools that would support such engineering concepts in biology. As a solution, we have developed the software Athena that allows biological models to be constructed as modules. Modules can be connected to one another without altering the modules themselves. In addition, Athena houses various tools useful for designing synthetic networks including tools to perform simulations, automatically derive transcription rate expressions, and view and edit synthetic DNA sequences. New tools can be incorporated into Athena without modifying existing program via a plugin interface, IronPython scripts, Systems Biology Workbench interfacing and the R statistical language.<br /><br /><br />In order to obtain the full functionality from Athena, including SBML support, AutoLayout and Simulation capabilities, it is recommended to install a copy of the Systems Biology Workbench (<a href=\"http://sys-bio.org/\">sys-bio.org</a>). Furthermore you need to have R installed in order to take advantage of the R integration. <br /><br />Additional information and downloads are available at <a href=\"http://sys-bio.org/\">sys-bio.org</a>.<br /><br />As of now Athena is used to experiment with the Systems Biology Graphical Notation <a href=\"http://sbgn.org\">http://sbgn.org</a>. While the current prototype is not ready to be a usable editor yet, all components of SBGN are available and can be experimented with. Here only a couple of examples:<br />\n<h2>A rather complex Complex</h2>\rIn SBGN you can annotate every element rather extensively, by attaching either &quot;Units of Information&quot; or display &quot;State Variables&quot;. This can be taken to the extreme as in this example<br /><img src=\"/projects/athena/81930c9f-f61e-468a-98bb-b6e778334c4d\" alt=\"SBGN-complex-small.png\" title=\"SBGN-complex-small.png\" /><br />\n<h2>Experimentation with SBGN Alias fill styles</h2>\rAt the beginning of the SBGN discussions, cloning of SBGN elements was highly debated. The compromise was to allow for the cloning of elements, but to mark them by a 25% fill ... the current prototype allows to experiment with different fill styles and how they effect all elements.<br /><img src=\"/projects/athena/75a08efc-b267-4676-893b-80be07545eb5\" alt=\"SBGN-marker.png\" title=\"SBGN-marker.png\" /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "SBW,IronPython,.NET 2.0,SQL Server CE,ZedGraph,Athena,",
  "LastEdited": "2009-01-09T11:20:30.953-08:00"
}