{
  "ProjectName": "BehaviorAnalyzer",
  "Title": "Email Behavior Analyzer",
  "Description": "The application presents statistics based on people with whom a user has corresponded or from whom he or she has received emails.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p>I developed this Microsoft Outlook Addin to present statistics based on people with whom a user has corresponded or from whom he or she has received emails. The Addin allows users to select an email folder and then specify a keyword. The application presents\r\n a sorted results table that contains the names of the people with whom he or she corresponded, their total email count, and the specified keyword/email rate for each person. This is useful for research (or curiosity) purposes&mdash;to provide some indication\r\n of who is more attached to a certain topic or project; who is more emotional, more direct, and more practical; who expresses closeness or affection for others; and to determine who is a difficult person, etc. Another reason to use such an email analysis application\r\n is to assess whether a certain project is progressing in the right direction. It can also be used to analyze employee satisfaction/dissatisfaction if certain words are used more than others in certain periods. Finally, it can predict internal/external organizational\r\n trends. Obviously, this is just a basic implementation (a five-hour project) and can be extended using advanced natural language and classification techniques. Adding charts of course is necessary&mdash;for example, x represents a person&rsquo;s name and y\r\n is a keyword/per email rate, or for a certain period (say for each quarter), x specifies keyword names and y counts occurrences. A chart can also be dedicated to one specific keyword, in which x is time and y counts occurrences, to demonstrate variability\r\n over time for the keyword. To compile the code on a machine, it might be necessary to create a test certificate. In Visual Studio 2010, go to &quot;Properties&quot; -&gt; &quot;Signing,&rdquo; then press &quot;Create Test Certificate...,&quot; and provide a password.</p>\r\n<p>Enjoy!<br>\r\n<br>\r\nUri Kartoun</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Email,Exchange,Statistics,Behavior,Outlook Add-in,Classification,Emotions,Kartoun,",
  "LastEdited": "2012-11-02T16:02:50.867-07:00"
}