{
  "ProjectName": "brainiac",
  "Title": "Brainiac Designer",
  "Description": "Brainiac Designer is an open-source visual behaviour tree editor. It allows you to build behaviour trees by using simply drag&drop. The editor supports plugins, exporters and stores behaviours as XML files.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Brainiac Designer is an open-source visual behaviour tree editor. It allows you to build behaviour trees by using simply drag&#38;drop. The editor supports plugins, exporters and stores behaviours as XML files.<br /><br /><a href=\"https://brainiac.codeplex.com/wikipage?title=How%20To%20Create%20A%20New%20Plugin&referringTitle=Home\">How To Create A New Plugin</a> - <a href=\"https://brainiac.codeplex.com/wikipage?title=Migration%20Guide%20v1.3a%20to%20v2.0&referringTitle=Home\">Migration Guide v1.3a to v2.0</a><br />\n<h1>Note</h1>\rPlease notice that the Brainiac Designer is an editor. You have to write your own exporter which generates files for your AI. The editor contains no node logic so it contains <b>no</b> AI. You have to implement the nodes by yourself. Nodes can be added, removed or modified by modifying the source code of the example plugin included.<br /><b>There is a C++ example plugin available so you can export behaviours using native code.</b><br /><br /><a href=\"http://nextgenai.com\">My Blog</a><br />\n<h1>Features</h1>\r<h2>Visual Graph with Drag &amp; Drop and Docking</h2>\r<img src=\"/projects/brainiac/42f8b883-b689-4649-b229-d77a6351c32f\" alt=\"brainiac_designer.png\" title=\"brainiac_designer.png\" /><br />\n<h2>Support for Workspaces and Plugins</h2>\r<img src=\"/projects/brainiac/e9645fb4-fa02-48af-8528-a34fa9fd8133\" alt=\"brainiac_designer_workspaces.png\" title=\"brainiac_designer_workspaces.png\" /><br />\n<h2>Place Comments (v2.1+)</h2>\r<img src=\"/projects/brainiac/466b56b2-cb4e-425b-bb02-45b324defe1b\" alt=\"brainiac_designer_comment.png\" title=\"brainiac_designer_comment.png\" /><br />\n<h2>Export Behaviour Tree From Editor... or from Command Line for an Automatic Build Process</h2>\r<img src=\"/projects/brainiac/f8038fbe-e4e9-47ff-90e2-7abe82c1dc0d\" alt=\"brainiac_designer_export2.png\" title=\"brainiac_designer_export2.png\" /><br />\n<h2>Save Behaviour Tree as PNG Image or EMF Vector Graphics</h2>\r<img src=\"/projects/brainiac/647022e9-f115-4941-a6d9-8e461e61116a\" alt=\"brainiac_designer_emf.png\" title=\"brainiac_designer_emf.png\" /><br />\n<h1>Controls v2</h1>\r<ul><li>To load an existing behaviour, double click it in the the node explorer (on the left).</li>\n<li>To drag the graph around, hold down the left mouse button on the graph and move your mouse.</li>\n<li>To zoom in and out, scroll your mouse wheel over the graph.</li>\n<li>To attach a new node, drag it from the node explorer (on the left) on a node in the graph (on the right). Arrows will appear which allow you to add the node in a specific location of the graph.</li>\n<li>To delete a single node from the graph, select it by left clicking it and press the delete key. The children will be added to the parent node of the deleted node. The node will not be deleted if this is not possible.</li>\n<li>To delete a node from the graph as well as its children, select it by left clicking it and press Shift+Delete.</li>\n<li>To move a single node in the graph, drag it on another node by holding down the right mouse button. Arrows will appear which allow you to place the node in a specific location of the graph.</li>\n<li>To move a node as well as its children, drag it on another node by holding down Shift + RMB.</li>\n<li>To attach an event to a node (except root behaviour, conditions and actions), drag it from the node explorer (on the left) on a node in the graph (on the right), holding down the left mouse button.</li>\n<li>To select an event, you must first select the node it is attached to and then left click the event itself.</li>\n<li>To edit a node or event, it must be selected.</li>\n<li>To delete a behaviour or folder from the node explorer, you can also press the delete key.</li>\n<li>To duplicate a single node by dragging it using Ctrl and the left mouse button.</li>\n<li>To duplicate a node as well as its children, drag it using Ctrl + Shift + LMB.</li>\n<li>To copy a single node use Ctrl + C. Use Ctrl + Shift + C to copy the node as well as its children.</li>\n<li>To cut a single node use Ctrl + X. Use Ctrl + Shift + X to cut a node as well as its children.</li>\n<li>To paste a previously copied node, hold down Ctrl + V and click on an appearing arrow to paste it at the given position. Hold down Ctrl + Shift + V and click to paste the whole copied branch.</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "Editor,Designer,Brainiac,Behavior,Behaviour,Tree,AI,Artificial,Intelligence,artificial intellige,Project Hoshimi,Library,Tools,rad,diagramming,AI; Graphing,graph designer,",
  "LastEdited": "2009-11-23T00:43:10.05-08:00"
}