{
  "ProjectName": "dnncb",
  "Title": "DNN Content Builder WCMS",
  "Description": "Content management is about to transform raw content into assets, managing every aspect of its life cycle. We are talking about workflow, scheduling, versioning, staging, personalization and much more than simply create HTML or inserting images into a page.\n\nDNN Content Builder offers an open source CMS solution for Dotnetnuke 4.5.x\n\nConnect to any database (SQL Server, Oracle, MySQL even Access) \n\nCreate your own data model (no more proprietary XML or pre-defined tables!) \nDesign forms quickly, with both validation and dynamic behaviour \nExtend form capabilities through formlet technology \nDesign flexible workflows (any numbers of steps!) \nControl your tasks \nDefine security per publishing \nSchedule content publishing \nCreate your own templates to show content \nShare content between portals \nYou can create your own content types. Some possibilities are:\n\nPhoto gallery \nAudio gallery \nVideo gallery \nArticles \nAnnouncements \nDocument gallery \nThere is a lot of work to do, but we are creating the foundation. The next major release will bring some nice tools to manage multiple content types at same time, plus some advanced capabilities, like versioning, staging and personalization. We are making a WCM platform for DNN. Join us!\n\nYou need to register in order to download the module PA & source! (free)",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Content management is about to transform raw content into assets, managing every aspect of its life cycle. We are talking about workflow, scheduling, versioning, staging, personalization and much more than simply create HTML or inserting images into a page.<br /><br />DNN Content Builder offers an open source CMS solution for Dotnetnuke 4.5.x<br /><br />Connect to any database &#40;SQL Server, Oracle, MySQL even Access&#41; <br /><br />Create your own data model &#40;no more proprietary XML or pre-defined tables&#33;&#41; <br />Design forms quickly, with both validation and dynamic behaviour <br />Extend form capabilities through formlet technology <br />Design flexible workflows &#40;any numbers of steps&#33;&#41; <br />Control your tasks <br />Define security per publishing <br />Schedule content publishing <br />Create your own templates to show content <br />Share content between portals <br />You can create your own content types. Some possibilities are&#58;<br /><br />Photo gallery <br />Audio gallery <br />Video gallery <br />Articles <br />Announcements <br />Document gallery <br />There is a lot of work to do, but we are creating the foundation. The next major release will bring some nice tools to manage multiple content types at same time, plus some advanced capabilities, like versioning, staging and personalization. We are making a WCM platform for DNN. Join us&#33;<br /><br />You need to register in order to download the module PA &#38; source&#33; &#40;free&#41;<br /><br />Documentation, samples and more can be found at www.redrails.net  (project&#39;s official website - 100% free)</div><div class=\"ClearBoth\"></div>",
  "TagList": "DotNetNuke,DNN,",
  "LastEdited": "2008-02-09T12:12:41.667-08:00"
}