{
  "ProjectName": "HSBL",
  "Title": "High School Behaviour Log",
  "Description": "A web based tool for recording student detentions, behaviour issues as well as referrals and positive behaviour. Integrated with school's SIMS.net MIS system.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rA web based tool for recording student detentions, behaviour issues as well as referrals and positive behaviour. Integrated with school&#39;s SIMS.net MIS system.<br /><br />Links:\n<ul><li><a href=\"https://hsbl.codeplex.com/wikipage?title=Screenshots\">Screenshots</a></li>\n<li><a href=\"https://hsbl.codeplex.com/wikipage?title=Technical%20Documentation\">Technical Documentation</a></li>\n<li><a href=\"https://hsbl.codeplex.com/wikipage?title=Installation%20Instructions\">Installation Instructions</a></li></ul>\n\n<h1>High School Behaviour Log</h1>\r\nThis project was originally created to keep a digital record of student behaviour; both negative and positive, in a High School environment. It is integrated with SIMS.net MIS (Management Information System) for student names, form groups, student photos and parent email address&#39;s via custom reports and XML files. All information is stored in a MySQL database and an Exchange server is used for email notifications. Graphs are produced by using Libchart, a simple PHP chart drawing library.<br />\n<h1>How it works</h1>\r\nI&#39;m sure this can be customised to your own needs but we find it works well in our High School. I&#39;ll try to explain what we do and how we use it. We call this the &quot;Detention Ladder&quot;<br />\n<h1>Detentions</h1>\r\nWe have a Behaviour Policy in place and it goes as follows:<br />\n<h2>Level 1 Detention</h2>\r\nUpon misbehaving a student is issued with a Level 1 detention, 15mins with the teacher issuing it and it is recorded in the students organiser/planner.<br /><br />Things recorded are:<br />\n<ul><li>Name/Form Group</li>\n<li>Option to enter staff to be notified about the detention (Form tutor is automatically notified)</li>\n<li>Incident Reason (Drop Down List)</li>\n<li>Whether the incident involved Bullying which then allows you to select type of bullying and comments box)</li>\n<li>Incident Date</li>\n<li>Incident Period</li>\n<li>Incident Location</li>\n<li>Incident Subject</li>\n<li>Textbox for any witnesses&#39; to the incident</li>\n<li>The date to set the detention for (Checks with SIMS for absences before submitting)</li>\n<li>Detention location</li>\n<li>Comments textbox for explaining the reason for the detention</li></ul>\n<br />Once recorded, all information is submitted and stored in the database.<br /><br />Emails are also sent to the relevant members of staff and if parent email addresses are stored in SIMS, they will also receive an email with details of the detention.<br /><br />The teacher has their own personal Overview page where they can view all detentions set by themselves. Detentions are highlighted different colours depending whether they are in the Past, Today or Upcoming.<br /><br />On the day of the detention, a check is made to make sure the student is in school on the day so the teacher knows they should be expected to attend.<br /><br />Three buttons are present:<br />\n<ul><li>Attended - Once clicked the detention is set as complete and stored for future reference/graphs/statistics</li></ul>\n\n<ul><li>Reschedule - If there is a genuine reason for not attending the detention it can be rescheduled for another date</li></ul>\n\n<ul><li>No-Show - This is clicked if the student doesn&#39;t attend the Level 1 detention and it is escalated to the next level</li></ul>\n\n<h2>Level 2 Detention</h2>\r\nIf a student fails to attend their Level 1 detention then a Level 2 Detention is automatically generated.<br /><br />Emails are also sent to the relevant members of staff and if parent email addresses are stored in SIMS, they will also receive an email with details of the detention.<br /><br />In our school the reception staff have access to the Behaviour Log and with the Level 2, a detention slip is generated and put into the relevant register for the Form Tutor to issue the student. This includes the Level 1 detention details with the date, time and location of the Level 2 detention.<br /><br />A Level 2 Detention is a lunchtime detention in a room specified by the subject that the original Level 1 Detention was issued. It&#39;s a departmental detention. These departments, members of the department  and specific days of the week when they can be generated for are also stored in the database.<br /><br />On the day of the detention, a check is made to make sure the student is in school on the day so the teacher knows they should be expected to attend.<br /><br />The options available are pretty much the same as a Level 1 detention:<br />\n<ul><li>Attended - Once clicked the detention is set as complete and stored for future reference/graphs/statistics</li></ul>\n\n<ul><li>Reschedule - If there is a genuine reason for not attending the detention it can be rescheduled for another date</li></ul>\n\n<ul><li>No-Show - This is clicked if the student doesn&#39;t attend the Level 2 departmental detention and it is escalated to the next level</li></ul>\n\n<h2>Level 3 Detention</h2>\r\nAfter not attending their Level 1 and Level 2 detentions the student is escalated to a Level 3 detention. These are similar to a Level 2 detention and a further detention slip is generated for reception staff to print and put into registers.<br /><br />Emails are also sent to the relevant members of staff and if parent email addresses are stored in SIMS, they will also receive an email with details of the detention.<br /><br />They are given 4 days notice (in accordance with our Behaviour Policy) and are set for Tuesdays and Thursdays, if it is generated on a Wednesday for example, they will be scheduled for the following Tuesday.<br /><br />These are after school detentions which are manned by one member of SLT (Senior Leadership Team) and two members of staff which work on a rota basis (Excel Workbook with Macros etc)<br /><br />Again the options available are:<br />\n<ul><li>Attended - Once clicked the detention is set as complete and stored for future reference/graphs/statistics</li></ul>\n\n<ul><li>Reschedule - If there is a genuine reason for not attending the detention it can be rescheduled for another date</li></ul>\n\n<ul><li>No-Show - This is clicked if the student doesn&#39;t attend the Level 3 after school detention and it is escalated to an Isolation.</li></ul>\n\n<h2>Isolation</h2>\r\nWe are fortunate enough to have a separate SSC (Student Support Centre) where Students can be put into what we call Isolation.<br /><br />Upon non attendance of a Level 3 detention, an Isolation request is sent to the SSC Manager. On the Behaviour Log, she can organise an Isolation time slot for the student to go and work in isolation. This can be for a Period in the day, Lunchtime, AM, PM or all day etc<br />\n<h1>Majorly Threatening/Abusive Incident</h1>\r\nThis is a separate option to recording a detention.<br /><br />If an incident has involved abusive language or violence and is deemed Majorly Threatening/Abusive then an Isolation request can be recorded, skipping the &quot;Detention Ladder&quot;. <br /><br />An Isolation request is sent to the SSC Manager. On the Behaviour Log, she can organise an Isolation time slot for the student to go and work in isolation. This can be for a Period in the day, Lunchtime, AM, PM or all day etc<br />\n<h1>Referrals</h1>\r\nThese are for informational purposes only and aren&#39;t really classed as sanctions. They are recorded in a similar way to detentions and there are two types of referral, Positive and Negative. Emails are sent to staff and parents if email address is in SIMS.<br />\n<h2>Positive Referral</h2>\r\nThese are for recording good behaviour, good work and to praise students. They are for informational purposes only and good for reports, statistics and graphs.<br />\n<h2>Negative Referral</h2>\r\nAgain these are for informational purposes only, mainly for misdemeanours where a detention isn&#39;t quite necessary but something still needs recording. Good for reports, statistics and graphs.<br />\n<h1>Coursework Catchup /Controlled Conditions Sessions</h1>\r\nSometimes students may be required to stay after school hours to complete coursework or continue with missed controlled conditions sessions. While this isn&#39;t strictly behaviour related; it is good to keep a digital record of these sessions for future statistics and evidence. There are two &quot;levels&quot; of Coursework Catchup /Controlled Conditions Sessions:<br /><br />Emails are automatically generated and sent to Form Tutor, notified staff and parent if email address is in SIMS.<br />\n<h2>First Chance Coursework Catchup /Controlled Conditions Sessions</h2>\r\nAfter recording a Coursework Catchup /Controlled Conditions Session it is displayed on the teachers Overview page where similar to detentions they have the following options:<br />\n<ul><li>Attended - Once clicked the session is set as complete and stored for future reference/graphs/statistics</li></ul>\n\n<ul><li>Reschedule - If there is a genuine reason for not attending the session then it can be rescheduled for another date</li></ul>\n\n<ul><li>No-Show - This is clicked if the student doesn&#39;t attend the session and it is escalated a Last Chance Coursework Catchup /Controlled Conditions Session.</li></ul>\n\n<h2>Last Chance Coursework Catchup /Controlled Conditions Sessions</h2>\r\nIf a student fails to attend a First Chance Coursework Catchup /Controlled Conditions Session then they are moved to the next &quot;level&quot;, a last chance to turn up and complete the respective work etc. Failure to attend this will result in a detention being issued.<br /><br />\n<h1>Recording an SSC (Student Support Centre) Withdrawal</h1>\r\nSometimes students need to be withdrawn from a lesson for various reasons, school phobic, SEAL, Emotional or Behavioural etc and we wanted to keep a digital register of this. This is a way of recording these, and comes in useful for Ofsted too! Again, graphs and statistics are also available.<br /><br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "PHP,MySQL,Education,High School,",
  "LastEdited": "2013-10-17T05:07:29.983-07:00"
}