{
  "ProjectName": "NBehave",
  "Title": "NBehave",
  "Description": "NBehave is a lightweight behavior-driven design framework for describing application behavior in terms of stories and scenarios.  NBehave features a fluent interface and can be used with any testing framework, including NUnit, MbUnit, and MSTest.  It is heavily influenced by Joe ",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>We are moving to Github:</h1>\r\n<a href=\"https://github.com/nbehave/NBehave\">https://github.com/nbehave/NBehave</a><br />\n<h2>Vision Statement </h2>\rBased on Dan North&#39;s initial vision of <a href=\"http://dannorth.net/2007/06/introducing-rbehave\">rbehave</a> and utilizing the behavioral <a href=\"http://en.wikipedia.org/wiki/Domain-specific_programming_language\">domain specific language (DSL)</a> of Behavior Driven Design (BDD) we created the NBehave framework.  The primary goal of NBehave is a framework for defining and executing application requirement goals.  These characterizations are modeled after the Behavioral Driven Design (BDD) terms Story, Scenario, Given, When, Then. Relying on a syntax that is lightweight and targeted at product owners (a few &quot;quotes&quot; mostly), the code becomes an executable and self-describing requirements document.  The definitions within the actual unit test of the application coupled with the organic nature of the architecture and ubiquity of the domain model translates these concepts into becoming one cohesive amalgam.  With the help of <a href=\"http://domaindrivendesign.org/index.htm\">Domain Driven Design</a>, the code actually becomes what we have always wanted, living requirements that are constantly asserted on to ensure their viability and accuracy from inception to implementation.  Can you say true traceability! <br /><br />\n<h1>Content</h1>\r<a href=\"https://nbehave.codeplex.com/wikipage?title=Getting%20started&referringTitle=Home\">Getting started</a><br /><a href=\"https://nbehave.codeplex.com/wikipage?title=Features&referringTitle=Home\">Features</a><br /><a href=\"https://nbehave.codeplex.com/wikipage?title=Set%20Up&referringTitle=Home\">Set Up</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "TDD,nunit,watch,Testing,Unit Test,Agile,Specification,bdd,BehaviorDrivenDesign,behavior-driven,requirements,atdd,dsl,",
  "LastEdited": "2012-10-14T04:40:13.76-07:00"
}