{
  "ProjectName": "phone7actionpack",
  "Title": "Phone 7 Action Pack (Windows Phone 7)",
  "Description": "Phone7ActionPack #wp7ap is a set of tools aimed at making developing for Windows Phone 7 as easy as possible. It will include some useful Extension Methods, Behaviors, Actions, Triggers and several controls.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Phone7ActionPack &#35;wp7ap is a set of tools aimed at making developing for Windows Phone 7 as easy as possible. It will include some useful Extension Methods, Behaviors, Actions, Triggers and several controls.<br /><br />If you talk about this on twitter could you kindly tag it with #wp7ap and you can follow me on twitter @phpn00b where I will tweet any an all news.<br />I will be posting more samples here <a href=\"http://www.anythingtheycando.com/blog/index.php/category/wp7ap/\">http://www.anythingtheycando.com/blog/index.php/category/wp7ap/</a><br /><br /><b>First release is up and I will be aiming to do a major release every 2 weeks. Till I get some real meat on the action packs bones.</b><br />The action packs goals are simple to bring in to expression blend for design time usage as many as possible of the underlying elements of the framework.<br /><br /><b>It should be noted that any class not marked as stable or working is still in development and not expected to work</b><br /><br /><b>Currently Implemented (at some level)</b>\n<ul><li>OrientationChangedGoToStateBehavior - Forces visual state changes based on changes to the phone orientation </li>\n<li>PhoneFileDataSource - Control that will read/write/list files in the applications Isolated Storage</li>\n<li>MakeCallAction - Action that can be attached to any FrameworkElement that will make the phone call a number based on bound properties</li>\n<li>CallMethodAction - This is just a simple port from Silverlight of the same basic action that calls a method on a target element</li>\n<li>ChoosePhoneNumberAction - Simple Action that will bring up the phones contact list and allow the user to pick a phone number </li></ul>\n<br /><b>Goals</b>\n<ul><li>PhonePositionControl - expose as dependency properties all useful information about the position of the phone</li>\n<li>TakePictureBehavior - simple behavior that takes a picture based on an event on the attached object</li>\n<li>AccelerometerControl - expose as dependency properties all useful information about the accelerometer on the phone so that visual elements can be bound to them.</li></ul>\nMore to come<br /><br /><b>Just a side not as for using this stuff in any project of yours</b><br />This is free open source software, I don&#39;t expect to make money with the Action Pack but I would like to know if and how you use it. Not for legal reasons just so that I can get a feel for how people want to use this software. <br /><br /><br /><br />HD Version of the second Sample Video <a href=\"/projects/phone7actionpack/c6288110-fbe9-4976-aca8-68afcf4da869\">Phone7ActionPack Sample 2.7z</a><br /><br /><br /><b>Thanks to my coworker Jose Salvador who kindly gave us a <a href=\"/projects/phone7actionpack/fce95ffe-36a3-48a4-807c-5b9c8cd2ded2\">logo</a> for the Phone7ActionPack.</b></div><div class=\"ClearBoth\"></div>",
  "TagList": "WP7,",
  "LastEdited": "2010-07-01T14:25:43.213-07:00"
}