{
  "ProjectName": "piab",
  "Title": "Policy Injection Application Block",
  "Description": "PIAB can be used to change the behavior of your custom objects, and almost any other .NET class in the Aspect-Oriented Programming (AOP) fashion.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><a href=\"http&#58;&#47;&#47;aka.ms&#47;entlibopen\"><img src=\"/projects/piab/c2885dc0-d704-425c-805f-815fa6ff5a28\" alt=\"PIAB&#32;invites&#32;community&#32;contributions\" title=\"PIAB&#32;invites&#32;community&#32;contributions\" /></a><br />\n<h2>What is PIAB?</h2>\r<blockquote>The <b>Policy Injection Application Block (PIAB)</b> can be used to change the behavior of your custom objects, and almost any other .NET class in the Aspect-Oriented Programming (AOP) fashion, in order to better manage crosscutting concerns for these objects. It changes the behavior of your objects by injecting custom behaviors at run time. Policy injection is now implemented through the Unity interception mechanism, which supports transparent proxy interception, interface interception and virtual method interception. The Policy Injection Application Block contains handlers to add capabilities from other Enterprise Library blocks (such as validation, logging, and exception handling) to objects in your applications\t</blockquote>\n<h2>How do I use PIAB?</h2>\r<blockquote>Official releases are available via <a href=\"http://www.nuget.org/packages/EnterpriseLibrary.PolicyInjection/\">Nuget</a>. You can also head to <a href=\"http://msdn.microsoft.com/en-us/library/dn178466.aspx\">msdn.com</a> for additional information, documentation, videos, and hands-on labs. </blockquote>\n<blockquote>If you want to try out the latest changes that have not been officially released yet, signed interim builds of the PIAB code base are made available on this site. </blockquote>\n<h2>What is going on?</h2>\r<blockquote>We use the <a href=\"https://piab.codeplex.com/workitem/list/basic\">Issue Tracker</a> for updating the product backlog (both feature requests and bugs).</blockquote>\n<h2>How do I contribute?</h2>\r<blockquote>We welcome your contributions. Check out project and contribution <a href=\"https://entlib.codeplex.com/wikipage?title=ContributingCode\">guidelines</a>.</blockquote></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-05-28T16:28:59.82-07:00"
}