{
  "ProjectName": "schooledu",
  "Title": "School Education Management",
  "Description": "Project Description\r\nSchool Management System helps schools in managing student's data. It is targeted for colleges in the Philippines. It is developed in ASp.Net MVC3 and uses SQL Server as the database.\r\n\r\nThe system is divided into several modules:\r\n\r\n1. Registrar Module - used by the Registrar.\r\n2. Scheduling Module - used by Deans for creating course offerings schedule\r\n3. Cashiering Module - used by the Accounting Department\r\n4. Grading Entry Module - used by teachers for encoding grades.\r\n5. Advising Module - used by the different departments for advising students.\r\n6. Admission Module - used by the Department of Student Affairs (DSA).\r\n7. Administration Module - used by the system administrator for controlling the behavior of the system.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">Project Description<br />School Management System helps schools in managing student&#39;s data. It is targeted for colleges in the Philippines. It is developed in ASp.Net MVC3 and uses SQL Server as the database.<br /><br />The system is divided into several modules&#58;<br /><br />1. Registrar Module - used by the Registrar.<br />2. Scheduling Module - used by Deans for creating course offerings schedule<br />3. Cashiering Module - used by the Accounting Department<br />4. Grading Entry Module - used by teachers for encoding grades.<br />5. Advising Module - used by the different departments for advising students.<br />6. Admission Module - used by the Department of Student Affairs &#40;DSA&#41;.<br />7. Administration Module - used by the system administrator for controlling the behavior of the system.<br /><br /><br /><br />Additional information on starting a new project is available here: <a href=\"http://codeplex.codeplex.com/wikipage?title=Start%20a%20Project\">Project Startup Guide</a>.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2012-03-26T09:06:27.913-07:00"
}