{
  "ProjectName": "SketchWizard",
  "Title": "SketchWizard: Wizard of Oz Prototyping of Pen-based User Interfaces",
  "Description": "SketchWizard makes Wizard of Oz testing more accessible to designers of intelligent sketching applications. In such applications, the requirements for recognition technology are very dependent on low-level interface design choices. Currently, designers must produce costly high-fidelity prototypes in order to evaluate these design choices, which results in fewer design iterations and lower-quality interfaces. Our method uses common components to prototype sketching systems and allows designers to fake complex behaviors by editing users’ views on the fly. This speeds up design iterations and allows designers to see the effects of low-level interface design decisions early in the development process.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />SketchWizard makes Wizard of Oz testing more accessible to designers of intelligent sketching applications. In such applications, the requirements for recognition technology are very dependent on low-level interface design choices. Currently, designers must produce costly high-fidelity prototypes in order to evaluate these design choices, which results in fewer design iterations and lower-quality interfaces. Our method uses common components to prototype sketching systems and allows designers to fake complex behaviors by editing users&#8217; views on the fly. This speeds up design iterations and allows designers to see the effects of low-level interface design decisions early in the development process.<br /><br /><a href=\"http://dub.washington.edu/projects/sketchwizard/download\">Binary Releases</a><br /><br /><a href=\"http://www.cs.washington.edu/homes/ssaponas/144-davis.wmv\">video (WMV/22MB)</a><br /><br /><b>Publications</b><br />Richard C. Davis, T. Scott Saponas, Michael Shilman, and James A. Landay. <br />                        SketchWizard: Wizard of Oz Prototyping of Pen-based User Interfaces. In Proceedings<br />                        ACM Symposium on User Interface Software and Technology. (Newport, RI, October 6-10, 2007). UIST &#39;07. <br />                        ACM Press, New York, NY, 119-128.<br /><a href=\"http://www.cs.washington.edu/homes/ssaponas/publications/SketchWizard-UIST07-Paper.pdf\">local pdf</a> | <a href=\"http://portal.acm.org/citation.cfm?id=1294211.1294233\">official pdf</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "rad,",
  "LastEdited": "2007-10-26T09:34:24.207-07:00"
}