{
  "ProjectName": "Sprinkler",
  "Title": "Sprinkler framework for deploying multi-server applications",
  "Description": "Sprinkler is a set of Powershell v2 scripts that helps in deploying multiple packages on as server farm. A configuration file drives its behavior, so it can be used on different environments (DEV, TEST, PROD, ...). Used in conjunction with BTDF, it is ready for BizTalk .",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Sprinkler is a set of Powershell v2 scripts that helps in deploying multiple packages on as server farm. A configuration file drives its behavior, so it can be used on different environments &#40;DEV, TEST, PROD, ...&#41;. Used in conjunction with BTDF, it is ready for BizTalk . Notable features are:<br />\n<ul><li>Parallelization of execution — the tool must be run on all servers of the farm and will operate concurrently as much as possible, reducing deployment time window;</li>\n<li>Can be run from a central location by leveraging Powershell v2 remoting;</li>\n<li>Script based — requires Powershell v2, no additional component to install on any server; you can Zip everything and send it to a different site;</li>\n<li>Flexible layout — keep all the files in a single share or spread them in different locations to keep sensitive information in a safe place or in a read-only folder;</li>\n<li>Simple configuration — all parameters for execution are contained in just two files;</li>\n<li>Interactive and unattended mode — an menu driven wizard helps choosing the script to run and its parameters;</li>\n<li>Complete and centralized logging in plain text files;</li>\n<li>Can execute sections of code in 32-bits for compatibility;</li>\n<li>Rich library for operating BizTalk — stopping host instances, setting host adapters, starting and stopping applications in order, BRE rules managing;</li>\n<li>Add new scripts and functions that leverage all above features.</li></ul>\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "BizTalk,powershell,Deployment,",
  "LastEdited": "2010-09-29T08:53:14.97-07:00"
}