{
  "ProjectName": "sse",
  "Title": "Simple Sharing Extensions (SSE) for .NET",
  "Description": "SSE is an XML micro-format and corresponding sync algorithm that can be embedded in RSS or Atom feeds to allow for two-way synchronization among peers. More important: the algorithm allows for mesh-style synchronization between nodes, with no concept of a \"master\" copy. This can be game-changing for data-exchange and app-level data interop. But only the future will tell.\r\n\r\nThis projects provides an open-source implementation of the required behavior from the spec.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />SSE is an XML micro-format and corresponding sync algorithm that can be embedded in RSS or Atom feeds to allow for two-way synchronization among peers. More important&#58; the algorithm allows for mesh-style synchronization between nodes, with no concept of a &#34;master&#34; copy. This can be game-changing for data-exchange and app-level data interop. But only the future will tell.<br /><br />This projects provides an open-source implementation of the required behavior from the spec.<br /><br />SSE was initially announced by Ray Ozzie (Microsoft&#39;s CTO). You can learn more about SSE by watching the <a href=\"http://msdn.microsoft.com/msdntv/episode.aspx?xml=episodes/en/20060330sseps/manifest.xml\">MSDN TV video</a> and reading the <a href=\"http://msdn2.microsoft.com/en-us/xml/bb510102.aspx\">latest SSE spec</a> and links above.<br /><br />The library has 80%+ code coverage through unit tests.<br /><br />What can you do with the library right now?<br />\n<ul><li>Create an adapter (repository) that talks to your underlying application data/business objects (your CRM system, data-entry app, whatever) </li>\n<li>Export RSS feeds with synchronization information embeeded for merging with other feeds </li>\n<li>Import RSS feeds from other peers </li>\n<li>Synchronize a local feed via HTTP with a server feed </li>\n<li>Do all this without changing any code in your app: this makes for a hassle-free way to add import/export/sync functionality to your application</li></ul>\nThe SSE spec takes care of defining a standard algorithm for detecting conflicts and updates in a merge operation, as well as the behavior for deleted and created items. This makes for a predictable behavior regardless of the actual implementation technology. <br /><br />The library was created with the following goals in mind:\n<ul><li>Have a minimal library that can be easily extended with adapters to accomodate simple synchronization scenarios </li>\n<li>Provide a full .NET as well as .NET Compact Framework implementation </li>\n<li>Interop with other SSE implementations as they come along</li></ul>\n<br />The following are non-goals:\n<ul><li>Provide a full-blown and highly optimized synchronization engine (i.e., you can hardly use it for full database merge/replication, complex data/binary payload sync, etc.) </li>\n<li>Provide a server-side story </li>\n<li>Provide a service to periodically perform sync with a server and manage jobs (this means you have to manually sync from your app using the exposed SyncEngine API)</li></ul>\n <br /><br />Included in the download is a sample application that is a very simple Customer CRUD application that provides a custom adapter to import/export feeds using its internal data-access component, and which syncs with a simple ASMX webservice via HTTP. This sample application uses a <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyId=%2085E0C3CE-3FA1-453A-8CE9-AF6CA20946C3&amp;displaylang=en\">SQL Compact Edition</a> database, so you&#39;ll need to install it, as well as the <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyId=877C0ADC-0347-4A47-B842-58FB71D159AC&amp;displaylang=en\">SQL Compact Edition Tools for VS 2005</a>. If you don&#39;t want to, just exclude the Samples solution folder from the solution.<br /><br />*<a href=\"https://sse.codeplex.com/releases/view/5301\">Download it now!</a><br /><br />Thanks <a href=\"http://johncrowley.net\">John Crowley</a> for dreaming up such a cool logo for SSE!<br /><br />This project is sponsored by <a href=\"http://www.codeplex.com/clarius\">Clarius Labs</a>.<br />This project is owned by the <a href=\"http://www.codeplex.com/MVPXML\">MVPXML Project</a>.<br /><br /><img src=\"/projects/sse/a71b23b4-15aa-4370-8637-5bce90855e5b\" alt=\"ClariusLabsCodePlex.png\" title=\"ClariusLabsCodePlex.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "RSS,.NET,xml,myfav,SSE,Synchronization,ASP.NET,Sync,FeedSync,RETURN,",
  "LastEdited": "2010-07-17T10:51:18.673-07:00"
}