{
  "ProjectName": "tanashcms",
  "Title": "TanashCMS",
  "Description": "I wrote this CMS in 2005, it was my first .Net 2.0 project. Since then it has fallen by the wayside and as I've discovered new methods this code is looking very dated, and I'm a bit embarrassed of it.\n\nThe point of this CodePlex project is to have a central repository for it (instead of copying it around the various machines I've owned), to share the code for anyone who's interested, and to gradually improve on what's here.\n\nI learned a lot about design patterns while I was developing this CMS, so it's very poorly designed. One of the most recent additions I made was to provide for XSLT site templates instead of MasterPages. Some production websites are still using MasterPages and rather than migrate all of them I hacked the new logic into the CMS, so now it's a bit of a mess. Many features are in the same state, I got bored or didn't have enough time so things are half or only just finished.\n\nWhat I want to achieve:\n- Refactor the business logic into areas of use, like a Tasks namespace, DTO namespace, Gateways, Domain etc.\n- Streamline the page renderer so that it's clearer, more efficient and more extensible. Remove MasterPage support and any bespoke site logic.\n- Rewrite the product inventory import/export logic and push the code further down into the business logic layer (currently in app_code)\n- Write a unit test and behaviour test project\n- Improve the admin and standardise the pages (some are heavily AJAX, some are all postback)\n- Eventually when the business logic and all wrapped in a satellite assembly, rebuild the presentation layer as an MVC website\n\nI don't foresee this project being of any interest to anyone else or providing much help to anyone as far as best practises are concerned. Any code you find you are welcome to use (depending on whatever the license says).\nI would definitely appreciate any guidance about how I can improve my code!! I still have a lot to learn...",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />I wrote this CMS in 2005, it was my first .Net 2.0 project. Since then it has fallen by the wayside and as I&#39;ve discovered new methods this code is looking very dated, and I&#39;m a bit embarrassed of it.<br /><br />The point of this CodePlex project is to have a central repository for it &#40;instead of copying it around the various machines I&#39;ve owned&#41;, to share the code for anyone who&#39;s interested, and to gradually improve on what&#39;s here.<br /><br />I learned a lot about design patterns while I was developing this CMS, so it&#39;s very poorly designed. One of the most recent additions I made was to provide for XSLT site templates instead of MasterPages. Some production websites are still using MasterPages and rather than migrate all of them I hacked the new logic into the CMS, so now it&#39;s a bit of a mess. Many features are in the same state, I got bored or didn&#39;t have enough time so things are half or only just finished.<br /><br />What I want to achieve&#58;<br />- Refactor the business logic into areas of use, like a Tasks namespace, DTO namespace, Gateways, Domain etc.<br />- Streamline the page renderer so that it&#39;s clearer, more efficient and more extensible. Remove MasterPage support and any bespoke site logic.<br />- Rewrite the product inventory import&#47;export logic and push the code further down into the business logic layer &#40;currently in app_code&#41;<br />- Write a unit test and behaviour test project<br />- Improve the admin and standardise the pages &#40;some are heavily AJAX, some are all postback&#41;<br />- Eventually when the business logic and all wrapped in a satellite assembly, rebuild the presentation layer as an MVC website<br /><br />I don&#39;t foresee this project being of any interest to anyone else or providing much help to anyone as far as best practises are concerned. Any code you find you are welcome to use &#40;depending on whatever the license says&#41;.<br />I would definitely appreciate any guidance about how I can improve my code&#33;&#33; I still have a lot to learn...</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2008-02-10T06:26:01.353-08:00"
}