{
  "ProjectName": "touchmouseplus",
  "Title": "Microsoft Touch Mouse Plus",
  "Description": "A little utility to alter some default behaviors of the Touch Mouse by Microsoft.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />A little utility to alter some default behaviors of the Touch Mouse by Microsoft.<br /><br /><br />I am just a 3 weeks old C# programmer and this is my first project.<br /><br />It is just a simple program for Microsoft&#39;s touch mouse using it&#39;s SDK and some other libraries.<br /><br />What I wanted was to alter some functions and add others. My code is far from professional but I have tried my best depending on the total time I have spent on the whole programming idea.<br /><br />All experienced programmers should feel free to alter the code , make suggestions or scold me . End users can do that too.<br /><br />What I changed :<br /><br />1) Double finger swipe up/down now doesn&#39;t go through maximized/normal/minimized states.The downside of that setup was that when a window was maximized then if you swiped down it would have to go through normal state and then minimize. What i changed was that swipe down is always minimize no matter what the previous state was and swipe up alters window state between normal/maximized . Hooray! 2 weeks programming for making a swipe down less for minimizing!<br /><br />2) There were some solutions for middle click by others  (who inspired me of course) but I wanted a middle CLICK and not a simple touch because it fired sometimes just by touching the mouse. So i used a very nice library with hooks to intercept a right click when you clicked and your finger was at a very specific point . When all conditions apply , the right click is intercepted and a middle click is sent instead. This point is actually on the  right of the first third from above , of the  middle carved line of the touch mouse. It is a matter of minutes to get used to it and it is chosen according to MY fingers resting position. So feel free to change the spot to suit yours.<br /><br />Right now i have only uploaded only the x64 binaries and source.<br /><br />It&#39;s a simple exe with a few DLL&#39;s so you might as well put it in your startup folder. No gui , no options (as of now).<br /><br />Windows 7 only.</div><div class=\"ClearBoth\"></div>",
  "TagList": "touch mouse,microsoft touch,",
  "LastEdited": "2012-05-23T14:40:38.867-07:00"
}