{
  "ProjectName": "usp",
  "Title": "Propositional Framework",
  "Description": "Different sales propositions are presented to the user using data collected from marketing intelligence, browser history or user behaviour as they navigate through your site. What they see depends on who they are and what information has been collected on them...",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />Different sales propositions are presented to the user using data collected from marketing intelligence, browser history or user behaviour as they navigate through your site. What they see depends on who they are and what information has been collected on them...<br /><br />A Unique Selling Proposition must be strong, unique and compelling. It must appeal to the individual by seeming to not only understand the needs of a particular consumer but also to provide something that no one else can. It must do this for each person that is driven to your website.<br /><br />When a consumer visits your website you might know where they come from, if they sign in you might have a raft of information about them and knowledge of why they have bought your product before. You might even have data collected by monitoring their behaviour as they browse your site. Whatever data is available - be it bought, inferred or discovered - should drive the content of the web pages so that they adapt to user behaviour.<br /><br />Lets say that I am a company who has done very well working out of an office but want to expand the business online. I have a massive amount of data gathered over the past 10 years and want to use this knowledge of the customer to help drive sales online. I know that the market is competitive and if we are to be successful we must adapt as quickly as possible. I have several products that might even seem to be competing products and so might have different websites. I&#39;ve got massive datastores of customers and marketing data that I wish to make use of when a person logs in to any site.<br /><br />To cope with change in a highly competitive market I hire a SharePoint guru who convinces me that SharePoint 2010 is better than green eggs on ham. Its got enterprise content types for my unique selling propositions, application services that I can use to do something withe the data I have and business connectivity services that I can use to plug into my data.<br /><br />What I as a client wants is to be able to map the 20 or so things that I know all of my customers differ on to what I information I show them on a page. To do that I use a neural network with 20 inputs and 5 or so outputs depending on the number of unique propositions I have.</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2010-03-12T15:09:13.7-08:00"
}