{
  "ProjectName": "wcf4templates",
  "Title": "WCF 4 Templates for Visual Studio 2010",
  "Description": "This project includes WCF 4 templates for Visual Studio 2010. All templates produce a customized WCF Service Application which is hosted in IIS 7 with bindings and behaviors configured for specific scenarios to help you get started.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>Project Description</h1>\rThis project includes WCF 4 templates for Visual Studio 2010. All templates produce a customized WCF Service Application which is hosted in IIS 7 with bindings and behaviors configured for specific scenarios to help you get started.<br /><br />Updated 06/10/2010: AnonymousOverHttp and AnonymousOverHttps templates are now uploaded.<br />Updated 06/15/2010: UserNameOverHttps and UserNameForCertificate templates are now uploaded.<br />Updated 06/16/2010: Minor updates to AnonymousOverHttp and AnonymousOverHttps templates.<br />Updated 06/27/2010: Fixed links below, two were juxtaposed.<br />Next up 07/4/2010: TrustedSubsystemServices and TrustedSubsystemWeb templates forthcoming. (UPDATED)<br />\n<h2>AnonymousOverHttp Template </h2>\rProduces a WCF service application configured for anonymous calls over HTTP. Supplies a default BasicHttpBinding setting that maxes out the quotas for an ASMX-equivalent experience. <br />NOTE: It is best to reduce those maxed quotas when you are more aware of the message, string, array and other related sizes your service will require. Quotas exist to add another layer of protection against Denial of Service (DoS) attacks.<br /><a href=\"http://wcf4templates.codeplex.com/releases/view/46715\">http://wcf4templates.codeplex.com/releases/view/46715</a><br />\n<h2>AnonymousOverHttps Template </h2>\rProduces a WCF service application configured for anonymous calls over HTTPS/SSL. Supplies a BasicHttpBinding default configured for Transport security and no credentials. The binding also maxes out the quotas for an ASMX-equivalent experience. <br />NOTE: It is best to reduce those maxed quotas when you are more aware of the message, string, array and other related sizes your service will require. Quotas exist to add another layer of protection against Denial of Service (DoS) attacks.<br /><a href=\"http://wcf4templates.codeplex.com/releases/view/46989\">http://wcf4templates.codeplex.com/releases/view/46989</a><br />\n<h2>UserNameOverHttps Template</h2>\rProduces a WCF service application supporting username and password authentication over HTTPS/SSL, relying on transport security to protect messages and credentials en route, while using Message security to send credentials. Supplies a WS2007HttpBinding default configured for Transport security with UserName Message credentials. The default service behavior enables Windows Identity Foundation (WIF) for authentication and authorization, therefore you must install WIF prior to using the template. There is a readme produced for the generated project that provides further instructions.<br /><a href=\"http://wcf4templates.codeplex.com/releases/view/47290\">http://wcf4templates.codeplex.com/releases/view/47290</a><br />\n<h2>UserNameForCertificate Template</h2>\rProduces a WCF service application supporting username and password authentication, relying on message security to protect messages en route. Supplies a WS2007HttpBinding default configured for UserName credentials transmitted and secured using Message security. The default service behavior enables Windows Identity Foundation (WIF) for authentication and authorization, therefore you must install WIF prior to using the template. There is a readme produced for the generated project that provides further instructions.<br /><a href=\"http://wcf4templates.codeplex.com/releases/view/47291\">http://wcf4templates.codeplex.com/releases/view/47291</a><br />\n<h2>Additional Templates</h2>\rThis site has not been updated in a long time thanks to busy schedules...but there are some new templates coming for WIF and passive and active federation. In the works.<br />Let me know if you are still interested in other templates such as TrustedSubsystemWindows, TrustedSubsystemCertificate, WindowsIntranet, UserNameWithMembershipProvider.<br />All secure templates will be based on WIF to help you get started with claims-based identity and decouple the authentication mechanism from your service implementations.<br />What other scenarios would you like to see here? Please comment in the discussions area.<br /><br />Enjoy!</div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-04-18T09:27:10.95-07:00"
}