{
  "ProjectName": "webtesttools",
  "Title": "Web Test Tools",
  "Description": "Tools like the Coded UI Testing tools in Visual Studio 2010 and SpecFlow are great tools when it comes to Behavior Driven Development (BDD) of web sites, but unfortunately they don't work together as easily as they could.\r\n\r\nThis project attempts to address these problems using a set of C# libraries that server as a starting point for the integration of UI Maps and SpecFlow features.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><a href=\"http://browsertesttools.codeplex.com/wikipage?title=Getting%20Started\">Getting Started</a> |\r\n<a href=\"http://browsertesttools.codeplex.com/documentation\">Documentation</a> <br>\r\n<br>\r\n<a href=\"http://msdn.microsoft.com/en-us/library/dd286726.aspx\">Visual Studio 2010's Coded UI Tests</a> and\r\n<a href=\"http://specflow.org\">SpecFlow</a> work well when performing automated testing of web sites, but unfortunately they don't work together as easily as they could.&nbsp; The Web Test Tools project is a set of C# libraries and Visual Studio 2010 Plugins\r\n designed to integrate them and simplify automated testing of web applications. <br>\r\n<br>\r\n<img title=\"image\" src=\"http://download.codeplex.com/Download?ProjectName=webtesttools&DownloadId=283870\" border=\"0\" alt=\"image\" width=\"897\" height=\"314\" style=\"padding-left:0px; padding-right:0px; display:inline; padding-top:0px; border:0\">\r\n<br>\r\n<br>\r\nVisual Studio 2010&rsquo;s Coded UI Test tools work well for tests that can be recorded on the complete web site once it has stabilized and isn&rsquo;t changing often.&nbsp; Unfortunately changes require another recording of the test.&nbsp; This can be time\r\n consuming and lead to fragile tests while developing.&nbsp; By separating the concepts of the UI definition and the steps into two pieces and providing a terse XML syntax to define the UI definition, the Web Test Tools project addresses these concerns.</p>\r\n<p>Instead of using a visual design tool to describe the layout of the web page to test, the XML UI definition is used to generate wrapper classes that utilize the framework already provided by Visual Studio 2010&rsquo;s Coded UI Test Tools.&nbsp; The XML format\r\n allows rapid changes to the mappings and regeneration of the wrapper classes which will lead to compile errors in any code using the wrapper classes.&nbsp; Now the key steps that need to be performed can be defined as SpecFlow steps and integrated into SpecFlow\r\n Features and Scenarios.&nbsp; The levels of indirection between test, step, and UI Definition allow the fundamental scenarios to change less frequently.</p>\r\n<p><img title=\"image\" src=\"http://download.codeplex.com/Download?ProjectName=webtesttools&DownloadId=283871\" border=\"0\" alt=\"image\" width=\"852\" height=\"245\" style=\"padding-left:0px; padding-right:0px; display:inline; padding-top:0px; border:0\">\r\n<br>\r\n<br>\r\nSpecFlow is good tool for mapping natural language scenarios to predefined steps. To make the process of running integration tests with SpecFlow easier, the Web Test Tools includes a set of events that manage the lifetime of test web servers and test browser\r\n instances.&nbsp; <br>\r\n<br>\r\nThe primary benefits of the Web Test Tools are:</p>\r\n<ul>\r\n<li>Simple XML format for the UI definition </li><li>Visual Studio 2010 Project Item and Custom Tool to automatically generate the wrapper classes\r\n</li><li>SpecFlow helpers to automate the lifetime of a test web server and IE9 </li><li>Ability to test IE9 with scripting disabled </li></ul>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Coded UI Test,testing framework,visual studio addin,Web Test,CodedUI,Testing,",
  "LastEdited": "2011-10-10T10:53:02.9-07:00"
}