{
  "ProjectName": "Calcium",
  "Title": "Calcium MVVM Toolkit",
  "Description": "Calcium is an MVVM toolkit for UWP, WPF, Windows Phone, and Xamarin apps. It provides much of what you need to rapidly build sophisticated yet maintainable apps",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1><b>PLEASE NOTE</b> Calcium has been superseded by <a href=\"http://codonfx.com/\">Codon</a></h1>\r\nCalcium is an MVVM toolkit for UWP, WPF, Windows Phone, and Xamarin apps. It provides much of what you need to rapidly build sophisticated yet maintainable apps<br />\n<h1>Get Started</h1>\rMore information about Calcium can be found at <a href=\"http://calciumsdk.com\">calciumsdk.com</a><br /><br />Use NuGet to install Calcium in your project via issuing the following command in the package manager console:<br /><b>Install-Package Calcium</b><br /><br />Get up to the minute news on Calcium at <a href=\"http://twitter.com/calciumsdk\">twitter.com/calciumsdk</a><br />Follow Calcium on <a href=\"http://www.facebook.com/CalciumSdk\">Facebook</a><br /><br />Calcium is a project by <a href=\"http://danielvaughan.org\">Daniel Vaughan</a> and <a href=\"http://katkavaughan.com\">Katka Vaughan</a><br />\n<h2>Calcium for Xamarin.Forms</h2>\r\n<img src=\"/projects/Calcium/298e2f8d-259f-41fb-9c84-0b0a7d6efccf\" alt=\"Calcium&#32;for&#32;Xamarin.Forms\" title=\"Calcium&#32;for&#32;Xamarin.Forms\" /><br /><br />Xamarin.Forms is now supported. <a href=\"http://www.codeproject.com/Articles/818278/Introducing-Calcium-for-Xamarin-Forms\">Read more here</a><br />With Calcium for Xamarin you can implement a cross-platform Application Bar component using the Xamarin Forms native rendering API with Menu Item support that works on iOS, Android, and Windows Phone; and which offers more features than the built-in Windows Phone Application Bar.<br /><br />With Calcium you can place images anywhere in a shared project as Content resources like in Windows Phone, and consume them in the same way across all three platforms.<br /><br />Use Calcium in conjunction with T4 templates to enable localizability for your Android app. <br /><br />Extend beyond current Xamarin Forms API capabilities to implement a quasi-data-template selector to materialize viewmodels in an MVVM compatible way.<br />\n<h2>Calcium for Windows Phone</h2>\r\nCalcium for Windows Phone is a consolidation of the infrastructure code that has been written for the book <a href=\"http://www.amazon.com/gp/product/0672333481/ref=as_li_tf_tl?ie=UTF8&amp;tag=danielvaughan-20&amp;linkCode=as2&amp;camp=1789&amp;creative=9325&amp;creativeASIN=0672333481\">Windows Phone 7.5 Unleashed</a>, and is already used by a number of published apps. Calcium for Windows Phone is a light weight framework for incorporating the main features that every app needs. Unlike Calcium for WPF and Silverlight, Calcium for Windows Phone does not depend on Prism and has a smaller footprint, more suitable for the mobile platform. <br /><br /><img src=\"/projects/Calcium/814c1050-4890-4613-b160-55aa7035cd91\" alt=\"Calcium&#32;Screenshot\" title=\"Calcium&#32;Screenshot\" /><br /><br />Some of Calcium for Windows Phone features include: \n<ul><li>A user options system that allows you to add a settable option to an options page, with a single line of code.</li>\n<li>A bindable application bar with toggle buttons and menu items, hyperlink button/menu items, which allows you to host multiple application bars in a Pivot.</li>\n<li>Built-in support for localization. Bindable resources allows the user to change the interface language at run-time.</li>\n<li>An IoC container and DI infrastructure, and templates to allow you to hide or show a Purchase link in your app depending on the • Trial state of your app and so forth.</li>\n<li>Templates for Views with ViewModels.</li>\n<li>Attribute based state persistence system.</li>\n<li>Message service that allows you to display messages and ask the user questions from your ViewModel.</li>\n<li>Launchers and Choosers abstraction layer.</li>\n<li>Input Validation system, with styles customized for displaying validation errors.</li></ul>\n\n<h2>Calcium for WPF</h2>\r\nCalcium for WPF consists of a client application and server based WCF services, which allow interaction and communication between clients. Out of the box, Calcium comes with a host of modules and services, and an infrastructure that is ready to use in your next application.<br /><br />The following is a list of just some of the features of Calcium for WPF:\n<ul><li>Visual Studio templates for instantly creating Calcium projects, including client applications, MVVM Module Templates, and server WCF host projects. (C# and VB.NET!)</li>\n<li>Module Manager for enabling or disabling of modules at runtime.</li>\n<li>Theme Support (with two themes included)</li>\n<li>Duplex messaging services for interacting with the user from the client or server using the same API. Interact with the user using Message Boxes from the server!</li>\n<li>A Command Service to associate WPF ICommands with content interfaces that only become active when an active view or viewmodel implements the interface.</li>\n<li>Region Adapters for ToolBars and Menus.</li>\n<li>Client-server logging ready to work out-of-the-box.</li>\n<li>Includes modules, such as a Web Browser, Text Editor, Output Window, and many more.</li>\n<li>Tabbed interface with dirty file indication (reusable across modules).</li>\n<li>A User Affinity module that assists collaboration with other users of the application.</li>\n<li>Undo/Redo/Repeat task management system.</li>\n<li>And many more!</li></ul>\n<br /><img src=\"/projects/Calcium/0d3435bc-2fa4-4f48-98c6-0d7f03e2eb50\" alt=\"Calcium&#32;Screenshot\" title=\"Calcium&#32;Screenshot\" /><br /><br /><br /><br />For further information about this project please see  \n<ul><li><a href=\"http://www.calciumsdk.com\">http://www.calciumsdk.com</a></li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "CAB,MVVM,CAL WPF,WPF,WebBrowser,wp7,Windows Phone,C#,",
  "LastEdited": "2017-11-06T13:43:51.32-08:00"
}