{
  "ProjectName": "matchingo",
  "Title": "Matchingo - A Silverlight Memory Game",
  "Description": "Matchingo is an open source Silverlight memory game using C# and the latest .Net technologies including Prism, MVVM, Silverlight Unit Testing Framework, Unity, LINQ, etc.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><h1>About</h1>\rMatchingo is an implementation of a card matching game in which you are given an even number of cards face down in a grid, and you try to flip over 2 cards at a time to create a match until all cards are matched.<br /><br />Matchingo is built using C# .Net 3.5 SP1, Silverlight, <a href=\"http://www.codeplex.com/CompositeWPF\">Composite Silverlight (Prism)</a>, <a href=\"http://code.msdn.microsoft.com/silverlightut/\">Silverlight Unit Test Framework</a>, and is built using development techniques including composite UI, the Model-View-ViewModel (MVVM) pattern, dependency injection, unit tests, event aggregation, LINQ, llamda expressions, and more.<br /><br /><i><b>Matchingo has been ported to Facebook! Check out the latest source download, and go play <a href=\"http://apps.facebook.com/matchingo\">Matchingo on Facebook</a> now!</b></i><br /><i><b>Matchingo was featured in the <a href=\"http://www.serverquestcontest.com\">Server Quest Contest</a>, congratulations to the winners!</b></i><br />\n<h1>Play Now</h1>\rThe latest release of Matchingo can be played at <a href=\"http://www.matchingo.com\">Matchingo.com</a> and on <a href=\"http://apps.facebook.com/matchingo\">Facebook</a>!<br />\n<h1>Current Screenshots</h1>\r<img src=\"/projects/matchingo/68cd8abd-cf36-47bc-953e-b937bbce382a\" alt=\"Early&#32;Alpha&#32;Sneak&#32;Peak\" title=\"Early&#32;Alpha&#32;Sneak&#32;Peak\" /><br />\n<h1>Release Information</h1>\rThe latest code drop is available in the <a href=\"http://matchingo.codeplex.com/Release/ProjectReleases.aspx#ReleaseFiles\">downloads section</a>.<br />\n<h1>Interested in Contributing?</h1>\rMatchingo was built as a learning experience, and was built with modularity as its focus. I would love to hear back from others who are interested in contributing to this project from designers to developers. Likewise, I would love to hear constructive suggestions for how Matchingo might be refactored in the future. If you have any interest in improving on the bits of Matchingo, or contributing new bits, please contact <a href=\"http://www.twitter.com/SmartyP\">SmartyP via twitter</a> or via the contact link on <a href=\"http://www.smartypantscoding.com/content/about\">SmartyPantsCoding.com</a>.<br /><br />Here are just a few of the things that someone could contribute:\n<ul><li>new sounds</li>\n<li>new graphics (menu, particles, celebration flyouts, card types, etc.)</li>\n<li>new card and background image sets</li>\n<li>support for loading dynamic image sets (Fotki, etc.)</li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2009-09-28T18:09:10.613-07:00"
}