{
  "ProjectName": "mmtoolkitsl",
  "Title": "MM Toolkit for Silverlight",
  "Description": "The MM Toolkit for Silverlight is a composition of handy controls. It supports the MVVM pattern by using commands and bindings as well as events.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The MM Toolkit for Silverlight is a composition of handy controls. It supports the MVVM pattern by using commands and bindings as well as events.<br /><br />The MM Toolkit for Silverlight is a composition of controls I feel are missing from the Silverlight 5 SDK. Right now, the only controls in the toolkit are a DateTime picker control and a Search box control. But I will add more controls when I feel they are ready for an initial publish, as there are more controls on my drawing board.<br />\n<h2>DateTimeBox</h2>\rThe DateTimeBox is a control that holds both date and time. You can select and change both without having to operate with two different controls. It supports the MVVM pattern by using commands and bindings as well as events. VisualStates makes the control look and feel like a standard Silverlight control.<br /><br /><img src=\"/projects/mmtoolkitsl/86497f39-4b37-4f4a-8ac7-0be590c1ac55\" alt=\"DateTimeBox.png\" title=\"DateTimeBox.png\" /><br />Here is the DateTimeBox in its focused state. The buttons to the right in the control (&quot;choose date&quot;, &quot;choose time&quot; and &quot;step date or time up or down&quot;) can be hidden at any time.<br /><i>Note that the date format follows the CurrentCulture settings as default</i><br /><br /><img src=\"/projects/mmtoolkitsl/735198bd-8d6d-4c39-b87e-37dfe3e07c6d\" alt=\"DateTimeBox_date.png\" title=\"DateTimeBox_date.png\" /><br />Here is the date picker part, choosing the date from the built-in Silverlight 5 calendar control.<br /><br /><img src=\"/projects/mmtoolkitsl/fce7b5f4-4491-447f-afbf-23a2a22e83a4\" alt=\"DateTimeBox_time.png\" title=\"DateTimeBox_time.png\" /><br />Here is the time picker part, choosing the time (by halv hours) from a standard dropdown control.<br /><br />You can of course also write any date or time directly to the control. You can also set the format for the date and time.<br />\n<h2>SearchBox</h2>\rThe SearchBox is a control in which you can do a search (like asynchronous service calls), and the control waits to display the result, created for searches in huge sources. You don&#39;t have to pre-load lots of values in the client. The control has a SearchText property which contains the text to search from. When pressing &lt;enter&gt; or waiting the threshold time (default 2 seconds), an event and a command (use which you like) will fire. The actual search is handled by you, and the result is put to the ItemsSource so it can be viewe in the control.<br />The Searchbox control also has a SelectedItem which holds the selected item.<br /><br /><img src=\"/projects/mmtoolkitsl/4008ef8d-a892-40b7-8c6e-f692d4fa8400\" alt=\"SearchBox.png\" title=\"SearchBox.png\" /><br />Here is the SearchBox in its focused state. You can start searching by start writing text, or pressing the arrow button to expand the search panel.<br /><br /><img src=\"/projects/mmtoolkitsl/293d7662-37aa-40e6-b549-d6a3447bcff4\" alt=\"SearchBox_search.png\" title=\"SearchBox_search.png\" /><br />Here is the control in its search state. You write your text in the search box and press &lt;enter&gt; or wait default 2 seconds, and the search will start.<br /><br />The SearchBox has three available templates:<br /><br /><b>ItemTemplate</b><br />The ItemTemplate is the template available for the items in the search part, showing the result as a vertical list. The ItemTemplate will apply for each item.<br /><br /><b>ContentTemplate</b><br />The ContentTemplate is the corresponding template for showing the selected item in the control, to the left of the arrow button.<br /><br /><b>NullContentTemplate</b><br />This is the template for the content when the SelectedItem is null. You can show some default text or whatever you like.</div><div class=\"ClearBoth\"></div>",
  "TagList": "silverlight,toolkit,datetime,controls,mvvm,",
  "LastEdited": "2013-02-06T00:02:09.49-08:00"
}