{
  "ProjectName": "MRUList",
  "Title": "MRU List",
  "Description": "The MRU List project implements a WPF/MVVM compliant architecture to use lists of frequently used items. Important items can be bookmarked (pinned) etc ...",
  "MovedLink": "https://github.com/Dirkster99/MRULib",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />The MRU List project implements a WPF&#47;MVVM compliant architecture to use lists of frequently used items. Important items can be bookmarked &#40;pinned&#41; etc ...<br /><br />See the control in action inside <a href=\"http://locult.codeplex.com\">Locult</a><br />\n<h1>Theming</h1>\rThe display of items in the MRU list is fully configurable but default implementation supports a Generic, ModernUI LIght, and <b>Dark</b> theme.<br /><img src=\"/projects/MRUList/0cd7088b-acfd-4d3b-8f0e-8dc5769166d8\" alt=\"ModernUI_Dark.png\" title=\"ModernUI_Dark.png\" /><br /><img src=\"/projects/MRUList/e2def187-0352-4442-b479-06c116a68650\" alt=\"ModernUI_Light.png\" title=\"ModernUI_Light.png\" /><br />\n<h1>Details</h1>\rThe screenshot below demos the Most Recently Used (MRU) list of items with the Generic WPF design.<br /><img src=\"/projects/MRUList/48529657-74e9-4e6a-9801-1b3bb277fa08\" alt=\"MRU_List.png\" title=\"MRU_List.png\" /><br />The mouse hovers over the last hyperlink entry and the component shows a full path in the tool tip.<br /><br /><b>Note</b> Some entries are are displayed partially since the available space is not sufficient to display the full path. The MRU List has a build in feature to use the available space with an intelligent display of ellipses instead of cutting of paths in some rude way.<br /><br />The system shows a needle like icon to the left. The user can move the mouse over it and click the pin to bookmark the entry. As shown in the next screenshot below:<br /><br /><img src=\"/projects/MRUList/2fcccd8e-bb47-4a32-8ae0-e32ed042e42f\" alt=\"MRU_List_Pinned.png\" title=\"MRU_List_Pinned.png\" /><br /><br />The ViewModel is designed to service more than 1 possible display as you can see in the demo of the menu section below:<br /><img src=\"/projects/MRUList/a5ee5980-3455-4092-88ca-3c37081e70a0\" alt=\"MRU_List_Menu.png\" title=\"MRU_List_Menu.png\" /><br /><br />The list of MRU hyperlinks comes with a configurable list of common (localized) context menu entries (here showing the German version)<br /><img src=\"/projects/MRUList/0d7d388c-a358-4574-8d2b-7354d8c3b4b4\" alt=\"MRU_List_ContextMenu.png\" title=\"MRU_List_ContextMenu.png\" /><br /><br />The default strings are already localized using <a href=\"https://locult.codeplex.com/\">Locult</a> with <a href=\"https://hub.microsofttranslator.com/\">Microsoft Translator</a> in:\n<ul><li>Chinese (simplified), Dutch, English, French, German, Hindi, Italian, and Spanish</li></ul>\n<br />The list of recent file items can be completely re-defined simply by re-implementing the RecentItems view: <a href=\"https://mrulist.codeplex.com/SourceControl/latest#MRULib/RecentItems.xaml\">https://mrulist.codeplex.com/SourceControl/latest#MRULib/RecentItems.xaml</a><br /><br />The available entries in the context menu entries are:\n<ul><li><b>Load File ...</b> this function is configurable to define the process that should happen when the user clicks the link. The consumer of the library can also re-define the displayed string and tool tip with a custom text. </li>\n<li><b>Copy Path to Clipboard</b> copies the path into the Windows Clipboard</li>\n<li><b>Open with Windows Application</b> opens the selected file in the associated Windows application</li>\n<li><b>Open in containing Folder</b> opens the Windows Explorer with the folder in which the file is stored (if the file actually exists)</li></ul>\n\n<ul><li><b>Remove</b> removes the selected MRU entry</li>\n<li><b>Remove All</b> removes all MRU entries - note how the corresponding menu entries disappears when there is no child entry to show</li></ul>\n<br /><img src=\"/projects/MRUList/730f1786-a816-4cb2-8d86-30413d56bdaf\" alt=\"MRUList_ContextMenu_English.png\" title=\"MRUList_ContextMenu_English.png\" /><br /><br />Click the Xml demo tab with the <b>GetXml</b> and <b>SetXml</b> buttons to see how the currenlty displayed information is persisted to Xml and can also be restored from Xml.<br />\n<ul><li>Click the <b>GetXml</b> button to retrieve the Xml for the currently shown items.</li></ul>\n\n<ul><li>Edit the Xml and click the <b>SetXml</b> button to re-define the currently shown items (make sure the Xml is valid).</li></ul>\n<img src=\"/projects/MRUList/a2cd54c0-fab7-4c2a-9004-f819d6e8e1b6\" alt=\"XMLDemo.png\" title=\"XMLDemo.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": ".net,MVVM,WPF,",
  "LastEdited": "2015-10-21T14:47:35.533-07:00"
}