{
  "ProjectName": "mtgenome",
  "Title": "MTGenome",
  "Description": "MTGenome is a card database system for Magic: the Gathering collectable card game.\n\nEventually features like online play, drafting, etc. will be added.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>MTGenome</b><br /><br />MTGenome is a full featured card database software package for the Magic: the Gathering card game.<br /><br />The goal is to create a free, open source replacement for outdated software such as &quot;Apprentice&quot; or &quot;Magic Workstation&quot;.<br /><br />Want to help?  Please contact me! Especially need a graphic artist for icon sets, theming, etc.<br /><br /><b>WE ARE IN NEED OF A GRAPHIC DESIGNER!</b>  Check out the project openings.<br /><br /><b>Developers</b><br /><br />MTGenome is built with C#, .Net 4.0, and uses SQLServerCe as its backend database storage.<br /><br />MTGenome was an experiment in software design using MVVM, IoC, &amp; DI.  Now uses Caliburn for MVVM framework.  Code critiques welcome.<br /><br /><b>Upcoming</b><br />\n<ul><li>Extended filtering and searching, searching will be able to be as complicated (or more) than what you get on gatherer</li>\n<li>Playmat - for solitaire games or laptop vs real cards</li>\n<li>Peer-to-Peer Online play, chat, etc. using no central servers at all</li></ul>\n<br /><b>Disclaimer</b><br /><br />MTGenome is not published or endorsed by Wizards of the Coast, Inc.<br /><br />Magic: The Gathering, all magic artwork, cards, edition names, and text are property of Wizards of the Coast, Inc.  All copyrights and trademarks apply.<br /><br />All card data is pulled from <a href=\"http://gatherer.wizards.com\">http://gatherer.wizards.com</a>, and hence MTGenome is merely a glorified web browser.  Any legal claim made against MTGenome would also apply to any web browser such as Internet Explorer or Firefox.<br /><br />MTGenome also uses:<br />\n<ul><li>AvalonDock - <a href=\"http://avalondock.codeplex.com/\">http://avalondock.codeplex.com/</a></li>\n<li>Html Agility Pack - <a href=\"http://htmlagilitypack.codeplex.com/\">http://htmlagilitypack.codeplex.com/</a></li>\n<li>Caliburn - <a href=\"http://caliburn.codeplex.com/\">http://caliburn.codeplex.com/</a></li></ul>\n<br />NOTE: source may not work for a little while, development is in progress.  </div><div class=\"ClearBoth\"></div>",
  "TagList": "MTG,.Net,C#,MVVM,clickonce,",
  "LastEdited": "2010-12-09T20:55:40.773-08:00"
}