{
  "ProjectName": "muvavimo",
  "Title": "MuVaViMo",
  "Description": "Transforming, encapsulating and concatenating ObservableCollections without compremising its notification capabilities. Useful for MVVM in WPF or UWP.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Disclaimer:</b> I originally host this project on GitHub (<a href=\"https://github.com/Yeah69/MuVaViMo\">https://github.com/Yeah69/MuVaViMo</a>), but to get a broader presence and honor Microsoft (it&#39;s a .Net project after all), I decided to host here, too.<br />\n<h1>MuVaViMo</h1>\r\nThis project has classes, which could make your life easier while working with ObservableCollections and the Model View ViewModel (MVVM) pattern. You always wanted to encapsulate, concatenate or transfrom (for example, transform a Model to ViewModel) them and all that in synchronized manner while still keeping the change notification capabilities. Then MuVaViMo might be the right package for you!<br />\n<h2>Nuget</h2>\r\nYou can also install it via Nuget in your projects:<br />\n<ul><li>Install-Package MuVaViMo</li></ul>\nNuget page: <a href=\"https://www.nuget.org/packages/MuVaViMo\">https://www.nuget.org/packages/MuVaViMo</a><br />\n<h2>Wiki</h2>\r\nDetailed descriptions of the core classes and interfaces of this project you can find in the wiki of this GitHub repository (<a href=\"https://github.com/Yeah69/MuVaViMo/wiki\">https://github.com/Yeah69/MuVaViMo/wiki</a>).<br />\n<h2>License</h2>\r\nTo get it published here, I had to choose a license, but the license (Unlicense), which I originally set in GitHub wasn&#39;t there, so MIT will be the aliby license here because it comes pretty close to Unlicense. If this is a problem I will draw this project back from here.<br /><br />Unlicense:<br /><br />This is free and unencumbered software released into the public domain.<br /><br />Anyone is free to copy, modify, publish, use, compile, sell, or distribute this software, either in source code form or as a compiled binary, for any purpose, commercial or non-commercial, and by any means.<br /><br />In jurisdictions that recognize copyright laws, the author or authors of this software dedicate any and all copyright interest in the software to the public domain. We make this dedication for the benefit of the public at large and to the detriment of our heirs and successors. We intend this dedication to be an overt act of relinquishment in perpetuity of all present and future rights to this software under copyright law.<br /><br />THE SOFTWARE IS PROVIDED &quot;AS IS&quot;, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.<br /><br />For more information, please refer to <a href=\"http://unlicense.org/\">http://unlicense.org/</a></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2016-11-11T11:29:23.233-08:00"
}