{
  "ProjectName": "PrismSplashScreen",
  "Title": "Prism Splash Screen Module",
  "Description": "This project is intended to demonstrade a neat way for developers to add splash screen to their Prism based applications. The main features are:\r\n1. The splash screen is encapsulated in a Prism module, which can be loaded explicitly by bootstraper code or implicitly loaded from the app.config file\r\n2. The splash screen is running in a separate STA thread so it has the best responsiveness than usual ones.\r\n3. The splash screen subscribs to a message update event and displays the messages (for a list of modules initialization for example)\r\n4. The splash screen will close itself and show the main window once the module initializations are finished \r\n5. THe splash screen is fully drag-moveable without interrupting module loadings (even you won't release you mouse), it also accepts mouse left double click to close itself\r\n6. Implemented in the MVVM pattern\r\n\r\nVisit below URL to find more details:\r\nhttp://eagleboost.wordpress.com/2011/06/02/prism-splash-screen-module/",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Project Description</b><br />This project is intended to demonstrade a neat way for developers to add splash screen to their Prism based applications. The main features are&#58;<br />1. The splash screen is encapsulated in a Prism module, which can be loaded explicitly by bootstraper code or implicitly loaded from the app.config file<br />2. The splash screen is running in a separate STA thread so it has the best responsiveness than usual ones.<br />3. The splash screen subscribs to a message update event and displays the messages &#40;for a list of modules initialization for example&#41;<br />4. The splash screen will close itself and show the main window once the module initializations are finished <br />5. THe splash screen is fully drag-moveable without interrupting module loadings &#40;even you won&#39;t release you mouse&#41;, it also accepts mouse left double click to close itself<br />6. Implemented in the MVVM pattern<br /><br />Visit below URL to find more details&#58;<br />http&#58;&#47;&#47;eagleboost.wordpress.com&#47;2011&#47;06&#47;02&#47;prism-splash-screen-module&#47;<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2011-07-31T07:32:23.18-07:00"
}