{
  "ProjectName": "quicklight",
  "Title": "Quicklight",
  "Description": "The Quicklight project that allows a developer to write anything from Rich Internet Applications to Apps for mobile phones using C# and HTML based Razor views",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">\r\n<p><span style=\"text-decoration:underline\"><strong>Project Description</strong></span></p>\r\n<p>The Saltarelle C# to Javascript compiler allows a developer to write C# code and then compile it to Javascript which can be run in any web browser. This makes it possible to write applications in C# that target any platform. Thanks to the type safe nature\r\n of C# and its language features it also allows the developer to more easily write complicated applications than would have been possible in javascript. The Quicklight library was written to help exploit this capability and is meant to be for Saltarelle what&nbsp;Silverlight\r\n is for .NET (but replacing the XAML view enging&nbsp;with the Razor view engine). At least as far as is possible, given the limitations of javascript.</p>\r\n<p>The Quicklight project is a collection of libraries that, along with the <a title=\"Saltarelle C# to Javascript Compiler\" href=\"http://www.saltarelle-compiler.com/\" target=\"_blank\">\r\nSaltarelle C# to Javascript compiler</a>, allow a developer to write anything from Rich Internet Applications to Apps for mobile phones using C# and the HTML based Razor syntax. The project contains three libraries:</p>\r\n<ol>\r\n<li>The Quicklight.Web library contains classes used to write a GUI using&nbsp;patterns and tools&nbsp;such as MVVM, dependancy injection, Razor generated views, region management and&nbsp;event management. It allows you to write an application consisting of\r\n loosely coupled modules. It is inspired by the <a title=\"Microsoft Prism library\" href=\"http://compositewpf.codeplex.com\" target=\"_blank\">\r\nMicrosoft Prism library</a>. A tutorial on the patterns employed is available for viewing on\r\n<a title=\"YouTube\" href=\"http://www.youtube.com/watch?v=KTtTW-BmXJg\" target=\"_blank\">\r\nYouTube</a>. </li><li>The Quicklight.Net library which contains meta data for the <a title=\"Javascript Soap Client\" href=\"http://javascriptsoapclient.codeplex.com/\" target=\"_blank\">\r\nJavascript Soap Client</a>&nbsp;. This allows the developer to create a C# webservice wrapper using&nbsp;the C# version of the Javascript Soap Client, thereby allowing the application easily access webservices.\r\n</li><li>The Quicklight.Mobile library which contains meta data for the <a title=\"Phonegap\" href=\"http://www.phonegap.com/\" target=\"_blank\">\r\nPhoneGap/Cordova</a> library. This allows the developer to write C# code against the PhoneGap/Cordova library, thereby accessing the hardware of a mobile device. If this library is used the developer writes the C# code, compiles it to Javascript and then creates\r\n a native app using the PhoneGap online&nbsp;compiler. </li></ol>\r\n<p>The vision for this project is that it will be used to create applications of a wide range, covering diverse platforms, but with only one C# codebase. It is envisioned that the different resolutions of the supported devices are addressed by using different\r\n views (but the same business logic), and that the application will simply load the&nbsp;resolution specific&nbsp;views in the dependancy injector, thereby displaying the correct view for the device.</p>\r\n<p><span style=\"text-decoration:underline\"><strong>Component libraries</strong></span></p>\r\n<p>The Quicklight.Web library is designed to be used with the MVVM design pattern. Within this pattern the ViewModel is not aware of the View. Therefore it should be used with declarative component libraries, instead of programmatic component libraries, and\r\n the view properties, collections and events should then be binded to the elements of the view. Declarative component libraries include:</p>\r\n<ol>\r\n<li>Bootstrap <a href=\"http://twitter.github.com/bootstrap/index.html\">http://twitter.github.com/bootstrap/index.html</a>\r\n</li><li>KickStart <a href=\"http://www.99lime.com/\">http://www.99lime.com/</a> </li><li>jQuery Mobile <a href=\"http://jquerymobile.com/\">http://jquerymobile.com/</a>\r\n</li><li>jQuery UI <a href=\"http://jqueryui.com/\">http://jqueryui.com/</a> </li><li>XTag <a href=\"http://x-tags.org/\">http://x-tags.org/</a> </li></ol>\r\n<p>jQuery UI does have some programmatic parts, but because it has been wrapped for the Saltarelle compiler it can be used with Quicklight.</p>\r\n<p>It is possible to use programmatic component libraries with Quicklight if there&nbsp;are&nbsp;metadata libraries for these programmatic component libraries. Unfortunately none, except for jQuery UI, currently exist.</p>\r\n</div><div class=\"ClearBoth\"></div>",
  "TagList": "Saltarelle,PhoneGap,Cordova,Javascript,Webservice,Razor,MVVM,",
  "LastEdited": "2012-10-21T13:43:15.337-07:00"
}