{
  "ProjectName": "silverlightmobileme",
  "Title": "Silverlight MobileMe Gallery",
  "Description": "Silverlight MobileMe Gallery is a 100% pure Silverlight implementation (recreation) of the Apple MobileMe Gallery.",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\">The <b>Silverlight MobileMe Gallery</b> is a recreation of the Apple MobileMe Gallery using 100% pure Silverlight.<br />\n<h1>**Update**</h1>\r<ul><li>This project is no longer under active development. I did this as a learning excercise to learn Silverlight and try to recreate something useful and elegant. If you would like it to continue, please contact me or grab the code and fork away!</li></ul>\n\n<h1>Getting Started</h1>\r<ul><li><b>Last Release:</b> <a href=\"https://silverlightmobileme.codeplex.com/releases/view/36368\">v0.1 Alpha 11/25/2009</a></li>\n<li>Check out the Apple MobileMeGallery sample (this is what we&#39;re trying to recreate): <a href=\"http://gallery.me.com/emily_parker\">http://gallery.me.com/emily_parker</a></li>\n<li>Visit the working sample (using Silverlight) here: <a href=\"http://gallery.restazured.com/emily_parker\">http://gallery.restazured.com/emily_parker</a>\n<ul><li><b>Note:</b> You can also try your own MobileMe username using format: http://gallery.restazured.com/<b>[your username here]</b></li></ul></li></ul>\n\n<h1>About the Silverlight MobileMe Gallery</h1>\rThe goal in one sentence is to create an exact replica, feature-for-feature match of the MobileMe Gallery using 100% Silverlight.<br />This project began as a way to experiment with and learn the new features in Silverlight 3. Check out the blog post that introduced the idea: <a href=\"http://anderly.com/2009/07/23/recreating-the-mobileme-gallery-in-silverlight-3/\">Recreating the MobileMe Gallery in Silverlight 3</a><br /><br />In addition to learning the features in Silverlight 3, I also wanted to experiment with using Expression Blend 3 as a compliment to Silverlight development. Therefore, all graphics (rss button, image slider, etc) and toolbar items were created/styled using Expression Blend 3.<br /><br /><img src=\"http://anderly.com/wp-content/uploads/2009/07/mobileme_silverlight1.jpg\" /><br />\n<h1>Key Features &amp; Success Criteria:</h1>\r\n<ul><li>Play MPEG-4 (.m4v) files using Silverlight without the need for QuickTime</li>\n<li>Photo Album and Movie “Scrubbing” (if you view the sample above, you’ll see what I mean when you mouse over an album or movie)</li>\n<li>Full featured photo album with all the features (and views) of the one built-in to MobileMe Gallery</li>\n<li>Utilize the photos/movies already stored on MobileMe Gallery (no separate upload or storage mechanism required)</li>\n<li>Support same URL structure as MobileMe: http://gallery.me.com/<b>[username]</b>\n<ul><li>Work with <b>ANY</b> MobileMe username: http://gallery.restazured.com/<b>[username]</b></li></ul></li>\n<li><b>100% Silverlight implementation</b></li></ul></div><div class=\"ClearBoth\"></div>",
  "TagList": "Silverlight 3,MobileMe,Gallery,Silverlight Gallery,Silverlight 4,MEF,MVVM,",
  "LastEdited": "2012-05-25T07:09:52.607-07:00"
}