{
  "ProjectName": "vent",
  "Title": "Vent",
  "Description": "Window Phone, MVVM, .NET, C#, xaml, WPF, WinPhone, MarckupExtension, ICommand, drawing, perfomance",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>Vent</b> is an example of interactive graphics editor for the <b>Windows Phone</b> platform. <br />Development is closely associated with the <a href=\"http://poet.of.by\">Poet project</a>, and the source code is free for non-commercial use. <br /><br />If you use them for commercial purposes, please donate some money. Thank for your honesty!<br /><br /><a href=\"http://poet.of.by/download\"><img style=\"border:none;\" src=\"https://www.paypalobjects.com/en_US/GB/i/btn/btn_donateCC_LG.gif\" alt=\"Donation form\" title=\"Donation form\" /></a><br /><br />P.S. At the moment I am an independent. NET-oriented developer and ready for remote collaboration to work on interesting projects with a minimum salary of 55 USD per hour or 2200 per month.<br />\n<hr />\n<b>Vent</b> - это приложение-пример интерактивного графического редактора для платформы <b>Windows Phone</b>. <br />Его разработка тесно связана с <a href=\"http://poet.of.by\">проектом Poet</a>, а исходные коды бесплатны для некоммерческого использования.<br /><br />При использовании в коммерческих целях, пожалуйста, пожертвуйте немного денег. Спасибо за вашу честность!<br /><br />P.S. На данный момент я являюсь независимым .NET-ориентированным разработчиком и готов к удалённому сотрудничеству для работы над интересными проектами с минимальной зарплатой от 55 USD в час, либо от 2200 за месяц.<br />\n<hr />\n<b>Contacts</b><br />poemmuse@gmail.com<br />skype: vovka.mak<br /><a href=\"http://vk.com/vladimir_makarevich\">vk.com/vladimir_makarevich</a><br /><br /><img src=\"/projects/vent/c0301361-8a52-4065-addd-f2f665d661ca\" alt=\"Vent.png\" title=\"Vent.png\" />\n<hr />\n<b>Tags</b> <br />Window Phone, MVVM, .NET, C#, xaml, WPF, WinPhone, MarkupExtension, ICommand, drawing, perfomance<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2014-01-29T11:23:12.31-08:00"
}