{
  "ProjectName": "wp7fx",
  "Title": "WP-Fx",
  "Description": "WP-Fx is a small framework to simplify the work with WP7.\r\n\r\nFeatures\r\n- EasyMoq (Mocking-Framework)\r\n- Testing extensions\r\n- MVVM extensions\r\n- About-page",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><b>30.05.2013:</b> I recently published some new parts of the framework on <a href=\"https://nuget.org/packages?q=WP-Fx\">NuGet</a> <br />\n<h1><a href=\"https://wp7fx.codeplex.com/documentation?referringTitle=Home\">WP-Fx</a></h1>\rWP-Fx is a small framework to simplify the work with WP (well it was intended to support WP development - but since it is all built on PCL it could be used on WP7/8, WinRT, Silverlight and &quot;original&quot; .NET-Framework) - especially if you prefer using TDD. Currently there is only EasyMoq, Testing and a small UI part available. You&#39;ll find all parts on <a href=\"https://nuget.org/packages?q=WP-Fx\">NuGet</a>.<br />\n<h2><a href=\"https://wp7fx.codeplex.com/wikipage?title=WP-Fx.EasyMoq&referringTitle=Home\">EasyMoq</a></h2>\rSince there is (at least in my opinion) no usable approach to create mocks when targeting the WP platform, I decided to create a framework for this scenario based on already existing frameworks and tools used by the developers. This resulted in the EasyMoq-framework, a small mocking-framework based on the abilities <a href=\"http://code.google.com/p/moq/\">Moq</a> provides on other platforms. It is completely built from scratch with the goal of being totally independent of other frameworks (except .NET) and toolkits.\n<h3>Missing mocking features</h3>\rIf you find a feature that is missing in EasyMoq but should be accessable in a mocking framework, please let me know and I&#39;ll look what I can do.<br />\n<h2>Testing</h2>\rContains an ExceptionAssert-class that can be used to easily assert exception without the annoying debugger break (when using the attribute) and provides you the ability to assert further properties of an exception (not just the type).<br />\n<h2>UI</h2>\rContains a RelayCommand and CommandManager implementation along with some supportive features.<br />\n<h1>Feature requests &amp; bug reporting</h1>\rIf you have any further ideas of missing features or if you have any trouble using this framework feel free to get in contact.<br />\n<h1>Contact</h1>\rIf you&#39;d like to contact me feel free to write an <a href=\"mailto:lkretschmar.dev@bluewin.ch\">e-mail</a>.<br /></div><div class=\"ClearBoth\"></div>",
  "TagList": "",
  "LastEdited": "2013-05-30T13:14:57.277-07:00"
}