{
  "ProjectName": "wp7guide",
  "Title": "patterns & practices - Case Study: TailSpin Windows Phone 7 Survey Application",
  "Description": "patterns & practices for Windows Phone 7 development - Community site",
  "MovedLink": "",
  "HomeWiki": "<div class=\"wikidoc\"><img src=\"/projects/wp7guide/fb3a7aa6-97c4-4d07-8e36-a3b0086fcb04\" alt=\"wp7_logo.png\" title=\"wp7_logo.png\" /> <img src=\"/projects/wp7guide/b02877fa-aad2-48f1-84d2-ec3249f13706\" alt=\"wAzure_logo.png\" title=\"wAzure_logo.png\" /><br />\n<h2>Live on MSDN!</h2>\rWe dramatically updated our <a href=\"http://msdn.microsoft.com/en-us/library/gg477144.aspx\">guidance around Windows Phone development</a>. Beyond recompiling our previous guidance against the Mango SDK, the latest guidance takes advantage of many Mango features such as fast app switching, background tasks, and new sensor APIs. We also did a fair amount of work showing how to create a layer of abstraction on top of the Windows Phone APIs that facilitates unit testing. <br /><br />We split up our guidance into three parts:\n<ul><li>Developing a Windows Phone Application using the MVVM Pattern</li></ul>\nThis guidance walks you through building a simple Windows Phone application using CodeBehind files. The guidance then shows you how the same app can be much more unit testable when built using the MVVM pattern. \n<ul><li>A Case Study for Building Advanced Windows Phone Applications</li></ul>\nThis guidance takes an in-depth look at how to write an advanced Windows Phone application, using many features of Mango. Unit testability was an important factor that guided the design of this application.\n<ul><li>Building Testable Windows Phone Applications</li></ul>\nTaking the work on unit testability from the above guidance, this guidance provides shorter samples of how to build unit testable Windows Phone applications.<br />\n<h2>Overview</h2>\rWindows Phone 7 Mango provides an exciting opportunity for companies and developers to build applications that travel with users, are interactive and attractive, and are available whenever and wherever users want to work with them. <br /><br />By combining Windows Phone 7 Mango applications with on-premises services and applications, or remote services and applications that run in the cloud (such as those using the Windows Azure™ technology platform), developers can create highly scalable, reliable, and powerful applications that extend the functionality beyond the traditional desktop or laptop; and into a truly portable and much more accessible environment. <br /><br />This guide describes a scenario around a fictitious company named Tailspin that has decided to encompass Windows Phone 7 Mango as a client device for their existing cloud-based application. Their Windows Azure-based application named Surveys is described in detail in a previous book in this series, Developing Applications for the Cloud on the Microsoft Windows Azure Platform. For more information about that book, see the page by the same name on MSDN&#174; at <a href=\"http://msdn.microsoft.com/en-us/library/gg490765.aspx\">Windows Phone 7 Developer Guide</a>.<br /><br />In addition to describing the client application, its integration with the remote services, and the decisions made during its design and implementation, this book discusses related factors, such as the design patterns used, the capabilities and use of Windows Phone 7, and the ways that the application could be extended or modified for other scenarios. <br /><br />The result is that, after reading this case study, you will be familiar with how to design and implement applications for Windows Phone 7 Mango that take advantage of remote services to obtain and upload data while providing a great user experience on the device.<br />\n<h2>Windows Phone 7 Test Guidance Survey</h2>\rThe Windows Phone 7 Guidance team has posted a very short, 10 question survey that centers on testing of Windows Phone 7 applications.<br /><br /><a href=\"http://www.surveymonkey.com/s/NBZ3FS8\">http://www.surveymonkey.com/s/NBZ3FS8</a><br /><br />This survey will be used to drive the second phase of our current project. <br />\n<h2>Project&#39;s scope</h2>\rThis project updates the current Windows&#174; Phone 7.0 Guidance published on MSDN at <a href=\"http://msdn.microsoft.com/en-us/library/gg490765.aspx\">Windows Phone 7 Developer Guide</a> to Windows Phone 7.5 Mango while at the same time reducing the written guidance down to a case study of the TailSpin application. This case study will also examine and provide additional guidance for unit testing Windows Phone 7 applications.<br /><br />This project and the written guidance have been renamed to Case Study: TailSpin Windows Phone 7 Survey Application.<br /><br />The key themes for these projects are: <br /><br />   1. A Windows Phone 7 Mango client application<br />   2. A Windows Azure backend for the system<br />   3. Unit testing for Windows Phone 7 Mango client applications<br /><br /><img src=\"/projects/wp7guide/131c3f99-96ce-4ae9-b7d3-361673790fe6\" alt=\"TailSpinCaseStudy.png\" title=\"TailSpinCaseStudy.png\" /></div><div class=\"ClearBoth\"></div>",
  "TagList": "WP7,windows phone,sample,Guidance,MVVM,",
  "LastEdited": "2012-04-02T23:32:57.663-07:00"
}